{
  "meta": [
    {
      "job_title": "Lead Editor",
      "job_category": "Creative",
      "job_class": "Lead",
      "sector": "Media",
      "salary": 70000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Edit projects from start to finish that engage an audience, ranging from 15-second edits to 30+ min."
    },
    {
      "duty": "Stay abreast of trends and technology to aid in project deliverables and push boundaries."
    },
    {
      "duty": "Manage and safeguard all media, including performing daily digital image transfers."
    },
    {
      "duty": "Facilitate and address all agency and/or client cut changes throughout the approval process. "
    },
    {
      "duty": "Concept and edit trailers, teasers, and company marketing material."
    },
    {
      "duty": "Maintain proper file structure allowing for future edits/adaptations and observe best practices for data storage."
    },
    {
      "duty": "Oversee short and long-term data storage and observe related best practices."
    },
    {
      "duty": "Maintain all editing equipment, troubleshoot problems, and actively facilitate repairs."
    },
    {
      "duty": "Ensure the brand aesthetic is successfully translated into high-quality visual assets."
    },
    {
      "duty": "Always be pushing the envelope to further separate us from other production houses."
    },
    {
      "duty": "Relocation to Louisville, KY required. Excited to travel and can be on production for extended periods of time if required."
    },
    {
      "duty": "Proficient using non-linear editing software and After Effects."
    },
    {
      "duty": "Highly creative and an out-of-the-box thinker that has worked in both the documentary and commercial spheres."
    },
    {
      "duty": "A team player that thrives in a collaborative environment and maintains a positive attitude in stressful situations."
    },
    {
      "duty": "Practices humility and is hungry to learn. Mad ping-pong skills."
    }
  ],
  "skills": [
    {
      "skill": "Video Editing",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Media Management",
      "experience": 5
    },
    {
      "skill": "Creative Conceptualization",
      "experience": 5
    },
    {
      "skill": "Non-linear Editing Software",
      "experience": 5
    },
    {
      "skill": "After Effects",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Adaptability",
      "experience": 5
    },
    {
      "skill": "Travel Readiness",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Film, Media, or related field (Master's preferred)"
    }
  ]
}