{
  "meta": [
    {
      "job_title": "Lead Service Installer",
      "job_category": "Field Operations",
      "job_class": "Lead",
      "sector": "Energy",
      "salary": 43000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "PV Equipment Knowledge",
      "experience": 5
    },
    {
      "skill": "Roof Work",
      "experience": 4
    },
    {
      "skill": "Electrical Wiring",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Building Plans Interpretation",
      "experience": 4
    },
    {
      "skill": "Power Tool Handling",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Travel Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as a subject matter expert in energy system installation, providing training and mentoring to team members."
    },
    {
      "duty": "Supervise jobsite activities, guide and train team members to ensure compliance, and resolve equipment and system issues."
    },
    {
      "duty": "Service and commission energy systems on roofs, including array layout, mounting hardware, and troubleshooting onsite."
    },
    {
      "duty": "Collaborate with warehouse team to ensure material and equipment availability onsite, and communicate job status to customers and leadership."
    },
    {
      "duty": "Drive team members to improve efficiency and productivity goals, while performing routine maintenance on energy systems."
    },
    {
      "duty": "Attend weekly team meetings, training sessions, and provide exceptional customer experience to all customers."
    },
    {
      "duty": "Perform other related duties as assigned, including travel up to 2 weeks at a time, several times a year to various US locations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Valid Driver's License, Extensive knowledge in PV equipment, electrical wiring, and general construction or carpentry. Excellent customer service and communication skills required."
    }
  ]
}