{
  "meta": [
    {
      "job_title": "Transporter",
      "job_category": "Service / Ancillary Staff",
      "job_class": "Housekeeping",
      "sector": "Environmental Services",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Under general supervision and according to established policies and procedures performs the following, transports patients to and from various locations within the facility and discharges patient to main lobby areas and decedents to the morgue. Performs assigned cleaning tasks in maintaining Hospital areas in an orderly and sanitary condition. In doing so, moves equipment and supplies in assigned area and performs a variety of housekeeping duties."
    },
    {
      "duty": "Login to TeletrackingReceive Assignments and job requirements Pick up patient chart and inform Nursing of transport."
    },
    {
      "duty": "Complete Transport Communication Sheet.Utilize AIDET Introduce self to patient and explain method of transport and destination."
    },
    {
      "duty": "Is knowledgeable and can demonstrate safety precautions involving patient transport.Upon arrival to destination, report patients’ arrival, deliver patient chart to appropriate personnel and obtain required signatures."
    },
    {
      "duty": "Cleaning Procedure in vacated patient area including bed sanitizing ensuring linen is clean, neat and in excellent condition."
    },
    {
      "duty": "Visually inspects area upon completion of cleaning to ensure appropriate levels of cleaning and neatness have been achieved."
    },
    {
      "duty": "Familiar with possible hazards associated with using oxygen.Ensures that oxygen label is correctly displayed and designated medical 02.Ensures proper connection prior to initiating patient transport."
    },
    {
      "duty": "Familiar with the proper storage of oxygen tanks.Uses proper 02 holders when transporting a patient.Utilizes AIDET with each patient, visitor and staff encounter. Promotes and projects the hospitals service standards in their daily job tasks. Promotes a positive patient experience during all patient encounters.Demonstrate competencies related to the 7 step room cleaning procedure.Provides consistent work performance and meets productivity standards"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalency required."
    },
    {
      "credential": "Preferred one year on the job experience necessary to learn sanitation principles and techniques, Hospital layout and departmental/Hospital policies and procedures."
    },
    {
      "credential": "Interpersonal skills necessary to be courteous to patients, visitors and staff when performing transporting and housekeeping assignments."
    },
    {
      "credential": "Qualified candidates must be able to effectively communicate with all levels of the organization."
    }
  ]
}