{
  "meta": [
    {
      "job_title": "Marketing Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Cultivate ongoing relationships with customers to ensure their return time and again."
    },
    {
      "duty": "Demonstrate successful outreach to potential and existing customers to keep Razny at the top of their minds for jewelry and timepiece shopping."
    },
    {
      "duty": "Achieve sales objectives as identified by management by using successful sales techniques and consistent follow-through."
    },
    {
      "duty": "Share, with customers, our mission and brand identity as a primary reason to trust Razny with their purchases."
    },
    {
      "duty": "Display a welcoming and attentive manner with all customers at all times."
    },
    {
      "duty": "Show commitment to providing outstanding and unique experiences to each customer."
    },
    {
      "duty": "Exhibit a willingness to learn the technical aspects of all products and describe this, with confidence, to customers to establish the exclusive nature of our items."
    },
    {
      "duty": "Insert/remove store display inventory and maintain signage, displays, and overall tidiness."
    },
    {
      "duty": "Actively transition guests from service to purchasing, as applicable."
    },
    {
      "duty": "Exhibit a professional manner and composure with all customers, peers, and management."
    },
    {
      "duty": "Some experience in luxury retail product sales. This may include jewelry and fine timepieces. It may also include retail sales of other types of luxury products such as clothing, shoes, accessories, home items, and autos, to name a few."
    },
    {
      "duty": "Aptitude to thoroughly grasp product details and gain appropriate product knowledge."
    },
    {
      "duty": "Must have a passion and enthusiasm for luxury jewelry and timepieces."
    },
    {
      "duty": "Strong motivation to generate high sales commissions."
    },
    {
      "duty": "Desire to generate strong, ongoing customer relationships."
    },
    {
      "duty": "Ability to contribute to team sales goals and generate strong profit and volume of sales."
    },
    {
      "duty": "Capable to use the company computer software and email system."
    },
    {
      "duty": "Ability to stand and walk for extended periods of time during the sales floor shift and vision capable of observing very small product features."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing or Business (Master's preferred)"
    }
  ]
}