{
  "meta": [
    {
      "job_title": "Audiologist/Hearing Aid Specialist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage a clinic and perform normal Audiologist/Hearing Aid Dispenser duties such as diagnosing and treating hearing loss, providing clinical expertise, and ensuring a positive patient experience."
    },
    {
      "duty": "Create an exceptional patient journey through patient care and appropriate treatment options."
    },
    {
      "duty": "Provide quality care and aftercare of dispensing services such as hearing tests, hearing aid fittings, educating and training hearing aid users of best practices."
    },
    {
      "duty": "Conduct checks on hearing aids and other amplification devices, troubleshooting, repairs, earmold cleaning, and promote sales and key business metrics while focusing on providing quality patient care."
    },
    {
      "duty": "Develop a relationship with local community leaders by representing the clinic as an advocate and maintain an active Hearing Aid Dispensing License in accordance with state requirements."
    },
    {
      "duty": "Maintain continuing education requirements based on state requirements and operate audiometric equipment to interpret the results."
    }
  ],
  "skills": [
    {
      "skill": "Degree in Audiology or Experienced Hearing Instrument Specialist",
      "experience": 2
    },
    {
      "skill": "Optimistic and compassionate character",
      "experience": 2
    },
    {
      "skill": "Patient management",
      "experience": 2
    },
    {
      "skill": "Hearing Aid Dispensing services",
      "experience": 2
    },
    {
      "skill": "Sales and business metrics focus",
      "experience": 2
    },
    {
      "skill": "Community advocacy and relationship building",
      "experience": 2
    },
    {
      "skill": "Continuing education requirements",
      "experience": 2
    },
    {
      "skill": "Audiometric equipment operation and result interpretation",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Degree in Audiology or experienced Hearing Instrument Specialist"
    }
  ]
}