{
  "meta": [
    {
      "job_title": "Director, Sales",
      "job_category": "Sales",
      "job_class": "Director",
      "sector": "Sales",
      "salary": 150000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive sales plans/approaches to meet/exceed budgeted revenue goals."
    },
    {
      "duty": "Find and pursue new business opportunities through various channels, including leveraging existing contacts, following through on leads, networking, and cold calling."
    },
    {
      "duty": "Deliver compelling sales proposals to prospective clients by articulating the value and benefits of offered programs and services."
    },
    {
      "duty": "Use CRM technologies to effectively manage leads, contacts, and sales opportunities."
    },
    {
      "duty": "Collaborate with relevant departments to complete the full sales cycle, including contracting, procurement, logistics, and marketing/design."
    },
    {
      "duty": "Develop and maintain professional working relationships with key stakeholders, business partners, and suppliers."
    },
    {
      "duty": "Work closely with the Manager, Sales Support & Exhibitor Services to handle contract administration, invoicing, and accounts receivables, and maintain accurate exhibitor data within appropriate databases."
    },
    {
      "duty": "Keep up to date on market developments and identify/research new growth areas for sales."
    },
    {
      "duty": "Design exhibit hall floor plan, assign booths, implement and enforce exhibitor rules and regulations, and coordinate with decorator to ensure successful exhibit hall set up/delivery, including fire marshal approval, and provide successful onsite management of exhibit hall events."
    },
    {
      "duty": "Prioritize and manage multiple projects to meet deadlines."
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "CRM Management",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Financial Services",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Event Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree."
    }
  ]
}