{
  "meta": [
    {
      "job_title": "Aquatics Maintenance Specialist",
      "job_category": "Maintenance",
      "job_class": "Specialist",
      "sector": "Maintenance",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Diagnose, repair, and supervise maintenance of public swimming pools, water systems, filter systems, pumps, and playground equipment."
    },
    {
      "duty": "Oversee maintenance, testing and tracking of chemical balance and general water chemistry; supervise training on proper chemicals, cleaning, and pump and filter maintenance; supervise and assist with the transportation and storing of hazardous chemicals."
    },
    {
      "duty": "Ensure the pool and training areas are clean, well-maintained, and free of hazards."
    },
    {
      "duty": "Complete maintenance of the pool area; respond to swimming pool related work orders, assess and repair non-functioning machinery or equipment; recommend repairs of electrical and mechanical equipment."
    },
    {
      "duty": "Ensure facility will meet or exceed health department code and expectations; oversee building maintenance and coordinates projects with the parks department or outside companies as needed."
    },
    {
      "duty": "Assist with gathering bids, compiling quotes, managing projects and various maintenance tasks; communicate with contractors through bid process; manage project work and closures."
    },
    {
      "duty": "Maintain inventory of pool supplies and alert supervisor of shortages; assist in ordering supplies."
    },
    {
      "duty": "Provide general assistance, information, and instruction to the public regarding water and other related public safety issues; receives, responds to and/or resolves questions, assists with inquiries and complaints from the public and refers to management."
    },
    {
      "duty": "Identify problems and write incident reports in accordance with applicable ordinances and departmental policies/procedures; ensure the health and safety of all patrons."
    },
    {
      "duty": "Oversee and coordinate a plan for daily upkeep of facilities and grounds; assist with backwashing and pool/spa cleaning program."
    },
    {
      "duty": "Perform maintenance of property grounds including Schryver Park, pollinator beds, and the pond."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "3 years of pool maintenance experience required.\nCertified Pool Operator certification preferred, or can obtain within 1 year of hire.\nAmerican Red Cross Lifeguard, CPR for Professionals, First Aid or equivalent, or able to obtain within 60 days of hire.\nLifeguard Instructor certificate required within one year of hire."
    }
  ]
}