{
  "meta": [
    {
      "job_title": "Executive Director",
      "job_category": "Management",
      "job_class": "Executive",
      "sector": "Nonprofit",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Financial Management",
      "experience": 10
    },
    {
      "skill": "Community Relations",
      "experience": 10
    },
    {
      "skill": "Fundraising",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "Organizational Development",
      "experience": 10
    },
    {
      "skill": "Public Speaking",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops and directs the vision and organizational strategy; articulates the organizational strategic plan to the community and facilitates the roles of the Board of Directors, staff and volunteers in fulfilling the mission and strategy."
    },
    {
      "duty": "Leads and collaborates as part of a team to achieve the VLP’s mission and to integrate the VLP’s core principles of Commitment, Compassion, Honesty, and Patience in all efforts."
    },
    {
      "duty": "Directly manages the Director of Library Programs and Services, the Director of Development, and the Director of Organizational Performance and Equity. Indirectly manages approximately 20 staff (including 10 youth education staff)."
    },
    {
      "duty": "Ensures the recruitment and retention of qualified, dedicated, and diverse staff members."
    },
    {
      "duty": "Serves as liaison between the Board of Directors and the organization, regularly reporting progress, challenges, and opportunities."
    },
    {
      "duty": "Supervises development of annual budget and periodic financial statements, including an annual audit."
    },
    {
      "duty": "Manages budget and administers finances and records of the organization, including bookkeeping, payroll and personnel, insurance, and charitable and grant reports."
    },
    {
      "duty": "Acts as senior organization spokesperson in all external communications, ensuring consistent communications of organizational activities and priorities."
    },
    {
      "duty": "Develops and manages partnerships and collaborations with external organizations to enhance the educational programs and services of the organization."
    },
    {
      "duty": "Supports the development of a fundraising plan to diversify the funding base, in partnership with the Director of Development and the Board of Directors."
    },
    {
      "duty": "Identifies and develops new opportunities and relationships which result in building a sustainable and growing donor base, in coordination with the Director of Development."
    },
    {
      "duty": "Participates in the development of and reviews final grant proposals, ensuring accurate and timely reporting for grants."
    },
    {
      "duty": "Participates in donor cultivation and stewardship processes in coordination with the Director of Development."
    },
    {
      "duty": "Performs other duties as required for the organization and requested by the Board of Directors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s Degree preferred; MED, MSW, MLS or MBA a plus"
    }
  ]
}