{
  "meta": [
    {
      "job_title": "Safety Compliance Manager",
      "job_category": "Safety",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "DOT Regulations",
      "experience": 5
    },
    {
      "skill": "OSHA Standards",
      "experience": 5
    },
    {
      "skill": "Supervisory Skills",
      "experience": 5
    },
    {
      "skill": "Strategic Partnerships",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage safety, compliance, and orientation of new drivers, ensuring adherence to local, state, federal, DOT, and OSHA rules and regulations."
    },
    {
      "duty": "Develop and implement corporate safety and loss prevention efforts, and compliance programs to integrate safety policies and procedures into business planning."
    },
    {
      "duty": "Oversee all aspects of safety training and driver orientations program to maintain a strong safety ethic among drivers and meet training objectives."
    },
    {
      "duty": "Provide reporting on vehicle, cargo loss, and injury by division, and prepare accident analysis and driver demographic reports."
    },
    {
      "duty": "Manage the department's annual operating budget, cost center, AP, and AR."
    },
    {
      "duty": "Supervise road testing of all driver applicants, ensuring compliance with company and federal standards."
    },
    {
      "duty": "Participate in continuous improvement activities by reviewing, changing, and improving processes aligned with organizational goals."
    },
    {
      "duty": "Assist with loss prevention, company-wide compliance efforts, and governmental reporting and compliance."
    },
    {
      "duty": "Monitor Safe stats, Root Cause Analysis process, DOT accident reporting, and monthly DOT data reporting."
    },
    {
      "duty": "Act as liaison between other divisions/departments in support of safety and compliance efforts."
    },
    {
      "duty": "Management of C-TPAT and Customs/in-bond shipment compliance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree (B.A.) from a four-year college or university; or 5-7 years related experience and/or training; or equivalent combination of education and experience in the industry."
    },
    {
      "credential": "Firm understanding of the transportation industry with a strong working knowledge of safety, loss prevention, and DOT and OSHA regulations."
    },
    {
      "credential": "2-5 years of supervisory experience required."
    },
    {
      "credential": "Proven ability to form strategic partnerships with Operations and to collaboratively instill a Safety culture and standards."
    },
    {
      "credential": "Excellent organizational skills and ability to manage and prioritize workload in a fast-paced environment."
    },
    {
      "credential": "Proficient in Microsoft Office (Word, Excel, Outlook) required."
    },
    {
      "credential": "Excellent communication skills (written, listening, and verbal)."
    },
    {
      "credential": "Willing and able to travel occasionally, including overnight travel."
    }
  ]
}