{
  "meta": [
    {
      "job_title": "Team Lead",
      "job_category": "Retail",
      "job_class": "Team Lead",
      "sector": "Sales",
      "salary": 20000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Delivering excellent community member service and leading Team Members to do the same, in our efforts to spread global wellness."
    },
    {
      "duty": "Supporting the Store Manager and Assistant Store Manager with opening, closing, and leadership duties."
    },
    {
      "duty": "Generating business results and achieving key KPIs including revenue and comp growth goals, AVS, IPT, traffic, conversion, and loyalty program growth."
    },
    {
      "duty": "Ensuring Team Members are equipped with the product knowledge they need to make intentional recommendations for Community Members."
    },
    {
      "duty": "Upholding presentation standards and assessing and action merchandising opportunities to elevate the in-store experience."
    },
    {
      "duty": "Taking a proactive and innovative approach to growing the business through community outreach."
    },
    {
      "duty": "Inspiring and uplifting the team through coaching, collaboration, and embodying core values."
    },
    {
      "duty": "Choosing culture first in everything done, with a commitment to personal growth and self-awareness."
    },
    {
      "duty": "Contributing to a team environment where all Team Members consistently experience a sense of belonging and inclusion."
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Retail Experience",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Community Outreach",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Personal Growth",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Culture Development",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ]
}