{
  "meta": [
    {
      "job_title": "Brand Ambassador",
      "job_category": "Marketing",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 20,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Event Planning",
      "experience": 2
    },
    {
      "skill": "Customer Engagement",
      "experience": 2
    },
    {
      "skill": "Budgeting",
      "experience": 2
    },
    {
      "skill": "Logistics",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 2
    },
    {
      "skill": "Team Management",
      "experience": 2
    },
    {
      "skill": "Adaptability",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Set up booths at various events, including home shows, vendor shows, and chamber of commerce gatherings."
    },
    {
      "duty": "Attend events to represent Semper Fi Heating and Cooling, engaging with potential customers in a professional and engaging manner to gather leads and valuable information."
    },
    {
      "duty": "Forge and nurture relationships with event vendors, chambers of commerce, and other organizations to expand our reach and establish Semper Fi Heating and Cooling as the preferred HVAC company for Arizona residents."
    },
    {
      "duty": "Manage event sponsorships and vendor shows within a specified budget to ensure cost-effective participation."
    },
    {
      "duty": "Cover vendor shows across the entire Valley, from Peoria and Sun City to Glendale, Phoenix, Avondale, Tolleson, Laveen, Surprise, Goodyear, Anthem, Chandler, Mesa, and beyond."
    },
    {
      "duty": "Oversee all aspects of event planning, ensuring seamless execution of booth setup and lead generation activities."
    },
    {
      "duty": "Proactively address and resolve any challenges that may arise during events to ensure a positive and successful representation of our brand."
    },
    {
      "duty": "Assist in outreach efforts for our lead generation platform, including making calls and sending text messages to leads gathered from events."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": []
}