{
  "meta": [
    {
      "job_title": "Health Fitness Specialist",
      "job_category": "Fitness",
      "job_class": "Specialist",
      "sector": "Health and Wellness",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop exercise programs to improve participant strength, flexibility, endurance, or circulatory functioning, in accordance with the most recent exercise science standards."
    },
    {
      "duty": "Provide emergency or other appropriate medical care to participants with symptoms or signs of physical distress."
    },
    {
      "duty": "Submit Safety Events within 24 hours of an unusual incident. Immediately notify the federal manager of serious incidents."
    },
    {
      "duty": "Demonstrate correct use of exercise equipment or performance of exercise routines."
    },
    {
      "duty": "Recommend methods to increase physical activity."
    },
    {
      "duty": "Interpret exercise program participant data to evaluate progress or identify needed program changes."
    },
    {
      "duty": "Prescribe individualized exercise programs, specifying equipment, such as treadmills, exercise bicycles, ergometers, or other strength and conditioning equipment."
    },
    {
      "duty": "Provide general oversight of exercise for participants at all risk levels."
    },
    {
      "duty": "Explain exercise programs or physiological testing procedures to participants."
    },
    {
      "duty": "Report all privacy and security breaches immediately according to FOH and HHS policy."
    },
    {
      "duty": "Assist in orienting new FOH WHPS staff."
    },
    {
      "duty": "Work on agency agreement, as assigned by the Health Fitness Manager."
    },
    {
      "duty": "Manage customer/agency complaints professionally with feedback within 48 hours of receipt. Determine whether upper management involvement is needed during any point of the process and refer in 24 hours."
    },
    {
      "duty": "Respond to customer complaints, issues, and requests regarding FOH service within 24 hours. Follow outstanding issues to resolution in a timely manner. Escalate issues as appropriate and directed by the supervisor."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred or a minimum of 1 year’s experience in exercise physiology, corporate fitness, wellness, health promotion, and/or healthcare-related field."
    },
    {
      "credential": "Current certification in group fitness or personal training through a nationally accredited organization."
    },
    {
      "credential": "Current CPR/AED certification."
    }
  ]
}