{
  "meta": [
    {
      "job_title": "Chief Financial Officer",
      "job_category": "Finance",
      "job_class": "CFO",
      "sector": "Management",
      "salary": 185000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Account Management",
      "experience": 10
    },
    {
      "skill": "Budget Development",
      "experience": 10
    },
    {
      "skill": "Negotiation",
      "experience": 10
    },
    {
      "skill": "Compliance",
      "experience": 10
    },
    {
      "skill": "Public Representation",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead in creating a culture of financial stewardship and support the organization in wise resource planning."
    },
    {
      "duty": "Direct and manage the finance and accounting department, including external vendors, while supporting all financial and accounting work."
    },
    {
      "duty": "Present decision points and financial trends to the executive team and the SEIU 775 Benefits Group Board Treasurer."
    },
    {
      "duty": "Oversee financial activities for health, economic security, retirement, training, and job placement services, including financial planning, reporting, and budget development."
    },
    {
      "duty": "Develop programs that support managers, directors, and leaders in deepening their skills, knowledge, and effectiveness in managing their budgets and financial planning."
    },
    {
      "duty": "Integrate financial planning, budgeting, and reporting within the organization's strategic planning."
    },
    {
      "duty": "Review rules, laws, and standards to facilitate financial compliance and ensure required information is available for executive-level decision-making."
    },
    {
      "duty": "Represent the organization before the public, other jurisdictions, and professional organizations as a member of the senior leadership team."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in finance, accounting, or a similar field (Master of Business Administration (MBA) or certifications such as Chartered Financial Analyst (CFA) and Certified Public Accountant (CPA) preferred)"
    }
  ]
}