{
  "meta": [
    {
      "job_title": "Principal",
      "job_category": "Management",
      "job_class": "Principal",
      "sector": "Turnaround & Restructuring",
      "salary": 180000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Specialize in performing highly intensive turnaround projects with middle-market companies in distress."
    },
    {
      "duty": "Work closely across the organization with c-suite and ground-floor stakeholders, as well as balancing the relationships and needs of work across a varied and unique client base on engagements involving Turnaround & Restructuring, Operations Improvement, M&A, and Group Strategy centered around profits."
    },
    {
      "duty": "Partner with clients throughout the distress curve to restructure their short-term cash flow pressures and create long-term stability and sustainable growth."
    },
    {
      "duty": "Work under constricted timelines as an effective and valued partner delivering the best-in-service as an advisor and in implementation."
    },
    {
      "duty": "Help drive business development opportunities, cross-selling complementary service offerings. Develop network in Chicago while working and collaborating across all offices and building the national brand and capability set."
    },
    {
      "duty": "Manage a team of motivated professionals and mentor junior colleagues, working as a teacher across the firm, while also being open to learning and developing personally."
    },
    {
      "duty": "Work hands-on, shoulder-to-shoulder with all team members, working in a hands-on capacity where needed and empowering other staff members to take on stretch opportunities and increased responsibility."
    },
    {
      "duty": "The opportunity for success in this role is defined by your entrepreneurial drive and ability to see value realized in a shortened timeframe. If you can work at speed, deliver creative solutions to increasingly complex problems, then you will have an unlimited trajectory of success with this firm."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 200,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Certified Turnaround professional4+ years’ experience consulting within the restructuring / distressed space. Experience building and managing 13-week cashflows is essential, the ideal candidate will have full range of experience within turnaround and restructuring engagements. 7-11 years of total experience. An entrepreneurial appetite and drive to create value within your network and help to build a leading specialist consulting firm. Be part of building a business that will last into the future, laying the foundation for a leading consulting firm in the middle market across the USA."
    }
  ]
}