{
  "duties_responsibilities": [
    {
      "duty": "Provide visionary leadership in shaping Haum's technology strategy and direction. Work closely with me as the CEO and other executives to align technology initiatives with our overall business objectives."
    },
    {
      "duty": "Lead and mentor our talented team of developers, fostering a culture of innovation, collaboration, and continuous learning. Ensure the effective execution of projects and deliverables."
    },
    {
      "duty": "Design and oversee the development of Haum's technology infrastructure, ensuring scalability, security, and performance of our platform."
    },
    {
      "duty": "Create a clear and comprehensive technology roadmap, outlining the implementation of new technologies, tools, and frameworks to enhance our product offerings."
    },
    {
      "duty": "Stay updated with industry trends and advancements, identifying opportunities for innovation and improvement within Haum's technology stack."
    },
    {
      "duty": "Oversee the implementation of robust security measures and ensure compliance with data protection regulations."
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Engineering, or related field (Master's preferred)"
    }
  ],
  "meta": [
    {
      "job_title": "Chief Technology Officer",
      "job_category": "Technology",
      "job_class": "Executive",
      "sector": "Software Engineering",
      "salary": 180000,
      "remote": true
    }
  ],
  "skills": [
    {
      "experience": 10,
      "skill": "Technology Strategy Development"
    },
    {
      "experience": 10,
      "skill": "Team Leadership"
    },
    {
      "experience": 10,
      "skill": "Architecture Design"
    },
    {
      "experience": 10,
      "skill": "Roadmap Planning"
    },
    {
      "experience": 10,
      "skill": "Innovation Research"
    },
    {
      "experience": 10,
      "skill": "Security Compliance"
    }
  ],
  "subjective_elements": [
    {
      "introvert_extrovert": 180,
      "soldier_general": 160,
      "student_teacher": 150
    }
  ]
}