{
  "meta": [
    {
      "job_title": "Membership Manager",
      "job_category": "Manager",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 70000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and manage the onboarding of new members from application to full membership status."
    },
    {
      "duty": "Manage and execute new member orientation program to ensure a superior \n“first impression” experience."
    },
    {
      "duty": "Ensure integrity of membership records in accordance with membership requirements of the National Association of REALTORS®."
    },
    {
      "duty": "Collaborate with bookkeeper to manage annual dues billing. Coordinate dues bill correspondence with Director of Communications."
    },
    {
      "duty": "Implements membership strategies that support recruitment of new members and retention of existing members through outreach efforts."
    },
    {
      "duty": "Develop strong customer relationship between Association and members through support and outreach efforts. Routine visits and communication are required to strengthen the Association-Member relationship."
    },
    {
      "duty": "Provide support and assistance with member benefit services."
    },
    {
      "duty": "Maintain an in-depth knowledge of Association offerings to deliver programs which exceed the standards established."
    },
    {
      "duty": "Responsible for both internal and external customer relations with all members and industry contacts which the Association interacts."
    },
    {
      "duty": "Provide quality customer service to members at levels above industry standards on a consistent basis."
    },
    {
      "duty": "Provide both direction and support to assigned Task Forces, Work Groups, or special projects to successfully reach all objectives identified."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Oral Communication",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Quality",
      "experience": 5
    },
    {
      "skill": "Adaptability",
      "experience": 5
    },
    {
      "skill": "Initiative",
      "experience": 5
    },
    {
      "skill": "Planning/Organizing",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree. Minimum of three years of experience in membership or constituent management position preferred. Demonstrated experience in growing membership/customers and strengthening membership/customer retention. Must possess knowledge of modern technology to include proficiency in Microsoft Office Suite, virtual meeting platforms, and membership database management."
    }
  ]
}