{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Nuclear Services",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Contract Management",
      "experience": 7
    },
    {
      "skill": "MS Word, Excel and PowerPoint",
      "experience": 7
    },
    {
      "skill": "Primavera Project Management Software",
      "experience": 7
    },
    {
      "skill": "Quality Assurance (QA) Program",
      "experience": 7
    },
    {
      "skill": "Team Building",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Budget and Accounting",
      "experience": 7
    },
    {
      "skill": "Marketing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage highly complex projects, plan, execute, and finalize projects according to established schedule and within budget."
    },
    {
      "duty": "Understand, develop, and maintain project schedules, project management plans, project quality plans, and manage project staff to ensure project requirements are met."
    },
    {
      "duty": "Foster and maintain working relations with assigned clients, act as a single point of contact for one or more assigned clients."
    },
    {
      "duty": "Aggressively support marketing efforts, including identification of marketing opportunities, proposal preparation, and follow-up."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. in Engineering or equivalent from an accredited university."
    },
    {
      "credential": "PMP Certification preferred. ENERCON Project Manager Certification required."
    },
    {
      "credential": "Experienced in contract and non-disclosure agreement language development and review."
    },
    {
      "credential": "Ability to understand and work with budget and accounting processes."
    },
    {
      "credential": "Experience working under a QA Program, Appendix B or NQA-1, is desirable."
    },
    {
      "credential": "Ability to travel 20-25%."
    },
    {
      "credential": "Ability to pass pre-employment and random drug and alcohol screenings; ENERCON and client specific background checks; and an annual motor vehicle record (MVR) according to company and client policies."
    },
    {
      "credential": "Must be legally eligible to work in the US without current or future sponsorship."
    }
  ]
}