{
  "meta": [
    {
      "job_title": "Human Resources Generalist",
      "job_category": "Human Resources",
      "job_class": "Generalist",
      "sector": "Human Resources",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Human Resources Management",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Compliance",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Employee Communications",
      "experience": 5
    },
    {
      "skill": "Safety and Health Management",
      "experience": 5
    },
    {
      "skill": "Talent Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Run daily HR functions, including hiring, interviewing, pay administration, benefits, and leave management."
    },
    {
      "duty": "Partner with management to direct safety initiatives and ensure compliance with laws, regulations, and company policies."
    },
    {
      "duty": "Ensure ethical conduct and compliance with regulatory requirements at all levels."
    },
    {
      "duty": "Deliver HR programs including compensation, benefits, leave, disciplinary matters, and talent management."
    },
    {
      "duty": "Recruit, interview, and facilitate hiring qualified job applicants; implement new hire orientation and employee recognition programs."
    },
    {
      "duty": "Handle employment-related inquiries, attend employee disciplinary meetings, and maintain compliance with employment laws and regulations."
    },
    {
      "duty": "Review and maintain knowledge of trends, best practices, regulatory changes, and new technologies in human resources."
    },
    {
      "duty": "Develop good employee communications, promote positive teamwork attitudes, and company culture."
    },
    {
      "duty": "Collaborate with management to promote company safety culture objectives, and develop, prepare, and implement training programs, policies, and procedures for a safe working environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Human Resources, Business Administration, or related business"
    },
    {
      "credential": "SHRM-CP"
    },
    {
      "credential": "Two to three years of related experience is required"
    }
  ]
}