{
  "meta": [
    {
      "job_title": "Finance and Grants Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as primary contact for multiple project staff; provide financial analysis, management support and guidance."
    },
    {
      "duty": "Communicate regularly with Grant Funders and provide a high level of customer service around short- and long-term fiscal management."
    },
    {
      "duty": "Support projects’ funding proposals: assist with budgets, review proposals, provide supporting documents."
    },
    {
      "duty": "Ensure complete documentation of funding awards."
    },
    {
      "duty": "Work with project directors to comply with funder’s terms and conditions, manage deliverables, monitor spending, request amendments, and plan spend-out."
    },
    {
      "duty": "Prepares all grant reporting and maintains the Billing and Budget Review Schedule."
    },
    {
      "duty": "Support budget creation, budget projections and analysis of expenses as needed."
    },
    {
      "duty": "Review Cost Allocation Plan to ensure correct charges to various grants and funds."
    },
    {
      "duty": "Process bi-weekly payroll using ADP Workforce Now."
    },
    {
      "duty": "Review salaries being allocated to projects and adjust to ensure correct allocation. Adjust leave accruals as needed."
    },
    {
      "duty": "Prepare, review, and distribute monthly reports, funder reports and others. Document and address issues requiring attention and/or further discussion."
    },
    {
      "duty": "Analyze and monitor projects’ fund, cash balances, and keep project and AFL team informed of status, issues."
    },
    {
      "duty": "Supervises Financial Specialist to ensure timely and accurate processing of payables, deposits, and billings."
    },
    {
      "duty": "Works with auditors to ensure timely audit completion."
    },
    {
      "duty": "Perform other duties as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS degree in business, nonprofit fiscal management or accounting preferred; five or more years of experience managing grants and nonprofit finances required."
    },
    {
      "credential": "Sophisticated nonprofit fund and federal grant accounting and management strongly preferred."
    },
    {
      "credential": "Budgeting experience required."
    },
    {
      "credential": "Demonstrated skill in providing a high level of service to multiple customers, ideally in a nonprofit context, required."
    },
    {
      "credential": "Proficiency with ADP WorkForceNow and Quickbooks accounting software, spreadsheets and data management systems required."
    },
    {
      "credential": "Proficiency with Excel and Word."
    },
    {
      "credential": "Experience working as part of a team delivering coordinated services highly desirable."
    },
    {
      "credential": "Excellent communication and critical thinking skills."
    },
    {
      "credential": "Ability to pay close and accurate attention to details."
    },
    {
      "credential": "Ability to juggle multiple tasks and priorities."
    },
    {
      "credential": "Ability to work in a fast paced, multi-cultural environment."
    },
    {
      "credential": "Commitment to the mission of AFL."
    },
    {
      "credential": "Must have own transportation, valid driver’s license, and insurance."
    }
  ]
}