{
  "meta": [
    {
      "job_title": "Chief Financial Officer",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 180000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Partner with and support senior leadership as they execute the strategic vision of the company."
    },
    {
      "duty": "Lead all functions in the accounting, cost accounting, cash management, and financial reporting areas for all locations."
    },
    {
      "duty": "Responsible for assessing the financial performance of the company as well as possible risks and investments."
    },
    {
      "duty": "Actively participate in the development and review of the monthly financial statements and related reports."
    },
    {
      "duty": "Responsible for the financial and accounting policies within guidelines of sound accounting practice and GAAP."
    },
    {
      "duty": "Direct audit preparation work and interactions with external auditors."
    },
    {
      "duty": "Provide input and analysis as part of the business planning process."
    },
    {
      "duty": "Review the annual company profit plan and insure that measurements are in place to help guide the company to meet its annual goals and objectives."
    },
    {
      "duty": "Provide leadership and guidance to all direct reports regarding SMART goals development."
    },
    {
      "duty": "Support the treasury and banking objectives of the CFO."
    },
    {
      "duty": "Review operations and financial business practices to help improve profits."
    },
    {
      "duty": "Assist in the due diligence and implementation of new business ventures and acquisitions."
    },
    {
      "duty": "Direct initiatives to continuously expand initiatives related to business intelligence and key performance indicators."
    },
    {
      "duty": "Work closely with and provide support for the outside tax experts to ensure tax filings are timely and accurate."
    },
    {
      "duty": "Foster a working environment that employees can thrive in that coincides with company culture initiatives."
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 7
    },
    {
      "skill": "Cost Accounting",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Mergers and Acquisitions",
      "experience": 7
    },
    {
      "skill": "Business Intelligence",
      "experience": 7
    },
    {
      "skill": "Key Performance Indicators",
      "experience": 7
    },
    {
      "skill": "Tax Management",
      "experience": 7
    },
    {
      "skill": "Culture Development",
      "experience": 7
    },
    {
      "skill": "GAAP Compliance",
      "experience": 7
    },
    {
      "skill": "Auditing",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS in Accounting/Finance with a CPA or CMA"
    }
  ]
}