{
  "meta": [
    {
      "job_title": "Senior Training Coordinator",
      "job_category": "Human Resources",
      "job_class": "Senior",
      "sector": "Training and Development",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Training Administration",
      "experience": 4
    },
    {
      "skill": "Employee Training Programs",
      "experience": 4
    },
    {
      "skill": "Recordkeeping",
      "experience": 4
    },
    {
      "skill": "Budgeting",
      "experience": 4
    },
    {
      "skill": "Training Coordination",
      "experience": 4
    },
    {
      "skill": "Safety Training",
      "experience": 4
    },
    {
      "skill": "Training Program Evaluation",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinating and deploying hands-on employee training programs for manufacturing and support employees."
    },
    {
      "duty": "Reviewing existing training programs and collaborating on enhancements and modifications to improve engagement, learning, and retention."
    },
    {
      "duty": "Ensuring that training materials and programs are current, accurate, and effective."
    },
    {
      "duty": "Identifying problems and opportunities that training could improve and conducting or facilitating required and recommended training sessions."
    },
    {
      "duty": "Monitoring the effectiveness of training using individual and group performance results and administering skill or competency assessments."
    },
    {
      "duty": "Ensuring that training milestones and goals are met while adhering to the approved training budget."
    },
    {
      "duty": "Assisting in other administrative and budgeting tasks associated with training programs."
    },
    {
      "duty": "Embracing safety-centric culture of the organization."
    },
    {
      "duty": "Maintaining knowledge of new methods and techniques for training, and training requirements applicable to the organization and/or manufacturing industry."
    },
    {
      "duty": "Performing other related duties as assigned."
    },
    {
      "duty": "Required Skills/Abilities: Proven team player Excellent verbal and written communication skills. Thorough understanding of training processes. Experience with physical process and machine operation training. Adept at navigating varying levels of education and experience. Ability to moderate large groups. Extremely organized and detail oriented. Proficient with Microsoft Office Suite and related software."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in communications or related area required. At least four years of experience in training with two years of supervisory experience required. Bi-lingual in English/Spanish preferred."
    }
  ]
}