{
  "meta": [
    {
      "job_title": "Customer Experience Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Customer Service",
      "salary": 38000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage incoming phone calls, live chats, voicemails, and Gorgias tickets from customers in a timely, effective, kind and positive manner."
    },
    {
      "duty": "Manage Returns Processes and Loop Platform."
    },
    {
      "duty": "Become Shopify & Gorgias platform expert and become proficient navigating and working with order/customer information."
    },
    {
      "duty": "Utilize Teams Messaging App to keep constant communications with fulfillment leadership."
    },
    {
      "duty": "Collaborate with marketing and fulfillment teams to enhance customer service and brand awareness."
    },
    {
      "duty": "Work on projects that support company-wide goals and initiatives. This can include Netsuite testing and implementation."
    },
    {
      "duty": "Continuously brainstorm ways to improve customers' experiences."
    },
    {
      "duty": "Set the example to become the gold standard Customer Experience Representative in the apparel industry."
    },
    {
      "duty": "Work with Inventory Analyst to make sure all inventory is stated accurately after CX processes returns and order cancellations."
    },
    {
      "duty": "Create and maintain metrics regarding customer experience with website, products, and overall brand using Shopify platform."
    },
    {
      "duty": "Be flexible. Given the team is small and growing fast, this position will require a team-building, self-motivating and solution-oriented attitude."
    },
    {
      "duty": "Have a willingness to pitch in on any and all fronts to help the team in a positive and effective manner."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Gorgias Platform",
      "experience": 1
    },
    {
      "skill": "Shopify",
      "experience": 1
    },
    {
      "skill": "Teams Messaging",
      "experience": 1
    },
    {
      "skill": "Netsuite",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Customer Experience Enhancement",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Flexibility",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    }
  ]
}