{
  "meta": [
    {
      "job_title": "Traveling Sales Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Cold Calling",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management (CRM)",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Industry Research",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement strategic sales plans to achieve and exceed individual and team sales targets."
    },
    {
      "duty": "Identify and prospect potential clients through various channels, including cold calling, networking, and referrals."
    },
    {
      "duty": "Conduct in-depth research on potential clients, understanding their needs, and industry trends to tailor solutions accordingly."
    },
    {
      "duty": "Build and maintain strong, long-lasting customer relationships by providing exceptional service and addressing client inquiries and concerns promptly."
    },
    {
      "duty": "Conduct on-site visits to clients, assessing restoration needs, and presenting comprehensive service proposals."
    },
    {
      "duty": "Collaborate with internal teams, including project managers and estimators, to ensure seamless project execution and customer satisfaction."
    },
    {
      "duty": "Prepare and deliver persuasive sales presentations to key decision-makers, showcasing the value proposition of RCM Restoration Service."
    },
    {
      "duty": "Negotiate contracts and terms with clients, aiming to maximize revenue while ensuring a win-win outcome."
    },
    {
      "duty": "Maintain accurate records of sales activities, customer interactions, and deal progress using CRM software."
    },
    {
      "duty": "Stay updated on industry developments, market trends, and competitor activities to identify potential business opportunities and challenges."
    },
    {
      "duty": "Attend industry events, conferences, and trade shows to expand the company's network and promote RCM Restoration Service."
    },
    {
      "duty": "Uphold the company's core values and always represent the organization in a professional and positive manner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Proven experience in outside sales or business development, preferably in the restoration services industry or a related field."
    }
  ]
}