{
  "meta": [
    {
      "job_title": "Accounting Associate",
      "job_category": "Accounting",
      "job_class": "Associate",
      "sector": "Finance",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Accounts Payable",
      "experience": 3
    },
    {
      "skill": "Accounts Receivable",
      "experience": 3
    },
    {
      "skill": "General Ledger",
      "experience": 3
    },
    {
      "skill": "QuickBooks",
      "experience": 3
    },
    {
      "skill": "Excel",
      "experience": 3
    },
    {
      "skill": "Word Processing",
      "experience": 3
    },
    {
      "skill": "Negotiation",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Process accounts receivable and accounts payable functions, including bank deposits, check processing, and reconciliations."
    },
    {
      "duty": "Match purchase orders and packing slips, enter invoices into the QuickBooks system, and process accounts payable check run batches."
    },
    {
      "duty": "Reconcile vendor statements, negotiate pricing with vendors, and order supplies for all locations."
    },
    {
      "duty": "Prepare and manage various accounting spreadsheets, allocations, and analyses related to billing and accounts receivable."
    },
    {
      "duty": "Manage accounts receivable related to cash deposits, reconciliations, and allocations of payments processed via bank check deposit scanner and credit card terminals."
    },
    {
      "duty": "Maintain accounting files and documentation thoroughly and accurately, assist with yearend 1099 process, and prepare yearly tangible tax documentation."
    },
    {
      "duty": "Work independently with minimal supervision, manage time efficiently, and meet deadlines."
    },
    {
      "duty": "Maintain strict confidentiality of all Finance Department information."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting, Finance, or a related field (CPA preferred)"
    }
  ]
}