{
  "meta": [
    {
      "job_title": "Principal Analyst",
      "job_category": "Research and Analysis",
      "job_class": "Analyst",
      "sector": "Defense",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Basing Initiatives",
      "experience": 10
    },
    {
      "skill": "Navy Justification",
      "experience": 10
    },
    {
      "skill": "NEPA Requirements",
      "experience": 10
    },
    {
      "skill": "Aviation Facility Needs",
      "experience": 10
    },
    {
      "skill": "Requirements Officer Training",
      "experience": 10
    },
    {
      "skill": "Business Process Analysis",
      "experience": 10
    },
    {
      "skill": "Systems Design Analysis",
      "experience": 10
    },
    {
      "skill": "Functional Requirement Analysis",
      "experience": 10
    },
    {
      "skill": "Government Security Clearance",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support infrastructure requirements including military construction, facility sustainment, restoration and modernization, and special projects as they relate to CNAF determination and prioritization processes."
    },
    {
      "duty": "Provide expert technical support for strategic basing initiatives involving aircraft and aircraft carriers, showcasing a comprehensive understanding of Navy justification and rationale for both existing and anticipated future force laydowns."
    },
    {
      "duty": "Collaborate across functions to analyze, design, and implement effective business solutions."
    },
    {
      "duty": "Utilize in-depth expertise in NEPA requirements concerning Naval Aviation basing and facility needs, as well as proficiency in navigating the CNAF Master Aviation Plan and securing funding through the CNIC Air Operations program."
    },
    {
      "duty": "Deliver an extensive Requirements Officer Training program, covering essential topics such as the Joint Capability Integration and Development System, Defense Acquisition System, and the Pentagon's Planning, Programming, Budgeting, and Execution process."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in business, finance, engineering, science, mathematics, or a related field required. Master's degree preferred."
    }
  ]
}