{
  "meta": [
    {
      "job_title": "Associate Designer",
      "job_category": "Design",
      "job_class": "Associate",
      "sector": "Creative",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Apply basic and some advanced skills in the creation of designs for packaging and/or point of service displays for assigned projects in accordance with PCA design and safety standards."
    },
    {
      "duty": "Answer routine questions regarding layouts, estimating, die making, order specifications, customer packaging procedures, and material handling techniques."
    },
    {
      "duty": "Design and submit samples to prospective customers for the purpose of securing new business."
    },
    {
      "duty": "Provide technical assistance to the sales representatives and/or customer service representatives regarding layout, detailed artwork, and printing dies."
    },
    {
      "duty": "Approve printing press and die cut set-ups for initial order of new designs."
    },
    {
      "duty": "Assist in the development of graphics, builds prototypes, and makes samples for review with designer."
    },
    {
      "duty": "Perform routine package and component testing and advises manager of findings."
    },
    {
      "duty": "Maintain archived client project and graphic files including logos, product photography, packaging design files, etc."
    },
    {
      "duty": "Work with design dies and check cutting dies upon arrival for accuracy."
    }
  ],
  "skills": [
    {
      "skill": "Computer Assisted Design (CAD)",
      "experience": 5
    },
    {
      "skill": "Graphic Design",
      "experience": 5
    },
    {
      "skill": "Product Photography",
      "experience": 5
    },
    {
      "skill": "Packaging Design",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Prototype Development",
      "experience": 5
    },
    {
      "skill": "Technical Assistance",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in graphic design, structural design, art, engineering, or packaging required."
    },
    {
      "credential": "Previous experience with packaging and point of purchase display creation and design."
    },
    {
      "credential": "Working knowledge of production methods, printing methods, materials, styles, and standard design forms and retail usage of packaging and point of purchase displays."
    },
    {
      "credential": "Experience in corrugated industry with a technical understanding of corrugated packaging design, cutting dies, converting machinery and printing."
    }
  ]
}