{
  "meta": [
    {
      "job_title": "Operational & Treasury Management Risk Officer, VP",
      "job_category": "Risk Management",
      "job_class": "Officer",
      "sector": "Management",
      "salary": 160000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Operational Risk Management",
      "experience": 10
    },
    {
      "skill": "Compliance",
      "experience": 10
    },
    {
      "skill": "Audit Processes",
      "experience": 10
    },
    {
      "skill": "Risk Assessment",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Financial Markets",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement risk control processes to improve internal systems and control risk."
    },
    {
      "duty": "Assist in the development of control activities and audit processes to identify, evaluate, and remediate operational risks."
    },
    {
      "duty": "Identify gaps in current processes and develop operational risk policies and standards for risk management."
    },
    {
      "duty": "Assist in the development and implementation of measurement processes for operational key risk and control indicators."
    },
    {
      "duty": "Track and monitor operating risk issues for all business units and report issues and mitigation strategies to senior management."
    },
    {
      "duty": "Assist business units and senior management to perform operational risk identification and assessments in all business lines."
    },
    {
      "duty": "Enhance the bank's payment risk monitoring program and conduct enhanced due diligence on merchants, partners, and clients."
    },
    {
      "duty": "Analyze data to identify trends/anomalies in customer behavior and investigate suspicious activity."
    },
    {
      "duty": "Assist management in audits and regulatory compliance requirements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business, Accounting, or related field; Master’s Degree preferred."
    }
  ]
}