{
  "meta": [
    {
      "job_title": "Reliability Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Maintenance Engineering",
      "experience": 3
    },
    {
      "skill": "Reliability Engineering",
      "experience": 3
    },
    {
      "skill": "Failure Analysis",
      "experience": 3
    },
    {
      "skill": "Process Safety Management (PSM)",
      "experience": 3
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 3
    },
    {
      "skill": "Equipment Sizing and Selection",
      "experience": 3
    },
    {
      "skill": "Ultrasonic Inspection",
      "experience": 3
    },
    {
      "skill": "Risk Based Inspection Techniques",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Grow a robust reliability centered operation where all levels of the organization are engaged in programs and tools to improve and sustain equipment reliability."
    },
    {
      "duty": "Investigate equipment problems and recommend design modifications to improve reliability, productivity, and safety of production assets."
    },
    {
      "duty": "Conduct failure analysis to determine the root cause of equipment failures and recommend improvements in design, administrative, and/or PPM measures to reduce or eliminate failures."
    },
    {
      "duty": "Manage corrective actions to closure generated from RCFA’s."
    },
    {
      "duty": "Participate in the site’s Mechanical Integrity and Process Safety Management program."
    },
    {
      "duty": "Perform equipment and production history data analysis to identify and prioritize areas for reliability improvements."
    },
    {
      "duty": "Develop and issue recommendation memos for key stakeholders."
    },
    {
      "duty": "Assist with managing the End-of-Life document and share with stakeholders twice a year."
    },
    {
      "duty": "Manage the Plant Vulnerabilities list."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Mechanical Engineering or a closely related engineering discipline, plus 3 years’ experience in a maintenance or reliability engineering role in a chemical production facility. The professional also should have working knowledge of ASME and API equipment codes, including ASME Sections I, II, V, VIII D1, IX, B31.1, B31.3, B16.1, B16.5, B16.20, B16.21, B16.47, and API codes and standards 610, 611, 612, 613, 614, 617, and 670. Utilizing Process Safety Management (PSM), Management of Change (MOC), and Mechanical Integrity (MI) methodologies. Experience with equipment sizing and selection. Conducting failure analysis or root cause analysis. Experience performing equipment and production history data analysis to identify and prioritize areas for reliability improvements. Understanding ultrasonic inspection and non-destructive testing equipment. Understanding of Risk Based Inspection Techniques and Fitness-for Service standards."
    }
  ]
}