{
  "meta": [
    {
      "job_title": "Brokerage and Transaction Coordinator",
      "job_category": "Real Estate",
      "job_class": "Coordinator",
      "sector": "Real Estate",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Prepare and edit correspondence, proposals, non-disclosure agreements, lease exhibits, contracts, and other documents."
    },
    {
      "duty": "Calculate commission amounts and prepare commission agreements."
    },
    {
      "duty": "Update transactions and prospects in Salesforce and assist with prospect outreach."
    },
    {
      "duty": "Qualify prospects and assign them to the appropriate broker. Show space as needed."
    },
    {
      "duty": "Interface with legal and construction department in triaging transaction documents and construction matters."
    },
    {
      "duty": "Oversee and assist with special projects as required."
    },
    {
      "duty": "Manage team listings in online databases including LoopNet, CoStar, and Crexi."
    },
    {
      "duty": "Collaborate with marketing department to facilitate customized marketing campaigns and events and prepare and execute marketing plans."
    },
    {
      "duty": "Responsible for updating marketing brochures and other related marketing materials."
    },
    {
      "duty": "Prepare marketing presentations for prospective commercial tenants that align the tenants' needs and available properties."
    },
    {
      "duty": "Perform database research, demographics reports, etc. Prepare prospect-specific marketing packages."
    },
    {
      "duty": "Manage content for brokerage teams' LinkedIn accounts."
    },
    {
      "duty": "Organize and oversee broker events."
    },
    {
      "duty": "Miscellaneous administrative functions related to managing the brokerage team."
    },
    {
      "duty": "All other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 50,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "2-year associate or professional degree required; 4-year bachelor's degree preferred. Minimum of 3 years' commercial real estate experience required; real estate license a plus."
    }
  ]
}