{
  "meta": [
    {
      "job_title": "Secretary-Treasurer",
      "job_category": "Finance",
      "job_class": "Executives",
      "sector": "Finance",
      "salary": 150000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Sets the strategy and oversees the operations and administration of the Airlines Clearing House and its various settlement services."
    },
    {
      "duty": "Establishes short and long-term goals, consults with and advises the ACH Board of Directors on financials, actions, emerging issues, opportunities, and daily operations."
    },
    {
      "duty": "Maintains all corporate records, conducts meetings of the ACH Board of Directors, and designs, assesses the value of, and implements products and services to be offered by the ACH."
    },
    {
      "duty": "Exercises general financial oversight for the corporation, drafts, evaluates, negotiates, executes, administers, and maintains contracts with suppliers."
    },
    {
      "duty": "Provides guidance to existing and prospective companies with respect to the application of, and adherence to, the rules and regulations of the various ACH settlement services."
    },
    {
      "duty": "Facilitates consensual resolution of billing disputes, arranges and conducts meetings for the ACH Revenue Accounting Committee, and represents the ACH and its members on the Integrated Settlement System Steering Group."
    }
  ],
  "skills": [
    {
      "skill": "Financial Strategy",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Corporate Governance",
      "experience": 8
    },
    {
      "skill": "Contract Management",
      "experience": 8
    },
    {
      "skill": "Financial Oversight",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business Administration or Accounting or equivalent experience. Master's degree preferred."
    }
  ]
}