{
  "meta": [
    {
      "job_title": "Construction Cost Estimator",
      "job_category": "Construction",
      "job_class": "Estimator",
      "sector": "Construction",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Cost Estimation",
      "experience": 5
    },
    {
      "skill": "Quantity Surveying",
      "experience": 5
    },
    {
      "skill": "Project Cost Analysis",
      "experience": 5
    },
    {
      "skill": "Construction Materials",
      "experience": 5
    },
    {
      "skill": "Sitework and Excavation",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Construction Software",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Cost Control",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepare conceptual estimates with limited information for the acquisitions team as they look at potential development projects."
    },
    {
      "duty": "Conduct detailed quantity takeoffs for construction materials, including earthwork, concrete, steel, lumber, finishes, plumbing fixtures, electrical fixtures, and landscaping."
    },
    {
      "duty": "Perform thorough and accurate cost estimation for multifamily construction projects, including new builds, renovations, and tenant improvements."
    },
    {
      "duty": "Analyze project drawings, specifications, and existing conditions to identify and understand construction requirements, materials, labor needs, and project scope."
    },
    {
      "duty": "Develop and maintain a comprehensive cost database that includes current market rates for materials, labor, and equipment to ensure accurate and up-to-date cost estimations."
    },
    {
      "duty": "Collaborate with vendors, suppliers, and subcontractors to gather pricing information and negotiate favorable rates and terms for materials and services."
    },
    {
      "duty": "Prepare detailed cost breakdowns, reports, and presentations to stakeholders, outlining the estimated costs for each project phase, including materials, labor, equipment, and overhead expenses."
    },
    {
      "duty": "Identify opportunities for value engineering and cost-saving measures without compromising the quality and integrity of the project."
    },
    {
      "duty": "Assist the Project Managers in evaluating bids received from subcontractors and suppliers, reviewing their cost proposals, and making recommendations based on cost competitiveness and quality of work."
    },
    {
      "duty": "Collaborate closely with project managers, architects, engineers, and other stakeholders to ensure cost estimates align with project goals and objectives."
    },
    {
      "duty": "Monitor and track project costs throughout the construction phase, identifying and addressing potential budget overruns or cost-saving opportunities."
    },
    {
      "duty": "Stay updated on industry trends, new construction methodologies, and cost-saving techniques to continuously enhance the cost estimation process and maintain competitiveness in the market."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Construction Management, Quantity Surveying, or a related field (Master's preferred)"
    }
  ]
}