{
  "meta": [
    {
      "job_title": "Site Crew Foreman",
      "job_category": "Construction",
      "job_class": "Supervisor",
      "sector": "Construction",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Supervision",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Job Site Safety",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide on-site Supervision for all Civil Construction Work through all phases of construction, including coordinating Subcontractors, materials, and equipment, ensuring that Specifications are being strictly followed, and work is proceeding on schedule."
    },
    {
      "duty": "Identify conflicts in the construction process and communicate them to the project manager for resolution."
    },
    {
      "duty": "Coordinate required daily inspections with local jurisdictions."
    },
    {
      "duty": "Ensure all work is being built according to the plan."
    },
    {
      "duty": "Perform as-built surveys of all Civil Construction Work."
    },
    {
      "duty": "Manage underground utility locating with DigSafe and third-party locators in coordination with the Civil PM."
    },
    {
      "duty": "Ensure that the Civil Construction Materials and Work is kept in a safe, clean and organized manner."
    },
    {
      "duty": "Ensure all workers are equipped with proper PPE."
    },
    {
      "duty": "Ensure all onsite operations follow current OSHA regulations."
    },
    {
      "duty": "Hold weekly toolbox talks."
    },
    {
      "duty": "Maintain daily log of activities on the jobsite."
    },
    {
      "duty": "Opening the jobsite at the beginning of the day and securing the jobsite at the end of the day."
    },
    {
      "duty": "Hold daily coordination meetings with the site crew(s)."
    },
    {
      "duty": "Manage in-house and temporary labor each day."
    },
    {
      "duty": "Order soils, bedding material, and aggregates as needed."
    },
    {
      "duty": "Set up 3rd party trucking in conjunction with the Civil PM."
    },
    {
      "duty": "Set up Mobilization in conjunction with the Civil PM."
    },
    {
      "duty": "Ensure Equipment is Maintained in accordance with manufacturer specifications."
    },
    {
      "duty": "Receive and check all Civil Construction deliveries."
    },
    {
      "duty": "Provide onsite management of Civil Construction Subcontractors."
    },
    {
      "duty": "Assist in ordering rental equipment in conjunction with the Civil PM."
    },
    {
      "duty": "Communicate with project management team regarding RFI’s and Submittals."
    },
    {
      "duty": "Operate at all times with the utmost integrity and loyalty to the team."
    },
    {
      "duty": "Exhibit an attitude of teamwork and cooperation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "2+ years of experience in general construction with at least 1 of those years in a Leadman or similar position"
    }
  ]
}