{
  "meta": [
    {
      "job_title": "Vice President of Finance",
      "job_category": "Finance",
      "job_class": "Vice President",
      "sector": "Finance",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "Cash Flow Modeling",
      "experience": 10
    },
    {
      "skill": "Debt Financing",
      "experience": 10
    },
    {
      "skill": "Banking Relationship Management",
      "experience": 10
    },
    {
      "skill": "Compliance Management",
      "experience": 10
    },
    {
      "skill": "Financial Reporting",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement financial strategies, strategic planning, budgeting, and cash flow modeling to maximize profits and plan for the company's growth."
    },
    {
      "duty": "Analyze data and advise leadership on strategic decisions related to the organization's future."
    },
    {
      "duty": "Define and implement key performance indicators and strategic objectives, facilitating measurement and reporting to the executive team."
    },
    {
      "duty": "Draft and implement policies and best practices to support achievement of financial objectives and required standards."
    },
    {
      "duty": "Manage investment strategy to maximize the rate of return on cash/short-term investments."
    },
    {
      "duty": "Cultivate banking relationships to ensure best practices for working capital management including payments and receivables."
    },
    {
      "duty": "Ensure compliance with federal, state, local, and organizational laws, regulations, guidelines, and best practices, including tax laws, GAAP, FAR, and CAS."
    },
    {
      "duty": "Maintain knowledge of developments and trends in finance including technological advances."
    },
    {
      "duty": "Prepare timely and accurate analyses, summaries, and reports of financial data on the operating progress of the company."
    },
    {
      "duty": "Create a reliable cash flow projection process and reporting structure that includes a minimum cash threshold to meet operational needs."
    },
    {
      "duty": "Routinely review revenue cycle metrics to proactively identify and address issues affecting overall performance."
    },
    {
      "duty": "Manage the company’s compliance with local and federal regulatory matters."
    },
    {
      "duty": "Perform other duties as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Accounting or Finance required; MBA preferred. Certified Public Accountant status highly desired. At least ten years of experience in the financial function of a company required."
    }
  ]
}