{
  "meta": [
    {
      "job_title": "Executive Sous Chef",
      "job_category": "Culinary",
      "job_class": "Sous Chef",
      "sector": "Culinary",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Culinary Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Menu Development",
      "experience": 5
    },
    {
      "skill": "Kitchen Management",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Food Safety and Sanitation",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Executive/Head Chef in overseeing all kitchen operations, maintaining high standards of food quality and presentation."
    },
    {
      "duty": "Lead and motivate the culinary team, promoting a positive, inclusive work environment that fosters collaboration, creativity, and professional growth."
    },
    {
      "duty": "Collaborate with the Executive Chef to develop innovative and seasonally inspired menus, using fresh, locally sourced ingredients whenever possible."
    },
    {
      "duty": "Ensure all food items are prepared and served in accordance with established recipes, portion control guidelines, and presentation standards."
    },
    {
      "duty": "Maintain a well-organized and efficient kitchen, optimizing workflow, and implementing effective systems for inventory management, ordering, and cost control."
    },
    {
      "duty": "Monitor food quality and freshness, actively participating in regular inspections, and taking appropriate corrective actions when necessary."
    },
    {
      "duty": "Assist in training and mentoring kitchen staff, providing guidance on proper cooking techniques, safety procedures, and sanitation practices."
    },
    {
      "duty": "Stay up to date with industry trends and best practices, continuously seeking opportunities to enhance culinary skills and knowledge."
    },
    {
      "duty": "Collaborate with the front-of-house team to ensure smooth communication, efficient service, and prompt resolution of any guest concerns or special requests."
    },
    {
      "duty": "Adhere to all food safety and sanitation regulations, promoting a safe and clean working environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Culinary Management Degree or Equivalent Professional Training (Preferred)"
    },
    {
      "credential": "High School Diploma or GED (Required)"
    }
  ]
}