{
  "meta": [
    {
      "job_title": "Director of Engineering",
      "job_category": "Engineering",
      "job_class": "Director",
      "sector": "Management",
      "salary": 160000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Engineering Management",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Strategic Leadership",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Process Optimization",
      "experience": 10
    },
    {
      "skill": "Health & Safety Compliance",
      "experience": 10
    },
    {
      "skill": "Talent Development",
      "experience": 10
    },
    {
      "skill": "Team Collaboration",
      "experience": 10
    },
    {
      "skill": "Innovation Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and communicate a clear vision and strategy for the engineering department that aligns with the company's overall goals and objectives."
    },
    {
      "duty": "Lead the recruitment, onboarding, and development of engineering talent, ensuring the team's skillset matches the company's needs."
    },
    {
      "duty": "Ensure that engineering activities and processes comply with all relevant health, safety, and environmental regulations and standards."
    },
    {
      "duty": "Oversee the planning, execution, and successful delivery of all engineering projects, ensuring they are completed on time, within budget, and to the highest quality standards."
    },
    {
      "duty": "Champion technological innovation and research, staying up-to-date with industry trends and emerging technologies to guide the team's decision-making process."
    },
    {
      "duty": "Identify skill gaps within the engineering team and implement training programs to enhance the technical competencies and professional development of engineers and technicians."
    },
    {
      "duty": "Collaborate closely with other department heads to ensure effective communication and alignment across teams."
    },
    {
      "duty": "Develop and present capital expenditure proposals for new equipment, machinery, and technology upgrades that will enhance manufacturing capabilities and improve productivity."
    },
    {
      "duty": "Identify potential risks and challenges associated with engineering projects and develop mitigation strategies to address them."
    },
    {
      "duty": "Develop and manage the engineering department's budget, allocating resources efficiently to meet project requirements and organizational goals."
    },
    {
      "duty": "Collaborate with the innovation and development team to translate new product designs and concepts into manufacturable solutions, ensuring the smooth transition from design to production."
    },
    {
      "duty": "Identify opportunities for process optimization, automation, and lean manufacturing practices to enhance production efficiency and reduce costs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Engineering."
    }
  ]
}