{
  "meta": [
    {
      "job_title": "Roofing Project Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Coordinate, manage and facilitate the completion of a minimum of 30 roofing projects annually."
    },
    {
      "duty": "Develop and implement a sustainable and efficient program process and related program communication and tracking documents."
    },
    {
      "duty": "Establish new and nurture existing relationships with local governmental agencies, vendors and suppliers, contractors and crews, community partners, and in-kind donors."
    },
    {
      "duty": "Track project costs to ensure the organization remains within budget for the funded program."
    },
    {
      "duty": "Conduct home walk-through assessments to identify project needs and develop scopes of work."
    },
    {
      "duty": "Attend and participate in scheduled events and projects on various weeknights and weekends throughout the year."
    },
    {
      "duty": "Promote the organization to the community and social service providers."
    },
    {
      "duty": "Assist in the planning, coordination, and execution of annual events."
    },
    {
      "duty": "Additional duties as assigned by the CEO."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 125,
      "student_teacher": 90,
      "introvert_extrovert": 85
    }
  ],
  "education_certification": [
    {
      "credential": "5 or more years of experience in roofing, construction, project management or related fields."
    },
    {
      "credential": "Well-rounded knowledge of roofing, construction techniques, construction codes, OSHA compliance, and city ordinances."
    },
    {
      "credential": "Ability to resolve conflicts with clients and contractors."
    },
    {
      "credential": "Ability to fluently and effectively communicate in Spanish (verbally and written) is considered a plus."
    },
    {
      "credential": "Proficient computer skills required (MS Office, DropBox, Google Workspace, Monday.com)."
    }
  ]
}