{
  "meta": [
    {
      "job_title": "Value Stream Manager",
      "job_class": "Manager",
      "job_category": "Management",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Continuous Improvement",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Lean Methodologies",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Microsoft",
      "experience": 5
    },
    {
      "skill": "ERP Systems",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and own the future direction of value streams to align improvements and changes to the manufacturing method to strategic growth plan including new product development (NPD); Coordinate with Product Managers, Materials Manager and HR team to facilitate forecasting and capacity planning through monthly SIOP process."
    },
    {
      "duty": "Leverage structured business system tools through Kaizen and our Continuous Improvement Roadmap (CIR) to implement the departmental and future factory visions (FFV); Apply six sigma and lean methodologies, statistical process control to drive world class product quality levels and lead team through this continuous journey."
    },
    {
      "duty": "Provide leadership to a team of Hourly and Salary professionals, coaching, mentoring and developing them through our Intellectual Capital process to achieve success and satisfaction for both the associate and the business; Maintain the daily cadence of Shift Huddles, Daily Gemba, Daily Management meeting, and monthly Strategy meeting."
    },
    {
      "duty": "Lead the efforts to drive ownership and execution to Safety, Quality, Delivery, Cost (SQDC) metrics; Develop and implement actions to drive cost savings in material, labor efficiency and expenses."
    },
    {
      "duty": "Promote proactive Safety initiatives to ensure an injury-free work environment."
    },
    {
      "duty": "Ensure production operations are compliant to ISO:9001, ISO:14001 and IATF:16949 requirements, supporting regular audit cadence in coordination with QA and EHS managers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor Degree in Engineering or Operations Management"
    }
  ]
}