{
  "meta": [
    {
      "job_title": "Mechanical Engineer II",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Mechanical",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Engineering",
      "experience": 10
    },
    {
      "skill": "Opto-Mechanical Systems",
      "experience": 10
    },
    {
      "skill": "Finite Element Analysis (FEA)",
      "experience": 10
    },
    {
      "skill": "3D Computer-Aided Design (CAD)",
      "experience": 10
    },
    {
      "skill": "Technical Documentation",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Hydraulic and Pneumatic Systems",
      "experience": 10
    },
    {
      "skill": "Motion Control Systems",
      "experience": 10
    },
    {
      "skill": "Structural Foundations",
      "experience": 10
    },
    {
      "skill": "Systems Engineering",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Contribute to the development and enhancement of cutting-edge observatory capabilities."
    },
    {
      "duty": "Support the design, troubleshooting, and maintenance of various mechanical and opto-mechanical systems."
    },
    {
      "duty": "Assemble, test, troubleshoot, and repair new and existing summit infrastructure equipment, encompassing various mechanical and infrastructure systems."
    },
    {
      "duty": "Design, analyze, test, and integrate new observatory capabilities and system upgrades, employing 3D computer-aided design (CAD) and finite element analysis (FEA)."
    },
    {
      "duty": "Prepare technical documentation adhering to ASME GD&T and Drawing standards, developing installation and operations procedures, and coordinating with multidisciplinary teams."
    },
    {
      "duty": "Provide technical and project management support for subcontracts, overseeing design, analysis, fabrication, installation, and repair efforts."
    },
    {
      "duty": "Lead the summit installation of mechanical systems, working closely with project management, engineers, summit supervisors, and the installation team while prioritizing safety through rigorous engineering design and planning."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science degree in mechanical engineering or a related field (Master's preferred)"
    }
  ]
}