{
  "meta": [
    {
      "job_title": "Preschool/Pre-K Teacher",
      "job_category": "Education/Teaching",
      "job_class": "Teacher",
      "sector": "Education",
      "salary": 25000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Preschool curriculum",
      "experience": 3
    },
    {
      "skill": "Lesson Planning",
      "experience": 3
    },
    {
      "skill": "Parent Communication",
      "experience": 3
    },
    {
      "skill": "Classroom Management",
      "experience": 3
    },
    {
      "skill": "Child Development",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and implement lesson plans and activities for Preschool/Pre-K children, aligning with curriculum requirements."
    },
    {
      "duty": "Supervise Assistant Teachers and/or Teacher Aides, ensuring classroom activities are in line with teaching objectives."
    },
    {
      "duty": "Teach a comprehensive program including Music, Art, Literacy, Math, and Science, contributing to the development of various skills in children."
    },
    {
      "duty": "Maintain and arrange the appearance of the classroom, following Human Services guidelines, and preparing necessary supplies."
    },
    {
      "duty": "Attend monthly staff meetings, communicate effectively with parents, and hold bi-annual parent conferences to discuss child progress."
    },
    {
      "duty": "Demonstrate excellent public relations and customer service skills when interacting with participants, parents, and staff."
    },
    {
      "duty": "Maintain a professional attitude while supporting the objectives of the Preschool program and treat all children with dignity and respect."
    },
    {
      "duty": "Must be able to repeatedly sit, walk, stand, climb, bend, kneel, stoop, reach and lift, push, and pull. Must be able to type, write, use a calculator, use a computer, and answer the telephone. Ability to communicate face-to-face is needed."
    },
    {
      "duty": "Obtain a Teacher Qualification letter from the state within 60 days of employment and complete all Human Services requirements, CPR and First Aid."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Early Childhood Education or a related field, Teaching Certification required"
    }
  ]
}