{
  "meta": [
    {
      "job_title": "Sales & Customer Support Specialist",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Support",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Social Media Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Compose and edit emails, documents, presentations, reports, letters and company communications."
    },
    {
      "duty": "Order entry for incoming sales orders, repeat and new."
    },
    {
      "duty": "Respond to all customer contacts in a positive and courteous manner via live chat and e-mail, carrying the voice of the company through all interactions."
    },
    {
      "duty": "Coordinate and maintain Leadership calendars, including staff meetings, events and book conference room."
    },
    {
      "duty": "Coordinate and order supplies for Office, Jan/San, Breakroom, Maintenance and Sales Tools."
    },
    {
      "duty": "Maintain & support sales tools such as phone directory, HubSpot, New Client Letters, Reports and general sales/admin processes."
    },
    {
      "duty": "Facilitate conference calls, online meetings, virtual events, webinars and tours."
    },
    {
      "duty": "Arrange and communicate travel and accommodations for leadership team."
    },
    {
      "duty": "Handle sensitive information with the upmost confidentiality."
    },
    {
      "duty": "Be the liaison between the customer, business development, production and shipping teams."
    },
    {
      "duty": "Support the efforts of Sales with sales collateral, mailing campaigns and daily business functions relating to sales and service to our clients (external & internal)."
    },
    {
      "duty": "Manage reception desk and monitor phone calls as first point of contact."
    },
    {
      "duty": "Maintain common areas both for functionality and presentation, associated with Clients and Sales; Front Entrance, Experience Center."
    },
    {
      "duty": "Using standard processes, send potential orders to design, estimating, graphics and all departments needed complete the request of Sales Representatives and/or Clients."
    },
    {
      "duty": "Works with multiple software to get the necessary answers for the Sales Representative and Client either by using an existing report working with IT to develop a new report or by investigating using software such as AMTECH."
    },
    {
      "duty": "Provide troubleshooting assistance for Clients orders, account status and any relevant problems."
    },
    {
      "duty": "Work as a facilitator with cross functional teams ensuring projects are shipped on time and within specifications to our clients."
    },
    {
      "duty": "Recognize and develop Continuous Process improvement projects within our department."
    },
    {
      "duty": "Supports Sales staff as their internal liaison to production and provides documentation and information as requested in a timely manner."
    },
    {
      "duty": "Works cross functionally with all departments to find answers for our clients and sales representatives."
    },
    {
      "duty": "Gaining a deep understanding of customer experience, identifying, and filling product gaps and generating new ideas that grow market share, improving customer experience and driving growth."
    },
    {
      "duty": "Managing My Print Valet software solution ensuring it successfully meets business and user’s needs."
    },
    {
      "duty": "Translating business goals into specific software requirements."
    },
    {
      "duty": "Developing product pricing and positioning strategies with Sales and Marketing Leadership."
    },
    {
      "duty": "Adhere to safety compliance in accordance with EHS (Environmental Health & Safety) policy."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Sales, Business, or a related field (Master's preferred)"
    }
  ]
}