{
  "meta": [
    {
      "job_title": "VP of Lending Strategy",
      "job_category": "Financial Services",
      "job_class": "Vice President",
      "sector": "Finance",
      "salary": 230000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Cross-Functional Collaboration",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Market Analysis",
      "experience": 8
    },
    {
      "skill": "AI Implementation",
      "experience": 8
    },
    {
      "skill": "Mentoring",
      "experience": 8
    },
    {
      "skill": "Financial Strategy",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Own and shape the lending strategy from ideation through deployment, fostering cross-functional partnerships and supporting strategic expansion initiatives."
    },
    {
      "duty": "Evaluate and expand data used in credit decision process, leveraging non-traditional data sources and re-engineering data elements."
    },
    {
      "duty": "Establish cross-functional partnerships with internal partners and drive new initiatives to transform the lending organization."
    },
    {
      "duty": "Prepare opportunity analysis and drive agenda through influence, ensuring new strategies are implemented accurately and as designed."
    },
    {
      "duty": "Assess and drive the performance of programs, identify new champion strategies, and make disciplined roll-out decisions."
    },
    {
      "duty": "Oversee customer research, ensure insights inform overall strategy, and influence cross-functional teams to develop and drive member engagement strategies."
    },
    {
      "duty": "Recruit, develop, motivate, and retain a high-performing, member-focused team, driving them to meet and exceed department goals and objectives."
    },
    {
      "duty": "Collaborate with peers to align on mutual priorities and enhance the credit union's image, brand, and visibility."
    },
    {
      "duty": "Participate in civic and community activities to reinforce the credit union's commitment to the communities it serves, while promoting a member-centric culture."
    },
    {
      "duty": "Attend meetings, report on areas of responsibility, and actively participate in organizational strategic planning and goal setting."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business, finance, or a related field (Master’s degree preferred)"
    },
    {
      "credential": "Minimum 8 years of progressive team management experience, with a minimum of 10 years of combined experience in consumer lending, mortgage lending, digital strategy, and product development/launch"
    }
  ]
}