{
  "meta": [
    {
      "job_title": "President - North America",
      "job_category": "Executive",
      "job_class": "President",
      "sector": "Management",
      "salary": 250000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Leadership",
      "experience": 10
    },
    {
      "skill": "Business Growth",
      "experience": 10
    },
    {
      "skill": "Client Success Management",
      "experience": 10
    },
    {
      "skill": "Thought Leadership",
      "experience": 10
    },
    {
      "skill": "Team Building",
      "experience": 10
    },
    {
      "skill": "Marketing",
      "experience": 10
    },
    {
      "skill": "Sales",
      "experience": 10
    },
    {
      "skill": "Operations Management",
      "experience": 10
    },
    {
      "skill": "Holistic Expertise",
      "experience": 10
    },
    {
      "skill": "High Performing Team Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, communicate, and execute a comprehensive go-to-market strategy, utilizing innovative prowess to drive new client acquisition and expand current service offerings."
    },
    {
      "duty": "Set the pace for client success, accountability, and satisfaction. Collaborate across the global leadership team to ensure services empower clients to achieve their goals."
    },
    {
      "duty": "Elevate Industry Dialogue and shape the narrative of the organization and the global landscape."
    },
    {
      "duty": "Elevate industry and client community influence as a thought leader."
    },
    {
      "duty": "Leverage profound understanding of accounting or recruitment industries to navigate challenges and opportunities."
    },
    {
      "duty": "Prove mettle by driving growth, innovation, and transformation across previous business ventures."
    },
    {
      "duty": "Orchestrate comprehensive success in marketing, sales, and operations."
    },
    {
      "duty": "Roll up sleeves and immerse in the trenches, setting a powerful example for the team. Build and lead high performing teams."
    },
    {
      "duty": "Step into the role of President and spearhead unparalleled success. Be a part of a growth journey that will redefine how the world perceives accounting services."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Management, or a related field (Master's preferred)"
    }
  ]
}