{
  "meta": [
    {
      "job_title": "Data Scientist/Product Analyst",
      "job_category": "Data Science, Product Analysis",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Statistical Analysis",
      "experience": 4
    },
    {
      "skill": "Modeling",
      "experience": 4
    },
    {
      "skill": "Product-Specific Data Analysis",
      "experience": 4
    },
    {
      "skill": "Business Acumen",
      "experience": 5
    },
    {
      "skill": "Coding (Python, SQL)",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Data Curation and Validation",
      "experience": 5
    },
    {
      "skill": "Measurement and Applied Analysis",
      "experience": 4
    },
    {
      "skill": "Product Analysis Leadership",
      "experience": 5
    },
    {
      "skill": "Project Scoping and Execution",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive analysis for Fitbit product teams focused on Fitbit’s products, apps, and services, including optimizing user lifetime value, improving usage and retention, evaluating content engagement, and suggesting future service innovations for growth."
    },
    {
      "duty": "Use causal inferential methods to quantify impact on product deliveries when experimentation is not available."
    },
    {
      "duty": "Collaborate with cross-functional stakeholders to formulate and complete full cycle analysis that includes data gathering, analysis, ongoing scaled deliverables, and presentations."
    },
    {
      "duty": "Conduct deep dive on core product features, user segmentation, and relation to user satisfaction and retention."
    },
    {
      "duty": "Analyze data to make business recommendations, develop and automate reports, iteratively build and prototype dashboards to provide insights at scale, and solve for business priorities."
    },
    {
      "duty": "Prepare effective presentations in content and function, and speak competently to the level of the audience."
    },
    {
      "duty": "Manage stakeholders and set proper technical direction for teams or organizations."
    },
    {
      "duty": "Identify and debug product issues and user pain-points, including carrying out root cause analysis and quantitatively assessing critical user journeys."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree or equivalent experience (Master's preferred)"
    }
  ]
}