{
  "meta": [
    {
      "job_title": "Tax Specialist",
      "job_category": "Finance & Accounting",
      "job_class": "Specialist",
      "sector": "Accounting",
      "salary": 45000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Tax Preparation",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Accounting",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Virtual Communication",
      "experience": 3
    },
    {
      "skill": "Teamwork",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct tax interviews with clients, and support do-it-yourself online tax clients through virtual tools such as video conferencing, phone, chat, and email."
    },
    {
      "duty": "Generate business growth, increase client retention, and offer additional products and services."
    },
    {
      "duty": "Understand that teamwork is essential to success, and communicate and coordinate regularly with leaders and peers about how remote work is impacting results."
    },
    {
      "duty": "Grow tax expertise and inspire confidence in clients by communicating complex tax situations concisely via phone, email, and chat."
    },
    {
      "duty": "Utilize effective customer service techniques and analytical/problem-solving skills. Research information using various tax and publication tools to understand the client's need."
    },
    {
      "duty": "Prepare complex tax returns, provide audit support, and conduct virtual tax interviews that create confidence in clients. Additionally, have experience in tax planning, sales, and marketing."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 40,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma/equivalent or higher. Must complete 18-hour continuing education requirement and meet all other IRS and applicable state requirements. Availability to work a minimum of 20 hours a week during peak tax season. Enrollment in or completion of the H&R Block Income Tax Course is neither an offer nor a guarantee of employment. It would be even better to have CPA or Enrolled Agent certification, and 5+ years of experience in accounting, finance, bookkeeping, or tax."
    }
  ]
}