{
  "meta": [
    {
      "job_title": "Limited Radiographer",
      "job_category": "Healthcare",
      "job_class": "Radiographer",
      "sector": "Medical",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Operates X-Ray equipment in the examination of patients in accordance with standard procedure and physician's instructions."
    },
    {
      "duty": "Provides treatment/care to pediatric, adolescent, adult and geriatric patients."
    },
    {
      "duty": "Maintains a positive attitude and demonstrates appropriate communication of information to all ages."
    },
    {
      "duty": "Responsible for the operation and maintenance of equipment, including routine maintenance, ordering of supplies, and cleaning."
    },
    {
      "duty": "Applies knowledge of the principles of radiation protection for the patient, self, and others."
    },
    {
      "duty": "Determines exposure factors to achieve optimum radiographic technique with a minimum of radiation exposure to the patients."
    },
    {
      "duty": "Applies knowledge of PACS or HIS to provide quality images for interpretation."
    },
    {
      "duty": "Follows HIPAA Guidelines and maintains compliance with appropriate health and safety regulatory agencies."
    },
    {
      "duty": "Performs scheduling, referrals, appointments, ancillaries, surgeries, hospital admissions, medical records, documentation, and works with forms and charts."
    },
    {
      "duty": "Performs phlebotomy, specimen collection and processing, medication management, inventory management, and patient care, including exam room preparation & maintenance and conducting patient interviews."
    },
    {
      "duty": "Provides support and guidance for clinical policies and procedures, precertification/authorization, coding, E & M / Basic Visits, office procedures/complex visits, surgeries, hospital services, correspondence, statistical reports, accounts payable, and payroll."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High School Diploma or Equivalent. Currently possess and maintain SCRQSA certification for Limited Practice Radiographer in at least one of the following designations: General, Chest, Podiatric, Chiropractic and/or Bone Densitometry. Successful completion of an educational course or program that meets the requirements of the SCRQSA; Familiar with all phases of anatomy and exhibits ability to understand related function of radiology computer; Must possess skills necessary to treat patients of all ages."
    }
  ]
}