{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Client Management",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Budget Management",
      "experience": 8
    },
    {
      "skill": "Team Coordination",
      "experience": 8
    },
    {
      "skill": "Business Development",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Building Code Knowledge",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, coordinate, and implement projects within the budget, timeline, and scope."
    },
    {
      "duty": "Manage multiple small/medium projects and coordinate all aspects of assigned projects."
    },
    {
      "duty": "Estimate scope of work and prepare strategic plans for project success."
    },
    {
      "duty": "Serve as the primary client liaison and actively manage client budgets, schedules, and programs."
    },
    {
      "duty": "Coordinate and communicate with the client on a routine basis and establish project process checklist and monitor progress."
    },
    {
      "duty": "Manage project staff, client expectations, and coordinate with consultants."
    },
    {
      "duty": "Initiate phase planning sessions and ensure that the project meets general firm goals, project design intent, standards, and quality assurance."
    },
    {
      "duty": "Obtain client requirements, communicate to project team, receive information from project team, and monitor efforts to incorporate requirements into the project."
    },
    {
      "duty": "Review project financial reports, including billing information, and assist in the development and maintenance of office standards."
    },
    {
      "duty": "Manage agency applications, interface, and approvals with the agencies having jurisdiction."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Architecture from an accredited program (preferred but not required)"
    }
  ]
}