{
  "meta": [
    {
      "job_title": "Substance Use Services Program Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Medical",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Supervision",
      "experience": 5
    },
    {
      "skill": "Program Oversight",
      "experience": 5
    },
    {
      "skill": "Clinical Intervention",
      "experience": 5
    },
    {
      "skill": "Health Education",
      "experience": 5
    },
    {
      "skill": "Psychotropic Medication Management",
      "experience": 5
    },
    {
      "skill": "Quality Assurance Processes",
      "experience": 5
    },
    {
      "skill": "Case Conferencing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide program oversight and clinical supervision for the designated Substance Use Services Program."
    },
    {
      "duty": "Train Substance Use Specialists and other program personnel in treatment protocols and diagnostic and bio psychosocial assessment."
    },
    {
      "duty": "Supervise non-licensed and licensed direct service staff in the administration of services for residents."
    },
    {
      "duty": "Develop and provide ongoing clinical and staff development and program planning."
    },
    {
      "duty": "Collaborate with other departments to coordinate care between medical and behavioral settings."
    },
    {
      "duty": "Administer behavioral/mental health assessments as necessary and coordinate care for the effective treatment of complex and multiple diagnoses."
    },
    {
      "duty": "Conduct assessments and provide individual and group services to residents requiring additional support as a result of co-occurring disorders and/or trauma."
    },
    {
      "duty": "Develop and implement behavioral/mental health Quality Assurance processes as required in compliance with all Federal, State, County, and Funder requirements."
    },
    {
      "duty": "Conduct case conferences with Substance Use Specialists and other clinical staff weekly."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s Degree in one of the following disciplines: Clinical Psychology, Mental Health Counseling, Education-Counseling, Medicine, Psychology, Psychiatric Nursing, Rehabilitative Counseling, Social Work, Human Services or related field, Substance use experience, and 2 years’ experience in mental health services."
    }
  ]
}