{
  "meta": [
    {
      "job_title": "Senior Director of Data Science",
      "job_category": "Data Science",
      "job_class": "Director",
      "sector": "Advanced Data Science",
      "salary": 250000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build and lead a Data Science practice leveraging generative and non-generative AI models that improve customer experience and retention initiatives."
    },
    {
      "duty": "Partner with Product, Marketing, & Strategy teams to develop AI use cases that deepen customer engagement, launch new customer experiences and products."
    },
    {
      "duty": "Mentor Data Scientists to leverage AI techniques on text, images, videos, and voice data for hyper-personalization strategies."
    },
    {
      "duty": "Create compelling AI-based value propositions, work cross-organizationally to build consensus, strategically influence partners to adopt AI-backed solutions for business gains."
    },
    {
      "duty": "Manage stakeholders during AI solution design, project execution, and deployment into full production."
    },
    {
      "duty": "Establish KPIs and metrics to track the effectiveness of AI initiatives."
    },
    {
      "duty": "Manage a high-performing team of Data Scientists and AI researchers that foster a culture of collaboration, learning, and innovation."
    },
    {
      "duty": "Keep abreast of AI trends and advancements, continuously research and evaluate emerging AI technologies, frameworks, and methodologies."
    }
  ],
  "skills": [
    {
      "skill": "Advanced Data Science",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "AI Techniques (ML, DL, NLP)",
      "experience": 10
    },
    {
      "skill": "Strategic Influence",
      "experience": 10
    },
    {
      "skill": "Stakeholder Management",
      "experience": 10
    },
    {
      "skill": "Data Scientist Mentoring",
      "experience": 10
    },
    {
      "skill": "AI Trend Research",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Master's or PhD in a highly technical discipline"
    }
  ]
}