{
  "meta": [
    {
      "job_title": "Senior Business Systems Analyst",
      "job_category": "Information Technology",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Manhattan Active Configuration",
      "experience": 5
    },
    {
      "skill": "MH WMOS Configuration",
      "experience": 5
    },
    {
      "skill": "API’s",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide business consulting, configuration, systems/data/application analysis, programming, and documentation."
    },
    {
      "duty": "Work within Company’s WMS platforms to customize and configure software packages and business processes to match the changes and updates to global operation and logistics business processes and reporting mechanisms."
    },
    {
      "duty": "Configures systems within Manhattan WMS/Active software package that impacts a range of standard and non-standard customer, operational, process, project, or service activities."
    },
    {
      "duty": "Performs technical analytics related to advanced data analysis, data mining, and source to target mapping."
    },
    {
      "duty": "Creates and maintains complex context process and system diagrams describing the architecture and functional flow for WMS systems."
    },
    {
      "duty": "Interprets customer needs, assesses requirements, and identifies solutions to non-standard requests."
    },
    {
      "duty": "Work with remote groups such as vendors, other Company facilities, and or departments to gather and document tactical requirements from the business."
    },
    {
      "duty": "Coordinate and communicate functional requirements of business unit and technical solutions with IT capability resources by designing and documenting advanced functional specs."
    },
    {
      "duty": "Provide support to all deployment, data conversion, go-live support, and stabilization."
    },
    {
      "duty": "Oversees and performs complex testing activities including construction of test plans/scripts including the expected results and the validation of test results."
    },
    {
      "duty": "Applies global process standards to regional technology solutions and defines standards, processes, and policies."
    },
    {
      "duty": "Configure packaged solutions to address unique and complex business requirements."
    },
    {
      "duty": "Test platform and business processes changes."
    },
    {
      "duty": "Assist Product Management in translating the business requirements into actionable work items."
    },
    {
      "duty": "Prioritize the work necessary to deliver against the business requirements."
    },
    {
      "duty": "Communicate and document system changes to the business."
    },
    {
      "duty": "Translate system functionality into business relevant language."
    },
    {
      "duty": "Works with systems personnel to implement design."
    },
    {
      "duty": "Measuring performance through metrics, performance indicators, and key results."
    },
    {
      "duty": "Partnering with peers to align work toward a common goal."
    },
    {
      "duty": "Plan and track quarterly budgets for engineering resources."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Computer Science, Information Systems, Business or other relevant areas and/or extensive work experience focused on system management and analysis."
    }
  ]
}