{
  "meta": [
    {
      "job_title": "Product design operations",
      "job_category": "Design",
      "job_class": "Operations",
      "sector": "Design",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Figma",
      "experience": 5
    },
    {
      "skill": "Trello",
      "experience": 5
    },
    {
      "skill": "JIRA",
      "experience": 5
    },
    {
      "skill": "Excel",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Program Management",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Mentoring",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Orchestrate and optimize the people, processes, and practices necessary to foster a creative environment for dynamic design."
    },
    {
      "duty": "Support and help develop best practices for the UX team on how to work together and deliver great work aligned with strategic initiatives."
    },
    {
      "duty": "Establish the operational foundation, strategy, and direction to ensure the UX teams have what they need to thrive and deliver great work."
    },
    {
      "duty": "Coach, mentor, and guide a small team of designers, as well as assign/schedule work across the design studio team in collaboration with design leads, deadlines, and shifting priorities."
    },
    {
      "duty": "Utilize data to articulate rationale, communicate recommendations with authority and openness, and advocate for design with partners and leaders at different levels."
    },
    {
      "duty": "Proactively partner with UX, Product, Tech & Business stakeholders to set the stage for the team to achieve exceptional outcomes."
    },
    {
      "duty": "Identify pain points in internal processes and implement solutions, all while fostering a collaborative and inclusive culture."
    },
    {
      "duty": "Facilitate internal meetings, assist the Head of Design with scheduling/HR/team health/budget, and maintain drive and patience throughout the journey."
    },
    {
      "duty": "Measure and report on the performance of design processes, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree (Master's preferred) in Design, Operations, Business, or a related field"
    }
  ]
}