{
  "meta": [
    {
      "job_title": "Account Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Enterprise Sales",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Cold Calling",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Salesforce.com",
      "experience": 5
    },
    {
      "skill": "Customer-Centric",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify, qualify, acquire and grow seller commitment to Selling on Amazon programs."
    },
    {
      "duty": "Analyze customer data and make recommendations in order to maximize the potential of the assigned territory. Execute successfully on the plan recommended."
    },
    {
      "duty": "Implement and track metrics for recording the success and quality of the sellers in your territory. Use these metrics to guide your work and uncover hidden areas of opportunity."
    },
    {
      "duty": "Manage complex contract negotiations and serve as a liaison to the legal team."
    },
    {
      "duty": "Prospect and close business to achieve quarterly quota targets for both the quantity and quality of sellers recruited."
    },
    {
      "duty": "Understand and utilize the right tools to track all pertinent account information and sales progress as well as forecast and prioritize to achieve quarterly goals."
    },
    {
      "duty": "Develop a thorough understanding of the e-commerce industry and including knowledge of product offerings."
    },
    {
      "duty": "Prepare and deliver business reviews regarding progress and state of health for the respective territory."
    },
    {
      "duty": "Meet or exceed quarterly revenue targets and operational metrics."
    },
    {
      "duty": "Create and articulate compelling value propositions around the Selling on Amazon product."
    },
    {
      "duty": "Develop a clear understanding of the Selling on Amazon products along with the features and functionalities."
    },
    {
      "duty": "Assist internal partners to drive change, remove roadblocks and close business."
    },
    {
      "duty": "Develop and manage a sales pipeline mix of both high value and transactional accounts while executing sales strategies to secure deals that will exceed account acquisition and output goals."
    },
    {
      "duty": "Identify and build relationships with key influencers within the senior management and executive teams of prospective accounts, along with internal stakeholders and cross-functional teams to create and present compelling Amazon solutions that meet and exceed customer requirements."
    },
    {
      "duty": "Manage multiple responsibilities and thrive in an ambiguous environment."
    },
    {
      "duty": "Constructively advocate on behalf of clients internally and assist in driving change and closing business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS or equivalent work experience."
    }
  ]
}