{
  "meta": [
    {
      "job_title": "Senior Strategic Communications Analyst / Technical Editor",
      "job_category": "Strategic Communications",
      "job_class": "Analyst",
      "sector": "Communication",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Communications",
      "experience": 7
    },
    {
      "skill": "Technical Editing",
      "experience": 7
    },
    {
      "skill": "Data Analytics",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Policy Development",
      "experience": 7
    },
    {
      "skill": "Presentation Skills",
      "experience": 7
    },
    {
      "skill": "Business Improvement Strategies",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with clients and partners to manage critical infrastructure analytic projects."
    },
    {
      "duty": "Create operational documentation for NRMC policies, processes, and procedures related to data analytics, risk analysis, and strategic planning."
    },
    {
      "duty": "Write, edit, review & organize written materials, including organization of key sections, tables, exhibits, and attachments."
    },
    {
      "duty": "Provide graphic/layout assistance to ensure quality work product."
    },
    {
      "duty": "Develop understanding and synthesize complex information for communication to people with diverse technical backgrounds."
    },
    {
      "duty": "Develop strategic communications products to keep stakeholders aware and informed of activities."
    },
    {
      "duty": "Support the development and maintenance of plans including vision, mission, goals, and objectives."
    },
    {
      "duty": "Prepare and deliver presentations to senior management."
    },
    {
      "duty": "Assist in aligning organizational investments in people, technology, and capital connected to division strategies."
    },
    {
      "duty": "Support development of business improvement strategies in alignment with priorities."
    },
    {
      "duty": "Develop long-range objectives and strategic plans that identify internal and external strategic issues affecting organizational effectiveness. "
    },
    {
      "duty": "Assist with strategic development initiatives and implementation plans."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Communications, Public Relations, Business, or a related field (Master's preferred)"
    }
  ]
}