{
  "meta": [
    {
      "job_title": "Business Technology Integration CoE Lead",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Information Technology",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Software Integration",
      "experience": 10
    },
    {
      "skill": "Technical Leadership",
      "experience": 10
    },
    {
      "skill": "Integration Platform Management",
      "experience": 10
    },
    {
      "skill": "Service-Oriented Architecture (SOA)",
      "experience": 10
    },
    {
      "skill": "Cloud Integration",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Agile Methodology",
      "experience": 10
    },
    {
      "skill": "AI and Machine Learning",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the delivery of integration projects on systems and architecture, proactively identifying and mitigating data integration risks to ensure reliable delivery"
    },
    {
      "duty": "Provide technical expertise in integration technologies, systems, tools, architectures, and patterns"
    },
    {
      "duty": "Manage full lifecycle of integration products, platforms, and tooling"
    },
    {
      "duty": "Establish and evaluate Objectives & Key Results and performance metrics for Integration CoE initiatives, and provide regular reports to stakeholders"
    },
    {
      "duty": "Provides leadership and direction to multiple teams through senior manager and or managers. Develops mid to long term (3-5 years) plans to execute strategies in systems integrations to support the mid to long term company strategies."
    },
    {
      "duty": "Accountable for the budget, performance and results of a medium-sized team. Mid to long term (3-5 years) impact on results. Contributes to strategic change across functions. Ideally, is recognized as an external thought leader within the Technology Industry."
    },
    {
      "duty": "Owns mid to long-term execution of functional strategy and operational direction. Identifies & solves complex, multi-dimensional technical challenges, requiring extensive investigation/analysis to meet business needs."
    },
    {
      "duty": "Develop and execute a comprehensive technology integration strategy aligned with the company’s overall objectives"
    },
    {
      "duty": "Assemble, lead, and manage a team of integration architects and engineers, and provide guidance, mentorship, and support"
    },
    {
      "duty": "Develop and execute a plan to modernize the existing integration architecture using modern, cost effective, and flexible technologies to ensure seamless data flow and communication between platforms"
    },
    {
      "duty": "Dynamically allocate integration platform resources to development squads based on BT needs, and monitor their performance"
    },
    {
      "duty": "Coordinate with BT stakeholders to identify integration priorities, requirements, and dependencies"
    },
    {
      "duty": "Evaluate and recommend future state integration capabilities, technologies, and tools"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 180,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree (Master's may be required at higher levels) with 11 - 14 years of position related functional management experience, or equivalent combo of education and experience level (Computer Science, Information Systems, or Computer Engineering)"
    }
  ]
}