{
  "meta": [
    {
      "job_title": "Data Center Infrastructure and Maintenance",
      "job_category": "Information Technology",
      "job_class": "IT Specialist",
      "sector": "Software Engineering",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Center Operations",
      "experience": 5
    },
    {
      "skill": "Infrastructure Maintenance",
      "experience": 5
    },
    {
      "skill": "Control-M",
      "experience": 5
    },
    {
      "skill": "Monitoring",
      "experience": 5
    },
    {
      "skill": "Physical Security",
      "experience": 5
    },
    {
      "skill": "Policy Management",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Vendor Interaction",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Issue Resolution",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Become proficient with data center operations, including room layouts, MDF’s/IDF’s, UPS & Non-UPS power, breakers, batteries, AC units, generators, fire systems, VESDA advanced smoke detection, and Site Scan/Alber."
    },
    {
      "duty": "Pro-actively perform walkthroughs and routine physical inspections of data center rooms and generators, accountable for daily data center health checks, and handle infrastructure issues with infrastructure teams and vendors."
    },
    {
      "duty": "Maintain daily batch scheduling using Control-M, coordinate exceptions, and critical activities outside of normal processes, and react to issues and concerns appropriately."
    },
    {
      "duty": "Maintain data center physical security and policies, execute Rapid Response process, and ensure visibility of environment health and system schedules, providing holistic status of operational performance."
    },
    {
      "duty": "Improve accuracy and quality of information provided on daily briefing calls, participate in daily briefing calls, post-call discussions, and demonstrate understanding of the issues discussed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Technology, Computer Science, or a related field (Master's preferred)"
    }
  ]
}