{
  "meta": [
    {
      "job_title": "Appian Developer",
      "job_category": "Software Engineering",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Appian Development",
      "experience": 5
    },
    {
      "skill": "Agile Development",
      "experience": 5
    },
    {
      "skill": "Java",
      "experience": 5
    },
    {
      "skill": "Microservices",
      "experience": 5
    },
    {
      "skill": "REST API",
      "experience": 5
    },
    {
      "skill": "Web service Integration",
      "experience": 5
    },
    {
      "skill": "Design Specification Compliance",
      "experience": 5
    },
    {
      "skill": "System Performance Optimization",
      "experience": 5
    },
    {
      "skill": "API Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, enhance, and build Client On-boarding platform in an agile development environment."
    },
    {
      "duty": "Translate functional requirements to Appian business flows using Process Models, Rules, CDTs, and Web service Integration."
    },
    {
      "duty": "Create conceptual approach, technical analysis, design, development, unit testing, deploy, and support activities."
    },
    {
      "duty": "Identify opportunities for future enhancements and refinements to standards, best practices, and development methodologies."
    },
    {
      "duty": "Collaborate with business partners on requirements elaboration, design, configuration, and business re-engineering."
    },
    {
      "duty": "Work within and across Agile teams to design, develop, test, implement, and support technical solutions across a full stack of development tools and technologies."
    },
    {
      "duty": "Collaborate with product vendors and systems integrators on delivery of solutions. Review and finalize technical specifications, code review, and implementation related activities."
    },
    {
      "duty": "Develop new APIs and enhance existing APIs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Software Engineering, or related field (Master's preferred)"
    }
  ]
}