{
  "meta": [
    {
      "job_title": "Mechanical Design Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "3D Modeling",
      "experience": 5
    },
    {
      "skill": "2D Drawing",
      "experience": 5
    },
    {
      "skill": "Product Data Management",
      "experience": 5
    },
    {
      "skill": "Geometric Dimensioning and Tolerancing (GD&T)",
      "experience": 5
    },
    {
      "skill": "Hydrodynamic Tilting Pad Fluid Film Bearing",
      "experience": 5
    },
    {
      "skill": "Fluid Mechanics",
      "experience": 5
    },
    {
      "skill": "Precision Design",
      "experience": 5
    },
    {
      "skill": "Engineering Principles",
      "experience": 5
    },
    {
      "skill": "Design Practices",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Creation of 3D models and associated 2D drawings"
    },
    {
      "duty": "Creation of Item and Part Structure (BOM) information within ERP system"
    },
    {
      "duty": "Develop and maintain 3D model and 2D drawing database within Product Data Management (PDM) system via Engineering Change Notice (ECN) process"
    },
    {
      "duty": "Perform checking duties on assembly and component level drawings"
    },
    {
      "duty": "Provide guidance to other Design Engineers and Drafters"
    },
    {
      "duty": "Updates existing drawings to current/best manufacturing processes"
    },
    {
      "duty": "Work closely with manufacturing personnel and engineering to ensure design requirements are met and the best manufacturing processes are used"
    },
    {
      "duty": "Participate in and contribute to process improvement and design for manufacturability activities"
    },
    {
      "duty": "Assist in the preparation of engineering project proposals as needed"
    },
    {
      "duty": "Support manufacturing personnel with evaluations of deviated components, corrective action investigations and other quality related activities"
    },
    {
      "duty": "Support engineering process development and design for manufacturability efforts through specific assignments as directed by Engineering Management"
    },
    {
      "duty": "Independently responsible for meeting deadlines necessary to support the company's commitments to customers and manufacturing"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Mechanical Engineering or equivalent, with a minimum of 3 years related work experience required"
    },
    {
      "credential": "Educational or experience with an emphasis on hydrodynamic components modeling, fluid mechanics, or fluid dynamics preferred"
    },
    {
      "credential": "Experience with ASME Y14.5 GD&T (Geometric Dimensioning and Tolerancing) and ISO standards required"
    },
    {
      "credential": "Hydrodynamic Tilting Pad Fluid Film Bearing experience required either through direct design, new product development, or engineering input (primarily Tilting Pad Journal and Tilting Pad Thrust bearings). Experience completing fluid flow, bolted joint, and stack calculations. Able to analyze the results and identify/implement design optimization options for a specific bearing"
    },
    {
      "credential": "Sleeve bearing experience through design, new product development, or engineering input preferred"
    },
    {
      "credential": "Experienced with precision design and manufacturing processes. Able to advise manufacturing plants on proposed operational changes and anticipates affect of change on the final part"
    },
    {
      "credential": "Able to train operators, supervisors, and managers on translation of 2D and 3D models/prints. Experience preferred"
    },
    {
      "credential": "Experienced in 3D modeling required; Inventor 3D modeling software preferred"
    },
    {
      "credential": "Demonstrated ability to apply continuous improvement techniques to existing processes and procedures including FMEA, traditional RCA, and C&E Matrix. Lean Six Sigma training is preferred"
    },
    {
      "credential": "Understanding of Engineering Principles and Design Practices"
    },
    {
      "credential": "Requires the ability to utilize precision measuring and surveying instruments such as calipers, inside/outside micrometers, depth gages, surfaces gages, etc"
    },
    {
      "credential": "Experience reading & developing engineering design prints with geometric dimensioning and tolerances"
    }
  ]
}