{
  "meta": [
    {
      "job_title": "Lead Wine Specialist",
      "job_category": "Hospitality",
      "job_class": "Wine Specialist",
      "sector": "Hospitality",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Wine Knowledge",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Upscale Hospitality",
      "experience": 5
    },
    {
      "skill": "Wine Club Management",
      "experience": 5
    },
    {
      "skill": "Event Management",
      "experience": 5
    },
    {
      "skill": "Strong Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Salesmanship",
      "experience": 5
    },
    {
      "skill": "Leadership/Management",
      "experience": 5
    },
    {
      "skill": "Wine Club Marketing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver a high-end, intimate hospitality experience rooted in deep wine knowledge, ensuring guests leave with a renewed appreciation for the wines."
    },
    {
      "duty": "Represent the company with elegance and engage guests with the rich history of the winery, weaving narratives that bring the wines and brand story to life."
    },
    {
      "duty": "Supervise the actions of the staff and follow up on guest issues in the absence of the General Manager."
    },
    {
      "duty": "Working closely with a select team of wine enthusiasts, cultivating a culture of knowledge sharing and mutual respect."
    },
    {
      "duty": "Initiating tastings and guiding guests through detailed insights about the selection, from flavor profiles to the intricacies of their origins."
    },
    {
      "duty": "Promoting exclusive wine club memberships with passion, emphasizing the unique offerings and benefits."
    },
    {
      "duty": "Providing concierge-level customer service for wine club members, offering unparalleled customer service during their visits."
    },
    {
      "duty": "Facilitating the training and coaching of team members on strategies and best practices for wine club sign-ups."
    },
    {
      "duty": "Coordinating with the wine club and winery teams to oversee the timely and accurate fulfillment and pickup of wine club allocations."
    },
    {
      "duty": "Leading and supporting upscale Outpost and Wine Club events, ensuring an atmosphere of sophistication and education."
    },
    {
      "duty": "Actively participating in the development and implementation of strategies to continuously improve the wine club experience."
    },
    {
      "duty": "Directing the actions of the team on the floor and handling guest issues that may arise to ensure guest satisfaction."
    },
    {
      "duty": "Participating in and contributing to monthly staff meetings and monthly inventory."
    },
    {
      "duty": "The following responsibilities are outside the scope of the Lead Wine Specialist position: Progressive Discipline, Scheduling, Payroll, Hiring/Termination, Floorplans/Section Assignment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Seasoned background in wine with demonstrable expertise and passion."
    }
  ]
}