{
  "meta": [
    {
      "job_title": "Window & Door Installation Field Specialist",
      "job_category": "Installation",
      "job_class": "Specialist",
      "sector": "Construction",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Installation Services",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform services not provided by a subcontractor and ensure installations are completed per Pella Manufacturing Installation Instructions."
    },
    {
      "duty": "Assess the quality of sub-contracted installations and give feedback to management."
    },
    {
      "duty": "Communicate effectively with customers and serve as a reputable Pella representative on all jobsites."
    },
    {
      "duty": "Responsible for the timely execution of the order verification process and setting realistic expectations with homeowners."
    },
    {
      "duty": "Perform job site inspection to assess home for water intrusion, rot, mold, and other issues."
    },
    {
      "duty": "Provide training as needed to Retail Sales Consultants."
    },
    {
      "duty": "Meet company safety requirements and maintain assigned vehicle and tools appropriately."
    },
    {
      "duty": "Assist with initial sub-contractor sourcing and assimilation, and with the recovery plan for installation projects."
    },
    {
      "duty": "Provide installation recovery work as needed and deliver missing items needed for installations to job sites."
    },
    {
      "duty": "Perform any other necessary task assigned by the supervisor or company in support of company goals or assistance with customer issues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Valid driver’s license and compliance with company Fleet Safety Policy"
    }
  ]
}