{
  "meta": [
    {
      "job_title": "Community Behavioral Health Center Clinician",
      "job_category": "Healthcare",
      "job_class": "Clinician",
      "sector": "Psychiatry",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Social Work",
      "experience": 3
    },
    {
      "skill": "Assessment and Intervention",
      "experience": 3
    },
    {
      "skill": "Therapeutic Treatment",
      "experience": 3
    },
    {
      "skill": "Case Management",
      "experience": 3
    },
    {
      "skill": "Counseling",
      "experience": 3
    },
    {
      "skill": "Supervision and Mentoring",
      "experience": 3
    },
    {
      "skill": "Documentation and Record-Keeping",
      "experience": 3
    },
    {
      "skill": "Effective Communication",
      "experience": 3
    },
    {
      "skill": "Cultural Sensitivity",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide urgent assessment/intake services and maintain a panel of patients receiving ongoing care in a Community Behavioral Health Center."
    },
    {
      "duty": "Consult, assess, and intervene with high-risk patients and their families regarding emotional and social problems."
    },
    {
      "duty": "Conduct outpatient individual therapy and psychosocial assessments, make psychosocial diagnoses, and plan effective treatments."
    },
    {
      "duty": "Collaborate with healthcare team members, social, governmental, and legal agencies, and other sources in the overall care of the patient."
    },
    {
      "duty": "Provide clinical supervision to other department personnel and comply with documentation and data collection requirements."
    },
    {
      "duty": "Maintain competency in areas of responsibility, attend scheduled staff meetings, and obtain continuing education units necessary to maintain licensure."
    },
    {
      "duty": "Support graduate and undergraduate training programs by supervising students, identify weaknesses in operation, and recommend improvements."
    },
    {
      "duty": "Represent the department throughout the hospital and outside community regarding social work practice and field."
    },
    {
      "duty": "Maintain patient confidentiality according to hospital policy, practice professional discretion, and document each patient encounter in the medical record or the Department clinical record concurrently."
    },
    {
      "duty": "Maintain work area and equipment in a neat and orderly manner, assist in the cleaning and organizing of department, and maintain a complete understanding of emergency procedures."
    },
    {
      "duty": "Conform to hospital standards of conduct, including those pertaining to patient rights and notify supervisor when patients in age group not regularly served are present."
    },
    {
      "duty": "Perform other duties as needed and follow established hospital infection control and safety procedures."
    },
    {
      "duty": "Maintain knowledge of community resources and agencies that serve the children and families, possess advanced interpersonal skills, and be comfortable in a fast-paced environment."
    },
    {
      "duty": "Work in an interdisciplinary team, demonstrate cultural sensitivity and a sense of humor, and have computer literacy with the ability to use standard word processing, spreadsheet programs, and email."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Master's Degree in Social Work, Counseling, Clinical Psychology, or related field from an accredited school."
    },
    {
      "credential": "Massachusetts mental health counselor license or licensed independent clinical social work license or eligible status."
    },
    {
      "credential": "One to two years of on-the-job training to acquire knowledge of Social Work process and community resources in relation to health, illness, and disability."
    },
    {
      "credential": "Strong communication skills and the ability to handle multiple tasks and responsibilities effectively."
    },
    {
      "credential": "Bilingual or multi-lingual skills preferred, especially Spanish, Portuguese Creole, or Haitian Creole."
    },
    {
      "credential": "Knowledge of software applications such as Microsoft Excel and Word."
    }
  ]
}