{
  "meta": [
    {
      "job_title": "Human Resources Coordinator",
      "job_category": "Human Resources",
      "job_class": "Coordinator",
      "sector": "HR",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Project Coordination",
      "experience": 5
    },
    {
      "skill": "HR Operations",
      "experience": 2
    },
    {
      "skill": "Administrative Support",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support and/or develop project communications, materials, supporting documents, etc."
    },
    {
      "duty": "Assist HR projects, including the development and implementation of new initiatives, policies, and programs."
    },
    {
      "duty": "Collaborate with cross-functional teams to define project goals, deliverables, and timelines."
    },
    {
      "duty": "Assist in developing, editing, and implementing HR policies, procedures, handbooks, and other HR-related documentation."
    },
    {
      "duty": "Manage calendaring and scheduling requirements; acting proactively and efficiently to contribute to maximizing the Director’s effectiveness in their role."
    },
    {
      "duty": "Coordinate logistics and occasionally the content for meetings and events to include drafting the agenda, ensuring room set up, catering, taking notes, and maintaining action items."
    },
    {
      "duty": "Assist with managing correspondence and Director presentations and other communications."
    },
    {
      "duty": "Assist with travel and expenses in support of the Director."
    },
    {
      "duty": "Assists the HRBP team leadership with various assigned tasks, special projects, and HR sponsored activities."
    },
    {
      "duty": "Handles general internal and external stakeholder questions or concerns to direct to appropriate COE."
    },
    {
      "duty": "Works in a collaborative team atmosphere closely working with the HRBP/ER Talent Management team."
    },
    {
      "duty": "Maintain security and confidentiality of highly sensitive information."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree preferred in Human Resources, Business Administration, or related field"
    }
  ]
}