{
  "meta": [
    {
      "job_title": "Procurement Administrator",
      "job_category": "Procurement",
      "job_class": "Administrator",
      "sector": "Management",
      "salary": 34,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Contract Negotiations",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Policy Adherence",
      "experience": 5
    },
    {
      "skill": "Cross-Functional Collaboration",
      "experience": 5
    },
    {
      "skill": "Procurement Management",
      "experience": 5
    },
    {
      "skill": "Contract Compliance",
      "experience": 5
    },
    {
      "skill": "Purchase Order Processing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the process of acquiring goods and services needed by the organization, ensuring efficient sourcing, negotiation, purchasing, and contract management while adhering to budgetary constraints and regulatory requirements."
    },
    {
      "duty": "Demonstrate expertise in contract compliance procedures, ensuring that all procurement activities align with university policies, regulations, and legal requirements."
    },
    {
      "duty": "Proficiently negotiate contracts, manage redline negotiations, and ensure favorable terms for the university while maintaining collaborative relationships with vendors."
    },
    {
      "duty": "Ensure policy adherence throughout the procurement process, ensuring that all departmental procurements align with university guidelines and standards."
    },
    {
      "duty": "Analyze complex procurement scenarios, identify potential challenges, and devise innovative solutions to ensure efficient and compliant procurement processes."
    },
    {
      "duty": "Handle a variety of procurement needs across departments such as IT, research, professional services, and scientific acquisitions, showcasing versatility in procurement management."
    },
    {
      "duty": "Collaborate cross-functionally, processing purchase orders from various university units, promoting seamless communication and procurement coordination."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "None required"
    }
  ]
}