{
  "meta": [
    {
      "job_title": "Amazon Brand Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in 3P/1P catalog management and day to day account operations for various Better Being brands"
    },
    {
      "duty": "Ensure best in class product detail pages across marketplaces to ensure successful content creation and upload to various marketplaces."
    },
    {
      "duty": "Analyze Brand catalog and suggest bundles, new product opportunities, or other strategies to grow sales and increase market share"
    },
    {
      "duty": "Assist in new item set up, testing, and product launch for 3P/1P Amazon business"
    },
    {
      "duty": "Process weekly Pos and chargebacks. Verify and approve invoicing"
    },
    {
      "duty": "Monitor inventory storage fees, FBA fees, term agreements and promos"
    },
    {
      "duty": "Maintain 3P/1P scorecard (stranded inventory, voice of customer, performance notifications, and account health)"
    },
    {
      "duty": "Work hand in hand with MAP and Authorized Reseller Team to ensure marketplace listings maintain price integrity and Buy Box"
    },
    {
      "duty": "Provide inventory management and forecasting insights to ensure we have sufficient inventory for every day demand and promotional events"
    },
    {
      "duty": "Create and manage marketplace promotional calendar for brands under management--work with Advertising Partner to take advantage of special events such as Prime Day, BFCM, NYNY, etc."
    },
    {
      "duty": "Identify bundles, packs, and other product offering opportunities for managed brands"
    },
    {
      "duty": "Troubleshoot listing issues, stranded inventory, suspended/restricted ASINs—monitor product catalog and ensure listings and SKUs stay live; uploading COA’s LOG requirements"
    },
    {
      "duty": "Work constructively with Systems/IT, Operations and Finance leaders in support of Amazon and other 3rd party platforms"
    },
    {
      "duty": "Willingness to travel to Utah for quarterly meetings"
    }
  ],
  "skills": [
    {
      "skill": "E-commerce Sales",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Marketplace Management",
      "experience": 3
    },
    {
      "skill": "Forecasting",
      "experience": 3
    },
    {
      "skill": "Product Launch",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "3+ years eCommerce sales and/or Amazon related experience. Experience with Amazon’s Health and Personal Care category is a plus."
    }
  ]
}