{
  "meta": [
    {
      "job_title": "Construction Coordinator",
      "job_category": "Construction",
      "job_class": "Coordinator",
      "sector": "Nuclear, Security & Environmental",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Construction Management",
      "experience": 10
    },
    {
      "skill": "Project Coordination",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Engineering Coordination",
      "experience": 10
    },
    {
      "skill": "Technical Communication",
      "experience": 10
    },
    {
      "skill": "Cost Estimation",
      "experience": 10
    },
    {
      "skill": "Construction Safety",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Implement constructability program and provide constructability plan to project members on assigned project in collaboration with project and GBU construction teams."
    },
    {
      "duty": "Representing Construction function in Project model reviews, and project progress review meetings."
    },
    {
      "duty": "Lead and conduct constructability workshops to project teams."
    },
    {
      "duty": "Participate in design development and suggest economical construction details for incorporation into the design and specifications by utilizing Construction Lessons Learned from other projects and best practices."
    },
    {
      "duty": "Implement “Design for Safe Construction”, support construction productivity initiatives on the project, including effective implementation of datacentric construction and other work."
    },
    {
      "duty": "Coordinate with Engineering to ensure Engineering deliverables are issued to support the construction schedule."
    },
    {
      "duty": "Review Interdisciplinary deliverables from Engineering and Procurement, providing construction input on Constructability, Safe Construction and TIC."
    },
    {
      "duty": "Identify potential problem areas or trends, develop total installed cost estimates and address continuous improvement."
    },
    {
      "duty": "Coordinate for identification and resolution of constructability issues for vendor drawings, shop fabrication details and construction procedures."
    },
    {
      "duty": "Review design (3D Model and 2D drawings),and identify potential constructability issues and engage with engineering for early."
    },
    {
      "duty": "Maintain effective interface with engineering, construction teams at other Bechtel offices and the jobsite ensuring construction knowledge, lessons learned, construction initiatives are effectively communicated and implemented in the project."
    },
    {
      "duty": "Monitor completeness of engineering data in construction applications."
    },
    {
      "duty": "Understand work packaging philosophy, scope of installation, Work Break Down structure and identify boundaries of work."
    },
    {
      "duty": "Assist in the preparation of construction manuals, field non-manual support proposals, internal desktop."
    },
    {
      "duty": "Review project proposals and assist project development team and estimation team with construction input on construction schedule, manpower, equipment, modularization & preassembly suggestions and project execution."
    },
    {
      "duty": "Responsible for independently preparing mass haul plans for earthworks, aggregate and quarry materials, determine construction equipment schedule / fleet schedules including its sizes, prepare piling execution plans, early works."
    },
    {
      "duty": "Assist engineering and project estimation teams with MTOs of temporary works, hauls roads, crane pads, working platforms and other build aids typically involved in the construction of large energy projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in engineering (or international equivalent) and a minimum 10 years of relevant experience."
    }
  ]
}