{
  "meta": [
    {
      "job_title": "Commercial Helper II (CDL)",
      "job_category": "Environmental Services",
      "job_class": "Helper",
      "sector": "Environmental Services",
      "salary": 47400,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Rides on the vehicle to assist the Driver while servicing customers on a designated route and also drives the vehicle as necessary to complete the route."
    },
    {
      "duty": "Climbs on and off vehicle to load refuse, waste and poly carts; lifts and carries trash bags and containers to the truck for disposal."
    },
    {
      "duty": "Operates packing mechanism and various levers and handles to activate the lifting and loading mechanism."
    },
    {
      "duty": "Assists Driver is safely operating the vehicle by directing the Driver from the ground."
    },
    {
      "duty": "Cleans waste from the packer blade and truck body on each disposal trip; sprays and cleans the hopper and truck."
    },
    {
      "duty": "Performs complete pre- and post-operation inspection of the vehicle in accordance with Company policy; reports any safety issues on standard reports."
    },
    {
      "duty": "Courteously interacts with all customers, dispatchers and others on a daily basis to ensure all customer routes are serviced in a timely and professional manner."
    },
    {
      "duty": "Continuously monitors waste for evidence of unacceptable waste."
    },
    {
      "duty": "Cleans area around an accidental waste spill, ensuring adherence to all applicable safety standards and policies."
    },
    {
      "duty": "Maintains adherence to required productivity standards for the department to ensure all customers are serviced in a timely and efficient manner."
    },
    {
      "duty": "Follows all required safety policies and procedures."
    },
    {
      "duty": "Actively participates in the Company’s ReSOP program."
    },
    {
      "duty": "Performs other job-related duties as assigned."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Minimum of 2 years of prior experience working around commercial trucks. Commercial Drivers License"
    }
  ]
}