{
  "meta": [
    {
      "job_title": "Storage Sales Specialist",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 255600,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Storage Sales",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Sales Pipeline Management",
      "experience": 5
    },
    {
      "skill": "Storage Portfolio Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Channel Partnership",
      "experience": 5
    },
    {
      "skill": "Technical Solution Consultation",
      "experience": 5
    },
    {
      "skill": "Sales Campaign Management",
      "experience": 5
    },
    {
      "skill": "ROI & TCO Calculation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead pursuit in assigned territory, prospect, qualify, negotiate and close opportunities for storage products and solutions."
    },
    {
      "duty": "Collaborate with Account Generalists to provide storage expertise within the sales team."
    },
    {
      "duty": "Develop pursuit plans, build and manage the storage sales pipeline, and contribute to proposal development, negotiations and deal closings."
    },
    {
      "duty": "Coordinate supporting sales activities related to pipeline hygiene through account managers, Presales, channel partners, and other stakeholders."
    },
    {
      "duty": "Collaborate across HPE teams to deliver a consistent approach to developing business, including account planning for end-to-end solutions."
    },
    {
      "duty": "Assess solution feasibility from a technical and business perspective to qualify/disqualify opportunities and negotiate profitable deals."
    },
    {
      "duty": "Drive sales of the Storage portfolio, forge relationships with the channel, and provide enablement of key technologies."
    },
    {
      "duty": "Coordinate Storage marketing campaigns, act as a trusted storage solutions consultant, and reinforce HPE's strategy and portfolio to partners and champions."
    },
    {
      "duty": "Use references to craft a story that makes complex technologies simple and understandable for customers, actively generate customer interest, and understand customer's buying trends."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "University or Bachelor's degree preferred. 5+ years of sales experience. Storage related sales experience required."
    }
  ]
}