{
  "meta": [
    {
      "job_title": "Assistant Attorney General",
      "job_category": "Legal",
      "job_class": "Assistant",
      "sector": "Legal",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Litigation",
      "experience": 4
    },
    {
      "skill": "Legal Analysis",
      "experience": 4
    },
    {
      "skill": "Writing and Editing",
      "experience": 4
    },
    {
      "skill": "Oral Advocacy",
      "experience": 4
    },
    {
      "skill": "Teamwork",
      "experience": 4
    },
    {
      "skill": "Technology Proficiency",
      "experience": 4
    },
    {
      "skill": "Complex Litigation",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Represent and defend the State of New York and its agencies, officials, and employees in federal and state courts in civil actions and proceedings involving civil rights, education, social services, public employment, public health, law enforcement, corrections, state finance, insurance, taxation, and other litigation matters."
    },
    {
      "duty": "Handle all phases of litigation from inception through trial, including constitutional challenges, labor and employment litigation, challenges to administrative decisions, and civil rights litigation."
    },
    {
      "duty": "Manage own cases, including case strategy development, drafting briefs, making arguments, and collaborating with a team of litigators."
    },
    {
      "duty": "Work in teams led by a Section Chief and Deputy Section Chief, with significant access to and support from supervising attorneys."
    },
    {
      "duty": "Demonstrate excellent legal analysis, writing, editing, and oral advocacy skills, and comfortable with using technology for legal work."
    },
    {
      "duty": "Reside in (or intend to soon become a resident of) New York State and be admitted to practice law in New York State."
    },
    {
      "duty": "Comply with the Public Officers Law's requirements for citizenship and a two-year commitment upon being hired."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of four (4) years of post-graduation civil litigation experience. Bachelor's degree in Law (Juris Doctor) required. Admitted to practice law in New York State."
    }
  ]
}