{
  "meta": [
    {
      "job_title": "Realtor Assistant",
      "job_category": "Real Estate",
      "job_class": "Assistant",
      "sector": "Real Estate",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct cold calls to potential clients to generate leads and identify potential buyers or sellers."
    },
    {
      "duty": "Serve as an appointment setter, coordinating schedules and confirming appointments for real estate agents."
    },
    {
      "duty": "Manage and update the real estate database with accurate client information and property details."
    },
    {
      "duty": "Assist in the creation and execution of effective social media strategies to promote properties, engage with clients, and build a strong online presence."
    },
    {
      "duty": "Prepare and assemble marketing materials, including brochures, flyers, and online listings, to showcase properties."
    },
    {
      "duty": "Collaborate with real estate agents to organize open houses and property tours for potential clients."
    },
    {
      "duty": "Respond to client inquiries and provide information about properties, market trends, and real estate processes."
    },
    {
      "duty": "Maintain a professional and positive demeanor while interacting with clients, colleagues, and partners."
    },
    {
      "duty": "Monitor and track the progress of leads, appointments, and sales activities to provide regular updates to real estate agents."
    },
    {
      "duty": "Assist with administrative tasks, including document management, contract preparation, and data entry."
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 2
    },
    {
      "skill": "Social Media Management",
      "experience": 2
    },
    {
      "skill": "Administrative Support",
      "experience": 2
    },
    {
      "skill": "Client Communication",
      "experience": 2
    },
    {
      "skill": "Sales Assistance",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ]
}