{
  "meta": [
    {
      "job_title": "Human Resources Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Human Resources Management",
      "experience": 5
    },
    {
      "skill": "Talent Acquisition",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Legal Compliance",
      "experience": 5
    },
    {
      "skill": "Organizational Development",
      "experience": 5
    },
    {
      "skill": "Business Acumen",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement strategic plans for human resources services, policies, and programs for the organization."
    },
    {
      "duty": "Manage employee relations, EHS compliance, recruitment, and employee development."
    },
    {
      "duty": "Design organization structure, business process, and systems that support strategic goals."
    },
    {
      "duty": "Ensure compliance with federal, state, and local regulations and consistent administration of policies and procedures."
    },
    {
      "duty": "Oversee human resource responsibility for business units and shared service functions."
    },
    {
      "duty": "Create short and long term plans to ensure performance and innovation within the Human Resources department."
    },
    {
      "duty": "Monitor and report on key HR metrics to effectively manage the workforce."
    },
    {
      "duty": "Demonstrate solid business acumen and make HR decisions that positively impact the bottom line."
    },
    {
      "duty": "Create a motivational environment of accountability and foster cross-functional teamwork."
    },
    {
      "duty": "Interact with VP/GMs or Sr. VPs and make HR presentations, and act as a catalyst for change."
    },
    {
      "duty": "Perform other projects as required by the business or functional unit."
    },
    {
      "duty": "Ensure safe working procedures are followed and observed during site visits."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Human Resources, or related discipline (Master's preferred)"
    }
  ]
}