{
  "meta": [
    {
      "job_title": "Medicaid Proposal Writer",
      "job_category": "Writing",
      "job_class": "Content Developer",
      "sector": "Writing",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Medicaid Proposal Writing",
      "experience": 5
    },
    {
      "skill": "Strategic Writing",
      "experience": 5
    },
    {
      "skill": "Research",
      "experience": 5
    },
    {
      "skill": "Content Development",
      "experience": 5
    },
    {
      "skill": "Facilitation",
      "experience": 5
    },
    {
      "skill": "SharePoint",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Managed Care Operations",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and execute strategic writing in response to Medicaid request for proposals (RFP) and requests for information (RFI)."
    },
    {
      "duty": "Highlight the brand/goals and local flavor/successes in an accurate, compelling, and responsive narrative."
    },
    {
      "duty": "Incorporate baseline material, independent research, approved collateral, and original writing to address RFP or RFI questions aligned with the approved strategy."
    },
    {
      "duty": "Collaborate with subject matter experts (SMEs) to identify and obtain new information to create compliant and responsive RFP responses."
    },
    {
      "duty": "Collaborate with team members and Graphic Designer to create compelling visuals that complement the narrative."
    },
    {
      "duty": "Meet all established deadlines and participate in review meetings."
    },
    {
      "duty": "Remain on-call following review meetings to assist with response changes as requested."
    },
    {
      "duty": "Communicate effectively with all levels of management and work evenings and weekends as needed."
    },
    {
      "duty": "Utilize strong team collaboration skills and execute creative solutions to adapt to changing priorities."
    },
    {
      "duty": "Build relationships, integrate strategies, and deliver successful communication programs at the enterprise level."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience (Master's preferred)"
    }
  ]
}