{
  "meta": [
    {
      "job_title": "Sales Supervisor",
      "job_category": "Sales",
      "job_class": "Supervisor",
      "sector": "Sales",
      "salary": 43000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Merchandising",
      "experience": 5
    },
    {
      "skill": "Operational Processes",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Retail Sales",
      "experience": 5
    },
    {
      "skill": "Staff Training",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direction and supervise associates to support a sales driving culture while focusing on creating a consistent customer experience."
    },
    {
      "duty": "Engage and connect with customers by providing excellent customer service through a hospitality mentality approach."
    },
    {
      "duty": "Offer information to the customer on current merchandise assortment, store promotions and events, and execute operational processes effectively and efficiently."
    },
    {
      "duty": "Drive sales by providing an inspiring environment that motivates customers to add to their basket."
    },
    {
      "duty": "Build customer connections with a greeting and execute an authentic hospitality experience."
    },
    {
      "duty": "Leverage omni channel offerings to deliver a frictionless customer experience."
    },
    {
      "duty": "Accurately deliver on operational processes, BOPUS, BOSS, MLS, SFS."
    },
    {
      "duty": "Be a savings consultant to help customers save with a Kohl's Card."
    },
    {
      "duty": "Convert, open, and activate Kohl's Card applications."
    },
    {
      "duty": "Train associates to maximize credit and loyalty conversion performance and customer experience."
    },
    {
      "duty": "Oversee daily functions of the Cash Office (i.e. register and cash balancing, change orders, authorizing voided transactions, supplies, over/short research)."
    },
    {
      "duty": "Onboard, train, and develop associates."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Management, or a related field"
    }
  ]
}