{
  "meta": [
    {
      "job_title": "Laboratory Assistant",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Under the direct supervision of the appropriate supervisor, performs a variety of general support duties in specimen procurement, clerical office, central processing, and/or other assigned areas at an entry skills level."
    },
    {
      "duty": "Functions in on-and/or off-site service areas."
    },
    {
      "duty": "May work any part of a 24-hour period."
    },
    {
      "duty": "May be required to accept on-call responsibilities."
    },
    {
      "duty": "Answers telephones, routes callers, takes messages and provides routine information to callers."
    },
    {
      "duty": "May receive specimens into the laboratory, process specimens, deliver specimens to on- and off-site locations, store specimens for future analysis, and dispose of specimens."
    },
    {
      "duty": "May receive and transport supplies, equipment, reports, and specimens between the laboratory and other health care locations."
    },
    {
      "duty": "May collect specimens as directed using appropriate or specified equipment for collecting and handling specimens."
    },
    {
      "duty": "Enters or retrieves data from established computer files."
    },
    {
      "duty": "Provides complete and accurate instructions to patients and other customers of the laboratory."
    }
  ],
  "skills": [
    {
      "skill": "Medical Terminology",
      "experience": 2
    },
    {
      "skill": "Clerical Skills",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "High School or G.E.D."
    },
    {
      "credential": "Basic Cardiac Life Support (BCLS) if applicable"
    },
    {
      "credential": "Other combinations of formal education, training, and experience may be considered."
    }
  ]
}