{
  "meta": [
    {
      "job_title": "Plant Director",
      "job_category": "Operations",
      "job_class": "Director",
      "sector": "Manufacturing",
      "salary": 185000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Manufacturing Operations Management",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Performance Improvement",
      "experience": 8
    },
    {
      "skill": "Staff Management",
      "experience": 8
    },
    {
      "skill": "Process Improvement",
      "experience": 8
    },
    {
      "skill": "Inventory Management",
      "experience": 8
    },
    {
      "skill": "Compliance",
      "experience": 8
    },
    {
      "skill": "Employee Relations",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Budget Management",
      "experience": 8
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create/improve metrics and tools to measure key performance indicators including productivity, quality, safety, scrap rates, labor efficiencies, machine down time, and inventory levels."
    },
    {
      "duty": "Utilize substantial personal industry experience to drive optimal production results through effective deployment and use of all plant manufacturing equipment."
    },
    {
      "duty": "Provide leadership, coaching, mentoring and direction to assigned staff, including hiring, performance management, training, and professional development."
    },
    {
      "duty": "Drive both short and long-range plans and objectives for improving operations, profitability, service, timeliness, quality, and compliance."
    },
    {
      "duty": "Identify potential improvements in service and transactional process flows and provide leadership in developing practices for maximum efficiencies and continuous improvements."
    },
    {
      "duty": "Ensure compliance with Company standards for cost control, waste reduction, quality, OSHA, safety, and complete on-time delivery at the lowest possible cost."
    },
    {
      "duty": "Determine operations staffing needs and ensure compliance with company employment policies and practices."
    },
    {
      "duty": "Manage key operations/manufacturing projects."
    },
    {
      "duty": "Provide a safe and healthy work environment in compliance with all regulatory agencies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 180,
      "introvert_extrovert": 30
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree required. Advanced degree a plus."
    }
  ]
}