{
  "meta": [
    {
      "job_title": "EBS Finance Functional Consultant - Accounts Receivables (AR)+Project Accounting (PA)",
      "job_category": "Finance",
      "job_class": "Consultant",
      "sector": "Finance",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Gather requirements, analyzes, creates design documents and performs impact analysis for application changes."
    },
    {
      "duty": "Plan and organize tasks, reports progress for implementations."
    },
    {
      "duty": "Defining scope, planning and scheduling projects."
    },
    {
      "duty": "Develop solutions to leverage Oracle applications functionality for the Financial and Treasury areas and suggest process improvements."
    },
    {
      "duty": "Lead user sessions for requirement and testing, Create test plans, test cases, test scripts and performs functional testing."
    },
    {
      "duty": "Guides technical team in the development reports, conversions, interfaces and extensions for Oracle Applications."
    },
    {
      "duty": "Understand and modifies the Application Configuration as required (includes system setups, flex-fields, workflow builder, custom library, profile options etc.)."
    },
    {
      "duty": "Assist users with problems and resolves issues independently."
    },
    {
      "duty": "Create and maintain system documentation."
    },
    {
      "duty": "Work with existing systems to track and manage requests and issues."
    },
    {
      "duty": "Review requests, assign/delegate tasks and track progress."
    },
    {
      "duty": "Provide leadership for functional solution design."
    },
    {
      "duty": "Proactively assess opportunities, risks, challenges for technology & business."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "8+ years IT related experience."
    },
    {
      "credential": "8+ years Oracle application experience with various Financial modules among Accounts Receivables (AR)+Project Accounting (PA)"
    },
    {
      "credential": "Strong systems/process orientation with demonstrated analytical thinking, organizational skills and problem solving skills."
    },
    {
      "credential": "Expertise with configuration and setups for Oracle Financial modules."
    },
    {
      "credential": "Working knowledge of software development and support methodologies."
    },
    {
      "credential": "Demonstrated skill in preparation and maintenance of implementation documents."
    },
    {
      "credential": "Understand various essential business functions of an organization."
    },
    {
      "credential": "Understanding of functional concepts & flow of Oracle Application Modules."
    },
    {
      "credential": "Oracle certifications is a plus."
    },
    {
      "credential": "Working knowledge of software development and support methodologies"
    },
    {
      "credential": "Knowledge and familiarity in underlying Oracle ERP applications database architecture, as well as Oracle database and development tools (PL/SQL, SQL Plus, Forms, Reports)"
    }
  ]
}