{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Customer Service",
      "salary": 18000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides efficient and courteous consumer service via various contact center technologies, such as chat, inbound/outbound calls, email, web, etc., to determine needs and to facilitate timely and appropriate services."
    },
    {
      "duty": "Receives and responds to consumer inquiries. Resolves non-clinical inquiries and complaints related to customer service across VNS Health."
    },
    {
      "duty": "Establishes effective working relationships and communications with customers, physicians, hospitals, and internal contacts to ensure problem resolution."
    },
    {
      "duty": "Keeps up with all organizational changes and updates through on-going training, coaching and educational materials."
    },
    {
      "duty": "Adheres to general contact center standards and metrics (e.g., call handling parameters)."
    },
    {
      "duty": "Tracks, organizes, and maintains records of service logs, performance reports and other data, as needed by management for review."
    },
    {
      "duty": "Participates in special projects and performs other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Effective Communication",
      "experience": 1
    },
    {
      "skill": "Problem Resolution",
      "experience": 1
    },
    {
      "skill": "Team Collaboration",
      "experience": 1
    },
    {
      "skill": "Record Keeping",
      "experience": 1
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent required. Bachelor's Degree in Communications, English, Public Relations or related field, or the equivalent preferred."
    }
  ]
}