{
  "meta": [
    {
      "job_title": "Assistant Director, Project Management",
      "job_category": "Project Management",
      "job_class": "Director",
      "sector": "Construction & Development",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Construction Management",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Risk Management",
      "experience": 8
    },
    {
      "skill": "Quality Management",
      "experience": 8
    },
    {
      "skill": "Budget Management",
      "experience": 8
    },
    {
      "skill": "Contract Management",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and mentor staff to deliver complex capital projects."
    },
    {
      "duty": "Coordinate project activities through project close-out."
    },
    {
      "duty": "Monitor project performance and pursue opportunities for improved performance."
    },
    {
      "duty": "Identify project issues and risks and ensure timely resolution and mitigation."
    },
    {
      "duty": "Manage project activities to minimize impact on agency operations and the public."
    },
    {
      "duty": "Coordinate project activities with the project team, staff, contractors, consultants, and other stakeholders."
    },
    {
      "duty": "Ensure project activities follow established requirements and adhere to relevant standards, guidelines, codes, regulations, policies, and procedures."
    },
    {
      "duty": "Manage the preparation and monitor implementation of project plans, quality plans, and work plans."
    },
    {
      "duty": "Coordinate with Safety and Quality Management staff."
    },
    {
      "duty": "Manage project documentation to ensure quality, completeness, and accuracy."
    },
    {
      "duty": "Manage and monitor progress against project scope, schedule, and budget."
    },
    {
      "duty": "Work collaboratively with Development and Contracts throughout the project life-cycle."
    },
    {
      "duty": "Review and approve contract invoices and other project charges based on established procedures."
    },
    {
      "duty": "Manage comprehensive project document control and retention."
    },
    {
      "duty": "Manage the preparation of reports, presentations, research, and studies."
    },
    {
      "duty": "Manage the presentation of project reporting and coordination of audit/inquiry responses."
    },
    {
      "duty": "Manage staff selection, coaching, training, development, evaluation, and discipline/termination."
    },
    {
      "duty": "Create a professional environment that respects individual differences and enables all employees to develop and contribute to their full potential."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Engineering, Architecture, Construction or Project Management, Business Administration, Transportation, or a related field. (Master’s preferred)"
    }
  ]
}