{
  "meta": [
    {
      "job_title": "WalkMe Builder/Developer",
      "job_category": "Software Engineering",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "WalkMe Development",
      "experience": 4
    },
    {
      "skill": "Software Engineering",
      "experience": 4
    },
    {
      "skill": "UX Research",
      "experience": 3
    },
    {
      "skill": "HTML/CSS/JavaScript",
      "experience": 3
    },
    {
      "skill": "Enterprise Technologies",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and drive WalkMe strategy, leading the design, build, and maintenance of WalkMe deployments for internal facing applications."
    },
    {
      "duty": "Work across multiple product areas within the Commercial bank, developing strong partnerships with Lines of Business and product teams."
    },
    {
      "duty": "Design, code, test, debug, and document WalkMe capabilities and requirements for projects and programs."
    },
    {
      "duty": "Lead cross functional teams to strategize, plan, and execute a variety of programs, services, and initiatives within technical domain environments."
    },
    {
      "duty": "Perform assessments through fact-finding and data analysis to arrive at creative approaches to solving complex issues and develop appropriate solutions or recommendations."
    },
    {
      "duty": "Collaborate and consult with peers, colleagues, and mid-level managers to resolve technical challenges and achieve goals."
    },
    {
      "duty": "Provide leadership in management of relationships and implementation of programs, services, and initiatives with cross-functional business partners."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Software Engineering, Computer Science, or a related field (Master's preferred)"
    }
  ]
}