{
  "meta": [
    {
      "job_title": "Associate Project Manager",
      "job_category": "Project Management",
      "job_class": "Associate",
      "sector": "Engineering",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Support the development and execution of company projects by assisting Sr Project Manager(s) and/or Principal Project Manager(s) in the completion of transmission, substation, distribution, and/or gas projects."
    },
    {
      "duty": "Participate and assist in the development and management of project scope, schedule, budget, risks, and safety performance under the guidance of an experienced Project Management professional."
    },
    {
      "duty": "Provide analytical and operational support to the Project Management function beginning with project inception, through development and execution of project plans, and project closeout."
    },
    {
      "duty": "Assist in the coordination and management of assigned projects, ensuring work is performed in a safe manner, within deadline and budget."
    },
    {
      "duty": "Establish and maintain strong professional relationships with internal and external project stakeholders to answer questions, provide data, and coordinate project activities as needed."
    },
    {
      "duty": "Monitor and track project status, prepare, review, and analyze reports."
    },
    {
      "duty": "Help maintain the company's good standing with customers and stakeholders in regard to supporting projects with a direct link to the customer."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 60,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Engineering, or related discipline and 0-2 years relevant experience, OR in lieu of a bachelor's degree, a minimum of 2-5 years of relevant experience."
    },
    {
      "credential": "Customer driven with good oral and written communication skills."
    },
    {
      "credential": "Ability to analyze basic problems/situations and recommend alternative courses of action."
    },
    {
      "credential": "Excellent planning and organizational skills with a focus on achieving desired results."
    },
    {
      "credential": "Strong financial aptitude."
    },
    {
      "credential": "Demonstrated proficiency in PC software packages such as Microsoft Word and Excel."
    },
    {
      "credential": "Job requires a valid driver's license and use of personal vehicle."
    }
  ]
}