{
  "meta": [
    {
      "job_title": "Medical Strategy Senior Manager",
      "job_category": "Medical",
      "job_class": "Senior Manager",
      "sector": "Healthcare",
      "salary": 150000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and maintain the integrated Medical strategy for our Molecular Residual Disease product area to support growth of the Precision Oncology business."
    },
    {
      "duty": "Facilitate and plan annual Medical Innovation and Ideation sessions; lead the development and socialization of a read-out with key takeaways."
    },
    {
      "duty": "Ensure that the integrated Medical strategy remains current and is reflective of new developments and/or emerging business decisions."
    },
    {
      "duty": "Socialize the integrated Medical strategy and ensure that it is synergistic with relevant Precision Oncology/business strategies, including the Portfolio Strategy plan and Marketing brand plan."
    },
    {
      "duty": "Facilitate a regular cadence of evidence generation and Medical strategy meetings to socialize and review the status of integrated Medical strategies in collaboration with Medical and Commercial team leads."
    },
    {
      "duty": "Track and provide regular status updates on objectives and key results (OKRs) linked to the integrated Medical strategy."
    },
    {
      "duty": "Successfully launch and implement key initiatives outlined in the integrated Medical strategies (e.g., launch readiness plans, study concept development, medical education priorities, key opinion leader engagement initiatives, new developments or ongoing risks to product adoption/growth, etc.)."
    },
    {
      "duty": "Actively engage in Medical Strategy team meetings and remain current on business decisions relevant to the role."
    },
    {
      "duty": "Participate in Medical Development team meetings, clinical teams study review meetings, publication planning and strategy meetings, and product-specific core team meetings."
    },
    {
      "duty": "Identify and communicate process/procedure gaps to Medical Strategy team lead; oversee related workstreams to fill these gaps, as needed."
    },
    {
      "duty": "Develop and maintain strong working relationships with internal and external cross-functional team members."
    },
    {
      "duty": "Provide onboarding support relevant to the Medical Strategy role to new team members and personnel from other functions."
    },
    {
      "duty": "Identify and communicate need for external contractors to Medical Strategy team leadership when demands on team exceed available resources."
    },
    {
      "duty": "Provide Medical Strategy team leadership with inputs into long- and short-range plans, budgeting, and resource allocation."
    },
    {
      "duty": "Ensure compliance with company policies and procedures, applicable regulations, business practices, and relevant guidelines."
    },
    {
      "duty": "Uphold company mission and values through accountability, innovation, integrity, quality, and teamwork."
    },
    {
      "duty": "Support and comply with the company’s Quality Management System policies and procedures."
    },
    {
      "duty": "Maintain regular and reliable attendance."
    },
    {
      "duty": "Ability to act with an inclusion mindset and model these behaviors for the organization."
    },
    {
      "duty": "Ability to work on a mobile device, tablet, or in front of a computer screen and/or perform typing for approximately 90% of a typical working day."
    },
    {
      "duty": "Ability to work seated for approximately 90% of a typical working day."
    },
    {
      "duty": "Ability to work standing for approximately 10% of a typical working day."
    },
    {
      "duty": "Ability to travel up to 20% of working time away from work location, may include overnight/weekend travel."
    }
  ],
  "skills": [
    {
      "skill": "Medical Strategy",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Clinical Research",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Healthcare Regulations",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Resource Allocation",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in field related to the essential duties."
    },
    {
      "credential": "5+ years of experience in Medical Strategy/Medical Affairs or a related function within the pharmaceutical and/or diagnostics industries or equivalent."
    },
    {
      "credential": "High-level proficiency with Microsoft Office Suite and reference management software."
    },
    {
      "credential": "Demonstrated ability to perform the essential duties of the position with or without accommodation."
    },
    {
      "credential": "Authorization to work in the United States without sponsorship."
    },
    {
      "credential": "Advanced degree (i.e., M.D., Pharm.D., Ph.D.) in relevant discipline."
    },
    {
      "credential": "Strong clinical/medical/scientific background in Oncology."
    },
    {
      "credential": "Project management experience or demonstrated experience coordinating activities in a matrixed organization."
    },
    {
      "credential": "HR@exactsciences.com"
    }
  ]
}