{
  "meta": [
    {
      "job_title": "Human Resources Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Thorough knowledge of HR functions",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Bilingual (English/Spanish)",
      "experience": 5
    },
    {
      "skill": "HRIS & Payroll software",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Orientation",
      "experience": 5
    },
    {
      "skill": "Confidentiality",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and direct the routine functions of the Human Resources department including analysis, reporting, recruiting, onboarding, compliance, employee relations, benefits assistance, and administrative tasks."
    },
    {
      "duty": "Provide hands-on support for the manufacturing facility, understanding and executing the organization's human resource and talent strategy."
    },
    {
      "duty": "Manage the hiring process, including recruitment, interviewing, hiring, and onboarding of qualified job applicants."
    },
    {
      "duty": "Collaborate with departmental managers to understand skills and competencies required for openings."
    },
    {
      "duty": "Administer human resource programs including timekeeping, compensation, leave, disciplinary matters, disputes and investigations, performance and talent management, recognition and morale, workers' compensation, and training and development."
    },
    {
      "duty": "Ensure compliance with data privacy regulations and best practices."
    },
    {
      "duty": "Prepare reports of data results and present findings to senior leadership."
    },
    {
      "duty": "Analyze data and statistics for trends and patterns, paying attention to recruitment, hiring practices, motivation, turnover, and compliance with employment laws and regulations."
    },
    {
      "duty": "Collect and compile HR metrics and data from various sources."
    },
    {
      "duty": "Stay informed on existing and proposed federal and state laws/regulations affecting HR and identify trends that could impact organizational objectives."
    },
    {
      "duty": "Interpret laws and policies and advise management and employees accordingly."
    },
    {
      "duty": "Maintain the highest level of confidentiality."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "5+ years of experience as a Human Resources Manager in an industrial environment (Manufacturing or Construction preferred)"
    },
    {
      "credential": "Bilingual (English/Spanish)"
    },
    {
      "credential": "PHR or SPHR Certification preferred"
    },
    {
      "credential": "Thorough knowledge of applicable local, state, and federal laws involving employment, HR, and HR policies"
    },
    {
      "credential": "Proficiency with HRIS, Payroll, and similar employee management software"
    }
  ]
}