{
  "meta": [
    {
      "job_title": "Carbon Neutral Catalyst Scientist",
      "job_category": "Science",
      "job_class": "Scientist",
      "sector": "Research",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Materials Research",
      "experience": 5
    },
    {
      "skill": "Chemistry",
      "experience": 5
    },
    {
      "skill": "Material Science",
      "experience": 5
    },
    {
      "skill": "Surface Characterization",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Scientific Writing",
      "experience": 5
    },
    {
      "skill": "Presentation",
      "experience": 5
    },
    {
      "skill": "Environmental Catalysis",
      "experience": 5
    },
    {
      "skill": "CO2 Conversion",
      "experience": 5
    },
    {
      "skill": "Machine Learning",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct materials research to advance the state-of-the-art in the conversion of emissions generated by the mobility industry, including automotive exhaust and carbon dioxide capture, utilization, and storage (CCUS)."
    },
    {
      "duty": "Perform original research, publish/present results, submit patent applications, participate in collaborative research, and develop new skill sets."
    },
    {
      "duty": "Conduct material synthesis, characterization, and evaluation of nano-structured oxides, metal, and metal alloy materials for application in environmental catalysis, CO2 capture, and CO2 conversion."
    },
    {
      "duty": "Investigation of academic and patent literature to propose and implement new materials for environmental catalysis and CCUS and introduce new methods of synthesis and characterization."
    },
    {
      "duty": "Analysis of data for identification of material structure-function relationships and communicate with data scientists to seek data-driven approaches to guide materials discovery."
    },
    {
      "duty": "Frequently communicate with materials research scientists within the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 0,
      "introvert_extrovert": 255
    }
  ],
  "education_certification": [
    {
      "credential": "PhD degree in Chemistry, Chemical Engineering, Material Science, or related technical field, or five+ years of practical experience with an MS/BS degree"
    },
    {
      "credential": "Broad knowledge related to artificial and natural CCUS, including CO2 sorption, environmental catalysis, electrochemistry/catalysis, bio-engineering, biochemistry, water chemistry, soil chemistry, etc."
    },
    {
      "credential": "Graduate level or job-related experience in projects materials research projects utilizing data-driven techniques such as machine learning and principal component analysis."
    },
    {
      "credential": "Established capability in scientific writing and presentation."
    },
    {
      "credential": "Hands-on laboratory experience with clear and documented evidence of safe laboratory practices."
    },
    {
      "credential": "First or corresponding author publication in scientific journals."
    },
    {
      "credential": "Knowledge and experience in methods specific automotive catalyst research, ex. wet impregnation synthesis, packed-bed reactor evaluation, and in situ characterization."
    },
    {
      "credential": "Track record of innovation leading to the generation of intellectual property, ex. Lead inventor on a patent or patent application, experience in industry-funded projects."
    }
  ]
}