{
  "meta": [
    {
      "job_title": "VCG Strategy Consultant",
      "job_category": "Management Consulting",
      "job_class": "Consultant",
      "sector": "Management",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Champion bold ideas and lead the execution strategy to evolve and grow fraud mitigation capabilities across the business."
    },
    {
      "duty": "Assess and mitigate fraud risks related to customer authentication, sales journeys, and account security."
    },
    {
      "duty": "Build and strengthen consultative and collaborative partnerships across Verizon."
    },
    {
      "duty": "Work closely with various technical and non-technical stakeholders including sales/marketing/CX/channel strategy; data scientists and business intelligence experts; application developers and software engineers; and, frontline operations and customer-facing teams."
    },
    {
      "duty": "Be a SME and consultative partner in the evaluation of complex initiatives through risk analysis and Agile solution design."
    },
    {
      "duty": "Develop and implement holistic strategies and solutions that cross multiple channels to mitigate fraud exposure and reduce bottom-line financial loss."
    },
    {
      "duty": "Oversee multiple and simultaneous sales, marketing, and experience workstreams, and partner across matrixed teams for strategy, planning, and execution to support scalability and efficiency."
    },
    {
      "duty": "Drive continual evolution and enhancement of the fraud prevention landscape while reducing customer friction."
    },
    {
      "duty": "Drive an ecosystem of risk mitigation while innovating across the Verizon journey."
    }
  ],
  "skills": [
    {
      "skill": "Fraud Risk Assessment",
      "experience": 4
    },
    {
      "skill": "Consultative Partnership",
      "experience": 5
    },
    {
      "skill": "Stakeholder Collaboration",
      "experience": 5
    },
    {
      "skill": "Agile Solution Design",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Sales and Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Cross-functional Team Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or four or more years of work experience."
    },
    {
      "credential": "An MBA or higher degree in Finance, Economics, Marketing, Strategy, or Innovation."
    },
    {
      "credential": "Lean Six Sigma, Project Management Professional (PMP), Design Thinking, or Agile certification."
    }
  ]
}