{
  "meta": [
    {
      "job_title": "Process Technician Trainee",
      "job_category": "Manufacturing",
      "job_class": "Technician",
      "sector": "Industrial",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Process Technology",
      "experience": 1
    },
    {
      "skill": "Equipment Monitoring",
      "experience": 1
    },
    {
      "skill": "Chemical Handling",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Troubleshooting",
      "experience": 1
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 1
    },
    {
      "skill": "Forklift Operation",
      "experience": 1
    },
    {
      "skill": "Hazardous Weather Preparation",
      "experience": 1
    },
    {
      "skill": "Plant Maintenance",
      "experience": 1
    },
    {
      "skill": "Safety Compliance",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Operate and monitor conversion of fuels, reactive vessels, steam boilers, and the water feed system as needed."
    },
    {
      "duty": "Sample and measure inventory and check temperatures of tanks."
    },
    {
      "duty": "Perform startup and operate during the interesterification, bleaching, and deodorization processes to produce a final product that meets internal and customer specifications."
    },
    {
      "duty": "Troubleshoot, rebuild, repair, and replace processing equipment components as needed."
    },
    {
      "duty": "Unload and wash trucks, tank containers, and other bulk methods of transporting oil."
    },
    {
      "duty": "Load oil and/or other materials into vehicles and installs seals, strapping, bracing, or padding to prevent shifting or damage in transit."
    },
    {
      "duty": "Take samples of materials and oils, labels with identifying information, and provides samples to the laboratory for analysis."
    },
    {
      "duty": "Keep accurate records of inventory (Counts, weights), verifies, and records units of supplies and raw materials received, movements and shipments, and accurately completes appropriate paperwork."
    },
    {
      "duty": "Transport drums and other production items via forklift."
    },
    {
      "duty": "Support in preparing plant equipment for startups, shutdowns, freeze plans, and hazardous weather conditions."
    },
    {
      "duty": "Assist in maintaining the cleanliness of the plant with a primary focus on processing areas and the outdoor tank farm."
    },
    {
      "duty": "Perform other duties as needed or assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Prior industrial experience or training such as Process Technology program"
    }
  ]
}