{
  "meta": [
    {
      "job_title": "Recruiting Lead",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Talent Acquisition",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruiting",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Interviewing",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Sourcing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead, guide, mentor and support a team of recruiters to successfully and strategically deliver on hiring metrics while maintaining a positive candidate experience."
    },
    {
      "duty": "Responsible for driving overall success of team including managing prioritization, delegation, and overall accountability of team."
    },
    {
      "duty": "Meet regularly with Moseley Leadership to develop the overall recruiting strategy, identifying gaps in internal talent and create an ongoing and ever-evolving recruiting roadmap reflective of current and future goals."
    },
    {
      "duty": "Participate in customer conference calls as requested."
    },
    {
      "duty": "Qualify and present potential candidate resumes to clients through approved channels with the goal of adding value to the selection process to include screen resumes, interview candidates, administer appropriate assessments, reference checking, make recommendations for hire and deliver employment offers."
    },
    {
      "duty": "Formulate recruiting strategies with the Professional Services Manager by translating engineering requirements into sourcing strategies/plans and executing against those plans."
    },
    {
      "duty": "Maintain a thorough understanding of Moseley’s applicant tracking system, iCIMS, policies, and procedures Continual strategizing with the Professional Services Manager in identifying qualified candidates with new and innovative sourcing ideas."
    },
    {
      "duty": "Maintain accurate and organized documentation on all candidates, searches, interactions, and other recruiting activities in Moseley’s Applicant Tracking System, iCIMS, to ensure compliance in accordance with company policies and procedures."
    },
    {
      "duty": "Maintain timely and effective communication with all partners throughout the recruiting process including communication with candidates."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 150,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Business related field and 4+ years overall recruiting experience or the 8+ years recruiting experience with no degree. 1+ years’ experience in Engineering Recruiting. 3+ years’ experience in Staffing Industry, to include contract labor and DoD specific job roles, required. 3+ years’ experience in leadership or management role with proven leadership ability."
    }
  ]
}