{
  "meta": [
    {
      "job_title": "Sr. Project Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Stakeholder Management",
      "experience": 8
    },
    {
      "skill": "Resource Planning",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Financial Forecasting",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Procurement and Sourcing",
      "experience": 8
    },
    {
      "skill": "Agile Methodology",
      "experience": 8
    },
    {
      "skill": "Waterfall Methodology",
      "experience": 8
    },
    {
      "skill": "Mentoring and Coaching",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Directs large-scale, complex projects often involving multiple internal and external constituents."
    },
    {
      "duty": "Is able to quickly build collaborative relationships with project stakeholders and project team members."
    },
    {
      "duty": "Directly manages all aspects of the project lifecycle and works with department leadership in a matrix environment."
    },
    {
      "duty": "Ensures project results are clearly articulated within scope and delivered business benefits are of the highest caliber."
    },
    {
      "duty": "Rigorously manages scope to ensure commitments are achieved and time, cost and quality parameters are met."
    },
    {
      "duty": "Performs resource capacity analysis and resource plan management in partnership with department leadership."
    },
    {
      "duty": "Defines and tracks project milestones while developing, maintaining and reporting on an overall integrated delivery plan."
    },
    {
      "duty": "Serves as subject matter expert in briefing stakeholders in aspects of project progress related to work completion, scope, cost and quality."
    },
    {
      "duty": "Prepares and manages all project related management plans in support of obtaining business benefits."
    },
    {
      "duty": "Ensures flexibility in their use of project management methodology based on the project requirements (Agile, Waterfall, or a hybrid)."
    },
    {
      "duty": "Validates financial forecasts and provides on-going reconciliation of resources and other related project expenditures."
    },
    {
      "duty": "Makes good decisions in ambiguous situations and provides stakeholders with recommendations and contingency plans."
    },
    {
      "duty": "Represents the project in various project governance and inter-department forums."
    },
    {
      "duty": "Publishes scheduled project status reports."
    },
    {
      "duty": "Facilitates the procurement and sourcing process by defining deliverables, managing procurement team tasks, and ensuring negotiation activities are tracked and documented."
    },
    {
      "duty": "Mentors and coaches team members and/or other project managers."
    },
    {
      "duty": "Other duties may be assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "PMP Certification Mandatory. Bachelor's degree in Project Management, Business Administration, or a related field (Master's preferred)"
    }
  ]
}