{
  "meta": [
    {
      "job_title": "Patient Relations Representative",
      "job_category": "Healthcare",
      "job_class": "Representative",
      "sector": "Healthcare",
      "salary": 28000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the daily functions of the Patient Relations Representatives Department."
    },
    {
      "duty": "Act as a facilitator for health system patients’ family members and patients’ designated representatives to achieve resolution to their concerns or complaints."
    },
    {
      "duty": "Coordinate communication between patient/families and the healthcare team to expedite the best outcomes for the patient."
    },
    {
      "duty": "Document patient complaints and assess areas for improvement based on daily interactions with patients and observations."
    },
    {
      "duty": "Maintain sensitivity to cultural diversity and effectively interact with a multicultural patient and guest population."
    },
    {
      "duty": "Respond to and resolve patient concerns and problems in an effective and timely manner, exhibiting the highest degree of professionalism, friendliness, helpfulness, and customer service."
    },
    {
      "duty": "Collaborate with department managers to meet patient expectations and quality outcomes, building a patient-focused culture."
    },
    {
      "duty": "Maintain knowledge and understanding of Medicare/Medicaid, IDPH guidelines, JCAHO, OSHA, and DOH regulations and compliance standards."
    },
    {
      "duty": "Assist with the patient’s needs or a referral to the appropriate staff and answer general questions and/or relay messages to the appropriate personnel."
    },
    {
      "duty": "Coordinate the investigation and analyze grievances/complaints/concerns with appropriate parties and departments for resolution."
    },
    {
      "duty": "Effectively communicate the findings of grievances/reviews to the patient in writing."
    },
    {
      "duty": "Support staff in the facilitation of Service Recovery opportunities, responding to the needs and concerns of patients, families, and other customers."
    }
  ],
  "skills": [
    {
      "skill": "Interpersonal Communication Skills",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Patient Advocacy",
      "experience": 4
    },
    {
      "skill": "Cultural Sensitivity",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Compliance Standards",
      "experience": 4
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred; Experience: 3-5 years’ experience in a healthcare-related field."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ]
}