{
  "meta": [
    {
      "job_title": "Security Advisory Manager",
      "job_category": "Security",
      "job_class": "Manager",
      "sector": "Consulting",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cyber Security",
      "experience": 7
    },
    {
      "skill": "Commercial Modeling",
      "experience": 7
    },
    {
      "skill": "Security Strategy",
      "experience": 7
    },
    {
      "skill": "IAM (Identity and Access Management)",
      "experience": 7
    },
    {
      "skill": "Data Protection",
      "experience": 7
    },
    {
      "skill": "GRC (Governance, Risk, and Compliance)",
      "experience": 7
    },
    {
      "skill": "Team Management",
      "experience": 7
    },
    {
      "skill": "Client Relationship Building",
      "experience": 7
    },
    {
      "skill": "Industry Alignment",
      "experience": 7
    },
    {
      "skill": "Advisory Leadership",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Transform client maturity, improve control environments, create new client offerings, define and lead engagements, sell meaningful services, and grow and manage a diverse team."
    },
    {
      "duty": "Influence, shape, and grow the Security Advisory practice, working with the North America Security Advisory Lead, and regional security resources to be a part of our 2023 Accelerated Security ambition."
    },
    {
      "duty": "Drive multi-million sales and revenues and be responsible for achieving and building out a strong consultancy project pipeline."
    },
    {
      "duty": "Understand clients’ security needs, solve unique problems, and work with clients from the earliest visions to the final experience."
    },
    {
      "duty": "Shape commercial models, risk, and go-to-market across a range of security capabilities including Strategy & GRC, IAM, Data Protection, and Cloud."
    },
    {
      "duty": "Shape, define, and guide transformative projects which enhance maturity, define strategy, solve technology issues, optimize business processes, provide assurance, strengthen controls, reduce security risk, and enable new secure ways of working."
    },
    {
      "duty": "Drive industry aligned focus, bringing together GTM offerings and taking them to the industry verticals via sales teams."
    },
    {
      "duty": "Help grow and nurture our internal talent, passing on knowledge and experience to create the leaders of the future."
    },
    {
      "duty": "Hire consulting specialists from diverse backgrounds to build a strong team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Cyber Security, Business, or a related field (Master's preferred)"
    }
  ]
}