{
  "meta": [
    {
      "job_title": "Dispatcher",
      "job_category": "Transportation",
      "job_class": "Coordinator",
      "sector": "Logistics",
      "salary": 20000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate the timely movement of customer's product in a safe, efficient manner, in compliance with company rules and DOT regulations."
    },
    {
      "duty": "Assign workload to available drivers, monitor product movements and resolve delivery and scheduling issues."
    },
    {
      "duty": "Properly use the Ruan transportation management systems to ensure all required operational data is accurately captured in a near real-time manner."
    },
    {
      "duty": "Responsible for the timely pickup and delivery of all customer orders within assigned area while maintaining customer expectations."
    },
    {
      "duty": "Ensure efficient utilization of drivers and equipment."
    },
    {
      "duty": "Direct and schedule drivers' work."
    },
    {
      "duty": "Notify drivers of work assignments to ensure on-time movement of goods to maximize operational efficiency."
    },
    {
      "duty": "Regularly monitor driver activities and performance."
    },
    {
      "duty": "Identify and resolve daily service and scheduling issues."
    },
    {
      "duty": "Inform and escalate service issues to management as appropriate."
    },
    {
      "duty": "Maintain timely and professional communication with customer contacts on issues impacting service and overall performance."
    },
    {
      "duty": "Monitor drivers' hours of service to prevent DOT violations."
    },
    {
      "duty": "Effectively communicate with customer on a regular and timely basis regarding issues impacting the customer and/or their service expectations."
    },
    {
      "duty": "Accurately prepare and process data and paperwork including but not limited to maintaining driver activities in computer systems, activity reports/trip documents, driver hours of service, fuel tickets and other required items."
    },
    {
      "duty": "Responsible to update driver and dispatch information into dispatch system real time."
    },
    {
      "duty": "Monitor and promote safety in all areas of dispatch."
    }
  ],
  "skills": [
    {
      "skill": "Transportation Management",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "DOT Regulations",
      "experience": 2
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 60,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma/GED or equivalent work experience."
    }
  ]
}