{
  "meta": [
    {
      "job_title": "Service Technician",
      "job_category": "Field Service",
      "job_class": "Technician",
      "sector": "Construction",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Diagnose, troubleshoot, adjust, inspect, repair, and replace parts on Pella products while at customer locations."
    },
    {
      "duty": "Complete service jobs on Pella products in the field: replacing glass in windows or doors, installing window shades, blinds, muntins, screens, etc."
    },
    {
      "duty": "Provide customers with helpful information on the care, operation, and maintenance of their Pella products."
    },
    {
      "duty": "Generate and update all service-related paperwork and file folders following a service visit."
    },
    {
      "duty": "Conduct any necessary follow-up service work or communication to bring resolution and Very Satisfied Customer Service Rating from all Customers."
    },
    {
      "duty": "Perform job site walk-thru’s and complete necessary paperwork, identifying items that need attention or correction prior to project finalization."
    },
    {
      "duty": "Load service van with all necessary parts and equipment, ensuring it stays in safe, working order."
    },
    {
      "duty": "Complete service work orders and communicate any ongoing customer or product related issues with CSR’s."
    },
    {
      "duty": "Work safely and serve as a Customer Service Champion at all times."
    },
    {
      "duty": "Communicate effectively with customers and serve as a professional Pella representative on all assigned job-sites."
    },
    {
      "duty": "Be fully knowledgeable on window and door repair and service aspects of residential construction, and have the ability to take and record accurate measurements."
    },
    {
      "duty": "Have technical expertise to perform job site inspection to assess conditions for repair and service, and be familiar enough with computers to develop proficient knowledge of our service system."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 60,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Technical degree or certification in mechanical, electrical, or construction-related field (preferred)"
    }
  ]
}