{
  "meta": [
    {
      "job_title": "Director of Shared Services",
      "job_category": "Directors & Executives",
      "job_class": "Director",
      "sector": "Finance",
      "salary": 180000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Finance Operational Strategies",
      "experience": 10
    },
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "SAP Knowledge",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Accounting",
      "experience": 10
    },
    {
      "skill": "M&A Integration",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 10
    },
    {
      "skill": "Financial Reporting",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement finance operational strategies, policies, and procedures to drive process efficiency and profitability."
    },
    {
      "duty": "Collaborate with the leadership team to understand and prioritize opportunities to streamline, automate, and optimize financial processes."
    },
    {
      "duty": "Conduct financial analysis and risk assessment to identify opportunities for scalability, cost reduction, risk optimization, and improved financial performance."
    },
    {
      "duty": "Oversee day-to-day financial operations, including accounts payable, accounts receivable, credit administration, and other recurring financial transaction processing. May also include aspects of cash flow management, and reporting."
    },
    {
      "duty": "Identify and deploy opportunities to use systems, processes, and people to drive excellence, efficiency, and accuracy through each process. Monitor and analyze operational performance, providing regular reports and recommendations to continuously improve senior management."
    },
    {
      "duty": "Evaluate and enhance our SAP financial systems, processes, and internal controls to optimize workflow, accuracy, efficiency, and data integrity."
    },
    {
      "duty": "Implement and maintain financial reporting systems, ensuring timely and accurate financial statements and management reports."
    },
    {
      "duty": "Serve as an advisor to the leadership team, providing strategic recommendations and insights on financial operations and other related matters."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "BS in Accounting or Finance"
    },
    {
      "credential": "CPA (preferred)"
    },
    {
      "credential": "MBA (optional)"
    }
  ]
}