{
  "meta": [
    {
      "job_title": "Product Manager",
      "job_category": "Software Engineering",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 135000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "AI Technologies",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Machine Learning",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Data Visualization",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Data Privacy Regulations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive the development and implementation of advanced technologies to enhance the project management capabilities of software."
    },
    {
      "duty": "Partner with other product managers, engineering, and UX to develop solutions using the latest technologies to deliver key insights and capabilities to customers."
    },
    {
      "duty": "Utilize AI technologies, machine learning, and data analytics to drive intelligent automation and data-driven insights within project management software."
    },
    {
      "duty": "Solve complex challenges, make data-driven decisions, and propose innovative solutions."
    },
    {
      "duty": "Collaborate effectively with development teams to advocate for a seamless and intuitive user experience, ensuring that AI and analytics features meet customer needs."
    },
    {
      "duty": "Stay up to date with industry trends, emerging technologies, and best practices in AI, analytics, and project management to drive product innovation."
    },
    {
      "duty": "Ensure data privacy and security regulations are adhered to, and data governance frameworks and standards are maintained."
    },
    {
      "duty": "Work cross-team with product owners, scrum masters, designers, and developers to drive product development."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Computer Science, Data Science, or a related field. Knowledge of data privacy and security regulations."
    }
  ]
}