{
  "meta": [
    {
      "job_title": "Human Resources Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Overseeing all aspects of Human Resources including payroll, 401K, recruitment, employee benefits, performance management, leadership development, employee and labor relations, policy compliance, and planning and executing strategic HR initiatives."
    },
    {
      "duty": "Guiding management and employees regarding company policies, values, HR programs administration, and interpretation."
    },
    {
      "duty": "Responsible for full cycle recruiting, collaborating with hiring managers on job requirements, sourcing, screening of candidates, coordinating interviews, and placing qualified candidates."
    },
    {
      "duty": "Overseeing all payroll and benefits administration and monitoring."
    },
    {
      "duty": "Developing policies and office-wide correspondence, including semi-monthly newsletter and flyers."
    },
    {
      "duty": "Developing and implementing Bank-wide performance objectives through the Incentive plan and Scorecard process."
    },
    {
      "duty": "Analyzing options and cost alternatives for providing employee benefits, recommending benefits program modifications, and leading efforts in implementing changes."
    },
    {
      "duty": "Coaching managers and supervisors on employee relation skills, including communication, performance appraisals, rewards and recognition, accountability."
    },
    {
      "duty": "Ensuring the CEO is informed of significant problems and preparing special reports/projects as required."
    },
    {
      "duty": "Consistently adhering to all state and federal employee laws."
    },
    {
      "duty": "Managing multiple projects, working in a fast-paced environment, paying attention to detail, and serving as a resource to personnel, and the management team."
    },
    {
      "duty": "Performing other duties and special projects as needed and assigned."
    }
  ],
  "skills": [
    {
      "skill": "Human Resources Management",
      "experience": 10
    },
    {
      "skill": "Recruiting",
      "experience": 10
    },
    {
      "skill": "Performance Management",
      "experience": 10
    },
    {
      "skill": "Employee Benefits Administration",
      "experience": 10
    },
    {
      "skill": "Policy Development",
      "experience": 10
    },
    {
      "skill": "Payroll Administration",
      "experience": 10
    },
    {
      "skill": "Employee Relations",
      "experience": 10
    },
    {
      "skill": "Strategic HR Initiatives",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Leadership Skills",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "Analytical Skills",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of 10 or more years of Human Resources, Payroll, or Administrative duties."
    }
  ]
}