{
  "meta": [
    {
      "job_title": "Director, Business Development",
      "job_category": "Business Development",
      "job_class": "Director",
      "sector": "Sales",
      "salary": 140000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for building an active and relevant funnel of open opportunities to facilitate continuous business generation and demonstrating the ability to close, maintain, and grow strategic customer relationships within the biotech and pharmaceutical sectors."
    },
    {
      "duty": "Plan and implement a detailed, cohesive, and actionable sales strategy for acquisition and management of business opportunities from biopharma companies within assigned territories and business segments."
    },
    {
      "duty": "Research, identify, and develop new business prospects, including strategic accounts, from multiple sources including industry contacts, leads generated from organic prospecting efforts, and email and inbound leads from the website and Inside Sales team."
    },
    {
      "duty": "Work in close collaboration with Commercial leadership to drive business development efforts based on the overall commercial strategy and growth objectives."
    },
    {
      "duty": "Represent the company by attending trade shows, industry events, and conferences and maintains active membership and participation in industry trade groups and networking events."
    },
    {
      "duty": "Assist in gathering market intelligence on customers, competitors, industry trends, etc."
    },
    {
      "duty": "Lead and execute business development initiatives including partner identification, outreach, management of the \\"
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Market Intelligence",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Trade Show Representation",
      "experience": 5
    },
    {
      "skill": "Business Analysis",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or advanced degree (BS, MS) in Biology, Chemistry, or related scientific/technical field of study. Advanced scientific, technical and/or business degree strongly preferred (e.g. MS, MBA)."
    }
  ]
}