{
  "meta": [
    {
      "job_title": "Corporate Recruiter",
      "job_category": "Human Resources",
      "job_class": "Recruiter",
      "sector": "Human Resources",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Proactively build and maintain a pipeline of qualified candidates through cold calling, networking, and data mining."
    },
    {
      "duty": "Influence passive job seekers to pursue opportunities within the company."
    },
    {
      "duty": "Maintain the established recruiting requirements and review store positions, plans, and objectives with the VP of Talent on a weekly basis."
    },
    {
      "duty": "Determine applicant qualifications by interviewing applicants, analyzing responses, verifying references, and comparing qualifications to job requirements."
    },
    {
      "duty": "Coordinate management interviews and escort applicants to site visits when necessary."
    },
    {
      "duty": "Assist in the creation and execution of monthly/quarterly open house events and annual career fair schedule."
    },
    {
      "duty": "Evaluate applicants by discussing job requirements and qualifications with managers."
    },
    {
      "duty": "Assist with the coordination of the pilot Intern Program by conducting orientations and scheduling rotations/assignments."
    },
    {
      "duty": "Assist in the coordination of the onboarding process for new hires in collaboration with the Human Resources department."
    },
    {
      "duty": "Cultivate candidate touchpoints from application to hire."
    },
    {
      "duty": "Communicate with hiring managers and partners to share progress and escalate issues as needed."
    },
    {
      "duty": "Share market information and educate managers on current recruitment challenges/conditions."
    },
    {
      "duty": "Actively pursue job-specific training opportunities and professional networking organizations to increase success in the role."
    },
    {
      "duty": "Serve as a brand ambassador for the company."
    }
  ],
  "skills": [
    {
      "skill": "Recruitment",
      "experience": 3
    },
    {
      "skill": "Cold Calling",
      "experience": 3
    },
    {
      "skill": "Interviewing",
      "experience": 3
    },
    {
      "skill": "Networking",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Event Planning",
      "experience": 3
    },
    {
      "skill": "Onboarding",
      "experience": 3
    },
    {
      "skill": "Market Knowledge",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business, or a related field (Master's preferred)"
    }
  ]
}