{
  "meta": [
    {
      "job_title": "Senior Scheduler Level 2",
      "job_category": "Construction & Development",
      "job_class": "Scheduler",
      "sector": "Construction & Development",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and maintain project/program schedules during all phases of capital projects, typically using in-house master schedules with one or multiple external parties providing input."
    },
    {
      "duty": "Facilitate planning sessions with project management teams, project team members, and multiple project stakeholders to identify work packages and tasks as well as the execution logic."
    },
    {
      "duty": "Work with internal and external estimators and construction experts to determine durations and resource requirements for individual tasks to create resource leveled execution plans, progress tracking baselines, and shutdown requirements."
    },
    {
      "duty": "Work closely with external designers/contractors to ensure that schedules and progress updates integrate into MTA C&D master schedules to create accurate actual status and product information and forecasts."
    },
    {
      "duty": "Contribute to risk analysis and management with project teams and stakeholders to assess schedule risks and mitigations."
    },
    {
      "duty": "Conduct scheduled stage gate reviews."
    },
    {
      "duty": "Contribute to continuous improvement of tools and methods in alignment within the global scheduling community."
    },
    {
      "duty": "Develop subject matter training material and train schedulers, project controllers, project managers, engineers, and other stakeholders."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Engineering, Architecture, Construction or Project Management, Business Administration, Transportation, or a related field. Must have a minimum of fourteen (14) years of related experience. Must have a minimum of eight (8) years in a management or supervisory role and/or project manager role in a large, multi-faceted organization. An equivalent combination of education and experience may be considered."
    }
  ]
}