{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement strategies to drive sales and key performance indicators."
    },
    {
      "duty": "Manage store P&L by driving top line revenue and strategically managing expense budgets to meet overall profitability goals."
    },
    {
      "duty": "Implement product and visual merchandising directives and techniques to maximize space and drive sales."
    },
    {
      "duty": "Manage and communicate merchandise opportunities to District Manager/ buying team."
    },
    {
      "duty": "Analyze customer profiles, buying trends, and competitive information to impact and drive business."
    },
    {
      "duty": "Create and manage in-store events, marketing initiatives and CRM activity to drive and reward repeat business."
    },
    {
      "duty": "Support new store openings, remodels, pop-ups and special events as needed."
    },
    {
      "duty": "Communicate staffing, merchandising and operational needs to HQ team."
    },
    {
      "duty": "Manage and achieve or exceed all inventory and shrink goals; plan and execute bi-annual Physical Inventory."
    },
    {
      "duty": "Manage inventory control procedures including product receipt, transfers and returns."
    },
    {
      "duty": "Provide direction, feedback and coaching in order to foster collaboration and productivity."
    },
    {
      "duty": "Recruit, train and retain an exceptional team of support managers and client experience focused associates."
    },
    {
      "duty": "Train and coach team to meet and/or adhere to client service standards and company policies and procedures."
    },
    {
      "duty": "Manage store-level HR functions, including associate scheduling and timecard review / approval."
    },
    {
      "duty": "Manage and maintain store cleanliness and organization, including front of house and stock space."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Business or related field preferred."
    }
  ]
}