{
  "meta": [
    {
      "job_title": "Senior Product Lifecycle Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Product Lifecycle",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Candidate will be responsible for products that have gone through development and are released to commercialization."
    },
    {
      "duty": "Troubleshoot, develop root cause analysis and be able to make decisions with minimal direction."
    },
    {
      "duty": "Design, verify and implement post-market engineer design changes and improvements to commercialized Candela products."
    },
    {
      "duty": "Own post-market engineer projects (Project Technical Lead) from kickoff to implementation."
    },
    {
      "duty": "Works to maintain product performance and quality of existing products by leading and assisting with issues relating to CAPAs, non-conformances, customer complaints and manufacturing processes."
    },
    {
      "duty": "Creates, updates or supervises designs in CAD, including detailed design of components, tolerance analysis, fundamental calculations, and finite element analysis."
    },
    {
      "duty": "Creates Engineering Change Orders (ECOs) and manages through completion."
    },
    {
      "duty": "Produce DHF and DMR documentation for transfer to manufacturing."
    },
    {
      "duty": "Contribute to risk management activities, dFMEA, pFMEA and hazard analysis."
    }
  ],
  "skills": [
    {
      "skill": "Electro-Mechanical Design",
      "experience": 7
    },
    {
      "skill": "Medical Experience",
      "experience": 7
    },
    {
      "skill": "Mechanical Manufacturing",
      "experience": 7
    },
    {
      "skill": "Electronic Manufacturing",
      "experience": 7
    },
    {
      "skill": "SolidWorks",
      "experience": 7
    },
    {
      "skill": "PDM Structure",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Mechanical Electrical, Software or Systems Engineering or other technical discipline with minimum 7 years-experience."
    }
  ]
}