{
  "meta": [
    {
      "job_title": "Supervisor - Student Union",
      "job_category": "Hospitality Services",
      "job_class": "Supervisor",
      "sector": "Hospitality",
      "salary": 37000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assists in supervision of the operations and coordination of assigned area."
    },
    {
      "duty": "May supervise second shift (evening/night) use of facilities and remote sites."
    },
    {
      "duty": "Complete required university/departmental/franchise training."
    },
    {
      "duty": "Count money, and verify proper handling of cash by employees, particularly cashiers."
    },
    {
      "duty": "Interview, hire and train new employees, develop existing staff."
    },
    {
      "duty": "Manage staff and assign duties."
    },
    {
      "duty": "Coordinate assignments of cooking personnel to ensure economical use of food and timely preparation."
    },
    {
      "duty": "Maintain food inventories, and keep inventory records."
    },
    {
      "duty": "Operate unit in the absence of unit manager during late night and weekends."
    },
    {
      "duty": "Order and receive food; Verify product quality and quantity."
    },
    {
      "duty": "Monitor food preparation methods, portion sizes, freshness, and presentation of food."
    },
    {
      "duty": "Ensure that food is prepared according to food safety guidelines and is presented in an acceptable manner."
    },
    {
      "duty": "Adherence to robust safety practices and compliance with all applicable health and safety regulations are responsibilities of all TTU employees."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 255
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of high school or the equivalent plus five years progressively responsible office administration or supervisory experience. Additional education may substitute for required experience on a year for year basis."
    }
  ]
}