{
  "meta": [
    {
      "job_title": "Senior Project Manager - Workday Implementation",
      "job_category": "Project Management",
      "job_class": "Senior",
      "sector": "Management",
      "salary": 155000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Workday Implementation",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Payroll Integration",
      "experience": 7
    },
    {
      "skill": "Global Payroll Integrations",
      "experience": 7
    },
    {
      "skill": "Financial Management",
      "experience": 7
    },
    {
      "skill": "Vendor Management",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Process Optimization",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support Workday payroll integration and payroll simulation testing efforts."
    },
    {
      "duty": "Assist in gathering test scenarios, support assignments, and tracking of scenarios utilizing project management methods for global payroll integrations and US Payroll implementation."
    },
    {
      "duty": "Develop, refine, validate, and manage project plans to ensure on-time and on-budget delivery of major technology initiatives across the enterprise."
    },
    {
      "duty": "Provide timely and concise communications to functional leadership regarding project status and pending issues; analyze processes and make recommendations for optimizing resources and product delivery."
    },
    {
      "duty": "Build consensus among multiple process leads relative to project scope, task execution, staffing, and issue resolution."
    },
    {
      "duty": "Identify potential risks within the project; proactively manage issues."
    },
    {
      "duty": "Participate in identifying project costs, resource allocation, project schedule changes, and issue escalation."
    },
    {
      "duty": "Provide overall financial direction for the projects to manage the development of budgets, controls, and measurements to monitor project progress."
    },
    {
      "duty": "Broker services within vendors on behalf of the business area represented."
    },
    {
      "duty": "Perform related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration or related field (Master's preferred)"
    }
  ]
}