{
  "meta": [
    {
      "job_title": "Dealership Operations Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Operations",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Operational Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee daily valet operations for assigned dealership location(s), including working as valet, greeting customers, washing and parking vehicles, and running the daily operations of all assigned account(s)."
    },
    {
      "duty": "Motivate and empower a team to provide world-class hospitality and effectively manage people, holding them accountable to expectations."
    },
    {
      "duty": "Create and manage the schedule, daily reports, and budget allocation, and be directly responsible for client satisfaction."
    },
    {
      "duty": "Responsible for the accountability of Account Managers, shift leads, team leads, and valet team members for all assigned location(s)."
    },
    {
      "duty": "Maintain proper staffing levels and create weekly schedules for all location(s) within their portfolio. Administer and embody the company’s disciplinary action process and provide support to the Account Manager(s)."
    },
    {
      "duty": "Identify and make changes for operations, safety, or procedural updates as needed. Assist in communicating these updates to corporate."
    },
    {
      "duty": "Directly responsible for building standard operating procedures and location pages for all current or new account(s) assigned, and ensure Account Managers are making the necessary edits."
    },
    {
      "duty": "Launching new locations within the assigned portfolio, administering local orientations and driving tests in coordination with Human Resources."
    },
    {
      "duty": "Create and implement site-specific training, identify and build additional training needs as needed at assigned location(s)."
    },
    {
      "duty": "Responsible for account manager remaining compliant with budget allocation, attending to any escalated customer and client complaints, and handling incident claims and denial of claims."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree is preferred but not required"
    }
  ]
}