{
  "meta": [
    {
      "job_title": "Coordinator of Payroll Reporting",
      "job_category": "Finance",
      "job_class": "Coordinator",
      "sector": "Finance",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Payroll Reporting",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "File Generation",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Systems Management",
      "experience": 5
    },
    {
      "skill": "Data Security",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages the payroll reporting process, including file generation, submission, and edits under time constraints."
    },
    {
      "duty": "Analyzes complex data relationships, identifies data inconsistencies, draws logical conclusions, and determines resolutions to the inconsistencies."
    },
    {
      "duty": "Troubleshoots data errors and repairs or notifies the appropriate offices of said errors."
    },
    {
      "duty": "Ensures security of payroll files and the file transfer process."
    },
    {
      "duty": "Maintains a commitment to data accuracy and data integrity."
    },
    {
      "duty": "Keeps up-to-date on payroll reporting changes and advises College officials of said changes."
    },
    {
      "duty": "Participates in state and institutional listservs and data user groups."
    },
    {
      "duty": "Serves as a technical resource for the payroll reporting process."
    },
    {
      "duty": "Serves as a data source for internal auditors and district administration in accordance with FERPA regulations."
    },
    {
      "duty": "Completes all required training and professional development sessions sponsored."
    },
    {
      "duty": "Supports the values of the College: diversity, teaching excellence, student success, innovation and creativity and service to the College"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or General Equivalency Diploma (GED)"
    },
    {
      "credential": "Five (5) years of work experience in a Finance and/or Payroll related area."
    },
    {
      "credential": "Reporting experience is required with Teacher Retirement System (TRS) reporting experience strongly preferred."
    },
    {
      "credential": "Knowledge of payroll, insurance, and other benefits programs."
    },
    {
      "credential": "Experience working with computerized systems."
    }
  ]
}