{
  "meta": [
    {
      "job_title": "Safety Physician, Global Safety Lead",
      "job_category": "Pharmaceutical",
      "job_class": "Physician",
      "sector": "Safety",
      "salary": 237500,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and perform the assessment of medical safety data for the Company’s assigned products."
    },
    {
      "duty": "Develop and execute safety signaling and benefit risk management strategies."
    },
    {
      "duty": "Closely collaborate with stakeholders internally and externally to ensure the safe use of the Company’s product(s)."
    },
    {
      "duty": "Provide strategic medical safety leadership and practical contributions for the Company’s assigned product(s) in a cross-functional setting."
    },
    {
      "duty": "Perform safety signal management and benefit risk assessment activities as well as other regular and/or ad hoc aggregate safety data reviews."
    },
    {
      "duty": "Lead cross-functional team to perform regular and/or ad hoc review of existing and emerging aggregate safety data for the Company’s assigned product(s)."
    },
    {
      "duty": "Contribute to the development of the overall safety governance structure and activities."
    },
    {
      "duty": "Provide safety strategies and deliver accurate, timely, and high-quality safety contributions for the preparation of relevant sections of regulatory submission documents globally for the Company’s assigned product(s)."
    },
    {
      "duty": "Prepare and/or review safety sections of clinical/regulatory documents."
    },
    {
      "duty": "Provide medical safety support for the preparation of responses to regulatory authority inquiries."
    },
    {
      "duty": "Lead the overall preparation of periodic safety reports, providing medical safety content and ensuring consistency and quality of such documents."
    },
    {
      "duty": "Oversee the medical assessment of individual Case Safety Reports."
    },
    {
      "duty": "Confirm criteria and content for expedited reporting and unblinding."
    },
    {
      "duty": "Lead or actively contribute to the preparations and presentation of safety information to the Data Safety Monitoring Board."
    },
    {
      "duty": "Provide medical safety contributions at internal audits and regulatory inspections."
    },
    {
      "duty": "Support the development of, and updates to, GPS Standard Operating Procedures (SOPs), and other controlled documents."
    },
    {
      "duty": "Support adverse event reporting training and pharmacovigilance awareness activities cross-functionally."
    },
    {
      "duty": "Support the preparation of pharmacovigilance agreements with clinical development or commercial business partners."
    },
    {
      "duty": "Participate in cross-functional teams and initiatives."
    },
    {
      "duty": "Perform other tasks as required to assist in department activities."
    }
  ],
  "skills": [
    {
      "skill": "Medical Safety Leadership",
      "experience": 7
    },
    {
      "skill": "Safety Signal Management",
      "experience": 7
    },
    {
      "skill": "Regulatory Submissions",
      "experience": 7
    },
    {
      "skill": "Cross-functional Collaboration",
      "experience": 7
    },
    {
      "skill": "Safety Governance",
      "experience": 7
    },
    {
      "skill": "Clinical/Regulatory Document Review",
      "experience": 7
    },
    {
      "skill": "Periodic Safety Reports",
      "experience": 7
    },
    {
      "skill": "Medical Assessment",
      "experience": 7
    },
    {
      "skill": "Case Safety Reports",
      "experience": 7
    },
    {
      "skill": "Expedited Reporting",
      "experience": 7
    },
    {
      "skill": "Safety Information Presentation",
      "experience": 7
    },
    {
      "skill": "Standard Operating Procedures (SOPs) Development",
      "experience": 7
    },
    {
      "skill": "Pharmacovigilance Agreement Preparation",
      "experience": 7
    },
    {
      "skill": "Adverse Event Reporting Training",
      "experience": 7
    },
    {
      "skill": "Cross-functional Team Participation",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 190,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "MD degree, or equivalent required."
    },
    {
      "credential": "At least 7 years’ relevant experience in the pharmaceutical/biotech industry, with at least 5 years in pharmacovigilance/drug safety. Global experience is a plus."
    },
    {
      "credential": "At least 1 year of experience in clinical practice or in academic medicine."
    },
    {
      "credential": "Working knowledge of relevant pharmacovigilance regulatory requirements and guidance documents."
    },
    {
      "credential": "Experience with authoring complex documents and contributing to regulatory submissions."
    },
    {
      "credential": "Knowledge of adverse event reporting systems."
    },
    {
      "credential": "Experience in epidemiology, biostatistics, clinical development, or medical affairs is a plus."
    },
    {
      "credential": "Strong scientific and analytical skills."
    },
    {
      "credential": "Strong ability to lead, motivate, influence, and collaborate with multidisciplinary teams."
    },
    {
      "credential": "Approximately 15% travel."
    }
  ]
}