{
  "meta": [
    {
      "job_title": "Special Education Teacher",
      "job_category": "Education",
      "job_class": "Teacher",
      "sector": "Education",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, prepare, and implement the instructional process for students with Individualized Education Plans (IEPs) within the learning center and/or classroom."
    },
    {
      "duty": "Provide a collaborative environment for students, parents, center staff, and administrative personnel."
    },
    {
      "duty": "Establish a climate that promotes a firm, fair, and respectful classroom environment with a focus on social development and group responsibility."
    },
    {
      "duty": "Implement established school-wide and classroom PBIS programs, reinforcement systems, behavioral expectations, and consequence guidelines."
    },
    {
      "duty": "Record student progress/records, maintain student files, and prepare reports on students and activities."
    },
    {
      "duty": "Provide direct subject based instruction and/or work in a team environment to collaboratively and/or co-teach curricular subjects as required in IEP."
    },
    {
      "duty": "Modify curriculum and assist with differentiated instruction for students as well as staff."
    },
    {
      "duty": "Use a variety of instructional strategies and resources to respond to the diverse needs and interests of students; including prescribed educational software and intervention curriculum."
    },
    {
      "duty": "Act as a case manager to special education students which may include updating IEP's and goals if required by the district."
    },
    {
      "duty": "Prepare daily lesson plans and materials for assigned class."
    },
    {
      "duty": "Report incidents (e.g. fights, suspected child abuse, suspected substance abuse, etc.) in order to maintain the personal safety of students and adhere to State and Federal law."
    },
    {
      "duty": "Maintain the physical center, furniture, and supplies in a neat and orderly condition according to procedure."
    },
    {
      "duty": "Ensure that the center and outside surrounding area are neat, clean, well maintained and present an organized and professional environment conducive to the education of students."
    },
    {
      "duty": "Keep up to date with research-based practices and developments in subject area."
    },
    {
      "duty": "Respond constructively to formal and informal feedback."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 160,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors degree or higher in education or related field."
    },
    {
      "credential": "Meet state teaching certification and/or licensing requirements."
    },
    {
      "credential": "Active special education certification."
    },
    {
      "credential": "Prior experience working with curriculum development, differentiation, and instruction in a classroom setting."
    },
    {
      "credential": "Solid motivational, problem-solving, decision-making, and organizational skills."
    },
    {
      "credential": "Willingness to be flexible and adapt to changing priorities and new initiatives."
    },
    {
      "credential": "Strong oral and written communication."
    },
    {
      "credential": "Highly skilled in working with students with diverse needs."
    }
  ]
}