{
  "meta": [
    {
      "job_title": "Restaurant General Manager",
      "job_category": "Food Service",
      "job_class": "Manager",
      "sector": "Hospitality",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Recruiting",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    },
    {
      "skill": "Talent Management",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Development",
      "experience": 5
    },
    {
      "skill": "Operational Excellence",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead by example to gain commitment from Family Members by reinforcing team behaviors consistent with Whataburger Core Values and Guiding Principles."
    },
    {
      "duty": "Provide leadership and mentoring to Family Members; accountable for the in-restaurant Family Member experience, aligns the team around a common vision, provides effective coaching, sets realistic expectations, holds themselves and others accountable, and celebrates successes."
    },
    {
      "duty": "Models High Performing Team behaviors and foster relationships through open and honest communications, coaching, and engagement."
    },
    {
      "duty": "Facilitates discussions among Family Members and Managers to ensure expectations are clear, share best practices, address underperforming areas, and resolve open questions."
    },
    {
      "duty": "Exercises high level of independent judgment and discretion in managing the daily operations of the restaurant to ensure effective and efficient performance of the restaurant and its Family Members in all Whataburger operational and customer experience standards."
    },
    {
      "duty": "Demonstrates ownership for growing Managers' and Team Leaders' capabilities by creating tailored development plans and establishing effective feedback mechanisms."
    },
    {
      "duty": "Trains and coaches Team Leaders and Managers, empowering them to lead their shift and focus on developing their Family Members."
    },
    {
      "duty": "Coaches and encourages Managers and Team Leaders on ways to effectively work as a High Performing Team and use operational tools to improve restaurant performance."
    },
    {
      "duty": "Identifies Managers, Team Leaders and Team Members with potential to progress to the next level. Works with the Family Member to develop the necessary skills and behaviors to be considered for promotion. Evaluates progress and provides feedback."
    },
    {
      "duty": "Participates in inter-restaurant collaboration through sharing best practices, individual perspectives and supporting other restaurants in area."
    },
    {
      "duty": "Leads recruiting, interviewing, and hiring to achieve staffing levels to drive, maintain, and sustain Restaurant High Performing Teams."
    },
    {
      "duty": "Develops the budget, expense plans, and sales goals as part of financial planning in order to achieve financial targets; manages profit and loss, oversee financial tasks such as cash reporting, labor, food expenses, repairs and maintenance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma/GED or equivalent work experience"
    }
  ]
}