{
  "meta": [
    {
      "job_title": "Senior Mechanical Engineer",
      "job_category": "Engineering",
      "job_class": "Senior",
      "sector": "Aerospace",
      "salary": 135000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "CAD Design",
      "experience": 5
    },
    {
      "skill": "Geometric Dimensioning and Tolerancing (GD&T)",
      "experience": 5
    },
    {
      "skill": "Mechanical Design",
      "experience": 5
    },
    {
      "skill": "Composite Manufacturing",
      "experience": 5
    },
    {
      "skill": "Finite Element Analysis (FEA)",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Materials Selection",
      "experience": 5
    },
    {
      "skill": "Aircraft Systems Design",
      "experience": 5
    },
    {
      "skill": "Prototyping",
      "experience": 5
    },
    {
      "skill": "Research and Development (R&D)",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Testing and Verification",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop innovative mechanical components, intricate mechanisms, and complex assemblies starting from initial concepts, progressing through detailed design, up to finalizing production-ready components."
    },
    {
      "duty": "Formulate designs compatible with diverse manufacturing techniques for metals, such as stamping, machining, and welding."
    },
    {
      "duty": "Create designs compatible with diverse manufacturing techniques for polymers, encompassing injection molding, 3D printing, roto-molding, and more."
    },
    {
      "duty": "Design components considering diverse manufacturing methods involving composites, including carbon fiber and fiberglass."
    },
    {
      "duty": "Demonstrate a comprehensive grasp of Geometric Dimensioning and Tolerancing (GD&T) principles and effectively integrate them into design drawings."
    },
    {
      "duty": "Conduct comprehensive and regular tolerance analyses to ensure the feasibility of manufacturing processes."
    },
    {
      "duty": "Engage in the design of mechanical elements within the scope of aircraft systems, encompassing flight controls, landing gear, windows, doors, and related components."
    },
    {
      "duty": "Utilize Creo (Pro/E) CAD software to perform robust solid modeling during the design process."
    },
    {
      "duty": "Manage the lifecycle of aircraft components and assemblies by employing Windchill PDMLink."
    },
    {
      "duty": "Determine component strength through initial hand calculations and FEA simulations, potentially leveraging software like Femap for stress analysis."
    },
    {
      "duty": "Supervise project timelines for assigned tasks, ensuring projects are completed punctually and proficiently."
    },
    {
      "duty": "Provide continuous support to the production line and post-sales assistance by upholding and improving designs."
    },
    {
      "duty": "Serve as a pivotal contributor to Research and Development (R&D) efforts, engaging in the production and testing of prototype components, assemblies, or systems."
    },
    {
      "duty": "Lead larger-scale design projects, showcasing leadership capabilities and fostering collaborative teamwork."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Mechanical and/or Aerospace Engineering."
    }
  ]
}