{
  "meta": [
    {
      "job_title": "Senior AEM Developer",
      "job_category": "Software Engineering",
      "job_class": "Senior Developer",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Java",
      "experience": 5
    },
    {
      "skill": "AEM",
      "experience": 5
    },
    {
      "skill": "Adobe Experience Manager/CQ5",
      "experience": 5
    },
    {
      "skill": "Web Development",
      "experience": 6
    },
    {
      "skill": "Integration Patterns",
      "experience": 6
    },
    {
      "skill": "HTML5",
      "experience": 5
    },
    {
      "skill": "CSS3",
      "experience": 5
    },
    {
      "skill": "JavaScript",
      "experience": 5
    },
    {
      "skill": "RESTful Web Services",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop digital consumer experiences based on foundation of the Adobe AEM product suite, including AEM, CRX, Target and DAM."
    },
    {
      "duty": "Translate marketing and web site needs into AEM specific recommendations and solutions."
    },
    {
      "duty": "Design and improve internal development methodologies around Adobe AEM solution."
    },
    {
      "duty": "Deliver a robust self-service environment for the end user community."
    },
    {
      "duty": "Design and code from specifications, analyzes, evaluates, tests, debugs, documents, and implements complex software apps."
    },
    {
      "duty": "Create and integrate content-driven applications on top of AEMs core platform and integrate with E-commerce solutions and search engines."
    },
    {
      "duty": "Work with technology teams to build and maintain web applications using Adobe's Experience Manager CMS to include site architecture, custom components, workflow development, Digital Asset Management (DAM)."
    },
    {
      "duty": "Integrate websites with web analytics tools and analyze/report on analytics data."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Computer Science or related field (Associate’s Degree accepted)"
    },
    {
      "credential": "5-7 years in Internet related system development for a public-facing internet web site."
    },
    {
      "credential": "Experience working with CMS platforms, and at least 5 years of experience building with Adobe Experience Manager/CQ5."
    },
    {
      "credential": "Ability to write complex programs, analyze code changes and make suggestions to improve code complexity for maintainability and scalability."
    },
    {
      "credential": "Knowledge and demonstrated experience with cross-browser, cross-platform, cross-device issues (IE, Firefox, Safari, mobile devices, etc.)"
    }
  ]
}