{
  "meta": [
    {
      "job_title": "CPG Sales Representative",
      "job_category": "Sales",
      "job_class": "Sales Representative",
      "sector": "Sales",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Experience",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 4
    },
    {
      "skill": "Mandarin or Cantonese Fluency",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 4
    },
    {
      "skill": "Microsoft Software",
      "experience": 5
    },
    {
      "skill": "CRM Software",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Achieve sales and profitability targets within a specified territory, building customer relationships and business scale."
    },
    {
      "duty": "Strategically identify opportunities for business growth, increasing existing product distribution within current accounts, finding new accounts, and launching new products within accounts."
    },
    {
      "duty": "Manage promotional spend within assigned budget and constantly seek to improve spend:result ratio."
    },
    {
      "duty": "Analyze, plan, and provide solutions to customers, such as distributors, stores, and restaurants."
    },
    {
      "duty": "Build strong customer relationships by regular sales calls and frequent communication with customer personnel."
    },
    {
      "duty": "Implement in-store/restaurant promotional activities to maximize brand presence and product turnover."
    },
    {
      "duty": "Provide merchandising expertise and support retailers to expand product placement/visibility in-store."
    },
    {
      "duty": "Participate in events to build a larger customer base and prospect for new events."
    },
    {
      "duty": "Resolve customer complaints by investigating problems, developing solutions, and recommending improvements."
    },
    {
      "duty": "Submit activity and results reports, such as daily call reports, weekly work plans, and monthly and annual territory analyses of sales metrics, sales activities, market trends, and competitive environment."
    },
    {
      "duty": "Maintain exhaustive, accurate, and up-to-date sales call and customer/territory information."
    },
    {
      "duty": "Monitor competition by gathering current marketplace information on pricing, products, new products, delivery schedules, and merchandising techniques."
    },
    {
      "duty": "Cooperate and communicate with other departments, especially marketing and supply chain."
    },
    {
      "duty": "Recommend changes in job content, products, services, and policies by evaluating current results, competitive developments, etc."
    },
    {
      "duty": "Actively improve own selling skills and performance by constantly seeking feedback and input from others."
    },
    {
      "duty": "Comply with all organizational processes and policies, exhibiting One Team Spirit."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Sales, or a related field (MBA preferred)"
    }
  ]
}