{
  "meta": [
    {
      "job_title": "Community Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 62000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management (CRM)",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Facility Inspection",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Procurement",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise the operation and administration of the Association in accordance with management agreement and the Association's policies and procedures."
    },
    {
      "duty": "Acts as or oversee the primary liaison with the Association Board of Directors and homeowners as needed."
    },
    {
      "duty": "Ensure Associa community management tools are being effectively developed and utilized such as annual calendar, action item list, resolution worksheets, timed agendas, RFP matrixes, committee charters, procurement procedures, FY operating budget, etc."
    },
    {
      "duty": "Review monthly financial reports and ensure management summary is submitted to the association Board of Directors."
    },
    {
      "duty": "Provide and/or oversee recommendations to the Association Board of Directors and committees regarding major capital expenditures as required to maintain the desired community appearance and operation."
    },
    {
      "duty": "Monitor corporate and client delinquency rates and collections process for account portfolio."
    },
    {
      "duty": "Attend Board meetings per the management agreement and community events as needed."
    },
    {
      "duty": "Prepare Board packages according to established time frames."
    },
    {
      "duty": "Ensure Board of Directors is aware of legal actions involving the Association."
    },
    {
      "duty": "Maintain unit and contract files relating to the operations of the Association."
    },
    {
      "duty": "Assist Board of Directors/ARB with architectural review process and/or routine inspections as necessary."
    },
    {
      "duty": "Responsible for maintenance of C3 data base, including updating resident information."
    },
    {
      "duty": "Responsible for routine and special project vendor management including procurement as well as performance evaluation as contracted."
    },
    {
      "duty": "Responsible for oversight of Associa staff as contract provides."
    },
    {
      "duty": "Coordinate and/or oversee inspection of building facilities and/or common area and arrange appropriate follow up actions as required."
    },
    {
      "duty": "Oversee the AP process in accordance with Associa home office processes and procedures."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 85
    }
  ],
  "education_certification": [
    {
      "credential": "Associates Degree Required. Bachelor's Degree Preferred."
    }
  ]
}