{
  "meta": [
    {
      "job_title": "Medical Strategy Senior Manager",
      "job_category": "Healthcare",
      "job_class": "Senior Manager",
      "sector": "Medical Strategy",
      "salary": 163000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medical Strategy",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Medical Development",
      "experience": 5
    },
    {
      "skill": "Clinical Research",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and maintain the integrated Medical strategy for Precision Oncology product area to support business growth."
    },
    {
      "duty": "Lead annual Medical Innovation and Ideation sessions; socialize key takeaways."
    },
    {
      "duty": "Track and provide regular status updates on objectives and key results (OKRs) linked to the integrated Medical strategy."
    },
    {
      "duty": "Facilitate evidence generation and Medical strategy meetings in collaboration with Medical and Commercial team leads."
    },
    {
      "duty": "Identify and communicate process/procedure gaps to Medical Strategy team lead; oversee related workstreams to fill these gaps."
    },
    {
      "duty": "Maintain regular attendance and compliance with company policies and procedures."
    },
    {
      "duty": "Provide onboarding support to new team members and personnel from other functions."
    },
    {
      "duty": "Engage in Medical Strategy team meetings and remain current on relevant business decisions."
    },
    {
      "duty": "Participate in Medical Development team meetings, clinical teams study review meetings, and product-specific core team meetings."
    },
    {
      "duty": "Identify and communicate need for external contractors to Medical Strategy team leadership when demands on team exceed available resources."
    },
    {
      "duty": "Provide inputs into long- and short-range plans, budgeting, and resource allocation."
    },
    {
      "duty": "Comply with the company's Quality Management System policies and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in a field related to the essential duties"
    }
  ]
}