{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Sales/Customer Service",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for providing high-quality, quick service to customers by processing orders, quotes and assisting customers with product information before, during, and after a purchasing transaction."
    },
    {
      "duty": "Receive and ensure orders are entered accurately via phone or email by reviewing and verifying all material entered."
    },
    {
      "duty": "Comprehend and easily maneuver through various computer programs to process transactions and provide basic product information to customers."
    },
    {
      "duty": "Determine customer expectations and provide options for resolution to meet their needs."
    },
    {
      "duty": "Maintain specified pricing guidelines and obtain approvals from Management for any exceptions."
    },
    {
      "duty": "Generate new and repeat sales by providing product and technical information in a timely manner."
    },
    {
      "duty": "Increase sales and average order size by means of cross-selling, up-selling, and add-on sales."
    },
    {
      "duty": "Constantly demonstrate a positive attitude toward self and others by interacting effectively and maintaining a professional manner and positive attitude through verbal and written contacts with external and internal contacts."
    },
    {
      "duty": "Support local Customer Service teams and provide support for other teams when needed."
    },
    {
      "duty": "Regular attendance at work is an essential part of the job."
    },
    {
      "duty": "Supports supervisor with updates on work queue status, in regular intervals."
    },
    {
      "duty": "Supports new joiners or existing team members to improve their performance."
    },
    {
      "duty": "Effectively and efficiently able to resolve complex customer inquiries and problems."
    },
    {
      "duty": "Support coaching of Customer Service Representative staff."
    },
    {
      "duty": "Research, evaluate, & recommend external tools for efficiency improvements."
    },
    {
      "duty": "Lead peers in learning and building customer service processes and service excellence skills."
    },
    {
      "duty": "Drive continuous improvements to further skills and customer service best practices."
    }
  ],
  "skills": [
    {
      "skill": "Effective Communication",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Adaptability",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent"
    },
    {
      "credential": "Bachelor's degree in Business, Administration, or a related field (Master's preferred)"
    }
  ]
}