{
  "meta": [
    {
      "job_title": "Client Service Representative",
      "job_category": "Client Service",
      "job_class": "Representative",
      "sector": "Finance",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Client Sales",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Financial Solutions",
      "experience": 3
    },
    {
      "skill": "Cross-selling",
      "experience": 3
    },
    {
      "skill": "Consumer Lending",
      "experience": 3
    },
    {
      "skill": "Bank Operations",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Sales Techniques",
      "experience": 3
    },
    {
      "skill": "Product Knowledge",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide industry-leading client service in person and over the phone, developing and expanding client relationships."
    },
    {
      "duty": "Offer financial solutions based on consultative conversations and refer clients to other business partners for additional growth opportunities."
    },
    {
      "duty": "Support teller transactions as needed and contribute to meeting or exceeding client service and sales targets."
    },
    {
      "duty": "Conduct consultative conversations, act upon or refer complex client needs or financial goals to other internal specialists."
    },
    {
      "duty": "Participate in all components of the established Truist Retail Community Bank Leadership Routines."
    },
    {
      "duty": "Advance individual knowledge of sales techniques and product knowledge to better serve consumer and business clients."
    },
    {
      "duty": "Advise on consumer lending options and take loan applications."
    },
    {
      "duty": "Adhere to internal controls, operational procedures, and risk management policies."
    },
    {
      "duty": "Engage clients with courteous conversation, conduct transactions, and uncover needs while ensuring a consistent client service experience."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent education. Must be SAFE (Mortgage Licensing Act) compliant within 30 days of employment in this role, including new or transfer of registration and applicable NMLS background check."
    }
  ]
}