{
  "meta": [
    {
      "job_title": "Senior QA Engineer",
      "job_category": "Quality Assurance",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Software Testing",
      "experience": 6
    },
    {
      "skill": "Quality Assurance",
      "experience": 6
    },
    {
      "skill": "Automation Testing",
      "experience": 3
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "Test Automation Frameworks",
      "experience": 5
    },
    {
      "skill": "Agile Environment",
      "experience": 6
    },
    {
      "skill": "Test Scripting",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Organizing and leading testing efforts, working with project teams to understand system requirements and specifications."
    },
    {
      "duty": "Developing Quality Assurance and testing strategies, creating comprehensive testing plans for new and existing systems."
    },
    {
      "duty": "Participating in requirements and design meetings to establish test effort estimates."
    },
    {
      "duty": "Analyzing project documentation, release notes, and other documentation to identify test scenarios."
    },
    {
      "duty": "Translating requirements, release notes, and design documentation into test cases, building test cases, test sets, and test scripts for Backend, Database, and UI validations."
    },
    {
      "duty": "Capturing the design of test cases and test procedures in Quality Center and Azure Dev Ops, overseeing and executing test scripts and results validation on projects."
    },
    {
      "duty": "Ensuring all Quality Assurance and testing activities are conducted throughout the life cycle and that the results from these activities are verified."
    },
    {
      "duty": "Facilitating defects tracking and problem determination throughout the lifecycle."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 75,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Computer Science or related analytical field or equivalent experience (Master's preferred)"
    }
  ]
}