{
  "meta": [
    {
      "job_title": "Content Specialist",
      "job_category": "Content",
      "job_class": "Specialist",
      "sector": "Assessment & Qualifications",
      "salary": 58000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Project Lead – Responsible for the daily functions of one or more handscoring contracts, coordinating with program and project managers to ensure project readiness, managing a team of Scoring Directors, Supervisors, and Scorers, and performing post-project work and data analysis."
    },
    {
      "duty": "Content Expertise – Thorough knowledge of science topics used for Elementary, Middle, and High School Science, and an ability to understand and apply state and national science standards, developing item-specific training, and providing expertise in meetings with clients and educators."
    },
    {
      "duty": "Logistics and Communication – Clear communication to a variety of roles daily is required, including communication via chat, email, phone, posted reports, and videoconference meetings. In-person and virtual interactions with the customer and other educators are expected."
    },
    {
      "duty": "Training and Coaching – Mentoring and training Scoring Directors, Supervisors, and Scorers in the expectations of their roles, as well as live training or pre-recorded module Science and potentially Math items to a large and varied scorer population."
    }
  ],
  "skills": [
    {
      "skill": "Science Knowledge",
      "experience": 5
    },
    {
      "skill": "Training & Mentoring",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required; degree within Life Science or Physical Sciences is strongly preferred. Additional Math college courses are preferred. Two (2) years assessment industry experience as a Scoring Director or other scoring team lead or equivalent experience."
    }
  ]
}