{
  "meta": [
    {
      "job_title": "BI Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Business Intelligence",
      "experience": 10
    },
    {
      "skill": "Technical Team Management",
      "experience": 10
    },
    {
      "skill": "Data Analytics",
      "experience": 10
    },
    {
      "skill": "Strategic Thinking",
      "experience": 10
    },
    {
      "skill": "Statistical Analysis",
      "experience": 10
    },
    {
      "skill": "MS PowerBI",
      "experience": 10
    },
    {
      "skill": "SQL",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Define and deliver data solutions and contribute to the development and implementation of IT business analytics plans."
    },
    {
      "duty": "Act as Lead Architect on major data programs and build and maintain strong relationships with business partners."
    },
    {
      "duty": "Provide deep hands-on experience in customer analytics, statistical analysis, predictive modeling, and management of the BI team."
    },
    {
      "duty": "Manage a team of BI professionals and be responsible for the development, growth, and performance of the team."
    },
    {
      "duty": "Participate in due diligence and evaluation of systems for M&A integration."
    },
    {
      "duty": "Participate in cross-organizational teams to develop solutions meeting the needs of SP&C."
    },
    {
      "duty": "Manage Data Warehouse help desk tickets and handle BI Analyst progress on reports."
    },
    {
      "duty": "Perform other duties as assigned and may require some travel."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in data analytics, data science, computer science, management information systems, finance, statistics, or related field required; MBA or post-graduate degree preferred."
    },
    {
      "credential": "Previous supervisory experience required; must be able to manage a technical team consisting of 5+ professionals."
    }
  ]
}