{
  "meta": [
    {
      "job_title": "Data governance SME in Health Care",
      "job_category": "Technology",
      "job_class": "SME",
      "sector": "Health Care",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Legislative Analysis",
      "experience": 5
    },
    {
      "skill": "Policy Drafting",
      "experience": 5
    },
    {
      "skill": "Data Governance",
      "experience": 5
    },
    {
      "skill": "Work Group Facilitation",
      "experience": 5
    },
    {
      "skill": "Health Care Experience",
      "experience": 5
    },
    {
      "skill": "Application Design",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review and synthesize legislation and determine applicability to HHS data governance."
    },
    {
      "duty": "Formulate strategy of HHS data governance and translate it into a plan of action."
    },
    {
      "duty": "Draft policy for Federal Agencies and conduct and document policy review processes."
    },
    {
      "duty": "Translate data governance principals into tangible action plans and work with senior leadership in large organizations."
    },
    {
      "duty": "Lead and facilitate work groups across diverse stakeholder groups and use tools and techniques to facilitate work group discussions."
    },
    {
      "duty": "Work in health care, Federal agencies with health-related missions, and have knowledge of a broad range of public health services and issues."
    },
    {
      "duty": "Have knowledge of health care data, health care data standards, and understanding of health care data challenges."
    },
    {
      "duty": "Engage users in defining requirements, collaborate with developers to understand user requirements, conduct surveys and interviews, and synthesize data and interview findings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Health Care, Policy, or a related field (Master's preferred)"
    }
  ]
}