{
  "meta": [
    {
      "job_title": "IT Operations Support Administrator IV",
      "job_category": "IT",
      "job_class": "Operations Support",
      "sector": "Software Engineering",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Team Building",
      "experience": 5
    },
    {
      "skill": "Data Understanding",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "System Analysis",
      "experience": 5
    },
    {
      "skill": "Network Administration",
      "experience": 5
    },
    {
      "skill": "System Administration",
      "experience": 5
    },
    {
      "skill": "Technical Support",
      "experience": 5
    },
    {
      "skill": "ITIL Concepts",
      "experience": 5
    },
    {
      "skill": "Customer Satisfaction Analysis",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead an 8x5 Service Desk team supporting over 2500 employees."
    },
    {
      "duty": "Implement ITIL concepts ensuring all work processes are planned, documented, tested, and consistently reviewed for improvement opportunities."
    },
    {
      "duty": "Ensure Service Desk is aware of all projects, initiatives, or changes that impact services."
    },
    {
      "duty": "Promote the Service Desk within the organization as the primary means of interacting with IT."
    },
    {
      "duty": "Develop new ways to interact with the service desk, such as chat and developing customer knowledge bases."
    },
    {
      "duty": "Actively participate in meetings such as: change, release, asset, and problem management meetings."
    },
    {
      "duty": "Sustain a culture of continuous process improvement; actively seeking input from internal and external stakeholders."
    },
    {
      "duty": "Track customer satisfaction survey trends to identify problem areas, identify root problem, create, and apply countermeasures to prevent future occurrences."
    },
    {
      "duty": "Develop performance targets reflecting customer expectations. Create dashboards and reports measuring success in meeting targets against industry benchmarks."
    },
    {
      "duty": "Train service-desk staff on new technologies or coordinate training with other IT subject matter experts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree in computer science or a closely related field from an accredited college or university (Bachelor's preferred)"
    }
  ]
}