{
  "meta": [
    {
      "job_title": "Site Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Permitting and Approvals",
      "experience": 5
    },
    {
      "skill": "Subcontractor Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate all subcontractors and manage the day-to-day activities of construction, including scheduling, inspections, quality control, safety, monitoring of construction budgets, and accountability for all related expenditures."
    },
    {
      "duty": "Work closely with Project Management for utilities, permits, plan checks, and Certificates of Occupancy to obtain all necessary approvals."
    },
    {
      "duty": "Direct subcontractors and subordinates."
    },
    {
      "duty": "Provide periodic written reporting and scheduling updates."
    },
    {
      "duty": "Evaluate situations and render decisions on certain issues without immediate supervision."
    },
    {
      "duty": "Maintain a safe and compliant work site on a daily basis."
    },
    {
      "duty": "Relate favorably with others beyond giving and receiving instructions; performs work activities requiring negotiating, instructing, supervising, persuading or speaking with others and responding appropriately."
    },
    {
      "duty": "Effectively influence people on a consistent basis."
    },
    {
      "duty": "Make generalizations, evaluations or decisions without immediate supervision."
    },
    {
      "duty": "Accept and carry out responsibility for direction, control, and planning."
    },
    {
      "duty": "Must be willing to travel as required by location of project."
    },
    {
      "duty": "Must attend company sponsored events that relate to the development of the team, which, from time to time, may include overnight stays at locations away from the employee's home."
    },
    {
      "duty": "Experience working with city, government, and other inspectors on construction projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, College degree with emphasis in Construction Management is preferred, OSHA 30 Hour Construction Safety Training is preferred"
    }
  ]
}