{
  "meta": [
    {
      "job_title": "Manager of Procurement Processes & Systems",
      "job_category": "Procurement",
      "job_class": "Manager",
      "sector": "Procurement",
      "salary": 115000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops, deploys and optimizes the Source to Pay (S2P) process to meet business needs to reduce the total cost of goods and services purchased, while also reducing staff time and costs to perform these transactions."
    },
    {
      "duty": "Implements, tests, and monitors procurement tools and data flow to ensure accurate and timely reporting."
    },
    {
      "duty": "Establish best practices in alignment with Procurement policies, procedures, and ESG strategies."
    },
    {
      "duty": "Monitor procurement policy compliance and adherence to guidelines and best practices."
    },
    {
      "duty": "Responsible for development, delivery, and maintenance of S2P related training materials for new hires and on-going re-training."
    },
    {
      "duty": "Leads change management necessary to implement process improvements Company wide."
    },
    {
      "duty": "Develops, optimizes and communicates S2P Key Performance Indicators (KPIs) and the metrics to measure them."
    },
    {
      "duty": "Gathers and documents business requirements and determines features and functions of software to be deployed."
    },
    {
      "duty": "Provides external benchmarking of S2P practices for internal improvement."
    },
    {
      "duty": "Participates in external procurement best practices forums both inside & outside the industry."
    },
    {
      "duty": "Helps prioritize, fund, and manage Procurement IS backlog."
    },
    {
      "duty": "Works with business users to fulfill reporting/information needs from the procurement systems."
    },
    {
      "duty": "Actively manages access to S2P systems and ensures training and testing of all S2P users."
    },
    {
      "duty": "Prioritizes and provides scope definition of potential projects including identifying and quantifying project risks and opportunities."
    },
    {
      "duty": "Engages in supervisory responsibilities i.e., involving staffing, conducting performance appraisals, training, and developing subordinates, promotions, salary increases, terminations, disciplinary actions, etc."
    },
    {
      "duty": "Engages in the typical responsibilities of a manager requiring planning, evaluating, organizing, integrating, and controlling."
    },
    {
      "duty": "Performs other job-related tasks as assigned by the Sr. Director – Procurement."
    },
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote freight and logistics services."
    },
    {
      "duty": "Lead a team of marketing specialists, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's online presence, optimizing the website and social media channels for maximum engagement and conversions."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "skills": [
    {
      "skill": "Procurement Management",
      "experience": 10
    },
    {
      "skill": "Change Management",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Process Optimization",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Training and Development",
      "experience": 10
    },
    {
      "skill": "Policy Compliance",
      "experience": 10
    },
    {
      "skill": "Supervisory Skills",
      "experience": 10
    },
    {
      "skill": "Business Process Documentation",
      "experience": 10
    },
    {
      "skill": "IT Tools Implementation",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Vendor Management",
      "experience": 10
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Report Writing",
      "experience": 10
    },
    {
      "skill": "Performance Appraisal",
      "experience": 10
    },
    {
      "skill": "Team Development",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree.MBA preferred.Procurement certification from CIPS, ISM or EIPM preferred.10+ years functional experience in one or more business disciplines. Must be able to understand and design complex business processes. Must be able to ‘think outside the box’ while using common IT tools to implement new processes."
    }
  ]
}