{
  "meta": [
    {
      "job_title": "Assistant Account Manager",
      "job_category": "Security",
      "job_class": "Manager",
      "sector": "Security",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Security Management",
      "experience": 3
    },
    {
      "skill": "Supervisory Skills",
      "experience": 3
    },
    {
      "skill": "Emergency Response",
      "experience": 3
    },
    {
      "skill": "Training and Development",
      "experience": 3
    },
    {
      "skill": "Report Writing",
      "experience": 3
    },
    {
      "skill": "Client Relationship Management",
      "experience": 3
    },
    {
      "skill": "Staff Scheduling",
      "experience": 3
    },
    {
      "skill": "Crisis Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate and supervise all aspects of executing the security contract at the assigned location."
    },
    {
      "duty": "Assign work tasks to Security Professionals and oversee their performance throughout the day."
    },
    {
      "duty": "Be the first direct supervisory contact for shift supervisors or Security Professionals, regarding performance, operations, and department needs."
    },
    {
      "duty": "Conduct interviews and evaluate new employees, delivering on-the-job training and ensuring adherence to post orders and training information."
    },
    {
      "duty": "Oversee all reports, logs, and pass downs generated by the Security Department, ensuring appropriate action is taken for minor incidents."
    },
    {
      "duty": "Identify personnel problems at posts and make recommendations for counseling and disciplinary action, as well as maintaining positive client/security relationships."
    },
    {
      "duty": "Occasionally perform Security Professional type job duties on an as-needed basis but not exceeding more than 50% of time in any given workweek."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent, some college education or business classes desirable, valid state Guard License, background investigation, and drug/alcohol test required, valid Driver’s License and driving experience required."
    }
  ]
}