{
  "meta": [
    {
      "job_title": "Inventory Management Technician",
      "job_category": "Inventory Management",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Supply Chain Management",
      "experience": 1
    },
    {
      "skill": "Cleaning and Disinfecting",
      "experience": 1
    },
    {
      "skill": "Record Keeping",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Inventory Replenishment",
      "experience": 1
    },
    {
      "skill": "Patient Transport",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct daily inventory management processes for supplies, linen, and equipment throughout the Medical Center and maintain related records."
    },
    {
      "duty": "Supply the clinical enterprises with the supplies they need in the right place and quantity."
    },
    {
      "duty": "Participate in the orientation and training of other personnel."
    },
    {
      "duty": "Pick up soiled supplies, linen, and equipment, clean, disinfect, and store equipment."
    },
    {
      "duty": "Assemble, deliver, and pick up oxygen tanks and assist the dispatch function."
    },
    {
      "duty": "Follow hospital infection prevention policies and procedures, and maintain a professional work environment."
    },
    {
      "duty": "Maintain accurate and legible records of transfer of accountability and maintain supply and linen carts in a neat, clean, and orderly fashion."
    },
    {
      "duty": "Make minor repairs to equipment, manage information utilizing appropriate manual or electronic systems, and participate in the orientation and training of other personnel."
    },
    {
      "duty": "Perform patient and supply transport functions, daily inventory of supplies, linen, and equipment, and pick up charges and batches them for transmittal to Data Processing."
    },
    {
      "duty": "Receive and process phone orders for supplies, linen and/or equipment, receive, check in, and store supply and linen shipments, and issue Lab Coats and Surgical scrubs clothes to authorized personnel."
    },
    {
      "duty": "Respond to patient and non-patient emergencies, perform necessary housekeeping tasks to ensure neat and clean linen and supply storage areas, and observe regulations regarding the transport and handling of clean/soiled linens and supplies throughout the Medical Center."
    },
    {
      "duty": "Seek resources for direction when necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED equivalent"
    }
  ]
}