{
  "meta": [
    {
      "job_title": "Technology Program Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Engineering Management",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Innovation Management",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Stakeholder Relations",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage, organize, and control various engineering and strategic initiative activities within designated function of accountability."
    },
    {
      "duty": "Provide central and focused leadership and management of technologies across the organization."
    },
    {
      "duty": "Support regulatory initiatives for new technology and manage the development and implementation of short- and long-term strategic initiatives."
    },
    {
      "duty": "Manages staff reporting directly or indirectly to this position and accountable for assigned budget and human resource needs."
    },
    {
      "duty": "Coordinate across the organization to fully position for improved results through industry partnerships and organizations."
    },
    {
      "duty": "Promote and implement strategies to advance technology usage towards positive results in operating and maintaining systems more reliably, economically, and safely."
    },
    {
      "duty": "Lead partnership efforts with universities, national labs, research institutes, and technology vendors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor Degree in Engineering, equivalent technical degree, or in another applicable field. At least 10 years Professional experience, or relevant experience including at least 5 years utility/technology related experience. Experience in providing leadership and innovation in a high-performance culture. Knowledge, understanding, and experience in distribution systems and emerging technologies. Ability to communicate effectively with internal and external stakeholders."
    },
    {
      "credential": "Professional Engineering Registration. Graduate degree in Engineering, Business Administration, or another applicable field. At least 3 years people management experience. Lead member of industry working group, standard organization or committee. Demonstrated experience working with the DOE, national labs and universities. Working experience with data analytics tools and understanding of data analytics methodologies. Demonstrated Publication record. Outstanding communicator; Inclusive Leader"
    }
  ]
}