{
  "meta": [
    {
      "job_title": "Financial Advisor Assistant",
      "job_category": "Finance",
      "job_class": "Assistant",
      "sector": "Sales",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the general servicing and support of the Financial Advisors. This includes administrative and operational support, business development assistance, and providing a consistent and effective level of client servicing when the Financial Advisor is unavailable."
    },
    {
      "duty": "Assist Financial Advisors in servicing clients including preparing financial plans, conducting investment research and completing client trades and transactions."
    },
    {
      "duty": "Receive and place orders as directed from Financial Advisor and assigned clients."
    },
    {
      "duty": "Process corporate actions where a license is warranted, such as tender offers, optional dividends and the exercise of warrants and rights."
    },
    {
      "duty": "Schedule and confirm client appointments, enter data in SalesForce, create meeting agendas and summaries, prepare/coordinate marking events and perform general administrative functions such as answer and return calls, manage the expense report process, prepare routine client correspondence and perform maintenance of client records."
    },
    {
      "duty": "Maximize sales opportunities by contacting potential investment clients based on internal and bank leads. Use product and industry knowledge to identify existing client, account, and product attributes that present sales potential."
    },
    {
      "duty": "Provide operational guidance to Financial Advisors ranging from systems navigation to document fulfillment."
    },
    {
      "duty": "Ensure new business paperwork is accurately successfully submitted. This includes preparing forms to be presented to clients, obtaining appropriate signatures, submission and follow-up of new account documentation."
    },
    {
      "duty": "Mitigate risk through appropriate authentication standards. This includes the authentication of incoming and outgoing client calls. Required to perform authentication callbacks for high risk transactions, such as third party distributions, profile changes and wires."
    },
    {
      "duty": "Maintain a professional environment and create a positive impression."
    },
    {
      "duty": "Submit and process certain operational requests as instructed by the Financial Advisor and/or client. These may include: funds distributions, deposits of checks, journals, client and account updates, ACAT initiation and other operational tasks."
    },
    {
      "duty": "Work in coordination with the Financial Advisor to ensure certain reports are reviewed and addressed, such as insufficient funds for periodic distributions and RMDs not met."
    },
    {
      "duty": "May assist with physical branch location needs, such as opening, closing, general requests for maintenance or service."
    }
  ],
  "skills": [
    {
      "skill": "Financial Planning",
      "experience": 2
    },
    {
      "skill": "Investment Research",
      "experience": 2
    },
    {
      "skill": "Order Placement",
      "experience": 2
    },
    {
      "skill": "Salesforce Management",
      "experience": 2
    },
    {
      "skill": "Client Servicing",
      "experience": 2
    },
    {
      "skill": "Risk Mitigation",
      "experience": 2
    },
    {
      "skill": "Account Management",
      "experience": 2
    },
    {
      "skill": "Financial Report Review",
      "experience": 2
    },
    {
      "skill": "Administration",
      "experience": 2
    },
    {
      "skill": "Banking Knowledge",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent experience and related training."
    },
    {
      "credential": "FINRA SIE, Financial Industry Regulatory Authority (FINRA) Series 7 and Series 66 licenses."
    }
  ]
}