{
  "meta": [
    {
      "job_title": "Area Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Logistics",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Expense Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Staff Training",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide oversight and intervention of all field operations while administering corporate policies."
    },
    {
      "duty": "Train team members on proper customer service, inventory controls, and communication skills; address team member performance issues; identify and develop promotable team members."
    },
    {
      "duty": "Manage and project ROI, track and maintain field equipment and company vehicles, and complete daily/weekly office duties assigned by upper Management."
    },
    {
      "duty": "Conduct pre-inventory contacts/calls with scheduled stores 1-2 weeks out, review previous week’s projections for goal results, and ensure the district’s needs for people, equipment, supplies, and transportations are in place for the next six months deployment."
    },
    {
      "duty": "Manage inventories start to finish, check all stores and text Regional Manager of status within the first 30 minutes of startups, and monitor and improve performance of all team members on a weekly basis."
    },
    {
      "duty": "Monitor projections to ensure stores are planned for positive ROI, review staffing for correct dot mix, and ensure personnel are scheduled correctly."
    },
    {
      "duty": "Monitor asset management at the district level, enforce all company policies and procedures, and ensure most current updates are on hand."
    },
    {
      "duty": "Perform other duties as directed by the Regional Manager, VP of Field Operations, and the Corporate Office."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Management, Logistics, or a related field (Master's preferred)"
    }
  ]
}