{
  "meta": [
    {
      "job_title": "Business Development Lead",
      "job_category": "Business Development",
      "job_class": "Lead",
      "sector": "Sales",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluate clients' outsourcing requirements and determine the most suitable CROs/CDMOs/CMOs (\"vendors\") from our existing network."
    },
    {
      "duty": "Coordinate with clients and vendors to understand project specifications, timelines, and budgetary constraints."
    },
    {
      "duty": "Conduct market research and identify potential new vendors to expand our network and ensure a diverse range of service offerings."
    },
    {
      "duty": "Initiate vendor selection process, including conducting due diligence, evaluating vendor capabilities, and negotiating contract terms."
    },
    {
      "duty": "Develop and maintain strong relationships with existing vendors, serving as the main point of contact for vendor-related inquiries and issue resolution."
    },
    {
      "duty": "Monitor vendor performance and ensure adherence to agreed-upon service levels and quality standards."
    },
    {
      "duty": "Collaborate with internal teams, such as sales, operations, and project management, to ensure seamless vendor integration and successful project execution."
    },
    {
      "duty": "Keep abreast of industry trends, market developments, and emerging technologies to enhance our vendor selection process and service offerings."
    },
    {
      "duty": "Track and analyze vendor performance metrics, providing regular reports and recommendations to internal stakeholders."
    },
    {
      "duty": "Proactively identify opportunities to optimize vendor costs, improve service quality, and streamline processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in life science-related fields or MBA with 2+ years of industry experience preferred"
    }
  ]
}