{
  "meta": [
    {
      "job_title": "Biometric Technician",
      "job_category": "Technology",
      "job_class": "Technician",
      "sector": "Government",
      "salary": 41808,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Front-line Security",
      "experience": 1
    },
    {
      "skill": "Biometrics Processing",
      "experience": 1
    },
    {
      "skill": "Administrative Duties",
      "experience": 1
    },
    {
      "skill": "Basic Computer Skills",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Complete biometrics registration for applicants seeking legal immigration to the United States."
    },
    {
      "duty": "Provide front-line customer service as representatives of Amentum and on behalf of the United States Government."
    },
    {
      "duty": "Perform quality biometrics processing to include capturing electronic fingerprints, photographs, and signatures within established program-wide processing times."
    },
    {
      "duty": "Utilize crowd control barriers (stanchions or rails) to ensure a safe and organized entry into the facility."
    },
    {
      "duty": "Conducting periodic facility checks (both interior and exterior) reporting any concerns to the Site Supervisor to manage."
    },
    {
      "duty": "Assist the Site Supervisor and/or government Immigration Service Officer in calling local law enforcement or first responders when necessary."
    },
    {
      "duty": "Manage and complete with accuracy administrative paperwork such as tracking processing time for applicants, reconciliation paperwork of biometrics captured, assisting in maintaining a visitor control log for non-applicants entering the facility, signing off on facility checks and other administrative duties as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent."
    }
  ]
}