{
  "meta": [
    {
      "job_title": "Project Design Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Engineering Design",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Equipment Improvement",
      "experience": 5
    },
    {
      "skill": "Technical Leadership",
      "experience": 5
    },
    {
      "skill": "Process Engineering",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "AutoCAD",
      "experience": 5
    },
    {
      "skill": "PLC Programming",
      "experience": 5
    },
    {
      "skill": "Travel Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide technical equipment design support and project management to maintain current markets and pursue new opportunities."
    },
    {
      "duty": "Lead and direct team efforts in a broad variety of equipment related activities and assignments."
    },
    {
      "duty": "Investigate and commercialize improvements to add value and improve customer preference for equipment."
    },
    {
      "duty": "Select, design, evaluate and manage new equipment projects to maintain the leadership position in the industry."
    },
    {
      "duty": "Work with suppliers to identify new or alternate components or methods of executing machine processes."
    },
    {
      "duty": "Lead efforts to identify, coordinate and implement new concepts that improve quality, efficiencies, enhance performance, and reduce costs."
    },
    {
      "duty": "Evaluate proposed projects to effectively manage the business and recommend appropriate course of action."
    },
    {
      "duty": "Lead project teams in the selection, purchase, installation, and debugging of equipment to increase capacity, efficiency, and run new products."
    },
    {
      "duty": "Communicate and document customer requirements, test results, and recommendations in both verbal and written form."
    },
    {
      "duty": "Investigate and communicate innovative technologies to the organization. Network and maintain relationships with vendors to enhance levels of knowledge of new concepts in the marketplace."
    },
    {
      "duty": "Ensure compliance with Food Safety and Food Quality Plans, in addition to customer requirements. Interpret and communicate customer requirements to plant production and/or support groups."
    },
    {
      "duty": "Establish and Audit PCPs, CCPs and Standard Operating Procedures to define and monitor processes, to ensure customer requirements are met. Review incidents during which the procedures are not met, and determine appropriate corrective action for partners failing to follow standard procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 30,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors in Engineering or related field"
    }
  ]
}