{
  "meta": [
    {
      "job_title": "Product Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Product Management",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Customer Collaboration",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of high performing individuals who own the entire product lifecycle from strategy to evaluation."
    },
    {
      "duty": "Work cross-functionally to complete product roadmaps and discover new opportunities."
    },
    {
      "duty": "Lead the planning, execution, and launch of new feature or products updates, ensuring they meet quality standards, are delivered on time, and exceed customer expectations."
    },
    {
      "duty": "Collaborate with marketing and finance team to develop effective product positioning, pricing, messaging, and go-to-market strategies."
    },
    {
      "duty": "Develop and implement product training programs for internal and external teams, such as sales, customer support, and implementation."
    },
    {
      "duty": "Develop product collateral, training materials, documentation, and resources to enable effective understanding and usage of the product by internal teams."
    },
    {
      "duty": "Assist in product launches, including coordinating internal and external sales team, organizing product demos, and driving user adoption."
    },
    {
      "duty": "Analyzing market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a relevant field; additional certifications or advanced degrees are a plus."
    },
    {
      "credential": "Proven experience as a Product Manager or similar role, preferably in the technology industry."
    },
    {
      "credential": "Strong understanding of product management principles and practices, including product lifecycle management and agile methodologies."
    },
    {
      "credential": "Excellent analytical skills with the ability to gather and interpret data to drive product decisions."
    },
    {
      "credential": "Exceptional communication and interpersonal skills to collaborate effectively with cross-functional teams, customers, and vendors."
    },
    {
      "credential": "Strong organizational and project management skills, with the ability to manage multiple projects simultaneously."
    },
    {
      "credential": "Bachelor's degree or equivalent 3+ years of experience in Product Management, Engineering, or Consulting."
    },
    {
      "credential": "Strong written, verbal and collaboration skills."
    },
    {
      "credential": "Ability to speak Mandarin is a plus."
    }
  ]
}