{
  "meta": [
    {
      "job_title": "Senior Assurance Associate",
      "job_category": "Accounting",
      "job_class": "Associate",
      "sector": "Accounting",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "GAAP and GAAS Knowledge",
      "experience": 3
    },
    {
      "skill": "CPA Eligibility",
      "experience": 3
    },
    {
      "skill": "Audit Leadership",
      "experience": 5
    },
    {
      "skill": "Financial Statement Review",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    },
    {
      "skill": "Accounting Research",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead audit and other assurance engagements by assuming responsibility for the supervision and completion of assigned engagements."
    },
    {
      "duty": "Review workpapers and financial statements, answer client questions, and clear concurring reviewer comments."
    },
    {
      "duty": "Ensure that material items are properly identified, researched, documented, and resolved."
    },
    {
      "duty": "Understand the scope of each engagement and can appropriately document and apply risk assessment procedures/standards."
    },
    {
      "duty": "Demonstrate high-level analytical and problem-solving skills."
    },
    {
      "duty": "Deal successfully with more complex accounting issues."
    },
    {
      "duty": "Perform analysis on adjusting entries or PAJEs and communicate effectively with clients."
    },
    {
      "duty": "Identify potential issues related to bank covenants early in the project and provide timely and high-quality services exceeding client expectations."
    },
    {
      "duty": "Pursue new business development and enhance skills for reviewing assurance engagements."
    },
    {
      "duty": "Adhere to the highest degree of professional standards and client confidentiality."
    },
    {
      "duty": "Develop and maintain quality client relations and become proficient at accounting and auditing research."
    },
    {
      "duty": "Serve as primary contact for assigned engagements and develop strong working relationships with client personnel."
    },
    {
      "duty": "Monitor entire engagement budget and manage workload and staff effectively."
    },
    {
      "duty": "Communicate deadlines to engagement team and ensure high-level oral and written communication skills."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting or related field (CPA eligibility preferred)"
    }
  ]
}