{
  "meta": [
    {
      "job_title": "Storage Engineer",
      "job_category": "Software Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Installs new software releases, system upgrades, evaluates and installs patches, and resolves software-related problems."
    },
    {
      "duty": "Performs system backups and recovery."
    },
    {
      "duty": "Maintains data files and monitors system configuration to ensure data integrity."
    },
    {
      "duty": "Analyze, design, test, document, and implement solutions for continuous data availability, integrity, storage solutions."
    },
    {
      "duty": "Maintain technical awareness of developments within the storage technology industry and evaluate the applicability of those developments to business requirements."
    },
    {
      "duty": "Contributes to complex storage engineering projects requiring specialized technical knowledge. Makes well-thought-out decisions on complex or ambiguous issues. Comprehends the big picture."
    },
    {
      "duty": "Provide technical expertise and/or solution delivery support for maintaining performance and reliability of storage solutions."
    },
    {
      "duty": "Maintain and enhance engagement with business and IT partners to determine requirements in support of service levels and project commitments. Establishes partner relationships with clients, internal and external."
    },
    {
      "duty": "Participate in relevant IT Architecture Domain Groups to appropriately review and plan the introduction of new storage technologies. Ensures appropriate implementation of technology."
    },
    {
      "duty": "Assess the storage solutions in use by our current installed-base customers."
    },
    {
      "duty": "Evaluate customer needs based on applications requirements, current capacity and growth trends."
    },
    {
      "duty": "Deliver engineering specifications, assist with functional specifications, and collaborate on technical designs and specifications for projects and initiatives."
    },
    {
      "duty": "Demonstrate domain knowledge in storage, data management and data protection technologies and be able apply the knowledge of these methodologies to the storage, protection, retention, reclamation, and disaster recovery."
    },
    {
      "duty": "Report on performance and capacities and make allocation recommendations based on trending."
    },
    {
      "duty": "Participate in capacity planning and performance discussions and assist in development and execution of disaster recovery exercises."
    },
    {
      "duty": "Work closely with external vendors and other personnel in order to optimize and facilitate the best solution to meet the needs of the business."
    },
    {
      "duty": "Analyze complex hardware and software issues associated with storage-related technologies, including Netapp, Dell/EMC SAN, Azure Netapp Files and Fiber Channel Switch management."
    },
    {
      "duty": "Analyze complex hardware and software issues associated with complex storage platforms including EMC, NetApp, and others."
    },
    {
      "duty": "Develop recommendations in support of project objectives. Develop logical and physical technical artifacts for review."
    },
    {
      "duty": "Promotes and encourages Diversity & Inclusion."
    }
  ],
  "skills": [
    {
      "skill": "Netapp, Dell/EMC, and others",
      "experience": 8
    },
    {
      "skill": "Storage migration and refresh processes",
      "experience": 8
    },
    {
      "skill": "IP networking, Windows PC and Server Administration, UNIX/Linux Server Administration, Azure IaaS, and PowerShell",
      "experience": 8
    },
    {
      "skill": "Consulting, presentation, and project management",
      "experience": 8
    },
    {
      "skill": "Change management principles associated with new technology implementations",
      "experience": 8
    },
    {
      "skill": "Leadership ability",
      "experience": 8
    },
    {
      "skill": "Project management principles",
      "experience": 8
    },
    {
      "skill": "Technological innovation and problem-solving",
      "experience": 8
    },
    {
      "skill": "Storage analysis and capacity planning",
      "experience": 8
    },
    {
      "skill": "Vendor management and optimization",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors degree in Computer Science or related discipline and typically 5 to 8 years hands-on experience with Storage solutions or equivalent combination of education and work experience."
    },
    {
      "credential": "Expertise in delivering storage solutions to an on-premise and IaaS environment for a large corporate environment."
    }
  ]
}