{
  "meta": [
    {
      "job_title": "Aquatics Operations Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Animal Welfare",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Employee Training",
      "experience": 5
    },
    {
      "skill": "Point-of-Sale Service",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Accountable for driving sales and for the overall effective operations within the area of aquatics, reptile, bird and small companion animals."
    },
    {
      "duty": "Responsible for the welfare of all live animals and merchandise within the department."
    },
    {
      "duty": "Achieve budgeted sales goals, gross margin, animal and merchandise shrink targets, managing inventory levels, supply cost, reported budgeted expense rates and budgeted contribution."
    },
    {
      "duty": "Directly supervise all Aquatics partners and provide guidance and training to partners."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Provide training and coaching in guest service and product knowledge to partners daily on the sales floor and on an ongoing basis."
    },
    {
      "duty": "Assist the Store Leader and/or Guest Experience Leader with location changes needed to the grid and ad planner to maximize sales."
    },
    {
      "duty": "Ensure the health, proper handling and welfare of all animals are met according to P&Ps, including completion of hourly animal check list and wellness cards."
    },
    {
      "duty": "Analyze inventory management data for the department and make recommendations for improvement."
    },
    {
      "duty": "Oversee and price all clearance merchandise for the department."
    },
    {
      "duty": "Perform all aspects of point-of-sale service, e.g. cash sales, credit and check sales, returns and exchanges."
    },
    {
      "duty": "Perform the daily balance of cash drawer as necessary."
    },
    {
      "duty": "Communicate all situations and/or conditions to the SL/GEL that affect the store."
    },
    {
      "duty": "Ensure the proper handling and documentation for all Adoption Animals."
    },
    {
      "duty": "Perform all special or other projects as assigned."
    },
    {
      "duty": "Provide quick and courteous service to all guests by utilizing the GUEST Model throughout the store."
    },
    {
      "duty": "Ensure that the store is opened and / or closed in accordance with established P&Ps."
    },
    {
      "duty": "Adhere to and promote established safety procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Retail Management, Business, or a related field (Master's preferred)"
    }
  ]
}