{
  "meta": [
    {
      "job_title": "Legislative Analyst, Senior",
      "job_category": "Legislative Analysis",
      "job_class": "Analyst",
      "sector": "Government",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Legislative Affairs",
      "experience": 10
    },
    {
      "skill": "Government Acquisition",
      "experience": 10
    },
    {
      "skill": "MS PowerPoint",
      "experience": 10
    },
    {
      "skill": "MS Word",
      "experience": 10
    },
    {
      "skill": "MS Excel",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Continuously monitoring and assessing the Congressional climate, identifying, researching, tracking, analyzing, and reporting on Congressional issues, activities, reports, and laws."
    },
    {
      "duty": "Producing summaries and reports covering all Air Force acquisition, acquisition capability areas, and individual acquisition programs."
    },
    {
      "duty": "Monitoring, researching, and reporting on key issues pertaining to Authorization and Appropriations processes."
    },
    {
      "duty": "Reviewing and providing data to assist in the preparation for legislative hearings, testimony, program documentation, briefing packages, and read-aheads."
    },
    {
      "duty": "Developing methods for gathering information to populate and maintain databases."
    },
    {
      "duty": "Researching and tracking Congressional reporting requirements as they are developed by Congress."
    },
    {
      "duty": "Developing and maintaining a library of Congressional legislation covering acquisition programs of client interest."
    },
    {
      "duty": "Providing educational training and materials on the budget enactment process including staffer days and the congressional process."
    },
    {
      "duty": "Maintaining a legislative database to include funding and language information by committee for Air Force acquisition programs throughout the 'mark' process to final passage, legislation to include defense bills and reports, information on key congressional personnel, and transcripts on Air Force acquisition-related hearings."
    },
    {
      "duty": "any other tasks closely associated with the performance of duties list above and as coordinated with the COR."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100
    },
    {
      "student_teacher": 0
    },
    {
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in any discipline."
    }
  ]
}