{
  "duties_responsibilities": [
    {
      "duty": "Lead and provide day-to-day support for assigned Navy Federal development efforts in compliance with NFCU standards, processes, and procedures following the System Development Life-cycle (SDLC) or applicable Agile Methodology.Identifies, analyzes, designs, develops, and maintains cost-effective information technology solutions that align with business initiatives and corporate strategies.Analyzes, defines, and documents requirements for data, workflow, logical processes, hardware, and operating systems environment, interfaces with other systems, internal and external controls, and output.Provides subject matter expertise and mentorship in developing system software code using commonly known best practices while adhering to NFCU standards and policies regarding software development.Responsible for ensuring the security and integrity of all NFCU systems.Participates in enhancing performance and availability of designed system solutions.Supports/leads the preparation, execution, and documentation of development tests and evaluations.Supports/leads the implementation of systems/applications into test and production environments. Prepares implementation plans and change requests required for system migration."
    }
  ],
  "education_certification": [
    {
      "credential": "Master's Degree in Computer Science, Management Information Systems or related field + 2 years work experience in Java Development OR Bachelor’s degree in Computer Science, Management Information Systems or related field + 4 years work experience in Java Development."
    }
  ],
  "meta": [
    {
      "job_title": "Software Developer",
      "job_category": "IT",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Java Development",
      "experience": 5
    },
    {
      "skill": "Agile/Scrum Methodologies",
      "experience": 5
    },
    {
      "skill": "JPA and Hibernate",
      "experience": 5
    },
    {
      "skill": "Angular (2+)",
      "experience": 5
    },
    {
      "skill": "Spring Boot/MVC",
      "experience": 5
    },
    {
      "skill": "REST Services",
      "experience": 5
    },
    {
      "skill": "Spring Batch",
      "experience": 5
    },
    {
      "skill": "Unit Testing (JUnit/Mockito)",
      "experience": 5
    },
    {
      "skill": "Microservices",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ]
}