{
  "meta": [
    {
      "job_title": "Supply Chain Manager",
      "job_category": "Supply Chain",
      "job_class": "Manager",
      "sector": "Logistics",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a comprehensive global supply chain strategy aligned with the company's overall business objectives."
    },
    {
      "duty": "Oversee the selection, evaluation, and management of suppliers, ensuring they meet quality, cost, and delivery requirements."
    },
    {
      "duty": "Lead the development and implementation of effective inventory management strategies, ensuring optimal stock levels to meet customer demand while minimizing carrying costs."
    },
    {
      "duty": "Develop and manage a global logistics and distribution network that optimizes efficiency, cost-effectiveness, and customer satisfaction."
    },
    {
      "duty": "Drive continuous improvement initiatives throughout the supply chain, implementing best practices and lean methodologies."
    },
    {
      "duty": "Identify and mitigate risks within the supply chain, including disruptions, capacity constraints, and geopolitical factors."
    },
    {
      "duty": "Collaborate with senior leadership to establish supply chain performance metrics and targets."
    },
    {
      "duty": "Develop strong relationships with key suppliers to promote collaboration, innovation, and continuous improvement."
    },
    {
      "duty": "Lead cross-functional teams in root cause analysis and problem-solving to address supply chain issues and improve performance."
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Management",
      "experience": 8
    },
    {
      "skill": "Supplier Management",
      "experience": 8
    },
    {
      "skill": "Inventory Management",
      "experience": 8
    },
    {
      "skill": "Logistics and Distribution",
      "experience": 8
    },
    {
      "skill": "Continuous Improvement",
      "experience": 8
    },
    {
      "skill": "Risk Management",
      "experience": 8
    },
    {
      "skill": "Negotiation",
      "experience": 8
    },
    {
      "skill": "Data Analytics",
      "experience": 8
    },
    {
      "skill": "Forecasting",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Communication",
      "experience": 8
    },
    {
      "skill": "Problem-Solving",
      "experience": 8
    },
    {
      "skill": "Supply Chain Management Software",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in supply chain management, operations management, business administration, or a related field. A Master's degree is preferred."
    }
  ]
}