{
  "meta": [
    {
      "job_title": "Operator I",
      "job_category": "Engineering",
      "job_class": "Operator",
      "sector": "Operations",
      "salary": 52000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Equipment Operation",
      "experience": 2
    },
    {
      "skill": "Industrial Waste Management",
      "experience": 2
    },
    {
      "skill": "Quality Control",
      "experience": 2
    },
    {
      "skill": "Team Collaboration",
      "experience": 2
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 2
    },
    {
      "skill": "Laboratory Testing",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Operate and maintain sludge, dewatering treatment, processing, disposal, and testing equipment to purify water and meet customer and state discharge permit requirements."
    },
    {
      "duty": "Independently operate assigned machines and equipment, meeting or exceeding processing, quality, and safety requirements."
    },
    {
      "duty": "Learn to operate equipment such as pumps, engines, centrifuge, generators, valves, gates, mixers, conveyors, blowers, dryers, chemical feed, sludge processing filters, belt presses, and testing equipment."
    },
    {
      "duty": "Utilize waste-water laboratory equipment and perform testing."
    },
    {
      "duty": "Work in a team environment and willingly assume additional responsibilities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or GED. Some experience in a related position and work environment is preferred. Ability to use computer programs for process control, read, and comprehend English, perform basic mathematical calculations, work in a team environment, and willingness to assume additional responsibilities. Must possess a valid driver’s license and a safe driving record. Ability to pass a drug test and a criminal background check. Ability to obtain certification to operate forklift and personnel lift."
    }
  ]
}