{
  "meta": [
    {
      "job_title": "Customer Service Specialist",
      "job_category": "Customer Service",
      "job_class": "Specialist",
      "sector": "Retail",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Cashier",
      "experience": 3
    },
    {
      "skill": "Retail Sales",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Merchandising",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Providing excellent customer experiences and exceptional shopping experiences for customers."
    },
    {
      "duty": "Serving as the primary customer service provider and liaison between customers and management."
    },
    {
      "duty": "Ensuring strong customer service standards are met by supporting cashiers through complex transactions."
    },
    {
      "duty": "Assisting manager with department scheduling, directing workflow, daily associate assignments, and monitoring department presentation standards."
    },
    {
      "duty": "Upholding company merchandising and presentation standards by following established floor sets, signage requirements, price changes, inventory presentation and replenishment standards, etc."
    },
    {
      "duty": "Promoting and providing training to new and current teammates on company programs."
    },
    {
      "duty": "Adhering to established policies and procedures related to safety, loss prevention, and standard operating procedures."
    },
    {
      "duty": "Creating an inclusive store environment where everyone feels welcome, safe, and is treated with respect."
    },
    {
      "duty": "Supporting the team across the store with an all-hands-on-deck approach."
    },
    {
      "duty": "Performing other tasks as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": []
}