{
  "meta": [
    {
      "job_title": "Provider Contract Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages contract negotiations with physician groups and conducts negotiations simultaneously to meet growth demands."
    },
    {
      "duty": "Proactively builds relationships that nurture provider partnerships and support the local market strategy."
    },
    {
      "duty": "Initiates, nurtures, and maintains effective channels of communication with matrix partners including Claims, Medical Management, Credentialing, Legal, Medical Economics, Compliance, Sales, and Marketing."
    },
    {
      "duty": "Responsible for meeting unit cost targets, while preserving an adequate network, to achieve and maintain competitive position."
    },
    {
      "duty": "Identifies and manages initiatives that improve total medical cost and quality."
    },
    {
      "duty": "Prepares, analyzes, reviews, and projects financial impact of high spend or increasingly complex provider contracts and alternate contract terms."
    },
    {
      "duty": "Manages key provider relationships and is accountable for critical interface with providers and business staff."
    },
    {
      "duty": "Partners with Regulatory Affairs to ensure all network filings are timely and accurate."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Physician Group Contracting",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Strategic Relationship Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience in related field, plus 5+ years of work experience beyond degree within provider contracting and/or health insurance"
    }
  ]
}