{
  "meta": [
    {
      "job_title": "Head of FP&A",
      "job_category": "Finance",
      "job_class": "Executive",
      "sector": "Finance",
      "salary": 160000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Planning",
      "experience": 10
    },
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "Financial Modeling",
      "experience": 10
    },
    {
      "skill": "Financial Reporting",
      "experience": 10
    },
    {
      "skill": "Strategic Financial Planning",
      "experience": 10
    },
    {
      "skill": "Mergers & Acquisitions",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the financial analysis function and partner with the executives, board members, and investment teams."
    },
    {
      "duty": "Drive key initiative analysis, including support M&A, and lead build-out of financial and operational KPI tracking."
    },
    {
      "duty": "Develop and report key financial and operational data/metrics in dashboards and forecasts, driving automation and systems optimization."
    },
    {
      "duty": "Conduct financial cost/benefit analyses to help evaluate and prioritize growth and strategic initiatives."
    },
    {
      "duty": "Manage and direct day-to-day financial reporting systems, and develop or implement systems for scalability."
    },
    {
      "duty": "Maintain and update the company’s regular lender reporting packages."
    },
    {
      "duty": "Lead annual budgeting, reforecasting, and ongoing cash flow forecasting processes."
    },
    {
      "duty": "Collaborate with management to develop budget with buy-in across the Company."
    },
    {
      "duty": "Partner with Information Technology team to ensure state-of-the-art systems and tools are implemented and functioning."
    },
    {
      "duty": "Collaborate with managers, operations team, and key constituents to enhance operational efficiency."
    },
    {
      "duty": "Assist in acquisition financial diligence work streams and lead financial integration of acquired practices."
    },
    {
      "duty": "Analyze cash flow, cost control and expenses, and suggest and implement improvements."
    },
    {
      "duty": "Perform economic and industry analyses and recommend response strategies to trends impacting the business."
    },
    {
      "duty": "Research and investigate financial and operational performance variance issues and assist in corrective actions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree in finance or accounting. MBA highly desirable."
    }
  ]
}