{
  "meta": [
    {
      "job_title": "Director of Procurement",
      "job_category": "Procurement",
      "job_class": "Director",
      "sector": "Management",
      "salary": 130000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement policies, procedures, and objectives for the procurement of goods and services for the business unit."
    },
    {
      "duty": "Interact with internal Business Relationship Owners and vendors to understand and develop requirements, measure performance and drive optimization throughout all stages of the vendor lifecycle."
    },
    {
      "duty": "Serve as the first line between vendor, internal stakeholders, and business relationship owners to understand requirements, identify suitable vendors, lead the sourcing process, and negotiate with vendors to secure the best price, service delivery, and quality."
    },
    {
      "duty": "Help establish a center-led vendor management program including governance, policies, and procedures that accelerate and support the business enhance spend transparency."
    },
    {
      "duty": "Develop and lead RFX process in collaboration with internal stakeholders, leveraging eSourcing (Scout RFX) and reverse auctions; draft, initiate and manage end-to-end RFX."
    },
    {
      "duty": "Partner with internal stakeholders to facilitate and lead vendor evaluation, selection, risk assessment, contract negotiations/execution, and vendor onboarding."
    },
    {
      "duty": "Lead and develop category and sourcing plans using structured sourcing methodologies; develop work plans and engage stakeholders."
    },
    {
      "duty": "Review, assess, and evaluate vendors for initial risk assessment."
    },
    {
      "duty": "Lead and develop supplier performance measurement programs, including scorecarding and quarterly reviews."
    },
    {
      "duty": "For high-risk/mission-critical vendors, proactively partner with internal stakeholders to manage third-party risks and develop mitigation plans."
    },
    {
      "duty": "Collaborate with stakeholders to manage the escalation and resolution of key vendor issues for issue tracking, remediation, and communication."
    },
    {
      "duty": "Lead and develop reporting and analytical packages, providing decision support and analysis."
    },
    {
      "duty": "Manage, coach, and lead direct and indirect staff."
    },
    {
      "duty": "Assist with various cross-departmental initiatives and projects."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent relevant work experience with indirect spend"
    }
  ]
}