{
  "meta": [
    {
      "job_title": "Social Media Intern",
      "job_category": "Marketing",
      "job_class": "Intern",
      "sector": "Marketing",
      "salary": 25000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Social Media Management",
      "experience": 2
    },
    {
      "skill": "Content Creation",
      "experience": 2
    },
    {
      "skill": "Community Engagement",
      "experience": 2
    },
    {
      "skill": "Social Media Analytics",
      "experience": 2
    },
    {
      "skill": "Partnership Development",
      "experience": 2
    },
    {
      "skill": "Social Media Trends",
      "experience": 2
    },
    {
      "skill": "Influencer Outreach",
      "experience": 2
    },
    {
      "skill": "Creativity",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement strategic social media plans to organically grow and enhance Vinyl Wellness' online presence across multiple platforms, including Instagram, TikTok, X, and Facebook."
    },
    {
      "duty": "Create compelling and visually appealing content that aligns with our brand voice, values, and target audience."
    },
    {
      "duty": "Engage with our social media community by responding to comments, messages, and inquiries in a timely and professional manner."
    },
    {
      "duty": "Collaborate with the marketing team to conceptualize and execute social media campaigns, contests, and partnerships to increase brand awareness and engagement."
    },
    {
      "duty": "Stay up-to-date with the latest trends, features, and best practices on each social media platform to optimize content performance."
    },
    {
      "duty": "Monitor social media analytics and generate reports to measure key performance indicators, identify trends, and provide insights for continuous improvement."
    },
    {
      "duty": "Research and identify influential individuals, organizations, and communities within the wellness and music festival industry for potential collaborations and partnerships."
    },
    {
      "duty": "Explore new and emerging social media platforms and suggest creative ways to leverage them for brand promotion."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": []
}