{
  "meta": [
    {
      "job_title": "Client Service Representative",
      "job_category": "Finance",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Responsible for providing an industry leading client service experience both in person and on the phone through the development and expansion of new and existing client relationships."
    },
    {
      "duty": "Provides financial solutions that meet client needs based on consultative conversations and referrals to other business partners for additional business growth opportunities."
    },
    {
      "duty": "Cross-trained to support teller transactions as needed."
    },
    {
      "duty": "Exercises advanced proficiency with routine client maintenance requests, problem resolution and advanced sales functions regarding deposit, credit, convenience and other product and service lines."
    },
    {
      "duty": "Contributes to meeting or exceeding client service as well as individual and branch sales targets by offering and selling products and services with a focus on developing, expanding and retaining relationships."
    },
    {
      "duty": "Supports team sales process by conducting consultative conversations and acting upon or referring more complex client needs or financial goals to other internal specialists."
    },
    {
      "duty": "Participates fully in all components of the established Truist Retail Community Bank Leadership Routines"
    },
    {
      "duty": "Commits to advancing individual knowledge of sales techniques and product knowledge to better serve consumer and business clients by attending sales, service and product knowledge meetings, applicable training classes and web-based learning."
    },
    {
      "duty": "Advises on consumer lending options and takes loan applications."
    },
    {
      "duty": "Adheres to internal controls, operational procedures and risk management policies. Stays informed of all changes in policies and procedures to ensure compliance with current guidelines."
    },
    {
      "duty": "Ensures a consistent client service experience by engaging clients with smiling, courteous conversation while conducting transactions and uncovering needs. This may include handling teller transactions and sharing responsibility for greeting clients and helping them navigate within the branch."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent education"
    },
    {
      "credential": "Must be SAFE (Mortgage Licensing Act) compliant within 30 days of employment in this role, including new or transfer of registration and applicable NMLS background check which includes meeting applicable financial responsibility, character, credit fitness and criminal background standards. Successful candidates must also meet ongoing regulatory requirements"
    }
  ]
}