{
  "meta": [
    {
      "job_title": "Client Implementation Manager",
      "job_category": "Client Implementation",
      "job_class": "Manager",
      "sector": "Project Management",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Healthcare Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Medicare Knowledge",
      "experience": 3
    },
    {
      "skill": "Change Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with the Implementation Account Service Manager to project manage new client implementations including requirements gathering, creating and managing project plans, and in-house resource co-ordination."
    },
    {
      "duty": "Serve as a subject matter expert to clients in HRA administration, eligibility data, operations, and communications, in order to successfully complete new client transitions."
    },
    {
      "duty": "Create and update all project documentation & obtain client approvals when finalized."
    },
    {
      "duty": "Serve as liaison with the data team to ensure eligibility specifications align with program design."
    },
    {
      "duty": "Coordinate with multiple internal teams such as the product, funding, operations, and communications teams to assure overall readiness prior to program launch and all client requirements are configured."
    },
    {
      "duty": "Implement multiple concurrent implementations while keeping all internal teams well informed of both project and client changes."
    },
    {
      "duty": "Liaise between clients and Operations for specific participant escalations."
    },
    {
      "duty": "Provide weekly status reports to clients regarding project plan status."
    },
    {
      "duty": "Facilitate regular status meetings with internal teams and clients."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 85,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business Administration, Project Management, or a related field (Master's preferred)"
    }
  ]
}