{
  "meta": [
    {
      "job_title": "Senior Financial Reporting Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "GAAP Knowledge",
      "experience": 5
    },
    {
      "skill": "CPA Certification",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel Proficiency",
      "experience": 5
    },
    {
      "skill": "Financial Software Applications",
      "experience": 5
    },
    {
      "skill": "Financial Narrative Preparation",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with cross-functional teams to gather financial data, ensure accuracy, and facilitate the preparation of financial statements, footnotes, and other disclosures in compliance with GAAP and SEC regulations."
    },
    {
      "duty": "Assist in the preparation of quarterly and annual financial statements, ensuring timely and accurate reporting to both internal and external stakeholders."
    },
    {
      "duty": "Conduct in-depth financial analysis, identify trends, and provide insights that contribute to the company's strategic and operational decision-making processes."
    },
    {
      "duty": "Assist with the preparation of MD&A (Management's Discussion and Analysis) and related financial narratives to enhance the understanding of financial results."
    },
    {
      "duty": "Collaborate with external auditors during the audit process, providing necessary documentation and responding to inquiries to facilitate a smooth audit experience."
    },
    {
      "duty": "Monitor and research changes in accounting standards and regulations, ensuring the company's compliance and timely adoption of new requirements."
    },
    {
      "duty": "Participate in the implementation and enhancement of financial reporting systems and tools to streamline processes and enhance accuracy."
    },
    {
      "duty": "Assist in the preparation of various ad hoc financial reports and presentations for senior management as required."
    },
    {
      "duty": "Mentor and provide guidance to junior team members to promote their professional growth and development."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting, Finance, or related field; Master's degree is a plus."
    }
  ]
}