{
  "meta": [
    {
      "job_title": "Travel Nurse RN ED - Emergency Department",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Emergency Medicine",
      "experience": 5
    },
    {
      "skill": "Critical Care",
      "experience": 5
    },
    {
      "skill": "Clinical Documentation",
      "experience": 5
    },
    {
      "skill": "Wound Care",
      "experience": 5
    },
    {
      "skill": "IV Therapy",
      "experience": 5
    },
    {
      "skill": "Medical Terminology",
      "experience": 5
    },
    {
      "skill": "Infection Control",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide patient care in emergency department settings, including assessment, treatment, and monitoring of patients in critical condition."
    },
    {
      "duty": "Administer emergency medicine to patients in urgent and life-threatening situations, ensuring timely and accurate interventions."
    },
    {
      "duty": "Manage critical care patients, including monitoring vital signs, administering medications, and coordinating with multidisciplinary teams."
    },
    {
      "duty": "Complete clinical documentation and maintain accurate records of patient cases and treatments according to healthcare regulations."
    },
    {
      "duty": "Provide wound care and perform dressing changes for patients with injuries and trauma."
    },
    {
      "duty": "Administer IV therapy and manage IV lines for patients in need of intravenous medications and fluids."
    },
    {
      "duty": "Utilize medical terminology and maintain infection control protocols to ensure patient safety and well-being."
    },
    {
      "duty": "Collaborate with medical and nursing teams to provide comprehensive and effective patient care in emergency department settings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Nursing (BScN) or related field (Master's in Nursing preferred)"
    }
  ]
}