{
  "meta": [
    {
      "job_title": "Operations Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 64480,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Scheduling",
      "experience": 5
    },
    {
      "skill": "Employee Management",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Payroll Processing",
      "experience": 5
    },
    {
      "skill": "Staffing",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Communications",
      "experience": 5
    },
    {
      "skill": "Security Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Staffing, scheduling, and processing payroll for all Security Professionals within assigned client sites."
    },
    {
      "duty": "Interviewing and hiring qualified applicants, evaluating low-performing employees for replacement, upgrade, or transfer."
    },
    {
      "duty": "Creating, modifying, and managing post schedules, ensuring adequate coverage at all times."
    },
    {
      "duty": "Managing branch overtime, maintaining a pool of rovers for backfill of vacant positions."
    },
    {
      "duty": "Processing payroll, ensuring records are properly maintained and updated, resolving payroll discrepancies in a timely manner."
    },
    {
      "duty": "Conducting disciplinary and counseling sessions, initiating termination procedures as needed."
    },
    {
      "duty": "Maintaining regular proactive contact with Security Professionals to ensure effective utilization and proper training."
    },
    {
      "duty": "Enforcing post-specific policies and procedures, maintaining a well-organized and effective working area."
    },
    {
      "duty": "Preparing and running all required reports, reviewing reports with the management team, and taking appropriate action as necessary."
    },
    {
      "duty": "Performing additional projects or tasks as directed by managers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent required. College degree or coursework desirable."
    }
  ]
}