{
  "meta": [
    {
      "job_title": "Attraction Manager",
      "job_category": "Entertainment",
      "job_class": "Manager",
      "sector": "Entertainment",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Maintain the daily operation of all rides and attractions, ensuring safety compliance and optimal functionality."
    },
    {
      "duty": "Assist in pre-operational inspections, including preventative maintenance, cleanliness, and proper operation of rides."
    },
    {
      "duty": "Deliver exceptional guest service and possess in-depth knowledge about the park and its offerings."
    },
    {
      "duty": "Create and manage schedules to ensure adequate staffing within the labor budget."
    },
    {
      "duty": "Ensure compliance and maintain proper documentation in accordance with the Attractions training program."
    },
    {
      "duty": "Collaborate with Corporate Leadership Staff to implement departmental policies, goals, objectives, and procedures."
    },
    {
      "duty": "Foster positive working relationships with other operating departments, such as Maintenance, Corporate office, Food & Beverage, and Guest Services."
    },
    {
      "duty": "Serve as the Manager on Duty regularly."
    },
    {
      "duty": "Recruit, interview, and hire personnel as required."
    },
    {
      "duty": "Organize daily assignments and break schedules for all positions."
    },
    {
      "duty": "Regularly communicate with the Operations Manager to exchange relevant information."
    },
    {
      "duty": "Compile and maintain attraction reports, including counts, staffing levels, data collection, and incident reporting."
    },
    {
      "duty": "Assist in long-term planning and provide recommendations for improvements."
    },
    {
      "duty": "Ensure compliance with all equipment regulations."
    },
    {
      "duty": "Oversee inventory management and ordering of supplies."
    },
    {
      "duty": "Ensure effective implementation of current promotions."
    },
    {
      "duty": "Perform other duties as assigned based on operational needs."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Three or more years of experience in a Kitchen/Retail/Operation Leadership role, preferably within the theme park industry."
    }
  ]
}