{
  "meta": [
    {
      "job_title": "Project Engineer - Civil",
      "job_category": "Engineering",
      "job_class": "Project Engineer",
      "sector": "Engineering",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Infrastructure Development",
      "experience": 3
    },
    {
      "skill": "Technical Writing",
      "experience": 3
    },
    {
      "skill": "AutoCAD",
      "experience": 3
    },
    {
      "skill": "Budget Management",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Feasibility Studies",
      "experience": 3
    },
    {
      "skill": "Team Coordination",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and manage large process and infrastructure improvement projects, including water and treatment systems."
    },
    {
      "duty": "Prepare budgets and proposals, generate detailed design drawings, scope criteria and schedules, write technical specifications and proposals for procurement."
    },
    {
      "duty": "Coordinate efforts of several departments and provide a leadership role in the development, installation, and monitoring of each project through commissioning."
    },
    {
      "duty": "Manage and coordinate with contractors, consultants, and local or state officials using both verbal and written communication."
    },
    {
      "duty": "Complete and submit all permit applications to the appropriate agencies and ensure projects are compliant throughout the design and construction stages."
    },
    {
      "duty": "Perform technical and feasibility studies from design to commissioning."
    },
    {
      "duty": "Meticulous attention to detail with superb organizational skills. Excellent time management skills to ensure project deadlines are met."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Civil Engineering or related field (Professional Engineering license preferred)"
    }
  ]
}