{
  "meta": [
    {
      "job_title": "Human Resources Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 97500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HR Management",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Staff Development",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Organizational Development",
      "experience": 5
    },
    {
      "skill": "MS Excel",
      "experience": 5
    },
    {
      "skill": "MS Word",
      "experience": 5
    },
    {
      "skill": "MS PowerPoint",
      "experience": 5
    },
    {
      "skill": "SAP",
      "experience": 5
    },
    {
      "skill": "Oracle",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide overall human resources support for the Food Operations Management in Theme Park with emphasis on conducting investigations and provide resolutions of concerns related to employee complaints, misconduct, and performance."
    },
    {
      "duty": "Provide HR counsel to Management Team on employee relations issues as well as investigating and responding to complaints and complex, high-risk, or sensitive employee relations cases."
    },
    {
      "duty": "Ensure fair and consistent enforcement of policies and practices. Investigate employee workplace situations including claims of harassment, discrimination, and policy violations."
    },
    {
      "duty": "Lead key HR processes for client groups (salary planning/reward management, performance management and goal setting, succession planning, employee satisfaction survey/TSAT, 360 feedback, etc)."
    },
    {
      "duty": "Partner with Labor Relations to ensure compliance with collective bargaining agreements and to assist in resolving grievances."
    },
    {
      "duty": "Provide support to client groups by interacting and communicating with employees in the park, visiting break rooms, and Lead offices to promote positive relations and seek out/resolve potential issues."
    },
    {
      "duty": "Act as a liaison between clients and core staff functions by assisting with rolling out new Company initiatives and communicating information relating to career development, recognition programs, payroll, benefits, training, and staffing."
    },
    {
      "duty": "Mentor and provide guidance to professional staff related to their career goals. Build bench strength within the departments by identifying training and development opportunities."
    },
    {
      "duty": "Proactively manage HR systems to ensure data integrity. Partner with HRIS on resolving system issues. Partner with Timekeeper on payroll problems and resolutions."
    },
    {
      "duty": "Ensure compliance with Federal, State, and local laws."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Human Resources, Industrial Relations, Business Management or related field required (advanced degree preferred)"
    }
  ]
}