{
  "meta": [
    {
      "job_title": "Director of Player Engagement",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Gaming",
      "salary": 169800,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Community Management",
      "experience": 10
    },
    {
      "skill": "Player Support",
      "experience": 8
    },
    {
      "skill": "Social Media Management",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "People Management",
      "experience": 10
    },
    {
      "skill": "Live Service Games",
      "experience": 10
    },
    {
      "skill": "Strategic Analysis",
      "experience": 10
    },
    {
      "skill": "Statistical Analysis",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Collaboration",
      "experience": 10
    },
    {
      "skill": "Industry Trends",
      "experience": 10
    },
    {
      "skill": "MMOs",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish and maintain alignment of various Social Media, Community Management and Player Support teams to support a common vision of best practices and tools in order to boost efficiency and effectiveness."
    },
    {
      "duty": "Define program success metrics and business reporting, interpreting data and translating it into a cohesive and clear product strategy."
    },
    {
      "duty": "Use social media data to effectively communicate and educate studio teams on the community of players and opportunities for improvement."
    },
    {
      "duty": "Advocate for studio-level Social Media, Community Management and Player Support needs to the wider SIE organization, while partnering with SIE stakeholders to align with brand guidelines, best practices, and identify opportunities to share resources or capabilities."
    },
    {
      "duty": "Partner closely with Marketing, Global Communications and Sales teams to deliver successful strategies and plans to meet product performance goals."
    },
    {
      "duty": "Actively contribute to and be close to the games industry, innovation, and best practices while aligning with SIE public speaking policies."
    },
    {
      "duty": "Partner with the SIE digital marketing and CRM teams to drive in- and out-of-game improvements to the business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Gaming Management, Business, or a related field (Master's preferred)"
    }
  ]
}