{
  "meta": [
    {
      "job_title": "Member Advisor Supervisor",
      "job_category": "Financial Services",
      "job_class": "Supervisor",
      "sector": "Financial Services",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Cash Handling",
      "experience": 2
    },
    {
      "skill": "Supervisory Experience",
      "experience": 3
    },
    {
      "skill": "Professional Interpersonal Skills",
      "experience": 3
    },
    {
      "skill": "Financial Institution Knowledge",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    },
    {
      "skill": "Recruiting",
      "experience": 3
    },
    {
      "skill": "Report Preparation",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as a subject matter expert as it relates to all product & service offerings of the credit union."
    },
    {
      "duty": "Assist members and associates via multiple channels which includes but is not limited to phone, video, chat, email, etc."
    },
    {
      "duty": "Perform quality assurance monitoring for the Member Advisors to ensure services levels are meeting and/or exceeding member and credit union expectations."
    },
    {
      "duty": "Assist with supervision of Member Advisor staff, act as Team Leader for a group of ten to twelve Member Advisors."
    },
    {
      "duty": "Maintain a highly motivated, well-trained staff and evaluate job performance within designated time frames to ensure quality of work and service to members and staff."
    },
    {
      "duty": "Assist with the development of department goals and objectives for designated staff."
    },
    {
      "duty": "Assist with the development and updates of departmental procedures."
    },
    {
      "duty": "Responsible for continued development of the training program(s) as it relates to the designated staff."
    },
    {
      "duty": "Consistently monitor various member service contact points to ensure prescribed service levels are achieved."
    },
    {
      "duty": "Lead daily meetings with team to disseminate information, perform skill-practice and provide recognition."
    },
    {
      "duty": "Assist in the recruiting process by attending interviews and recommending candidates for employment."
    },
    {
      "duty": "Perform PAT settlement and troubleshooting as assigned."
    },
    {
      "duty": "Prepare pertinent month-end reports as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 40,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Finance, or related field"
    }
  ]
}