{
  "meta": [
    {
      "job_title": "Pet Care Specialist",
      "job_category": "Animal Care",
      "job_class": "Specialist",
      "sector": "Retail",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide guests with exceptional customer service by being the subject matter expert on all pet products, nutrition, services, and local community events related to animal care and wellness."
    },
    {
      "duty": "Engage with customers to determine their needs, provide product knowledge, and suggest appropriate merchandise and services to satisfy them."
    },
    {
      "duty": "Perform all aspects of point-of-sale service, including cash sales, credit and check sales, returns and exchanges."
    },
    {
      "duty": "Express passion about animal welfare and maintain integrity in the work area. Remain familiar with all new pet products and services to engage customers effectively."
    },
    {
      "duty": "Polite and professional response to inquiries regarding products, services, and pricing via telephone. Promote a positive culture of teamwork and inclusion, and inform Guests of upcoming adoption events."
    },
    {
      "duty": "Connect the customer with the right partner to deliver the guest experience and desired services. Maintain familiarity with current promotions and special services."
    },
    {
      "duty": "Complete other duties and special projects as assigned. Evaluate guest inquiries and refer to the Leader on Duty as needed."
    },
    {
      "duty": "Utilize selling behaviors and contribute to a safe environment in Pet Care Locations. Be a part of a collaborative culture and engage in career development programs."
    },
    {
      "duty": "Handle merchandise stocking and customer carry-outs, which may require bending, kneeling, lifting (up to 50 pounds), and standing for long periods of time."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Pet Nutrition",
      "experience": 3
    },
    {
      "skill": "Point-of-Sale Service",
      "experience": 3
    },
    {
      "skill": "Product Knowledge",
      "experience": 3
    },
    {
      "skill": "Animal Welfare Advocacy",
      "experience": 3
    },
    {
      "skill": "Phone Etiquette",
      "experience": 3
    },
    {
      "skill": "Teamwork",
      "experience": 3
    },
    {
      "skill": "Retail Sales",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED. Certification in pet nutrition, PIJAC (California only), and familiarity with pet grooming, dog training, and pet services."
    }
  ]
}