{
  "meta": [
    {
      "job_title": "Hospitalist Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Negotiating",
      "experience": 5
    },
    {
      "skill": "Emotional Intelligence",
      "experience": 5
    },
    {
      "skill": "Learning Agility",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Proficiency with Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Hospital or Healthcare Experience",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate daily oversight of administrative responsibility for the hospitalist program."
    },
    {
      "duty": "Facilitate and track key onboarding activities for new providers and team members."
    },
    {
      "duty": "Serve as a liaison between Sound and Hospital Medical Staff Office, ensuring credentialing and provider enrollment packets are complete and following up on missing documentation."
    },
    {
      "duty": "Communicate key announcements to the hospitalist team and maintain important team documents."
    },
    {
      "duty": "Coordinate monthly and quarterly meetings, both within the hospitalist team and with hospital partner leadership, including scheduling, agenda, room/material facilitation, and meeting minutes."
    },
    {
      "duty": "Manage incoming phone calls, faxes, and mail. Maintain a Master team list and hospital contacts."
    },
    {
      "duty": "Assist hospitalist team with various administrative tasks, including completing forms, maintaining client-facing materials, tracking contract renewal timelines, and gathering information for contracting support."
    },
    {
      "duty": "Develop effective relationships with hospital data owners and collaborate with Regional Operations Manager to ensure timely collection of data."
    },
    {
      "duty": "Identify and problem-solve day-to-day site operations issues related to payroll, credentialing, human resources, recruiting, etc."
    },
    {
      "duty": "Provide support for organizational Value-Based Care activities, including coordination with the hospital business office and staffing management."
    },
    {
      "duty": "Ensure accuracy and timeliness of physician shifts for payroll, as well as coordination and facilitation of onboarding/orientation requirements for Physicians and Advanced Practice Providers."
    },
    {
      "duty": "Coordinate the service line(s) team schedule with site Program Medical Director and Staffing Coordinator, with proactive 3-6 month planning, labor/staffing mix awareness, and management of critical staffing gaps."
    },
    {
      "duty": "Drive internal staffing calls, follow up on scheduling issues, and assist in staffing optimization management processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree in a related field"
    }
  ]
}