{
  "meta": [
    {
      "job_title": "Operations Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Logistics",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Warehouse Management",
      "experience": 4
    },
    {
      "skill": "Inventory Management",
      "experience": 4
    },
    {
      "skill": "Logistics Planning",
      "experience": 4
    },
    {
      "skill": "Safety Policies",
      "experience": 4
    },
    {
      "skill": "Budget Management",
      "experience": 4
    },
    {
      "skill": "Employee Training",
      "experience": 4
    },
    {
      "skill": "Data Entry",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, direct, and coordinate the operations of the branch."
    },
    {
      "duty": "Formulate policies, manage daily operations, and plan the use of materials and human resources."
    },
    {
      "duty": "Responsible for the operations within the warehouse, including routing/dispatching, receiving, forklift operations, truck driving/maintenance, general warehouse, and inventory."
    },
    {
      "duty": "Develop supervisors and team leaders to effectively oversee the daily routines of their assigned teams."
    },
    {
      "duty": "Closely monitor compliance with all safety policies and operation of equipment."
    },
    {
      "duty": "Research, recommend, and implement appropriate equipment to ensure safe transport and storage of all products."
    },
    {
      "duty": "Develop and maintain quality processes and measures to increase efficiency and customer satisfaction."
    },
    {
      "duty": "Oversee the completion of all required paperwork and data entry by the warehouse team."
    },
    {
      "duty": "Coordinate scheduling and routes with drivers and dispatchers."
    },
    {
      "duty": "Work closely with accounting to resolve problems with invoices and billing."
    },
    {
      "duty": "Partner with Safety Director to continuously improve and enhance safety discipline, practices, and policies."
    },
    {
      "duty": "Ensure materials are stored properly to conserve space and comply with safety procedures."
    },
    {
      "duty": "Oversee the rotation of inventories within the warehouse, as needed."
    },
    {
      "duty": "Monitor and measure warehouse performance and quality measures."
    },
    {
      "duty": "Provide reporting to management as required."
    },
    {
      "duty": "Develop and recommend an annual budget requirement for the warehouse, including staffing levels and justification for new or replacement material handling equipment."
    },
    {
      "duty": "Adjust staffing levels to meet peak customer demand."
    },
    {
      "duty": "Keep warehouse accessible and safe for branch staff visitors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Business Management, Industrial Management, or related field preferred."
    }
  ]
}