{
  "meta": [
    {
      "job_title": "Portfolio Management Implementation Specialist",
      "job_category": "Project Management",
      "job_class": "Implementation Specialist",
      "sector": "Financial Services",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Portfolio Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Financial Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Technical Proficiency",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Process Assessment and Redesign",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and maintain the portfolio management standard implementation project plan, ensuring all partners are included and accountable for their respective areas."
    },
    {
      "duty": "Oversee the overall project management of the portfolio management solution implementation, including status reporting and risk/issue management."
    },
    {
      "duty": "Collaborate closely with clients to communicate and align portfolio management standard workflows/procedures within their broader business environment."
    },
    {
      "duty": "Execute the portfolio management training program to client users and trainers (train the trainer)."
    },
    {
      "duty": "Identify and manage key change management efforts associated with the portfolio management solution."
    },
    {
      "duty": "Act as the market unit’s single point of contact for platform delivery and product development teams concerning portfolio management conversion efforts."
    },
    {
      "duty": "Support the testing of new portfolio management capabilities/features in conjunction with technology partners."
    },
    {
      "duty": "Manage client expectations and provide regular updates throughout the conversion process, specifically regarding delivery outcomes and timeframes."
    },
    {
      "duty": "Coordinate with portfolio management market unit solution lead, providing input on solution development requirements for the overall solution roadmap."
    },
    {
      "duty": "Collaborate with the relationship management team to ensure a seamless hand-off to ongoing servicing relationship."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Financial Services, Business, or a related field (Master's preferred)"
    }
  ]
}