{
  "meta": [
    {
      "job_title": "Field Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute territory business plan that results in achievement of assigned sales quota."
    },
    {
      "duty": "Develop and maintain market knowledge, business acumen, and proven sales processes."
    },
    {
      "duty": "Identify and navigate large business opportunities with various market access partners."
    },
    {
      "duty": "Conduct in-service training programs with respective customers and assist in onboarding."
    },
    {
      "duty": "Embrace corporate values with regards to process and administrative responsibilities which includes, but is not limited to: (a) Complete and accurate account management practices via CRM tool, (b) timely submission & management of expenses, (c) Completion of all required training assignments on or before the defined deadlines."
    },
    {
      "duty": "Partner closely with Account Managers and Sales Leader to identify and source new pipeline that leads to closed revenue and quota attainment."
    },
    {
      "duty": "Execute discovery of the customers’ needs and identify opportunities for Element3 Health to be a good match for the prospect."
    },
    {
      "duty": "Manage a high volume of leads and accounts but remain focused on executing against the defined strategy."
    },
    {
      "duty": "Sign up new clubs in defined geography to the Club Network model via agreement. Once clubs are signed up work with the Club Leader and influencers within the club to properly onboard club and member enrollees to the Element3 Health platform."
    },
    {
      "duty": "Represent the Element3 Health mission and brand with internal and external stakeholders."
    },
    {
      "duty": "Collaborate with Marketing while being flexible as part of an ever-growing sales organization."
    },
    {
      "duty": "Perform market research and uncover customer insights is important for delivery of results."
    },
    {
      "duty": "< 75% travel inside territory"
    }
  ],
  "skills": [
    {
      "skill": "Business-to-Business Selling",
      "experience": 4
    },
    {
      "skill": "Market Analysis",
      "experience": 4
    },
    {
      "skill": "Customer Needs Analysis",
      "experience": 4
    },
    {
      "skill": "Account Management",
      "experience": 4
    },
    {
      "skill": "Sales Strategy",
      "experience": 4
    },
    {
      "skill": "Medical Sales",
      "experience": 4
    },
    {
      "skill": "CRM Management",
      "experience": 4
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 4
    },
    {
      "skill": "Accounting",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 70,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "4-year college degree or equivalent experience."
    }
  ]
}