{
  "meta": [
    {
      "job_title": "Head of Product Management and Marketing for Fixed Wireless Access",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Digital Products Management",
      "experience": 5
    },
    {
      "skill": "KPI Tracking",
      "experience": 5
    },
    {
      "skill": "Supervisory Experience",
      "experience": 5
    },
    {
      "skill": "Technical Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create the overarching business strategy and plan to effectively and profitably develop and deploy emerging and scalable FWA products and solutions."
    },
    {
      "duty": "Ownership of the go-to-market plan for driving adoption and revenue generation."
    },
    {
      "duty": "Drive acquisition of customers by actively developing and managing channel partners and sales and marketing teams."
    },
    {
      "duty": "Work with Product Development to ensure desired products and services to address the Market Opportunity."
    },
    {
      "duty": "Work closely with executive management and board of directors to align Mobility strategy and business plan with the overall organizational goals, objectives, and revenue plan."
    },
    {
      "duty": "Define, develop, ensure customer experience that is truly differentiated and enhanced, intuitive and fully integrated, automated with self-care to drive customer satisfaction, retention and increased usage."
    },
    {
      "duty": "Ensure end-to-end Mobility business meets financial and customer performance KPIs."
    },
    {
      "duty": "Lead supporting organization and all product/solutions teams, including both general administrative and more detailed strategic leadership."
    },
    {
      "duty": "Maintain end-to-end ownership of the products and solutions."
    },
    {
      "duty": "Define KPIs for Business Success of Products."
    },
    {
      "duty": "Enable continuous ongoing reporting of Product KPIs."
    },
    {
      "duty": "Ensure proper ongoing health monitoring of deployed products and services – scalability, availability and performance."
    },
    {
      "duty": "Work with customer care to enable support for production launched products/services."
    },
    {
      "duty": "Provide product performance/usage results to Product."
    },
    {
      "duty": "Provide inputs into product development for product feature roadmap and enhancements."
    },
    {
      "duty": "Develop and communicate team goals as well as track team accomplishments."
    },
    {
      "duty": "Recruit (and retain) excellent team members, establish roles and responsibilities."
    },
    {
      "duty": "Clearly define tasks to keep accountability towards achievement of team goals."
    },
    {
      "duty": "Motivate and mentor team members to establish and accomplish business and personal professional goals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in Business, Engineering, Computer Science preferred(Bachelor’s degree acceptable with right level of work experience)"
    }
  ]
}