{
  "meta": [
    {
      "job_title": "Senior Procurement Manager",
      "job_category": "Procurement",
      "job_class": "Manager",
      "sector": "Procurement",
      "salary": 98000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversees all Company's purchasing of raw materials, work in process, finished goods, and other items to ensure materials, products, and services are received on time and under budget."
    },
    {
      "duty": "Develops raw material strategies to support business objectives and deliver reliable, cost-effective outcomes to customers."
    },
    {
      "duty": "Builds and leads relationships with key partners including paper, and other raw materials."
    },
    {
      "duty": "Works with Finance to identify key cost-saving opportunities, develops initiatives and objectives for these opportunities, and executes a strategy to realize such savings."
    },
    {
      "duty": "Identifies and enhances the current estimating process to enable a single source program for processing estimates so that all Company's facilities can produce pricing for each other remotely."
    },
    {
      "duty": "Establishes strategic service models with partners, negotiating competitive volume and contractual rates for all Company's facilities."
    },
    {
      "duty": "Identifies and enhances the current outsourcing process to gain leverage from combined volumes from all Company's facilities and establish preferred vendor lists with contracts."
    },
    {
      "duty": "Leads the deployment, management, and adoption of technology including managing Company processes via PrintStream."
    },
    {
      "duty": "Establishes measurable KPI's, creates and maintains data and reporting tools to properly represent department performance and improvement."
    },
    {
      "duty": "Oversees development, monitoring, and reporting of department budget."
    },
    {
      "duty": "Identifies and implements best practice approaches to improve all aspects of the planning, ensuring the company has a service and cost advantage."
    }
  ],
  "skills": [
    {
      "skill": "Procurement Strategy",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Cost Savings Initiatives",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Outsourcing Process Improvement",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Technology Adoption",
      "experience": 5
    },
    {
      "skill": "KPI Management",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Business Process Improvement",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Procurement or related field of study or an equivalent level of experience in a manufacturing related industry"
    }
  ]
}