{
  "meta": [
    {
      "job_title": "Sales Account Manager",
      "job_category": "Sales",
      "job_class": "Account Manager",
      "sector": "Sales",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 3
    },
    {
      "skill": "Customer Relations",
      "experience": 4
    },
    {
      "skill": "Market Analysis",
      "experience": 4
    },
    {
      "skill": "Price Management",
      "experience": 3
    },
    {
      "skill": "Presentation Skills",
      "experience": 4
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 4
    },
    {
      "skill": "Microsoft Applications",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage existing business and analyze customer needs to sell excess products and maximize sales margins for poultry products."
    },
    {
      "duty": "Develop and implement strategic growth plans for food services, wholesale markets, and value-add processing."
    },
    {
      "duty": "Analyze sales growth for competitive opportunities and implement initiatives."
    },
    {
      "duty": "Resolve customer service issues and investigate customer claims."
    },
    {
      "duty": "Enter customer orders into the system and act as a liaison between customers, Sales Managers, and logistics and operations personnel."
    },
    {
      "duty": "Maintain customer focus, relationships, and satisfaction across the customer base."
    },
    {
      "duty": "Create and deliver presentations for sales initiatives and pricing adjustments to both internal and external customers."
    },
    {
      "duty": "Identify new customers, develop new opportunities, and partner with the sales team."
    },
    {
      "duty": "Serve as a resource for Sales Account Managers in customer relations and pricing, and facilitate issue resolution."
    },
    {
      "duty": "Wear personal protective equipment in required areas and perform additional relevant duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 85,
      "student_teacher": 75,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent; some college work preferred"
    }
  ]
}