{
  "meta": [
    {
      "job_title": "Patient Care Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 25000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Promotes and fosters ongoing collaborative communication with healthcare professionals and VNS Health to establish coordinated VNS Health services."
    },
    {
      "duty": "Functions as a liaison between external customers, patients, families and VNS Health."
    },
    {
      "duty": "Coordinates and shares information with patient’s other health care providers as appropriate."
    },
    {
      "duty": "Assists in the order processing for supplies, durable medical equipment, laboratory work and other appropriate items needed for the patient."
    },
    {
      "duty": "Determines customer needs and provides accurate and responsive intake to ensure customer satisfaction."
    },
    {
      "duty": "Builds and maintains a positive relationship with referral sources."
    },
    {
      "duty": "Creates and follows up on pending referrals using established guidelines with internal and external parties via phone, emails, fax, etc."
    },
    {
      "duty": "Completes relevant follow-up documentation in patient's chart in a timely manner."
    },
    {
      "duty": "Performs and submits weekly and monthly Pending Referrals reports and statistics to the VP of Operations."
    },
    {
      "duty": "Participates in the Daily Intake management huddles."
    },
    {
      "duty": "Presents pending cases that require management review and approval for next steps."
    },
    {
      "duty": "Coordinates with CCSS ICs for assistance in scheduling Start of Care."
    },
    {
      "duty": "Participates in special projects and performs other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Coordination",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Documentation Management",
      "experience": 2
    },
    {
      "skill": "Referral Processing",
      "experience": 2
    },
    {
      "skill": "Medical Terminology",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Adaptability",
      "experience": 2
    },
    {
      "skill": "Negotiation Skills",
      "experience": 2
    },
    {
      "skill": "Follow-Up Skills",
      "experience": 2
    },
    {
      "skill": "Bilingualism",
      "experience": 2
    },
    {
      "skill": "Managed Care Knowledge",
      "experience": 2
    },
    {
      "skill": "Medicare/Medicaid Knowledge",
      "experience": 2
    },
    {
      "skill": "Insurance Authorization/Billing",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Health Care, Business or a related field or the equivalent work experience required"
    }
  ]
}