{
  "meta": [
    {
      "job_title": "Patient Care Assistant",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care Services",
      "experience": 2
    },
    {
      "skill": "Registered Nurse Supervision",
      "experience": 2
    },
    {
      "skill": "High Risk Behavior Management",
      "experience": 2
    },
    {
      "skill": "Healthcare Policy Compliance",
      "experience": 2
    },
    {
      "skill": "Teamwork",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Performance Improvement",
      "experience": 2
    },
    {
      "skill": "Fiscal Responsibility",
      "experience": 2
    },
    {
      "skill": "City of Hope Values",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver specific patient care services to selected patients at the direction of and under the supervision of a Registered Nurse."
    },
    {
      "duty": "Support the efforts of the health care team through the delivery of services in a prompt, accurate and courteous manner."
    },
    {
      "duty": "Maintain current knowledge and awareness of organizational and regulatory standards, policies and procedures."
    },
    {
      "duty": "Participate in a collaborative, empowered work environment as demonstrated through teamwork."
    },
    {
      "duty": "Effectively communicate with all customers and team members to meet organizational goals and to provide customer satisfaction."
    },
    {
      "duty": "Actively participate in performance improvement activities to continuously improve service delivery."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Graduate or equivalent plus one of the following: Non-licensed graduate of a Registered Nurse or Licenses Vocational (LVN) program; or Enrollment in an approved RN program and completion of at least one medical surgical clinical rotation; or Certification as a Nursing Assistant; or If hired before May 1, 2018, successful completion of a Nursing Assistant Program."
    }
  ]
}