{
  "meta": [
    {
      "job_title": "Resource Development Manager",
      "job_category": "Fundraising",
      "job_class": "Manager",
      "sector": "Nonprofit",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the Chief Development Officer to develop and execute fundraising strategies."
    },
    {
      "duty": "Build relationships with community organizations, corporations, and small businesses supporting revenue goals."
    },
    {
      "duty": "Serve as the community liaison for community engagement and community networking with chambers of commerce, small businesses, and community advocates."
    },
    {
      "duty": "Implement community outreach programs, organize events, coordinate volunteers, and write and release publicity material that promotes the BGCDT mission."
    },
    {
      "duty": "Solicit and manage experiences for event sponsorships up to $5000, including but not limited to prospecting, engagement, tracking, stewardship, etc."
    },
    {
      "duty": "Manage grant proposals and reporting for small grants up to $5000 and all the tasks associated with such, including but not limited to prospecting, engagement, tracking, stewardship, etc."
    },
    {
      "duty": "Oversee planning, scheduling, and execution of board-sponsored community cultivation activities."
    },
    {
      "duty": "Manage event consultants and provide leadership for fundraising events, including but not limited to Great Futures Golf Outing; Tennies & Ties Annual Gala."
    },
    {
      "duty": "Manage Raiser’s Edge database administration functions, including gift entry, acknowledgment, receipting, stewardship, record maintenance, etc."
    },
    {
      "duty": "Provide gift entry into Raiser’s Edge with subsequent gift acknowledgment and receipting."
    },
    {
      "duty": "Entering and updating donors and prospects, tracking and updating actions in Raiser’s Edge."
    },
    {
      "duty": "Event Management of the following: Cultivation Events; Golf Outing; Gala; Donor Recognition Event; Youth of the Year; Community Appreciation."
    },
    {
      "duty": "Donor experiences involving stewardship and recognition, including but not limited to gift receipts, board calls and notes, member cards, and notes."
    },
    {
      "duty": "Work closely to support the Chief Development Officer in managing tasks associated with the organization’s annual resource development plan."
    },
    {
      "duty": "Prepare agendas and help create and distribute action items for the Resource Development Committee meetings as needed/determined."
    },
    {
      "duty": "Design department materials as needed, including case studies, stewardship items, and other light graphic design work."
    },
    {
      "duty": "In partnership with the Office Administrator, help prepare any materials, coordinate lunches, and set up and take down for board and committee meetings."
    },
    {
      "duty": "Manage creation and sending of resource development mailings and digital communications."
    },
    {
      "duty": "Assist with report generation, including updating the Action Status Report and Relationship Strategy Report, for the Chief Development Officer and Development Committee Chair."
    },
    {
      "duty": "Co-manage event ticketing and mobile bidding platform with the Director of Digital Experience."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "skills": [
    {
      "skill": "Fundraising Strategies",
      "experience": 5
    },
    {
      "skill": "Community Relations",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Donor Management",
      "experience": 5
    },
    {
      "skill": "Marketing Material Design",
      "experience": 5
    },
    {
      "skill": "Database Administration",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Report Generation",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Nonprofit Management, Business, or a related field (Master's preferred)"
    }
  ]
}