{
  "meta": [
    {
      "job_title": "Inside Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Demand Generation",
      "experience": 5
    },
    {
      "skill": "Lead Nurturing",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Sales Demo",
      "experience": 5
    },
    {
      "skill": "Event Selling",
      "experience": 5
    },
    {
      "skill": "Brand Ambassadorship",
      "experience": 5
    },
    {
      "skill": "Lead Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify qualified prospects and navigate company structures to identify decision-makers."
    },
    {
      "duty": "Learn, leverage, and help evolve our demand-generation process."
    },
    {
      "duty": "Generate appointments by means of proactive outbound prospecting."
    },
    {
      "duty": "Work closely with the Field Marketing team to identify various events, build a strategy on engagement and sessions."
    },
    {
      "duty": "Serve as a brand ambassador for the organization, showcasing solutions and fostering valuable connections at physical and virtual events."
    },
    {
      "duty": "Engage event attendees in meaningful conversations, skillfully qualifying leads to identify promising opportunities."
    },
    {
      "duty": "Identify potential business prospects to expand the reach of the organization's offerings."
    },
    {
      "duty": "Convert leads into qualified opportunities and pass them to the sales team."
    },
    {
      "duty": "Drive traffic and maximize booth presence through targeted pre-event and during-event outreach."
    },
    {
      "duty": "Coordinate with remote teams to streamline lead management and ensure efficient coordination."
    },
    {
      "duty": "Track and analyze lead activity, providing valuable insights and recommendations to optimize lead generation strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Sales, Business, or a related field (Master's preferred)"
    }
  ]
}