{
  "meta": [
    {
      "job_title": "Application Systems Analyst",
      "job_category": "Information Technology",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "SAP S/4 HANA",
      "experience": 5
    },
    {
      "skill": "Business Process Analysis",
      "experience": 5
    },
    {
      "skill": "System Configuration",
      "experience": 5
    },
    {
      "skill": "Integration Management",
      "experience": 5
    },
    {
      "skill": "Data Migration",
      "experience": 5
    },
    {
      "skill": "Technical Support",
      "experience": 5
    },
    {
      "skill": "Application Security",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for analysis, technical design, system configuration, testing, maintenance, and lifecycle management of the SAP S/4 HANA enterprise application in the Supply Chain functional area(s)."
    },
    {
      "duty": "Provide troubleshooting and operational support for integrations between the S/4 HANA enterprise application and the Transportation and/or Warehouse Management Systems."
    },
    {
      "duty": "Collaborate with Business Systems Analysts (BSAs) and others to define/clarify business requirements and provide configuration and development recommendations and estimations for new or enhanced functionality."
    },
    {
      "duty": "Coordinate execution of project tasks in assigned functional area and be comfortable working under the pressure of tight project deadlines."
    },
    {
      "duty": "Design and develop test plans, and document test cases for executing unit, integration, system, regression, and acceptance testing to ensure the solution meets the business requirements."
    },
    {
      "duty": "Maintain relevant functional and technical support documentation that adheres to established standards to ensure streamlined support and knowledge transfer within areas of responsibility."
    },
    {
      "duty": "Design and perform application security audits, system backup procedures, and other recovery processes in accordance with the cooperative’s disaster recovery and business continuity strategies."
    },
    {
      "duty": "Assist with periodic license and financial audits of enterprise applications and data."
    },
    {
      "duty": "Assist in creating strategies that promote standardization and optimization of processes."
    },
    {
      "duty": "Monitor and test application performance and prepare and deliver application performance statistics and reports."
    },
    {
      "duty": "Collaborate with server and database teams to ensure smooth and reliable operation of enterprise applications to fulfill business objectives and support processes according to the support level agreements."
    },
    {
      "duty": "Maintain technical knowledge of enterprise application components and architecture by researching and evaluating capabilities to support new or changing business strategies."
    },
    {
      "duty": "Drive continuous improvement by remaining current with industry and technology trends and IT best practices for enterprise applications and configuration."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Computer Science or Information Systems; OR 5+ years of equivalent experience required."
    }
  ]
}