{
  "meta": [
    {
      "job_title": "Cost Accounting Manager",
      "job_category": "Accounting",
      "job_class": "Manager",
      "sector": "Accounting",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cost Accounting",
      "experience": 10
    },
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Process Improvement",
      "experience": 10
    },
    {
      "skill": "Regulatory Reporting",
      "experience": 10
    },
    {
      "skill": "Staff Training",
      "experience": 10
    },
    {
      "skill": "Aerospace Manufacturing",
      "experience": 5
    },
    {
      "skill": "LEAN Exposure",
      "experience": 5
    },
    {
      "skill": "Complex Analysis",
      "experience": 10
    },
    {
      "skill": "GAAP",
      "experience": 10
    },
    {
      "skill": "Business Reporting",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads the creation, analysis, and reporting of financial data necessary for effective and efficient pricing and monitoring of major lines of business and products."
    },
    {
      "duty": "Provides input into the development and revision of department cost allocation policies, procedures, and systems."
    },
    {
      "duty": "Directs the timely and accurate preparation of regulatory reports, analysis, forecasts, and operating plans."
    },
    {
      "duty": "Provides a critical review of operating expense allocations, reports, analysis, and projections."
    },
    {
      "duty": "Motivates staff to perform duties and provides formal and informal training that promotes staff development."
    },
    {
      "duty": "Accountable for instilling the process improvement mindset into day-to-day activities within larger team."
    },
    {
      "duty": "Drives change activities through the entire department that improve Cost Accounting's ability to meet the current and future demands of our customers."
    },
    {
      "duty": "Is viewed as a subject matter expert in all areas of Cost Allocations and proactively consults with both internal and external customers."
    },
    {
      "duty": "Provides both formal and informal training that promotes staff development."
    },
    {
      "duty": "Identify, diagnose, influence, and implement process improvement ideas that improve effectiveness and preserve the ability to meet the needs of customers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Accounting, Master's Degree preferred."
    }
  ]
}