{
  "meta": [
    {
      "job_title": "Ophthalmic Imaging Supervisor",
      "job_category": "Healthcare",
      "job_class": "Supervisor",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Oversee the delivery of patient care and customer service, ensuring the timely resolution of concerns."
    },
    {
      "duty": "Supervise all technical ophthalmic imaging functions to include patient imaging and image quality management."
    },
    {
      "duty": "Ensure regulatory measures are followed to ensure a safe environment for patients and staff."
    },
    {
      "duty": "Monitor equipment performance and promptly report any equipment failures or needed repairs."
    },
    {
      "duty": "Jointly forecast staffing, capital, and budgetary needs."
    },
    {
      "duty": "Analyze and determine appropriate staffing to support clinical services while ensuring efficiency and maximizing resources."
    },
    {
      "duty": "Oversee human resource activities such as interviewing and hiring, training, verifying payroll, and managing employee performance."
    },
    {
      "duty": "Provide direct patient care in accordance with the incumbent's education and/or licensure."
    },
    {
      "duty": "Purchases medical and office supplies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Three (3) years of technical experience, or the equivalency."
    },
    {
      "credential": "Bachelor’s Degree in a related field, or equivalency."
    },
    {
      "credential": "Certification in at least six clinical study imaging protocols."
    },
    {
      "credential": "Certified Retinal Angiographer Certification (CRA)"
    },
    {
      "credential": "Current RQI Healthcare Provider eCredential through the University of Utah Health RQI system. The eCredential is to be obtained within 30 days of hire."
    },
    {
      "credential": "Optical Coherence Tomographer Certification (OCT-C)"
    },
    {
      "credential": "Additional license requirements as determined by the hiring department."
    }
  ]
}