{
  "meta": [
    {
      "job_title": "Associate Partner",
      "job_category": "Human Resources",
      "job_class": "HR",
      "sector": "Human Resources",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Respond accurately and professionally to questions and concerns from associates through multiple channels in a timely manner."
    },
    {
      "duty": "Escalate and take partners when discrepancies or issues arise with associate interactions such as Leave of Absence, accommodations, or other employee relations issues."
    },
    {
      "duty": "Enter and review associate data within HRIS and payroll systems in a timely and accurate manner."
    },
    {
      "duty": "Provide subject matter expertise to associates and leadership on people practices, systems, and resources."
    },
    {
      "duty": "Compile, assess, and use data regarding critical business metrics such as attendance, attrition, engagement, labor fill, etc."
    },
    {
      "duty": "Advocate for the employee experience by partnering effectively with leaders, partners, and core teams to provide world-class service to Amazon associates, including educating them on how and when to use self-service tools."
    },
    {
      "duty": "Draft and distribute communications to associates and leaders."
    },
    {
      "duty": "Plan, coordinate and implement associate activities that create an inclusive environment."
    },
    {
      "duty": "Assist managers in responding to associate questions regarding time/attendance, benefits, policies, accommodations, LOA."
    }
  ],
  "skills": [
    {
      "skill": "Human Resources",
      "experience": 1
    },
    {
      "skill": "Microsoft Office",
      "experience": 1
    },
    {
      "skill": "HRIS",
      "experience": 1
    },
    {
      "skill": "Payroll Processing",
      "experience": 1
    },
    {
      "skill": "Data Analysis",
      "experience": 1
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Time Management",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school degree or equivalent. Preferred: Associate’s degree from an accredited college."
    }
  ]
}