{
  "meta": [
    {
      "job_title": "Patient Account Specialist",
      "job_category": "Healthcare",
      "job_class": "Finance",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medical Billing Practices",
      "experience": 4
    },
    {
      "skill": "Customer Services",
      "experience": 5
    },
    {
      "skill": "Mathematics Skills",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Insurance Billing",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage patient balances and ensure accounts are clean and ready for self-pay collections post all insurance processes are completed."
    },
    {
      "duty": "Work closely with admissions teams to understand patient responsibility and expectations of collections are in line with financial agreements."
    },
    {
      "duty": "Initiate collection calls to patients or their families to collect outstanding balances."
    },
    {
      "duty": "Handle large volume of inbound calls regarding outstanding balances and invoices."
    },
    {
      "duty": "Provide daily/weekly updates to leadership on collections status."
    },
    {
      "duty": "Manage large volumes of patient accounts each week."
    },
    {
      "duty": "Processing invoice and credit requests in accordance with collections guidelines."
    },
    {
      "duty": "Timely response to inquiries received from other departments associated with patient care."
    },
    {
      "duty": "Navigate and gather data from various internal sources to ensure proper balances are collected."
    },
    {
      "duty": "Investigate escalated insurance billing inquiries and inaccuracies and take appropriate action to resolve the account."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100
    },
    {
      "student_teacher": 40
    },
    {
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Health Care Administration, Finance, Accounting, or a related field (Master's preferred)"
    }
  ]
}