{
  "meta": [
    {
      "job_title": "Analyst, FP&A",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Forecasting",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Financial Modeling",
      "experience": 5
    },
    {
      "skill": "Variance Analysis",
      "experience": 5
    },
    {
      "skill": "Valuation",
      "experience": 5
    },
    {
      "skill": "GAAP Compliance",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Business Intelligence",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage financial forecasts, annual budgeting process, operating plan variance analysis, and acquisition integration projects."
    },
    {
      "duty": "Supervise valuations of all newly acquired companies as required under US GAAP."
    },
    {
      "duty": "Financial modeling of the potential impact of acquisitions, new/lost contracts, business expansion, CapEx, etc. on the consolidated results of operations and financial position."
    },
    {
      "duty": "Analyze current and past trends in key performance indicators including revenue, cost of sales, operating and SG&A expenses, and capital expenditures."
    },
    {
      "duty": "Monitor performance indicators, highlighting trends and analyzing causes of unexpected variance."
    },
    {
      "duty": "Oversee and manage the continued development of Budgeting, Financial Forecasting, Operating Plan, and modeling tools including lender loan compliance/covenant model."
    },
    {
      "duty": "Prepare monthly and quarterly financial reports for leadership, sponsors, and lenders."
    },
    {
      "duty": "Implement and work with a business intelligence tool and dashboard reports."
    },
    {
      "duty": "Improve performance by evaluating processes to drive efficiencies and develop financial models and analyses to support strategic initiatives."
    },
    {
      "duty": "Analyze complex financial information and reports to provide accurate and timely financial recommendations to management."
    },
    {
      "duty": "Prepare quarterly presentations to Board of Directors and Senior Management Team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Accounting, or another related field (Master's preferred)"
    }
  ]
}