{
  "meta": [
    {
      "job_title": "Administrative Assistant II",
      "job_category": "Administration",
      "job_class": "Assistant",
      "sector": "General",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Administrative Support",
      "experience": 3
    },
    {
      "skill": "Office Practices",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Computer Software Proficiency",
      "experience": 3
    },
    {
      "skill": "Organization",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide complex administrative support to an individual, office, department or program under general supervision."
    },
    {
      "duty": "Edit, format, and revise a variety of documents and materials created by others. Proofread for errors and convert rough drafts to final version quality reports, presentations, and documents."
    },
    {
      "duty": "Develop, implement, and maintain paper and electronic filing systems. Create reports as needed."
    },
    {
      "duty": "Research, analyze, and summarize information for reports independently. Communicate findings orally and in writing."
    },
    {
      "duty": "Receive and read incoming correspondence and information. Summarize and prioritize review of correspondence."
    },
    {
      "duty": "Receive and screen telephone calls and visitors. Handle procedural and substantive matters and inquiries."
    },
    {
      "duty": "Make arrangements for travel and perform required administrative follow-up and recordkeeping."
    },
    {
      "duty": "Assist in preparing and administering department budget by updating accounts and running periodic reports."
    },
    {
      "duty": "Act as intermediary for supervisor, interact with officials, staff at all levels and the public. Provide information requiring comprehensive knowledge of institutional policies, procedures, and special departmental issues."
    },
    {
      "duty": "Provide day-to-day administrative support to the Chair, faculty, staff, and students of the Department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED (B.S degree preferred)"
    }
  ]
}