{
  "meta": [
    {
      "job_title": "Embedded Support Program Coordinator",
      "job_category": "Education",
      "job_class": "Program Coordinator",
      "sector": "Education",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Managing the day-to-day embedded program operations and student staff in alignment with best practices."
    },
    {
      "duty": "Coordinating high quality academic support services with various academic faculty from a diverse range of disciplines."
    },
    {
      "duty": "Recruiting, hiring, scheduling, supervising, and evaluating Embedded Peer Leaders."
    },
    {
      "duty": "Conducting regular meetings and session observations with the Embedded Peer Leaders."
    },
    {
      "duty": "Providing daily/weekly session plan feedback to Embedded Peer Leaders."
    },
    {
      "duty": "Developing and facilitating training for peer leaders in high-impact practices proven to promote student success, including fostering a sense of belonging, helping students with metacognition and skill transfer, facilitating collaborative learning opportunities, and writing effective and measurable learning objectives for session planning."
    },
    {
      "duty": "Tracking and reporting daily/weekly/monthly service utilization and satisfaction to designated faculty or campus partners."
    },
    {
      "duty": "Assessing the effectiveness of embedded programs and services by analyzing usage data, program surveys, and other center reports."
    },
    {
      "duty": "Marketing and promoting the embedded programs and services across campus to all stakeholders."
    },
    {
      "duty": "Assisting with coordination/facilitation of campus-wide training for peer support specialists."
    },
    {
      "duty": "Participating in campus-wide committees."
    },
    {
      "duty": "Supporting other center-wide operations, initiatives, programs, etc. at the discretion of supervisor."
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Recruitment",
      "experience": 3
    },
    {
      "skill": "Training and Development",
      "experience": 3
    },
    {
      "skill": "Program Coordination",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Marketing",
      "experience": 3
    },
    {
      "skill": "Report Generation",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from a regionally accredited institution.At least one year of experience in a professional role in higher education or in another relevant field."
    }
  ]
}