{
  "meta": [
    {
      "job_title": "Program Director",
      "job_category": "Healthcare",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Milieu Management",
      "experience": 5
    },
    {
      "skill": "Group Dynamics",
      "experience": 5
    },
    {
      "skill": "Individual and Family Treatment",
      "experience": 5
    },
    {
      "skill": "Biological Aspects of Psychological Illness",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive program plans for an inpatient psychiatric setting, ensuring adherence to individual treatment plans and best practices."
    },
    {
      "duty": "Provide clinical supervision of program dynamics within the acute therapeutic milieu, supporting efforts to reduce restraints and unusual incidents."
    },
    {
      "duty": "Coordinate program plans with healthcare standards for the population being served, and maintain a favorable attitude toward program review and evaluation."
    },
    {
      "duty": "Maintain ongoing consultation and serve as a liaison between clinicians, psychiatrists, nurses, direct care staff, and outside agencies to ensure effective treatment."
    },
    {
      "duty": "Conduct bi-weekly meetings and supervision sessions with all Mental Health Technicians, promoting quality treatment and excellence in the milieu."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate degree from an accredited school of psychology, social work, professional counseling, education, or medicine with licensure or licensure eligibility as a Clinical Psychologist, Psychologist, Clinical Social Worker, Professional Counselor, Nursing or Psychiatrist (MSW, LPC, LCSW, LCPC or RN BSN). Five years' full-time experience in inpatient psychiatric setting or equivalent preferred. One-year supervisory experience preferred."
    }
  ]
}