{
  "meta": [
    {
      "job_title": "Produce Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Ordering",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and control the operation of the Produce Department, including supervising and training personnel to achieve departmental and store sales and profit objectives."
    },
    {
      "duty": "Supervise department staff to include scheduling, training, and assigning duties."
    },
    {
      "duty": "Implement all merchandising programs and ensure standards of Department presentation and operations are met."
    },
    {
      "duty": "Responsible for ordering and inventory control to meet division 'turn' goals."
    },
    {
      "duty": "Ensure the Department has the highest quality of produce available for the customer and monitor to ensure variety standards are followed."
    },
    {
      "duty": "Ensure paperwork, as set by the Division, is followed and perform all other related duties as assigned by management."
    },
    {
      "duty": "Responsible for the sales and profitability of the produce department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma/GED or relevant work history or demonstrated ability to perform the essential functions of the position."
    },
    {
      "credential": "Minimum 2-3 years' experience in Produce, with Assistant Produce Manager experience preferred."
    },
    {
      "credential": "Must have strong leadership ability and possess strong Customer Service quality."
    },
    {
      "credential": "Highly motivated and team oriented."
    }
  ]
}