{
  "meta": [
    {
      "job_title": "Cloud Engineer",
      "job_category": "Software Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "AWS",
      "experience": 5
    },
    {
      "skill": "Terraform",
      "experience": 4
    },
    {
      "skill": "IAM",
      "experience": 4
    },
    {
      "skill": "S3",
      "experience": 4
    },
    {
      "skill": "EC2",
      "experience": 4
    },
    {
      "skill": "Python",
      "experience": 5
    },
    {
      "skill": "Bash",
      "experience": 4
    },
    {
      "skill": "DevOps",
      "experience": 5
    },
    {
      "skill": "Public Cloud Providers (AWS, Azure, GCP)",
      "experience": 5
    },
    {
      "skill": "Automation Tools (Ansible, Jenkins, Terraform, Kubernetes)",
      "experience": 5
    },
    {
      "skill": "Databases and Data (PostgreSQL, Redis)",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Be part of a global Cloud Center of Excellence focused on delivering cloud solutions."
    },
    {
      "duty": "Drive forward the Cloud Infrastructure as Code roadmap."
    },
    {
      "duty": "Partner with consumers within Sunlife to assist them in onboarding to the cloud, provision environments, develop roles, and build a seamless onboarding process."
    },
    {
      "duty": "Work with Enterprise Architecture team to ensure proper execution, business, and strategic alignment."
    },
    {
      "duty": "Consult and advise consumers on Cloud Services, best practices, and lead them to get onboarded to Cloud Environment seamlessly."
    },
    {
      "duty": "Build automation and compliance by design using Cloud Native technologies."
    },
    {
      "duty": "Be part of an Agile development team helping the business deliver strategic initiatives."
    },
    {
      "duty": "Work with new technologies and transforming legacy technology to leverage the Cloud."
    },
    {
      "duty": "Make both tactical and strategic decisions including delivering Cloud Proof of Concept (PoC) initiatives."
    },
    {
      "duty": "Work with Support teams to debug and fix reported issues, and act as an escalation point for incidents."
    },
    {
      "duty": "Apply best practices, standards, and ensure compliance to all company security directives."
    },
    {
      "duty": "Participate in security engineering to ensure compliance by design."
    },
    {
      "duty": "Support Cloud Audit, and Risk and compliance requirements from partnering with Security and governance teams."
    },
    {
      "duty": "Willing to work and support cloud platform with on engineering escalated on-call rotations."
    },
    {
      "duty": "AWS build out and support."
    },
    {
      "duty": "IaC and automation – Cloud formation and Terraform."
    },
    {
      "duty": "Dev/Ops but 90% the Ops part of Dev/Ops."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "University degree/college diploma in related discipline(s) or equivalent work experience, and/or 5+ years of industry experience in the IT industry"
    }
  ]
}