{
  "meta": [
    {
      "job_title": "Maintenance Technician",
      "job_category": "General Labor",
      "job_class": "Technician",
      "sector": "Facilities",
      "salary": 18.5,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform routine maintenance, janitorial duties and repair of buildings and grounds."
    },
    {
      "duty": "Report needs for major repairs as required by LSSI / CILA."
    },
    {
      "duty": "Follow all standards regarding safety, licensing, regulatory and agency requirements."
    },
    {
      "duty": "Assist in implementation of preventative maintenance program."
    },
    {
      "duty": "Assist in resident apartment or room turnover preparations."
    },
    {
      "duty": "Document work orders thru software based reporting system and complete other reporting functions as in compliance with LSSI and/or funding source requirements."
    },
    {
      "duty": "Willingness to guide and support DD staff in emergency situations, if available, either by phone or in person."
    },
    {
      "duty": "Perform other related tasks as necessary or assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma / Equivalent or  Light maintenance experience or handy man related experience."
    },
    {
      "credential": "Willingness and ability to participate/obtain LSSI, OSHA, CILA, etc. related training."
    },
    {
      "credential": "Comprehend and follow instructions, perform assigned tasks, maintain an appropriate work pace, perform complex and/or varied tasks, relate to others, make decisions, direct/control plan work, communicate in writing and verbally."
    },
    {
      "credential": "Valid Driver’s License in good standing."
    },
    {
      "credential": "Access to an insured vehicle with required and valid IL statutory minimum insurance coverage."
    }
  ]
}