{
  "meta": [
    {
      "job_title": "Readiness Coordinator",
      "job_category": "Operations",
      "job_class": "Coordinator",
      "sector": "Operations",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Planning and Scheduling",
      "experience": 5
    },
    {
      "skill": "Work Queue Management",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Database Query",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Utility Electrical Distribution Systems",
      "experience": 5
    },
    {
      "skill": "GIS",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct short-range planning and scheduling operational processes to ensure overall job readiness and minimize safety exposures."
    },
    {
      "duty": "Assist in providing reliable support to operations supervision by planning and scheduling activities, managing the work queue, staffing, equipment, and materials."
    },
    {
      "duty": "Develop a firm two-week plan of assigned operations center activities and a one-month projection of anticipated future activities."
    },
    {
      "duty": "Coordinating work request activities and performing pre-construction work request assessments."
    },
    {
      "duty": "Ensuring safety compliance, job readiness, and safe work practices."
    },
    {
      "duty": "Participating in interactions with internal/external customers on inquiries concerning construction and maintenance activities."
    },
    {
      "duty": "Managing time and priorities, and providing reliable support to supervision by planning and scheduling activities."
    },
    {
      "duty": "Physically visiting jobs to determine the job readiness state and communicating before jobs are dispatched."
    },
    {
      "duty": "Ensure UG Utility locates, switching/hold offs are completed, and reflecting lines employees crewing and vehicle assignments."
    },
    {
      "duty": "Assisting during emergencies and storm-related activities and traveling to various off-site locations as well as office locations, training facilities, and customer sites."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering Technology or related discipline and 1 to 4 years related work experience is required. In lieu of Bachelor's Degree, minimum 3 to 5 years related work experience is required."
    }
  ]
}