{
  "meta": [
    {
      "job_title": "Manager of Water Resources",
      "job_category": "Water Resources",
      "job_class": "Manager",
      "sector": "Environmental",
      "salary": 175000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Resource Planning",
      "experience": 7
    },
    {
      "skill": "Water Management",
      "experience": 7
    },
    {
      "skill": "Long-Range Planning",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Public Agency Experience",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop long-range water resources plans, studies, analyses, and special projects concerning water supply, system reliability, integrated resources, imported water, surface water, groundwater, wastewater, recycled water, stormwater, habitat conservation, climate resiliency, water use efficiency, conservation, energy management, and state and regional water issues."
    },
    {
      "duty": "Plan and direct the work of staff and consultants."
    },
    {
      "duty": "Oversee activities related to long-range water resources plans, studies, analyses, and special projects concerning water supply, system reliability, integrated resources, imported water, surface water, groundwater, wastewater, recycled water, stormwater, habitat conservation, climate resiliency, water use efficiency, conservation, energy management, and state and regional water issues."
    },
    {
      "duty": "Organize, integrate, and direct the work of the Water Resources Unit."
    },
    {
      "duty": "Plan and direct activities related to water supply, system reliability, integrated resources, imported water, surface water, groundwater, wastewater, recycled water, stormwater, habitat conservation, climate resiliency, water use efficiency, conservation, energy management, and state and regional water issues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in natural/physical sciences, engineering, water resources planning/management, urban/regional planning or a closely related field (Master’s degree preferred)"
    }
  ]
}