{
  "meta": [
    {
      "job_title": "Talent Operations Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Talent Operations",
      "experience": 5
    },
    {
      "skill": "Analytics",
      "experience": 5
    },
    {
      "skill": "Recruiting",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "ATS Usage",
      "experience": 5
    },
    {
      "skill": "Data Visualization",
      "experience": 5
    },
    {
      "skill": "Recruitment Process",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "Excel",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Enhance talent operations by executing talent program activities with excellence."
    },
    {
      "duty": "Efficiently manage talent program administration, including communications, participant management, reporting, and issue resolution, with a focus on stakeholder satisfaction."
    },
    {
      "duty": "Be the internal expert on our people talent platforms (ATS, Performance Platform, Salary.com)"
    },
    {
      "duty": "Conduct regular data and process audits to ensure data accuracy and identify areas for improvement."
    },
    {
      "duty": "Design and build data visualization dashboards for easy access to workforce insights, enabling data-driven decision-making."
    },
    {
      "duty": "Implement and execute efficient and effective recruiting and hiring processes to attract top talent and meet organizational needs."
    },
    {
      "duty": "Hire entry-level roles within the target time-to-hire window."
    },
    {
      "duty": "Build and maintain a continuous pipeline of A-players through LinkedIn and other platforms."
    },
    {
      "duty": "Support hiring process with compensation range assessment support, job description creation and new position communications."
    },
    {
      "duty": "Provide clear expectations to hiring managers and ensure timely and effective execution of recruiting processes with a focus on customer support."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 80,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred."
    }
  ]
}