{
  "meta": [
    {
      "job_title": "Oracle Financial Systems Support Specialist",
      "job_category": "Technical Support",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Oracle financial applications support",
      "experience": 6
    },
    {
      "skill": "SQL development",
      "experience": 3
    },
    {
      "skill": "Financial knowledge (AP, AR, GL, financial reporting)",
      "experience": 3
    },
    {
      "skill": "Commercial Off the Shelf product familiarity (Allegro, RightAngle, Waterfield, OneStream, UltiPro)",
      "experience": 3
    },
    {
      "skill": "ITIL concepts and incident management processes",
      "experience": 3
    },
    {
      "skill": "Troubleshooting and issue resolution across multiple systems",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitor and maintain Oracle financial applications to maximize availability and performance."
    },
    {
      "duty": "Troubleshoot and resolve business issues related to financial systems."
    },
    {
      "duty": "Create new reports and resolve errors or concerns with existing reports."
    },
    {
      "duty": "Investigate and diagnose service requests or incidents for assigned applications."
    },
    {
      "duty": "Provide technical and functional assistance for assigned applications."
    },
    {
      "duty": "Collaborate with users to identify and resolve issues impacting business processes."
    },
    {
      "duty": "Utilize 3rd parties and vendor support as defined within existing support arrangements."
    },
    {
      "duty": "Complete high-level designs and estimates to meet defined requirements."
    },
    {
      "duty": "Provide input to IT Project Management Office to support clear and concise requirements definitions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or related field (Master's preferred)"
    }
  ]
}