{
  "meta": [
    {
      "job_title": "Senior Construction Accountant",
      "job_category": "Accounting",
      "job_class": "Senior",
      "sector": "Construction",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Reporting",
      "experience": 7
    },
    {
      "skill": "General Ledger",
      "experience": 7
    },
    {
      "skill": "GAAP",
      "experience": 7
    },
    {
      "skill": "Cost Analysis",
      "experience": 7
    },
    {
      "skill": "Payroll Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain financial records and ensure that financial transactions are properly recorded."
    },
    {
      "duty": "Verify the accuracy of entries to ledger accounts and reconcile subsidiary ledger accounts to the general ledger."
    },
    {
      "duty": "Prepare complex balance sheets, profit and loss statements, and other financial reports."
    },
    {
      "duty": "Analyze current costs, revenues, financial commitments, and obligations incurred to predict future revenues and expenses."
    },
    {
      "duty": "Monitor revenue and expenses while coordinating collection, consolidation, and review of all financial data."
    },
    {
      "duty": "Prepare monthly and annual reports on expenditures and implement corrective actions when necessary."
    },
    {
      "duty": "Develop and maintain systems of control for accounting transactions."
    },
    {
      "duty": "Create, audit, and maintain effective chart of accounts and ensure costs are coded accurately."
    },
    {
      "duty": "Perform monthly closing of all assigned accounts ensuring detailed and accurate reconciliations are documented and filed for all balance sheet and income statement accounts."
    },
    {
      "duty": "Manage expense allocations from various departments and ensure accurate account coding."
    },
    {
      "duty": "Obtain and maintain a thorough understanding of the financial reporting and general ledger structure."
    },
    {
      "duty": "Manage all aspects of financial and accounting systems and processes including; compliance, A/P, A/R and revenue accounting, payroll, fixed assets and general ledger functions, and internal financial reporting."
    },
    {
      "duty": "Support audit requirements including internal, external, and compliance audits."
    },
    {
      "duty": "Assist with special projects as requested by Controller and CFO."
    },
    {
      "duty": "Assist the accounting department and outside vendors to ensure financial accuracy, cost control and reporting."
    },
    {
      "duty": "Preserve confidentiality of sensitive information."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree with an emphasis in Accounting"
    }
  ]
}