{
  "meta": [
    {
      "job_title": "Information Technology Manager II – Infrastructure",
      "job_category": "Information Technology",
      "job_class": "Manager",
      "sector": "Information Technology",
      "salary": 170000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "IT Infrastructure Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Help Desk/ITSM Solutions",
      "experience": 5
    },
    {
      "skill": "Network Administration",
      "experience": 5
    },
    {
      "skill": "Communication and Presentation Skills",
      "experience": 5
    },
    {
      "skill": "On-prem and Cloud Server Solutions",
      "experience": 5
    },
    {
      "skill": "Personnel Management",
      "experience": 5
    },
    {
      "skill": "Network Operations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the Infrastructure Section of the Systems Division, managing 21 staff members, an approximate budget of $4 million, and various projects and systems."
    },
    {
      "duty": "Exercise personnel management and strong leadership skills to build highly effective teams in a culture driven by team accomplishments and organizational advancement."
    },
    {
      "duty": "Facilitate approximately 450+ program/system end users."
    },
    {
      "duty": "Guide staff members through complex projects using technical expertise and strategic planning."
    },
    {
      "duty": "Give presentations to Executive Management, other departments within the organization, and the Board of Trustees at monthly meetings."
    },
    {
      "duty": "Lead a variety of new projects, from initial planning process through final implementation of all IT business solutions."
    },
    {
      "duty": "Serve as a respectable representative of the organization while interfacing with vendors, contractors, and outside agencies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 95
    }
  ],
  "education_certification": [
    {
      "credential": "A bachelor’s degree from an accredited college in Computer Science, Information Systems, or a closely related field; AND 5 years of progressively responsible, full-time, paid experience in a centralized Information Technology organization, performing information systems analysis and design, application development, network administration, or operating systems analysis; of which 2 years must be in a management capacity; OR 3 years of experience at the level of Information Technology Manager I, LACERA, or Information Technology Specialist I, LACERA; OR 5 years of progressively responsible, full-time, paid experience in managing the design, development, implementation, operation, and maintenance of a large complex information systems program in a large, multi-service public or private sector organization. A valid California Class C Driver License or the ability to utilize an alternative method of transportation when needed to carry out job-related essential functions."
    }
  ]
}