{
  "meta": [
    {
      "job_title": "Quality Control Supervisor",
      "job_category": "Quality Control",
      "job_class": "Supervisor",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervises and oversees the Quality Control inspectors; ensures that all inspectors are current in their required procedural training. Leads new inspector training as well as ongoing refresher training. This includes the new product lines as the business grows."
    },
    {
      "duty": "Schedules and prioritizes all receiving inspections, start-up, in-process, and final inspections of finished goods. If necessary, actively participates in QC inspections as appropriate to ensure compliance and timely completion."
    },
    {
      "duty": "Actively manages and controls the non-conforming materials as well as the quarantined product. Facilitates the weekly multi-functional Material Review Board meetings, driving timely disposition of non-conformances per the QMS requirements. Seeks appropriate help from the Quality Director."
    },
    {
      "duty": "Oversees and assists in the management of the calibration program as well as the temperature loggers; accountable for contacting external providers to schedule timely calibration services to QC instruments. Ensures availability of all required tools and instruments to perform required QC inspections."
    },
    {
      "duty": "Implements at least two improvement ideas per year on process simplification and harmonization related to QC inspections (receiving, in-process and final inspection)."
    },
    {
      "duty": "Ensures compliance with and/or follows all organizational systems, programs, training, policies, and procedures as required and complies with relevant legal mandates. Seeks guidance as necessary."
    },
    {
      "duty": "Carries out all responsibilities in an honest, ethical, and professional manner."
    },
    {
      "duty": "Must be able to fulfill essential job function in a consistent state of alertness and safe manner."
    },
    {
      "duty": "Handles various other duties as delegated by the Quality Director."
    }
  ],
  "skills": [
    {
      "skill": "Quality Management System (QMS) Implementation",
      "experience": 5
    },
    {
      "skill": "ISO 9001 and ISO 13485 Standards",
      "experience": 5
    },
    {
      "skill": "Microsoft Navision Dynamics MRP System",
      "experience": 3
    },
    {
      "skill": "Internal Audits",
      "experience": 5
    },
    {
      "skill": "Continuous Improvement Projects",
      "experience": 5
    },
    {
      "skill": "Geometric Dimensioning and Tolerancing",
      "experience": 5
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Adaptability",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in technical, management or related field; or equivalent education and work experience required"
    }
  ]
}