{
  "meta": [
    {
      "job_title": "Facilities and Equipment Maintenance Manager",
      "job_category": "Maintenance",
      "job_class": "Manager",
      "sector": "Maintenance",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Maintenance Management",
      "experience": 5
    },
    {
      "skill": "Preventive Maintenance",
      "experience": 5
    },
    {
      "skill": "Equipment Inspection",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Facility Safety",
      "experience": 5
    },
    {
      "skill": "Problem-solving",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Mechanical Engineering",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a comprehensive maintenance strategy for all facility equipment and systems, including but not limited to processing machinery, HVAC, electrical systems, plumbing, and building infrastructure."
    },
    {
      "duty": "Lead a team of maintenance technicians and collaborate with other departments to ensure seamless production operations."
    },
    {
      "duty": "Plan and schedule preventive maintenance tasks to minimize downtime and maximize equipment reliability."
    },
    {
      "duty": "Conduct regular inspections and audits of equipment to identify potential issues and address them proactively."
    },
    {
      "duty": "Troubleshoot and diagnose equipment malfunctions, coordinating repairs and replacements as needed."
    },
    {
      "duty": "Maintain accurate records of maintenance activities, equipment performance, and repairs for reporting purposes."
    },
    {
      "duty": "Ensure compliance with food safety regulations, industry standards, quality control protocols, and GFSI/SQF compliant programs. Manage the maintenance budget, monitor expenditures, and recommend cost-effective solutions."
    },
    {
      "duty": "Collaborate with the (General Manager) GM to source spare parts and manage vendor relationships."
    },
    {
      "duty": "Implement continuous improvement initiatives to enhance equipment efficiency, reduce downtime, and optimize resource utilization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 255,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Mechanical Engineering, Industrial Maintenance, or a related field (or equivalent work experience)"
    }
  ]
}