{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Leadership",
      "experience": 5
    },
    {
      "skill": "Team Mentorship",
      "experience": 5
    },
    {
      "skill": "Retail Management",
      "experience": 5
    },
    {
      "skill": "Customer Experience Enhancement",
      "experience": 5
    },
    {
      "skill": "Business Strategy Development",
      "experience": 5
    },
    {
      "skill": "Event Organization",
      "experience": 5
    },
    {
      "skill": "Stakeholder Communication",
      "experience": 5
    },
    {
      "skill": "Community Engagement",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive business strategies to drive sales and enhance store profitability."
    },
    {
      "duty": "Lead and mentor the sales team, fostering a culture of motivation and commitment to meet sales objectives."
    },
    {
      "duty": "Hire, train, and oversee new staff to ensure a high-performing and knowledgeable sales team."
    },
    {
      "duty": "Enhance customer experience to achieve excellence in service and satisfaction."
    },
    {
      "duty": "Monitor and improve store metrics including average sale, orders, margins, revenue, and spiffs."
    },
    {
      "duty": "Create and implement business strategies to attract new customers and enhance store profitability."
    },
    {
      "duty": "Organize store and company events to engage the community and attract new customers."
    },
    {
      "duty": "Communicate effectively with Regional Manager, Services Manager, and CEO to align store operations with company objectives."
    },
    {
      "duty": "Inspire and foster professional development among employees to build a high-performing team."
    },
    {
      "duty": "Develop positive community relationships and act as a role model to enhance the store's reputation."
    },
    {
      "duty": "Build business-to-business community relationships to drive store sales and partnerships."
    },
    {
      "duty": "Collaborate with Senior Management in important projects and assume additional responsibilities when needed to support the team."
    },
    {
      "duty": "Ensure customer satisfaction through positive interactions and exceptional service."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 150,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "3 years of experience in a leadership position."
    },
    {
      "credential": "Dynamic Footwear Specialist Certification."
    },
    {
      "credential": "3 years of retail, apparel, and footwear, anatomy & physiology, and business experience."
    }
  ]
}