{
  "meta": [
    {
      "job_title": "Cloud Network Engineer",
      "job_category": "Information Technology",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cloud Network Engineering",
      "experience": 4
    },
    {
      "skill": "Cloud Architecture",
      "experience": 4
    },
    {
      "skill": "Network Infrastructure Design",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Network Security",
      "experience": 4
    },
    {
      "skill": "Hybrid Cloud",
      "experience": 4
    },
    {
      "skill": "Cisco Networks",
      "experience": 4
    },
    {
      "skill": "Disaster Recovery",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Customer Engagement",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and drive high priority network initiatives and projects in both cloud and hybrid cloud models."
    },
    {
      "duty": "Evaluate network infrastructure and connectivity solutions and make recommendations to migrate applications and data workloads to a cloud-based model."
    },
    {
      "duty": "Collaborate with leadership, enterprise business partners, vendors, and project teams to develop documentation and tools for resolving technical issues related to cloud architecture and design."
    },
    {
      "duty": "Provide technical expertise to project managers and stakeholders about migrating and transitioning applications to cloud-based services and operating and maintaining applications once migrated."
    },
    {
      "duty": "Participate in potential refactoring, rebuild, or redesign required during cloud migration."
    },
    {
      "duty": "Develop and maintain network scripts to allow operations to deploy and configure environments after operational turnover."
    },
    {
      "duty": "Provide feedback to leadership and peers on risks identified during business impact analysis, site risk assessments, and disaster recovery planning."
    },
    {
      "duty": "Maintain technical knowledge and business acumen within the discipline."
    },
    {
      "duty": "Mentor junior-level team members."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Computer Science, Information Systems, or Computer Networking (Master's preferred)"
    },
    {
      "credential": "Cisco Certified Network Associate (CCNA) certification acceptable with other network credentials."
    }
  ]
}