{
  "meta": [
    {
      "job_title": "Associate Project Manager",
      "job_category": "Project Management",
      "job_class": "Associate",
      "sector": "Management",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for coordinating and supporting projects with various degrees of complexity and scope."
    },
    {
      "duty": "Assist experienced Project Managers in managing projects within authority level and delivery of services as a result of the scope of assigned projects."
    },
    {
      "duty": "Assists in the definition of project scope and objectives, performs business analysis, and helps create and maintain comprehensive project documentation."
    },
    {
      "duty": "Works in conjunction with project owners to ensure quality service delivery and fosters successful relationships with internal customers."
    },
    {
      "duty": "Assist with distribution of project tasks and responsibilities to appropriate areas and coordinate project resources appropriately."
    },
    {
      "duty": "Ensures that the project team responds to and addresses inquiries and customer requests in a timely manner and helps escalate project issues to management as needed."
    }
  ],
  "skills": [
    {
      "skill": "Project Coordination",
      "experience": 3
    },
    {
      "skill": "Business Analysis",
      "experience": 3
    },
    {
      "skill": "Project Documentation",
      "experience": 3
    },
    {
      "skill": "Resource Coordination",
      "experience": 3
    },
    {
      "skill": "Quality Service Delivery",
      "experience": 3
    },
    {
      "skill": "Stakeholder Management",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a Business or IT related discipline required or 1 to 3 years’ experience in providing IT consulting services. Preferred associate project management certification or equivalent industry experience."
    },
    {
      "credential": "Experience with project management and software development methodologies such as waterfall Agile / Scrum, hybrids, and SDLC methodologies a plus."
    },
    {
      "credential": "Process modeling and business process documentation experience a plus."
    },
    {
      "credential": "1 to 3 years’ experience managing the entire life cycle of a project for system implementations is highly desired."
    },
    {
      "credential": "PMI certification highly desired."
    },
    {
      "credential": "Valid Hawaii Driver’s License and use of own vehicle required."
    },
    {
      "credential": "Proficient in PC navigation and Windows based software application skills."
    },
    {
      "credential": "Demonstrated knowledge of and skill in the following: leadership, effective communication, time management and scheduling, organizational awareness, project management, collaboration and team building"
    }
  ]
}