{
  "meta": [
    {
      "job_title": "Quality Supervisor",
      "job_category": "Quality Control",
      "job_class": "Supervisor",
      "sector": "Quality Assurance",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Quality Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Team Supervision",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "JDEdwards E1",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise, train, and oversee Receiving, Assembly, and Shipping Inspection department procedures and processes."
    },
    {
      "duty": "Ensure compliance with ISO 13485, FDA, and other regulatory requirements for medical device and other regulated product manufacturing."
    },
    {
      "duty": "Monitor equipment calibration and maintain records to ensure compliance with quality and regulatory standards."
    },
    {
      "duty": "Collaborate with Account Teams to meet customer quality requirements and exceed expectations."
    },
    {
      "duty": "Stop processes or shipments to address nonconformance issues and ensure proper identification and control of non-conforming products."
    },
    {
      "duty": "Participate in quality systems maintenance, training, and team involvement as required."
    },
    {
      "duty": "Analyze and resolve customer quality concerns in collaboration with Operations Manager."
    },
    {
      "duty": "Conduct defect analysis from In Process and Final Inspection data to enhance continuous improvement processes."
    },
    {
      "duty": "Comply with facility safety, work rules, security requirements, and accident/incident procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Quality Control, Industrial Engineering, or a related field (Master's preferred)"
    }
  ]
}