{
  "meta": [
    {
      "job_title": "Shipping Coordinator",
      "job_category": "Logistics",
      "job_class": "Coordinator",
      "sector": "Logistics",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Logistics Management",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Team Coordination",
      "experience": 3
    },
    {
      "skill": "Supply Chain Management",
      "experience": 3
    },
    {
      "skill": "ERP Software",
      "experience": 3
    },
    {
      "skill": "Purchasing",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate the efficient shipment of outbound orders using System 21 (S21) and check in truck drivers, assign trailers to a dock door."
    },
    {
      "duty": "Print, scan, procure signatures, distribute, and file shipment paperwork (BOL, packing list), and communicate with internal and external truck drivers to coordinate trailer loading."
    },
    {
      "duty": "Distribute tasks to union labor forklift crews and respond to schedule and carrier changes."
    },
    {
      "duty": "Evaluate inventory and coordinate product shipments from outside storage. Develop and implement distribution best practices and execute processes, reports, and data entry in S21."
    },
    {
      "duty": "Recommend S21 software improvements and ensure adherence to Personal Safety, Food Safety, Quality, and Environmental Policies and Practices."
    },
    {
      "duty": "Maintain inventory records, perform cycle counts and physical inventories, and ensure compliance with federal and state required labeling on cases before shipping."
    },
    {
      "duty": "Support overall safety program, work closely with Supervisor to improve work-related skills, implement a Performance Development Plan, and document processes and continuously improve Distribution Center Processes."
    },
    {
      "duty": "Archive and make available SOP's and master copies of documents, continuously use and update the priority system, and develop and continuously sharpen a career development plan."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or GED equivalent, Bachelor's degree in Logistics, Supply Chain Management, or a related field (preferred)"
    }
  ]
}