{
  "meta": [
    {
      "job_title": "Vice President of Sales",
      "job_category": "Sales",
      "job_class": "Vice President",
      "sector": "Sales",
      "salary": 200000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Expertise",
      "experience": 15
    },
    {
      "skill": "Organizational Leadership",
      "experience": 8
    },
    {
      "skill": "Operational Leadership",
      "experience": 8
    },
    {
      "skill": "Data Leadership",
      "experience": 8
    },
    {
      "skill": "High-growth Experience",
      "experience": 8
    },
    {
      "skill": "Physical Products Experience",
      "experience": 8
    },
    {
      "skill": "Diverse Customer Experience",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Cast a compelling vision for how the company sells to and collaborates with a diverse ecosystem of wholesale customers."
    },
    {
      "duty": "Build creative and well-reasoned go-to-market strategies and deliver on them."
    },
    {
      "duty": "Design, lead, and care for the sales team, shaping a way of working that inspires them and enables them to do their best work."
    },
    {
      "duty": "Communicate with skill and intentionality, across all levels of the organization and with customers of all types."
    },
    {
      "duty": "Balance a wide range of stakeholder interests and champion the needs of wholesale customers and the sales organization."
    },
    {
      "duty": "Identify, make the case for, and marshal the necessary resources to enable the team’s success."
    },
    {
      "duty": "Craft a vision for understanding a complex business with data and implementing a concrete data ecosystem."
    },
    {
      "duty": "Think in systems and frameworks; at scale; considering multiple time horizons."
    },
    {
      "duty": "Provide senior sales gravitas and astuteness to navigate and close tough deals."
    },
    {
      "duty": "Be part of the leadership team steering the company through major organizational decisions and milestones."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Sales, or a related field (Master's preferred)"
    }
  ]
}