{
  "meta": [
    {
      "job_title": "Assistant Director, Recruiting & Admissions - Business Programs",
      "job_category": "Recruiting",
      "job_class": "Director",
      "sector": "Sales",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Marketing",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Admissions Process",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Public Relations",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Meet or exceed enrollment targets for assigned business programs."
    },
    {
      "duty": "Build and foster relationships with prospective students and feeder organizations."
    },
    {
      "duty": "Cultivate and shepherd prospective students through the admissions process to enrollment for degree completion or graduate level business programs."
    },
    {
      "duty": "Coordinate all recruiting tactics on behalf of each adult/graduate program represented in partnership with the DEO and program leadership."
    },
    {
      "duty": "Provide input to create strategic marketing plans for each program represented."
    },
    {
      "duty": "Work effectively within the various computer systems used to track prospective student progress through the application process."
    },
    {
      "duty": "Maintain strong working knowledge of program-specific admissions requirements and information."
    },
    {
      "duty": "Represent the College at various recruiting events and meet with students on and off campus."
    },
    {
      "duty": "Coordinate with the Director of Recruitment, Executive Director, and Program(s) faculty to seek out and build strategic partnerships in the local/regional community and with out-of-state partners and institutions."
    },
    {
      "duty": "Leverage social media tools to build a network/database of contacts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required; Masters preferred."
    }
  ]
}