{
  "meta": [
    {
      "job_title": "Payroll Specialist",
      "job_category": "Accounting and Finance",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Payroll Processing",
      "experience": 3
    },
    {
      "skill": "Garnishment Processing",
      "experience": 3
    },
    {
      "skill": "Attention to Detail",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Multi-tasking",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    },
    {
      "skill": "ADP Payroll Systems",
      "experience": 3
    },
    {
      "skill": "Tax Knowledge",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensuring accurate and timely processing of all Court Ordered Withholding Documents (Garnishments), payments, and compliance with withholding orders and laws."
    },
    {
      "duty": "High-volume data entry and critical analysis of multiple garnishment types in multi-state environments."
    },
    {
      "duty": "Conducting regular reviews of garnishments to verify accuracy and maintaining completed and terminated garnishment orders in the system."
    },
    {
      "duty": "Processing high-volume payrolls according to established schedule and compliance with SOX procedures."
    },
    {
      "duty": "Balancing payroll and reconciling discrepancies in a tight time frame prior to service provider transmission."
    },
    {
      "duty": "Accurate processing of employee overtime pay, bonuses, special payments, and taxable cash and non-cash fringe benefits."
    },
    {
      "duty": "Calculating and processing manual checks, researching and resolving payroll inquiries while maintaining customer service."
    },
    {
      "duty": "Maintaining confidentiality of payroll information and other duties and special projects as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree required, Bachelor's degree in Finance, Accounting, or related field preferred"
    }
  ]
}