{
  "meta": [
    {
      "job_title": "Engineering & Maintenance Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Engineering & Maintenance",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Maintenance Management",
      "experience": 10
    },
    {
      "skill": "Engineering Policy Development",
      "experience": 10
    },
    {
      "skill": "Facility Upgrade Design",
      "experience": 10
    },
    {
      "skill": "Operations Coordination",
      "experience": 10
    },
    {
      "skill": "Budgeting and Planning",
      "experience": 10
    },
    {
      "skill": "Staff Management",
      "experience": 10
    },
    {
      "skill": "Manufacturing Software Proficiency",
      "experience": 10
    },
    {
      "skill": "Time Management",
      "experience": 10
    },
    {
      "skill": "Organizational Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the maintenance programs and processes of the plant to ensure timely, effective production, and minimize downtime."
    },
    {
      "duty": "Develop engineering and maintenance policies and procedures for the plant."
    },
    {
      "duty": "Develop engineering designs and specifications for facility upgrades to maintain Gränges Americas Inc. in the most advantageous position competitively in the industry."
    },
    {
      "duty": "Coordinates with other management staff to ensure efficiency in preventative maintenance and new equipment installation."
    },
    {
      "duty": "Direct the operations of the Engineering and Maintenance Departments to ensure efficiency and quality of services within established cost forecasts."
    },
    {
      "duty": "Prepare short and long-range (1 year – 5 year) plans for all areas of engineering and maintenance, prepares the Engineering and Maintenance Department budgets for approval of his superior."
    },
    {
      "duty": "Establish and maintain a sufficient staff in size and skill to meet present and future needs."
    },
    {
      "duty": "Manages subordinate staff in the day-to-day performance of their jobs."
    },
    {
      "duty": "Ensures that project/department milestones/goals are met and adhering to approved budgets."
    },
    {
      "duty": "Work in a safe and healthy manner, adhering to all safety rules and practices."
    },
    {
      "duty": "Represent the company’s core values of being committed, action oriented, innovative and accessible."
    },
    {
      "duty": "Other related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in mechanical or electrical engineering."
    }
  ]
}