{
  "meta": [
    {
      "job_title": "Facilities Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 93300,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Facilities Management",
      "experience": 5
    },
    {
      "skill": "Maintenance Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Blueprint Interpretation",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Staffing Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, implement, and maintain the department business plan to support operational needs."
    },
    {
      "duty": "Manage department staffing in order to support facilities, production, and warehouse needs."
    },
    {
      "duty": "Implementation and management of a Total Productive Maintenance (TPM) program."
    },
    {
      "duty": "Lead the team in the investigation of new technologies/equipment for manufacturing and warehouse applications, in order to solve complex problems, and drive efficiencies."
    },
    {
      "duty": "Develop plans for building modification or expansion, when needed to support business growth."
    },
    {
      "duty": "Develop and manage key performance indicator (KPI), and creating corrective actions to improve as necessary."
    },
    {
      "duty": "Participate in, and support continuous improvement activities as needed."
    },
    {
      "duty": "Maintain and regularly evaluate the Computerize Maintenance Management System (CMMS), ensuring its application meets the operational needs."
    },
    {
      "duty": "Lead, direct, and provide support to maintenance, facilities, tool & die, and automation teams on a regular basis in order to ensure high efficiency and execution."
    },
    {
      "duty": "Ensure regulatory compliance pertaining to facilities, compliance with insurance company and risk audits, manage gas and electricity supplier contracts, and manage federal, state and local permits and ensure compliance."
    },
    {
      "duty": "Support maintenance and facilities related CAPEX projects."
    },
    {
      "duty": "Support other facilities related needs as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Facilities Management Professional Certification (FMP)"
    },
    {
      "credential": "Sustainability Facility Professional (SFP)"
    },
    {
      "credential": "Certified Facility Manager (CFM) or related degree"
    },
    {
      "credential": "Five years’ experience with maintenance management or supervision required"
    },
    {
      "credential": "Five years’ experience with facilities management required"
    },
    {
      "credential": "Ability to interpret blueprints, schematics, drawings, and specifications."
    },
    {
      "credential": "Strong Microsoft Office skills including Outlook, Word, Excel, Access, and Outlook."
    },
    {
      "credential": "Must be able to work independently and exhibit initiative to solve problems, including tracking situations until appropriate resolution is achieved."
    }
  ]
}