{
  "meta": [
    {
      "job_title": "Assistant Superintendent",
      "job_category": "Construction",
      "job_class": "Assistant",
      "sector": "Construction",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Superintendent in managing all aspects of on-site construction activities for multi-family residential projects, adhering to project plans, schedules, and budgets."
    },
    {
      "duty": "Collaborate with subcontractors, vendors, and suppliers to ensure timely and accurate delivery of materials and services, maintaining quality standards."
    },
    {
      "duty": "Monitor and report daily progress, identifying any potential delays, conflicts, or issues that could impact project timelines. Propose solutions and take corrective action as needed."
    },
    {
      "duty": "Ensure compliance with safety regulations, company policies, and industry standards. Conduct regular site inspections to identify and address safety concerns."
    },
    {
      "duty": "Assist in managing and coordinating manpower, equipment, and resources efficiently to optimize construction productivity."
    },
    {
      "duty": "Help interpret and communicate construction drawings, specifications, and documents to subcontractors and team members, ensuring accurate implementation."
    },
    {
      "duty": "Assist in managing and maintaining project documentation, including daily logs, progress reports, site photos, and change orders."
    },
    {
      "duty": "Collaborate with the project management team to review and implement design changes, ensuring they align with the project's scope and objectives."
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 3
    },
    {
      "skill": "Project Planning",
      "experience": 3
    },
    {
      "skill": "Safety Compliance",
      "experience": 3
    },
    {
      "skill": "Team Coordination",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Construction Management, Engineering, or related field (Master's preferred)"
    }
  ]
}