{
  "meta": [
    {
      "job_title": "General Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "General Management",
      "salary": 220000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 10
    },
    {
      "skill": "Marketing Management",
      "experience": 10
    },
    {
      "skill": "P&L Management",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Financial Management",
      "experience": 10
    },
    {
      "skill": "Account Management",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "CRM",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Legal Entity Management",
      "experience": 10
    },
    {
      "skill": "Communication",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive commercial strategies to drive growth and profitability in the Consumer Products Business Unit across various categories."
    },
    {
      "duty": "Lead and manage a diverse team covering commercial and operations functions, including sales, marketing, customer service, supply chain, and financial planning & analysis."
    },
    {
      "duty": "Drive collaboration with the Global COP Team to optimize business success and strengthen the organization."
    },
    {
      "duty": "Proactively identify changes in the competitive environment, informing key stakeholders and modifying strategies and tactics accordingly."
    },
    {
      "duty": "Provide national forecast data, market share trends, and competitive analysis as part of the annual budgeting process."
    },
    {
      "duty": "Facilitate local consumer understanding and support the global COP team in North American market product development."
    },
    {
      "duty": "Develop processes and capabilities required to lead and manage an effective and efficient COP operation in North America."
    },
    {
      "duty": "Develop Direct to Consumer sales capabilities and manage online marketplaces for future category launches."
    },
    {
      "duty": "Establish and maintain effective relationships with external customers, being seen as a trusted business partner."
    },
    {
      "duty": "Manage P&L and all operations of COP, legal entity management, trade compliance, data protection, and shared services utilization for the entire legal entity."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Degree in Business Administration or similar education"
    }
  ]
}