{
  "meta": [
    {
      "job_title": "Phlebotomist",
      "job_category": "Healthcare",
      "job_class": "Phlebotomy",
      "sector": "Healthcare",
      "salary": 36000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs phlebotomy specimen collection on all patients according to standard operating practices."
    },
    {
      "duty": "Patients are properly identified and specimens are properly labeled during the collection process with strict adherence to policy and procedure."
    },
    {
      "duty": "Participates in specimen processing, distribution, and central accessioning."
    },
    {
      "duty": "Accurately processes and accessions all incoming laboratory specimens."
    },
    {
      "duty": "Responsible for confirming all required patients and specimen identification information is correctly documented."
    },
    {
      "duty": "Primary laboratory communication liaison between physicians, nursing units, physician offices, patients, general public and laboratory sections via telephone and in person."
    },
    {
      "duty": "Provides information regarding test reports, the status of tests in process and clarification of physician orders."
    },
    {
      "duty": "Generates reports for charting and assists in the charting of reports to patient care units."
    },
    {
      "duty": "Performs all other required reporting functions of laboratory reports via mail and fax and function as receptionist to incoming customers of the Department of Laboratory Services."
    },
    {
      "duty": "Supports the Mission of Trinity Health and Holy Cross Hospital."
    }
  ],
  "skills": [
    {
      "skill": "Phlebotomy",
      "experience": 1
    },
    {
      "skill": "Laboratory Communication",
      "experience": 1
    },
    {
      "skill": "Patient Identification",
      "experience": 1
    },
    {
      "skill": "Medical Charting",
      "experience": 1
    },
    {
      "skill": "Medical Report Generation",
      "experience": 1
    },
    {
      "skill": "Specimen Processing",
      "experience": 1
    },
    {
      "skill": "Data Entry",
      "experience": 1
    },
    {
      "skill": "Receptionist Duties",
      "experience": 1
    },
    {
      "skill": "Medical Terminology",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "student_teacher": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High School graduate, GED or higher"
    }
  ]
}