{
  "meta": [
    {
      "job_title": "Customer Engagement Specialist",
      "job_category": "Customer Service",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 50000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Respond to external and internal customer inquiries through phone calls, ensuring excellent service and exhibiting strong problem-solving skills."
    },
    {
      "duty": "Participate in continuous improvement initiatives and track customer engagement performance through recorded call types."
    },
    {
      "duty": "Multi-task, set priorities, and manage time effectively to provide a high level of professionalism and collaborate solutions with the team."
    },
    {
      "duty": "Be resourceful and proactive in dealing with issues, demonstrate strong written and verbal communication skills, and have efficient typing and data entry skills."
    },
    {
      "duty": "Exhibit strong phone skills, including soft skills and active listening, and provide attention to detail and quality in customer interactions."
    },
    {
      "duty": "Adapt to different personality types and work effectively with a wide range of constituencies in a diverse community."
    },
    {
      "duty": "Handle several assignments at one time while providing attention to detail and resolving complex requests from customers."
    },
    {
      "duty": "Research, resolve, and direct phone calls effectively while utilizing multiple computer programs simultaneously."
    },
    {
      "duty": "Review recorded calls that are scored/evaluated and engage in individual reviews to improve skills and deliver a better customer experience."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Multi-tasking",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Phone Etiquette",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Data Entry",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Adaptability",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent"
    }
  ]
}