{
  "meta": [
    {
      "job_title": "Outreach and Recruiting Specialist",
      "job_category": "Outreach and Recruiting",
      "job_class": "Specialist",
      "sector": "Recruitment",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Market Analysis",
      "experience": 3
    },
    {
      "skill": "Online Presence Management",
      "experience": 3
    },
    {
      "skill": "Event Planning",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Digital Marketing",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate outreach activities to provide access and increased visibility of programs to underrepresented prospective students."
    },
    {
      "duty": "Advise students regarding programs, specializations, and the process of transferring to CWU."
    },
    {
      "duty": "Represent the college at career fairs, college transfer fairs, education fairs, and tabling events."
    },
    {
      "duty": "Present to potential groups of students at community colleges and organizations to recruit students interested in programs."
    },
    {
      "duty": "Provide individual and group advising to help students plan their transfer to CWU."
    },
    {
      "duty": "Assess student plans, advise on course selection, and advocate on their behalf with colleges and programs."
    },
    {
      "duty": "Prepare and conduct program-specific and general college orientation, workshops, and campus tours."
    },
    {
      "duty": "Analyze and interpret student data for department and university reports."
    },
    {
      "duty": "Serve on the CEPS Marketing and Recruitment committee and contribute to the development and dissemination of marketing materials and e-recruitment activities."
    },
    {
      "duty": "Develop and implement comprehensive recruitment programs and marketing strategies to increase enrollment and awareness of program offerings to diverse student populations."
    },
    {
      "duty": "Maintain relationships with community and technical colleges, distribute marketing materials, and analyze target markets for effective recruitment materials."
    },
    {
      "duty": "Build and sustain relationships between educational institutions, corporate, community, and governmental organizations or associations."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Education, Counseling, or related field (Master’s preferred)"
    }
  ]
}