{
  "meta": [
    {
      "job_title": "Associate Director of Academic Operations",
      "job_category": "Operations",
      "job_class": "Director",
      "sector": "Education",
      "salary": 62500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Higher Education Operations",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Administrative Operations",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft and Google Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with academic leadership to assess faculty needs and coordinate recruitment efforts."
    },
    {
      "duty": "Track and report on the use of faculty-related resources, including payroll to ensure accuracy, efficiency, and adequacy in use."
    },
    {
      "duty": "Monitor and support faculty performance and compliance with university expectations."
    },
    {
      "duty": "Support the process of faculty course assignments based on established university processes."
    },
    {
      "duty": "Manage the regular process of collecting student feedback on faculty performance, assessing trends and potential opportunities of improvement, and distributing to faculty and academic leadership."
    },
    {
      "duty": "Create efficiencies in the process for supporting faculty and academic leadership."
    },
    {
      "duty": "Maintain faculty records, including Faculty Handbook, in adherence to University policy and regulatory standards and actively participate in the preparation and execution of accreditation reports and visits."
    },
    {
      "duty": "Conduct analysis on faculty-based metrics and make recommendations based on these analyses."
    },
    {
      "duty": "Oversee and evaluate staff."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in education, business, or a related field required."
    },
    {
      "credential": "Minimum of 3 years of experience in higher education or a related field, preferably working directly with university faculty."
    },
    {
      "credential": "Minimum of 3 years of experience in a management role."
    },
    {
      "credential": "Experience in administrative operations a plus."
    },
    {
      "credential": "Experience with project management a plus."
    }
  ]
}