{
  "meta": [
    {
      "job_title": "Principal Engineer",
      "job_category": "Engineering",
      "job_class": "Principal Engineer",
      "sector": "Engineering",
      "salary": 160000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Substation Design",
      "experience": 15
    },
    {
      "skill": "Project Management",
      "experience": 15
    },
    {
      "skill": "Technical Guidance",
      "experience": 15
    },
    {
      "skill": "Engineering Standards",
      "experience": 15
    },
    {
      "skill": "Mentoring",
      "experience": 15
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 15
    },
    {
      "skill": "High Voltage Systems",
      "experience": 15
    },
    {
      "skill": "Transmission & Distribution",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and execute complete high voltage transmission and distribution substations, with relevant projects on applications that range from 13kV to 500kV."
    },
    {
      "duty": "Provide technical support to design & engineering project teams regarding substation design, standards, equipment specifications, and execution of the capital work."
    },
    {
      "duty": "Assist in onboarding internal and contracted staff, assist with development of standards and specifications, provide training, and mentorship of staff."
    },
    {
      "duty": "Support a variety of T&D capacity expansion projects, including AIS, GIS, FACTS."
    },
    {
      "duty": "Be a technical resource and advisor for large projects, including mentorship of project staff, development and approval of substation standards, and technical support for the development and evaluation of RFPs for engineering contracts."
    },
    {
      "duty": "Serve as a technical advisor for execution strategy regarding substation projects and innovations, as well as Transmission Reinforcement and Capacity Planning activities & projects."
    },
    {
      "duty": "Work with external organizations to develop best practices in engineering peer group activities and forums."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in electrical engineering required, master's degree preferred."
    }
  ]
}