{
  "meta": [
    {
      "job_title": "Restaurant Leader/General Manager",
      "job_category": "Restaurant",
      "job_class": "Manager",
      "sector": "Hospitality",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Restaurant Management",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Talent Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Operational Excellence",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Food Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Marketing",
      "experience": 3
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Staffing",
      "experience": 5
    },
    {
      "skill": "Financial Planning",
      "experience": 5
    },
    {
      "skill": "Reporting and Analysis",
      "experience": 5
    },
    {
      "skill": "Customer Relations",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and supervise all aspects of the Family Member experience in the restaurant, from talent management to recruitment to training and promotion of current Family Members."
    },
    {
      "duty": "Facilitate discussions among Family Members and Managers to ensure expectations are clear, share best practices, address underperforming areas, and resolve open questions."
    },
    {
      "duty": "Manage the daily operations of the restaurant to ensure effective and efficient performance of the restaurant and its Family Members in all Whataburger operational and customer experience standards."
    },
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote freight and logistics services."
    },
    {
      "duty": "Train and coach Team Leaders and Managers, empowering them to lead their shift and focus on developing their Family Members."
    },
    {
      "duty": "Participate in inter-restaurant collaboration through sharing best practices, individual perspectives, and supporting other restaurants in the area."
    },
    {
      "duty": "Instill a customer-service mindset and demonstrate how to reinforce the brand by engaging with our customers, addressing concerns, and creating a welcoming environment within the restaurant."
    },
    {
      "duty": "Demonstrate appreciation for the contribution of Family Members at all levels by recognizing best work through celebrating and sharing success stories."
    },
    {
      "duty": "Identify Managers, Team Leaders, and Team Members with potential to progress to the next level and work with them to develop the necessary skills and behaviors to be considered for promotion."
    },
    {
      "duty": "Lead recruiting, interviewing, and hiring to achieve staffing levels to drive, maintain, and sustain Restaurant High Performing Teams."
    },
    {
      "duty": "Lead operational plans utilizing reporting tools, customer metrics, and labor metrics to monitor restaurant performance and processes consistent with Whataburger standards of excellence."
    },
    {
      "duty": "Develop the budget, expense plans, and sales goals as part of financial planning in order to achieve financial targets; manage profit and loss, oversee financial tasks such as cash reporting, labor, food expenses, repairs, and maintenance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma/GED or equivalent work experience"
    }
  ]
}