{
  "meta": [
    {
      "job_title": "Machine Operator II",
      "job_category": "Manufacturing",
      "job_class": "Operator",
      "sector": "Manufacturing",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Machine Operation",
      "experience": 2
    },
    {
      "skill": "Quality Control",
      "experience": 2
    },
    {
      "skill": "Basic Maintenance",
      "experience": 2
    },
    {
      "skill": "Forklift Operation",
      "experience": 2
    },
    {
      "skill": "Communication",
      "experience": 2
    },
    {
      "skill": "Problem-Solving",
      "experience": 2
    },
    {
      "skill": "Team Collaboration",
      "experience": 2
    },
    {
      "skill": "Safety Procedures",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Operate plastic blow molding machines and make necessary adjustments to ensure safe, efficient, and high-quality production of containers."
    },
    {
      "duty": "Enforce safety, health, quality GMP, and company policies and procedures."
    },
    {
      "duty": "Participate in continuous quality improvement projects and related activities."
    },
    {
      "duty": "Perform mold, insert, and color changes on the line."
    },
    {
      "duty": "Conduct basic processing of injection and/or blow molding machines to improve machine efficiency and reduce scrap."
    },
    {
      "duty": "Assist in mold, insert, and color changes on the line."
    },
    {
      "duty": "Monitor resin, dryer, material handling, and color systems for appropriate processing conditions."
    },
    {
      "duty": "Perform quality checks on products and assist in mechanical repairs."
    },
    {
      "duty": "Perform assigned preventative maintenance work and maintain work area to safety and housekeeping standards."
    },
    {
      "duty": "Communicate with the Production Shift Supervisor and coordinate production line support staff."
    },
    {
      "duty": "Verify material usage, perform minor troubleshooting and programming on the line, and operate equipment to minimize waste generation."
    },
    {
      "duty": "Properly identify and communicate processing information to designated personnel on incoming shift."
    },
    {
      "duty": "Assist in the training of new Operators."
    },
    {
      "duty": "Manage operation of boxing stations, palletizers, strappers, pallet transport, stretch wrapper, and/or unscrambler."
    },
    {
      "duty": "Visually check product for defects, operate forklift, and arrange materials throughout the plant to ensure efficient workflow and proper storage of finished goods."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 30,
      "student_teacher": 70,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "A minimum of 2 years in manufacturing required."
    }
  ]
}