{
  "meta": [
    {
      "job_title": "Physician Assistant",
      "job_category": "Healthcare",
      "job_class": "Practitioner",
      "sector": "Healthcare",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluating and treating patients in accordance with clinical best practices for an urgent care and/or occupational health setting."
    },
    {
      "duty": "Providing compassionate and respectful patient care consistent with NextCare services, values and mission statement."
    },
    {
      "duty": "Treating all patients who present to the clinic appropriately and discuss the treatment plan with the patient ensuring there is a clear understanding of the next steps."
    },
    {
      "duty": "Documenting care utilizing the electronic documentation system."
    },
    {
      "duty": "Taking personal responsibility for appropriately coding and billing for care rendered."
    },
    {
      "duty": "Delivering exemplary care and act in a legal and ethical manner."
    },
    {
      "duty": "Maintaining clinical productivity consistent with peers and industry standards for a similar setting."
    },
    {
      "duty": "Follow up on patient care as indicated."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Active and unrestricted Oklahoma medical license"
    },
    {
      "credential": "Active D.E.A."
    },
    {
      "credential": "NCCPA certification for a Physician Assistant or an ANCC or AANP certification for a Nurse Practitioner"
    },
    {
      "credential": "Minimum of a Bachelor's degree in Physician Assistant studies or Master’s of Nursing degree in Nurse Practitioner studies"
    },
    {
      "credential": "Active BLS Certification"
    },
    {
      "credential": "Must be comfortable with all age groups"
    },
    {
      "credential": "EHR proficient"
    },
    {
      "credential": "DOT Certification is/may be required."
    },
    {
      "credential": "Must be able to work occasional weekends and holidays, the amount of these shifts will depend on facility you are assigned to"
    }
  ]
}