{
  "meta": [
    {
      "job_title": "Accounts Payable Specialist",
      "job_category": "Accounting",
      "job_class": "Specialist",
      "sector": "Accounting",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Accounts Payable",
      "experience": 2
    },
    {
      "skill": "General Ledger",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Invoicing",
      "experience": 2
    },
    {
      "skill": "Expense Reconciliation",
      "experience": 2
    },
    {
      "skill": "Vendor Management",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Problem Solving",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Receive and process invoices from vendors, ensuring accuracy and appropriateness of documentation."
    },
    {
      "duty": "Match invoices to purchase orders, receiving documentation, and payable documentation for review and processing."
    },
    {
      "duty": "Review and verify expense reports for compliance with company policy and process check requests."
    },
    {
      "duty": "Ensure proper General Ledger coding on invoices, check requests, and expense reports."
    },
    {
      "duty": "Enter and maintain vendor information and invoices in the accounts payable system."
    },
    {
      "duty": "Correspond with vendors for past due and paid invoices, resolving payment application errors and open credits."
    },
    {
      "duty": "Perform month-end accounting tasks including journal entry reclassifications and balance sheet reconciliations."
    },
    {
      "duty": "Perform general clerical duties, including filing and handling routine correspondence."
    },
    {
      "duty": "Adhere to company policy and process guidelines for record retention and organization."
    },
    {
      "duty": "Resolve routine problems with data discrepancies, interpret data, and manage multiple tasks and projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent, with 2 years of accounting experience. Associate’s Degree in Accounting, Finance, or related field preferred, with 2+ years clerical and accounting experience in a manufacturing environment."
    }
  ]
}