{
  "meta": [
    {
      "job_title": "Regional Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Lead Generation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop annual sales plan in support of overall company strategy and objectives for the assigned region."
    },
    {
      "duty": "Build, develop, and manage a sales team capable of successfully carrying out strategic sales initiatives."
    },
    {
      "duty": "Direct the implementation and execution of sales policies, procedures, and practices."
    },
    {
      "duty": "Generate sales, develop leads, and drive business development in the assigned regional area through various methods including social networking, cold calling, and telemarketing."
    },
    {
      "duty": "Qualify potential new business for the territory and negotiate pricing and payment terms based on corporate guidelines."
    },
    {
      "duty": "Implement marketing strategies for the territory and build strong relationships with internal and external customers."
    },
    {
      "duty": "Meet personal sales goals, ensure the sales team is meeting their goals, and manage to them."
    },
    {
      "duty": "Report activity on a regular basis in the CRM system."
    },
    {
      "duty": "Travel to visit each sales executive once per quarter in the assigned region."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Sales, Marketing, or related field (Master's preferred)"
    }
  ]
}