{
  "meta": [
    {
      "job_title": "Asset Integrity Inspector",
      "job_category": "Engineering",
      "job_class": "Inspector",
      "sector": "Oil & Gas",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Equipment Inspection",
      "experience": 5
    },
    {
      "skill": "QA/QC",
      "experience": 5
    },
    {
      "skill": "ASME/AWS/API Codes",
      "experience": 5
    },
    {
      "skill": "Project coordination",
      "experience": 5
    },
    {
      "skill": "Failure Mode Analysis",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 5
    },
    {
      "skill": "Incident Investigations",
      "experience": 5
    },
    {
      "skill": "HSE Audits",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Risk Based Inspection (RBI)",
      "experience": 5
    },
    {
      "skill": "Confined Space Entry Permits",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee field inspection activities and ensure work is done in accordance with applicable codes and standards."
    },
    {
      "duty": "Maintain relationships with field personnel and work with contractor inspectors, welders, fabricators, equipment coaters, etc."
    },
    {
      "duty": "Ensure inspection requirements are met for pressure vessels, piping, and tanks."
    },
    {
      "duty": "Coordinate, manage, and oversee contractors’ inspections to meet inspection requirements."
    },
    {
      "duty": "Liaise with Project QA/QC personnel to help with fabrication certification and certify fabrication shops and well locations."
    },
    {
      "duty": "Provide QA/QC for base capital projects and maintenance work."
    },
    {
      "duty": "Track recommendations and repairs to closure, participate in equipment Failure Mode Analysis, Events Root Cause Analysis, Incident Investigations, and HSE Audits."
    },
    {
      "duty": "Participate in the development and implementation of short-term inspection plans and travel approximately 25% of the time to aid in completion and documentation of Inspection, Testing, and Repair of equipment."
    },
    {
      "duty": "Write excavation and trenching permits or confined space entry permits for inspection activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Current/Valid driver's license, Certified Welding Inspector certification, 5+ years of equipment inspection experience related to pressure vessels, tanks, and piping."
    }
  ]
}