{
  "meta": [
    {
      "job_title": "Clinical Research Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Medical",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Research Management",
      "experience": 2
    },
    {
      "skill": "Data Management",
      "experience": 3
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 4
    },
    {
      "skill": "GCP Certification",
      "experience": 3
    },
    {
      "skill": "IATA Training",
      "experience": 3
    },
    {
      "skill": "Excellent Communication Skills",
      "experience": 4
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    },
    {
      "skill": "Critical Thinking",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform overall data management of studies — collect, enter, and maintain records for clinical study subjects."
    },
    {
      "duty": "Support accurate and timely data entry in electronic databases."
    },
    {
      "duty": "Ensure all protocol-required procedures and visits occur according to specified guidelines."
    },
    {
      "duty": "Manage participant enrollment and ensure compliance with the protocol during participant recruitment, informed consent, participant education, eligibility assessment, participant care, and follow-up per protocol."
    },
    {
      "duty": "Collaborate with quality assurance (QA) in the development of source documentation for new studies, assisting in the assessment of toxicities/adverse events and reporting serious adverse events per IRB and sponsor requirements."
    },
    {
      "duty": "Possess excellent interpersonal skills and collaborate with the research team."
    },
    {
      "duty": "Independently manage workflows and prioritize numerous tasks."
    },
    {
      "duty": "Be flexible and anticipate timeframes to accommodate frames subjects, monitors, and overtime hours during high-enrolling study periods."
    },
    {
      "duty": "Maintain GCP certification and IATA training as required."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Medical Science, Biology, or a related field (Master's preferred)"
    }
  ]
}