{
  "meta": [
    {
      "job_title": "Voice UCaaS Account Executive Sales",
      "job_category": "Sales",
      "job_class": "Account Executive",
      "sector": "Sales",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "B2B Sales",
      "experience": 5
    },
    {
      "skill": "UCaaS Technology",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "CRM Tools",
      "experience": 5
    },
    {
      "skill": "Industry Expertise",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify and research potential clients, industry segments, and target markets to generate a pipeline of qualified leads for Voice UCaaS services."
    },
    {
      "duty": "Engage with prospects to understand their communication and collaboration needs, providing expert advice on how our Voice UCaaS solutions can address their specific requirements."
    },
    {
      "duty": "Deliver compelling presentations and product demonstrations to showcase the features and benefits of our Voice UCaaS solutions, highlighting how they can solve business challenges and improve communication efficiency."
    },
    {
      "duty": "Establish strong relationships with key decision-makers and stakeholders within prospective client organizations, working to understand their long-term goals and aligning our offerings with their strategic objectives."
    },
    {
      "duty": "Collaborate with the sales team and technical experts to create customized proposals and quotes that meet the unique needs of each prospect."
    },
    {
      "duty": "Lead contract negotiations, overcome objections, and guide prospects through the decision-making process to successfully close deals."
    },
    {
      "duty": "Maintain accurate and up-to-date records of sales activities, opportunities, and prospect interactions using CRM tools."
    },
    {
      "duty": "Work closely with the marketing and product teams to provide valuable insights from the field to help shape product development and marketing strategies."
    },
    {
      "duty": "Stay informed about industry trends, competitive landscape, and emerging technologies in the UCaaS and Voice Communication space."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Sales, Marketing, or a related field (or equivalent experience)"
    }
  ]
}