{
  "meta": [
    {
      "job_title": "Senior Network Engineer",
      "job_category": "Information Technology",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Routing and Switching",
      "experience": 7
    },
    {
      "skill": "Firewall Configuration",
      "experience": 7
    },
    {
      "skill": "Network Access Control",
      "experience": 7
    },
    {
      "skill": "SD-WAN",
      "experience": 7
    },
    {
      "skill": "Azure",
      "experience": 7
    },
    {
      "skill": "AWS",
      "experience": 7
    },
    {
      "skill": "Disaster Recovery (DR)",
      "experience": 7
    },
    {
      "skill": "Network Monitoring",
      "experience": 7
    },
    {
      "skill": "Troubleshooting",
      "experience": 7
    },
    {
      "skill": "Strategic Technology Direction",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and implement new network solutions and/or improve the efficiency of current networks."
    },
    {
      "duty": "Collaborate with IT leadership in the design and development of the strategic direction and vision for the firm’s Network."
    },
    {
      "duty": "Responsible for having an advanced understanding of IT industry trends and enterprise standards, methodology and techniques."
    },
    {
      "duty": "Install, configure and support network equipment including routers, proxy servers, switches, WAN accelerators, DNS and DHCP."
    },
    {
      "duty": "Configure firewalls, routing and switching to maximize network efficiency and security."
    },
    {
      "duty": "Maximize network performance through ongoing monitoring and troubleshooting."
    },
    {
      "duty": "Arrange scheduled upgrades and update network equipment to the latest firmware releases."
    },
    {
      "duty": "Investigate faults in the network."
    },
    {
      "duty": "Report network status to key stakeholders."
    },
    {
      "duty": "Participate in evaluations of infrastructure and network systems to ensure designs meet applicable cyber security specifications."
    },
    {
      "duty": "Guide networking work streams toward simplifying and automating processes."
    },
    {
      "duty": "Research and analyze networking solutions, emerging trends and changes in business needs, identifying new areas of opportunity and evolving the strategic technology direction accordingly."
    }
  ]
}