{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Land Development",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Civil Engineering",
      "experience": 10
    },
    {
      "skill": "Client Management",
      "experience": 10
    },
    {
      "skill": "Team Building",
      "experience": 10
    },
    {
      "skill": "Contract Negotiation",
      "experience": 10
    },
    {
      "skill": "Land Development",
      "experience": 10
    },
    {
      "skill": "AutoCAD",
      "experience": 10
    },
    {
      "skill": "Civil 3D",
      "experience": 10
    },
    {
      "skill": "P.E. License",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Effectively lead the team of staff engineers, designers, and support staff to ensure timely completion of projects within budget."
    },
    {
      "duty": "Manage, mentor, and grow the junior engineering design team, as well as successfully manage the execution and completion of all engineering project phases."
    },
    {
      "duty": "Review, analyze, and solve design problems, recommend corrective actions for improvement, and adhere to established design guidelines and procedures."
    },
    {
      "duty": "Assist in the preparation of improvement plans, specifications, supporting documents, and permit applications for subdivisions, commercial developments, and public works projects."
    },
    {
      "duty": "Perform civil design analysis and calculations according to project requirements."
    },
    {
      "duty": "Increase the overall effectiveness of the team by developing staff, aligning individual team member strengths with appropriate project tasks, and identifying potential obstacles."
    },
    {
      "duty": "Delegate project tasks to team members in a timely fashion, provide clear direction, and establish clear deadlines with team member affirmation."
    },
    {
      "duty": "Assist in the preparation of calculations, such as storm drain, wastewater, water system, earthwork quantities, transportation, cost estimates, and other supporting documentation for public and private projects."
    },
    {
      "duty": "Set goals, evaluate junior engineering staff performance, and serve as a resource and mentor to the engineering staff."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 200,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Civil Engineering (Master's preferred)"
    },
    {
      "credential": "Current P.E. License"
    }
  ]
}