{
  "meta": [
    {
      "job_title": "Branch Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Performance",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Team Supervision",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Financial Solutions",
      "experience": 5
    },
    {
      "skill": "Banking Policies and Procedures",
      "experience": 5
    },
    {
      "skill": "Branch Management",
      "experience": 5
    },
    {
      "skill": "Compliance Regulations",
      "experience": 5
    },
    {
      "skill": "Performance Reviews",
      "experience": 5
    },
    {
      "skill": "Leadership Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Civic Engagement",
      "experience": 5
    },
    {
      "skill": "Consumer Lending",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain and develop customer relationships, both personal and business, to ensure deposit growth and fee income."
    },
    {
      "duty": "Achieve sales performance objectives related to deposit growth, investment, and expense control."
    },
    {
      "duty": "Supervise, coach, and develop branch staff, ensuring adherence to bank best practices, policies, and regulations."
    },
    {
      "duty": "Identify qualified prospects and develop new business relationships through effective sales skills and product recommendation."
    },
    {
      "duty": "Coordinate with Regional Managers and HR on hiring, performance reviews, and employee management."
    },
    {
      "duty": "Meet monthly branch and individual sales goals by monitoring performance and following action plans."
    },
    {
      "duty": "Ensure compliance with bank security, operating policies, and procedures, as well as regulatory requirements."
    },
    {
      "duty": "Participate in branch-local civic organizations to promote bank name, products, and services."
    },
    {
      "duty": "Manage settlement of branch cash and oversee completion of monthly and quarterly branch audits."
    },
    {
      "duty": "Conduct audits and ensure compliance with mystery shops, @ your service standards, and bank marketing materials."
    },
    {
      "duty": "Refer customers to wealth management, brokerage, and commercial representatives as appropriate."
    },
    {
      "duty": "Provide regular team meetings for branch personnel to convey relevant information."
    },
    {
      "duty": "Open and close branch office, adhering to bank’s security policy and procedures."
    },
    {
      "duty": "Promote and discuss consumer lending products with customers within compliance of related guidelines and procedures."
    },
    {
      "duty": "Maintain an active NMLS license by completing all training and annual renewal requirements as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred or equivalent work experience;Minimum of five (5) years experience in a management capacity required;Must possess an NMLS license or obtain NMLS license within 90 days of employment"
    }
  ]
}