{
  "meta": [
    {
      "job_title": "Design Manager",
      "job_category": "Design",
      "job_class": "Senior Manager",
      "sector": "Architecture and Construction",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages multiple projects and teams of design professionals and other professionals through the grants application process and in developing sustainability projects and programs."
    },
    {
      "duty": "Manages multiple projects with sustainability focus such as greening, emerging technologies and/or electrification."
    },
    {
      "duty": "Supervises staff in developing informative, creative, and well-organized presentations and grant application materials related to sustainability and energy efficiency projects and programs."
    },
    {
      "duty": "Oversees the planning and implementation of special events to increase the exposure of the district’s goals and objectives related to sustainability and making sure the District’s standards and guidelines meet both educational and building standard requirements."
    },
    {
      "duty": "Organizes and participates in sustainability awareness campaigns."
    },
    {
      "duty": "Collaborates with local, state, and federal agencies, service providers, non-profit and community organization in identifying funding and developing sustainability initiatives."
    },
    {
      "duty": "Establishes and maintains relationships with external sustainability and greening focused organizations and partners."
    },
    {
      "duty": "Works with other departments in preparing applications for prospective grant funding opportunities."
    },
    {
      "duty": "Manages and updates the Sustainability Initiatives Unit website with input from the unit as needed."
    },
    {
      "duty": "Assists in coordination and outreach for sustainability related educational programs."
    },
    {
      "duty": "Organizes information, creates presentations, and makes presentations as needed."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Sustainability Management",
      "experience": 5
    },
    {
      "skill": "Grant Application Development",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Stakeholder Collaboration",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Web Management",
      "experience": 5
    },
    {
      "skill": "Education Program Coordination",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Sustainability, Architecture or Marketing"
    }
  ]
}