{
  "meta": [
    {
      "job_title": "Oracle Business Intelligence Developer",
      "job_category": "IT",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the development, testing, optimization, and maintenance of Oracle business intelligence solutions such as Oracle Analytics Cloud (OAC)."
    },
    {
      "duty": "Analysis, maintenance, development, and deployment of business intelligence data models, dashboards, reports, and subject areas."
    },
    {
      "duty": "Creation of test data and execution of unit and system testing."
    },
    {
      "duty": "Monitoring the availability of the application and troubleshooting system issues."
    },
    {
      "duty": "Delivery of BI functionality in conjunction with approved project efforts, ad-hoc querying, and decision support against the data warehouse."
    },
    {
      "duty": "Learning new software technologies, especially those consistent with support requirements."
    },
    {
      "duty": "Building strong partnerships with the Technology Organization’s Business partners, the internal Shared Support Solutions group, the Project Management Office, Oracle Corporation, and other technical and consulting resources."
    },
    {
      "duty": "Providing timely production and end-user support for OAC both during and after business hours."
    },
    {
      "duty": "Configuration, implementation, and support of OAC as the analytics footprint expands."
    },
    {
      "duty": "Assisting in the monitoring of production applications and databases with the overall goal of resolving performance issues and identifying potential future problems."
    },
    {
      "duty": "Creating technical programming specifications, internal program documentation, and participating in peer reviews."
    },
    {
      "duty": "Providing time/effort estimates, contributing to project planning, and providing task and project status to end users, peers, and management."
    },
    {
      "duty": "Communicating issues and issue resolution to management and business partners in a clear, concise manner while managing multiple priorities."
    },
    {
      "duty": "Assisting in helping the company grow in the analytics space utilizing technologies such as OAC, to empower the business with modern AI-powered, self-service analytics capabilities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or a related field (Master's preferred)"
    }
  ]
}