{
  "meta": [
    {
      "job_title": "EMS Data Quality Assurance Coordinator",
      "job_category": "Emergency Medical Services",
      "job_class": "Coordinator",
      "sector": "Public Safety",
      "salary": 65000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide program direction by relieving superior of a variety of difficult administrative duties pertaining to the Quality Assurance (QA) program for Emergency Medical Services Incidence Reporting System (EMSIRS), Trauma Acute Care Registry (TACR), & state reporting for the Cardiac Arrest Registry to Enhance Survival (CARES) programs."
    },
    {
      "duty": "Formulate & implement policies & procedures for the Quality Assurance program"
    },
    {
      "duty": "Compile & analyze data related to QA programs"
    },
    {
      "duty": "Coordinate the development of data visualization dashboards"
    },
    {
      "duty": "Represent & promote EMS data systems at public & professional gatherings"
    },
    {
      "duty": "Participate in projects to support the effective collection, analysis & dissemination of public health information. Act as staff liaison representing the division & agency on internal & external committees, workgroups, presentations, task forces, etc."
    }
  ],
  "skills": [
    {
      "skill": "Program Direction",
      "experience": 4
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Policy Development",
      "experience": 4
    },
    {
      "skill": "Data Visualization",
      "experience": 4
    },
    {
      "skill": "Public Health Knowledge",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of an undergraduate core program, or 24 months experience in data science, data analysis, information systems, informatics, or statistics."
    },
    {
      "credential": "Completion of undergraduate core program in academic field commensurate with program area to be assigned per approved Position Description on file; 2 yrs. training or 2 yrs. exp. in supervisory, administrative &/or managerial position or staff position involving planning, research &/or policy/procedure development. Or 4 yrs. training or 4 yrs. exp. in business administration management science or public administration."
    },
    {
      "credential": "2 yrs. training or 2 yrs. exp. in supervisory, administrative &/or managerial position."
    }
  ]
}