{
  "meta": [
    {
      "job_title": "General Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategy",
      "experience": 4
    },
    {
      "skill": "Business Development",
      "experience": 4
    },
    {
      "skill": "Marketing",
      "experience": 4
    },
    {
      "skill": "Leadership",
      "experience": 4
    },
    {
      "skill": "Operations Management",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Budgeting",
      "experience": 4
    },
    {
      "skill": "SQL",
      "experience": 4
    },
    {
      "skill": "Excel",
      "experience": 4
    },
    {
      "skill": "Negotiation",
      "experience": 4
    },
    {
      "skill": "Forecasting",
      "experience": 4
    },
    {
      "skill": "Market Analysis",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Define a clear vision, goals, and strategy to drive growth and achieve targets in the Texas region."
    },
    {
      "duty": "Partner with cross-functional teams to establish goals and build strategic programs, influencing and engaging across the company."
    },
    {
      "duty": "Align and integrate the Texas region’s growth objectives with the firm's business strategy through strategic planning, data analysis, forecasting, and budgeting."
    },
    {
      "duty": "Utilize strong quantitative analysis skills, including SQL, Excel, and data analysis, to derive actionable insights and support decision-making."
    },
    {
      "duty": "Tackle challenges by breaking them down and reaching the most detailed solutions, embracing a bias for action and conducting scrappy tests to validate hypotheses."
    },
    {
      "duty": "Collaborate with Product and Technology teams to identify and implement technology enhancements for better merchant experience and operational efficiency."
    },
    {
      "duty": "Manage regional sales teams, marketing teams, and driver operations teams while working closely with product and engineering teams to exponentially grow the business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration or a relevant discipline (Master's preferred)"
    }
  ]
}