{
  "meta": [
    {
      "job_title": "IT Cloud Controls Tester",
      "job_category": "Information Technology",
      "job_class": "Tester",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Operational Audit",
      "experience": 3
    },
    {
      "skill": "IT Governance Risk Compliance",
      "experience": 5
    },
    {
      "skill": "Cybersecurity",
      "experience": 5
    },
    {
      "skill": "Cloud Operations",
      "experience": 5
    },
    {
      "skill": "Data Privacy Regulations",
      "experience": 5
    },
    {
      "skill": "NIST Cybersecurity Framework",
      "experience": 5
    },
    {
      "skill": "COBIT",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform control testing through observation or collection and analysis of evidence of control performance against defined policies, guidelines, or laws."
    },
    {
      "duty": "Assess control language and business line procedures to ensure alignment."
    },
    {
      "duty": "Lead process inquiries, walkthroughs, and procedure reviews to support the development of QA test work papers."
    },
    {
      "duty": "Collaborate with Control Owners, Risk Analysts, and subject matter experts to define evidence, populations, and discuss results of testing."
    },
    {
      "duty": "Validate populations of desired activity for accuracy and completeness."
    },
    {
      "duty": "Select test samples based on internal program methodology and document rationale for adequate coverage."
    },
    {
      "duty": "Lead test result discussions with business line management and risk partners related to identified exceptions, criteria used to define expected results, and actions needed/recommended."
    },
    {
      "duty": "Perform peer reviews of completed testing."
    },
    {
      "duty": "Document testing results in Archer."
    },
    {
      "duty": "Provide consultative, technical research and analytical support on Information Security industry trends, standards, best practices, concepts, and solutions."
    },
    {
      "duty": "Assist the Information Security department in providing for the safekeeping and integrity of company information assets by maintaining systems and controls that prevent unauthorized access, modification, disclosure, and/or deletion of information from computer networks and resources."
    },
    {
      "duty": "Serve as a security technical analyst and advisor on projects to evaluate new technology resources for program compliance by effectively testing solutions using industry standard evaluation criteria, which includes the delivery of formal papers and technical reports on test results and findings."
    },
    {
      "duty": "Provide research and analysis in a liaison capacity to the various Technology Groups and Architecture functions."
    },
    {
      "duty": "Directly interface with business line technical experts and information security members to provide guidance on authorization, authentication, and encryption solutions."
    },
    {
      "duty": "Consult with business units regarding their changing business and technical plans to ensure that information security issues are addressed early in the project life cycle."
    },
    {
      "duty": "Advise the district Information Security manager of changes in technical, legal, and regulatory arenas affecting information security and computer crime."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Management Information Systems, Cybersecurity or related discipline (Master's preferred)"
    }
  ]
}