{
  "meta": [
    {
      "job_title": "Senior Account Executive",
      "job_category": "Sales",
      "job_class": "Senior",
      "sector": "Sales",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 10
    },
    {
      "skill": "Business Development",
      "experience": 10
    },
    {
      "skill": "Relationship Building",
      "experience": 10
    },
    {
      "skill": "Negotiation",
      "experience": 10
    },
    {
      "skill": "E-commerce Platforms",
      "experience": 7
    },
    {
      "skill": "Client Solutions Implementation",
      "experience": 7
    },
    {
      "skill": "Presentation Skills",
      "experience": 10
    },
    {
      "skill": "IT Knowledge",
      "experience": 10
    },
    {
      "skill": "Analytical Skills",
      "experience": 10
    },
    {
      "skill": "Professional Networking",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a strategic plan to drive sales growth within the organization."
    },
    {
      "duty": "Identify new business opportunities through market research and prospecting activities."
    },
    {
      "duty": "Build and maintain strong relationships with key decision-makers."
    },
    {
      "duty": "Develop and deliver sales presentations and proposals to potential clients."
    },
    {
      "duty": "Negotiate contracts and agreements with clients."
    },
    {
      "duty": "Work closely with cross-functional teams to ensure successful implementation of client solutions."
    },
    {
      "duty": "Lead solution definition and scoping to generate technical solutions, estimates, and project implementation approaches."
    },
    {
      "duty": "Present technical topics to senior, technical, and business audiences and C-Levels."
    },
    {
      "duty": "Apply methodology, reusable assets, and previous work experience to deliver consistently high-quality work."
    },
    {
      "duty": "Contribute to team effort by accomplishing related results as needed."
    },
    {
      "duty": "Define/Refine the Go-to-Market strategy for revenue growth of the organization."
    },
    {
      "duty": "Lead or co-lead answers to RFPs issued by clients."
    },
    {
      "duty": "Identify product improvements or new products by remaining current on industry trends, market activities, and competitors."
    },
    {
      "duty": "Maintain professional and technical knowledge by attending educational workshops, reviewing professional publications, establishing personal networks, benchmarking state-of-the-art practices, and participating in professional societies."
    },
    {
      "duty": "Contribute to team effort by accomplishing related results as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 30,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in computer science or equivalent work experience."
    }
  ]
}