{
  "meta": [
    {
      "job_title": "Manager, Organizational Development",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "HR",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Training & Development",
      "experience": 7
    },
    {
      "skill": "Change Management",
      "experience": 7
    },
    {
      "skill": "Leadership Coaching",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Performance Management",
      "experience": 7
    },
    {
      "skill": "Development Planning",
      "experience": 7
    },
    {
      "skill": "Training Design",
      "experience": 7
    },
    {
      "skill": "Presentation Skills",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct, participate, and partner in human resources development projects and programs, including competency development, assessment/selection tool development and validation, succession planning, pipeline programs, performance management, development planning, culture initiatives, change management, employee engagement, coaching, mentoring, and talent planning."
    },
    {
      "duty": "Partner with executive team leaders to ensure training and learning experiences contribute to the advancement of high performing employees and teams."
    },
    {
      "duty": "Assess, identify, and implement learning and growth programs to ensure the development of highly performing and engaged employees."
    },
    {
      "duty": "Create tools, resources, and education to support the annual talent review process."
    },
    {
      "duty": "Conduct and oversee training sessions, including management coaching and leadership development, ensuring opportunities across all levels."
    },
    {
      "duty": "Manage a Learning Management System."
    },
    {
      "duty": "Design, implement, and execute training content and learning experiences for front line, middle management, and senior level staff."
    },
    {
      "duty": "Oversee the performance management and development system (job analysis, talent review, goal setting, etc.)."
    },
    {
      "duty": "Support the Human Resources team in the development of strategies and programs to enhance the culture and increase retention."
    },
    {
      "duty": "Perform other related duties and projects as business needs require at the direction of management."
    },
    {
      "duty": "Lead and facilitate change management activities to drive understanding and adaptability toward change."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree, preferably with a focus in Industrial/Organizational psychology, Organizational Development, Organization Leadership or Human Resource Management (Master's preferred)"
    }
  ]
}