{
  "meta": [
    {
      "job_title": "Maintenance Assistant",
      "job_category": "Maintenance",
      "job_class": "Assistant",
      "sector": "Maintenance",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Maintenance Manager or Plant Manager in maintaining an organized, clean, and safe working environment, which contributes to the overall operation and well-being of the facility."
    },
    {
      "duty": "Services, cleans, and supplies facility interior including restrooms, break/lunchrooms, changing rooms, lobby, conference rooms, and offices. The duties can include but are not limited to routine cleaning and/or polishing furniture and office equipment; cleans drapes or window blinds / shades; washes windows, counters, walls ceiling and woodwork; sweeps, vacuums, shampoos, scrubs and waxes floors, etc.; empties trash containers as needed. Ensures day-to-day continuity of cleaning schedule by maintaining an inventory of custodial supplies necessary to perform job, advising proper individuals when supplies need to be ordered and making recommendations for proper cleaning supplies. Assists production by helping in movement of product within facility as necessary (may require tow motor qualification).Supports Maintenance function by performing general minor maintenance tasks (painting, plumbing, lighting, and other building repairs).Contributes to the overall functioning of the facility by performing messenger and delivery activities within and outside of the facility (mail, parts from suppliers, etc.).Completes required training and re-training to follow procedures for the use of chemical cleaners and power equipment etc. to ensure safety of all.Sets up, arranges, and removes decorations, tables, chairs, etc. to prepare facility for meetings, events, and functions.Contributes in a team effort by performing in accordance to all STERIS policies, GMP, Lean principles and other directives; supports the directives and decisions of higher-level management and performs other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "General Housekeeping",
      "experience": 1
    },
    {
      "skill": "Minor Maintenance Tasks",
      "experience": 1
    },
    {
      "skill": "Supply Management",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Basic Computer Skills",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 75,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED"
    }
  ]
}