{
  "meta": [
    {
      "job_title": "Compliance Analyst I",
      "job_category": "Compliance",
      "job_class": "Analyst",
      "sector": "Financial Services",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Compliance Analysis",
      "experience": 3
    },
    {
      "skill": "Regulatory Analysis",
      "experience": 3
    },
    {
      "skill": "Compliance Risk Assessment",
      "experience": 3
    },
    {
      "skill": "Policy and Procedure Development",
      "experience": 3
    },
    {
      "skill": "Compliance Training",
      "experience": 3
    },
    {
      "skill": "Research Skills",
      "experience": 3
    },
    {
      "skill": "Critical Thinking",
      "experience": 3
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 3
    },
    {
      "skill": "Bilingual (English and Spanish)",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide subject matter advice and guidance related to compliance laws, regulations, and best practices affecting the company's operations."
    },
    {
      "duty": "Support compliance risk assessment and controls, aid in internal reviews, and collaborate with management to achieve compliance program objectives."
    },
    {
      "duty": "Develop and update internal company policies and procedures, conduct compliance reviews, and coordinate compliance training across the company."
    },
    {
      "duty": "Review new products and services to ensure compliance with applicable federal and state laws and regulations, perform compliance/regulatory related research as requested by management."
    },
    {
      "duty": "Assist in formulating programs to address and correct deficiencies or problems identified and perform other related duties as assigned or requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree desired, but not required. Minimum of three (3) years in the consumer financial services industry required, and automobile financing experience is preferred. Experience with supervisory compliance examination process and procedures under the CFPB."
    }
  ]
}