{
  "meta": [
    {
      "job_title": "Manager of Workforce Management",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Workforce Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Labor Planning",
      "experience": 5
    },
    {
      "skill": "Retail Operations",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify and prioritize opportunities to improve schedule quality and optimize labor investments, developing and maintaining multi-year roadmaps for labor and scheduling projects."
    },
    {
      "duty": "Manage multiple concurrent and cross-functional technology and process improvement projects, including new system releases/updates, from discovery through deployment."
    },
    {
      "duty": "Ensure project success through establishing well thought through timelines and dependencies while managing issues and creating solutions that minimize risks to scope, schedules, resources, and cost."
    },
    {
      "duty": "Oversee daily operations for labor management and scheduling, supporting issue resolution and escalation management, ensuring the highest level of service to our field teams and accurate visibility to current and forecasted selling costs."
    },
    {
      "duty": "Responsible for workforce management support and communication, including creating and maintaining all user documentation (SOP’s, guides and tools), training materials and store facing communications."
    },
    {
      "duty": "Partner cross-functionally with Communications, Retail Operations, and Technology teams to ensure a seamless integration of existing processes and new initiatives into the store associate experience."
    },
    {
      "duty": "Scope out and oversee engagements with external consulting groups to refresh labor standards and identify new opportunities to optimize cost and return on investment."
    },
    {
      "duty": "Lead, coach, and develop direct reports and other team members."
    },
    {
      "duty": "Additional Duties as assigned by management."
    },
    {
      "duty": "Staff supervision and Development – Yes."
    },
    {
      "duty": "Decision Making – Drafts policy documents and resolves problems, Provides data for decision, support, Negotiates on behalf of management, Provides consultation or expert advice, Participates in planning business objectives, Represents the company in handling complaints, disputes or resolving grievances."
    },
    {
      "duty": "Travel – up to 20 %."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Experience and expertise with Workforce Management platform for mid to large retailer"
    },
    {
      "credential": "Bachelor's degree in Business Administration, Technology, or related field (Master's preferred)"
    }
  ]
}