{
  "meta": [
    {
      "job_title": "Financial Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 168000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 6
    },
    {
      "skill": "Report Generation",
      "experience": 6
    },
    {
      "skill": "Financial Management",
      "experience": 6
    },
    {
      "skill": "Strategic Planning",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Leadership",
      "experience": 6
    },
    {
      "skill": "Mentoring",
      "experience": 6
    },
    {
      "skill": "Communication Skills",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the delivery of quarterly financial reports and variance analysis on trends affecting the School’s financial position."
    },
    {
      "duty": "Develop department level reporting of clinical performance, including variance analysis."
    },
    {
      "duty": "Lead yearly reserve reporting analysis; create and update metrics to reflect department and school level financial position."
    },
    {
      "duty": "Contribute to the development and advancement of the Finance and Accounting Forum; gauge the audience interest on relevant topics or areas in need of training."
    },
    {
      "duty": "Partner with other departments to conduct various fundraising related analysis at department level."
    },
    {
      "duty": "Establish operational objectives and assignments, plan, direct and monitor all budgets for areas of responsibility, manage business operation and administration of several functional areas."
    },
    {
      "duty": "Identify and resolve unique problems of substantial significance that affect the overall functional area, beyond the immediate unit."
    },
    {
      "duty": "Represent the units/school within the functional units or school and to external constituencies."
    },
    {
      "duty": "Contribute to designing, developing and delivering complex policies and procedures with both short and long term impact. Collaborate with other colleagues on school/ unit projects; design and execute an effective system of internal controls for areas of responsibility; establish operational objectives to support the university's stewardship of resources."
    },
    {
      "duty": "Engage in continuous critical analysis of existing systems and processes; identify need for new systems, and develop and present proposals."
    },
    {
      "duty": "Lead complex, high-visibility process redesign and innovation projects; develop, implement, and participate in major initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree and six years relevant experience or combination of education and relevant experience."
    }
  ]
}