{
  "meta": [
    {
      "job_title": "Loan Operations Specialist",
      "job_category": "Financial Services",
      "job_class": "Operations Specialist",
      "sector": "Finance",
      "salary": 58000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform all department functions in accordance with established policies and procedures; analyze loan packages received to determine best course of action to board to core system (DNA); ensure standards for a complete closing package are met; board all new credits to system of record; process payments and advances; issue statements and notices; adjust interest rates as agreed; respond to internal and external customer inquiries and requests; maintenance to customer, account, or transactional records; maintain official loan files; ensure boarding of documents to document image system of record with appropriate QC; manage collateral position and release; manage tax and insurance escrow; first level accounting reconcilement"
    },
    {
      "duty": "Responsible for tracking and maintaining all legal documents including imaging and QC along with tracking of all missing documents. Execute timely to ensure all items received are imaged and all missing items are reporting weekly via audit reports to Commercial Operations."
    },
    {
      "duty": "Responsible for critical function of updating rate indexes daily in core system with a dual control."
    },
    {
      "duty": "Responsible for processing any manual rate changes or adjustments required at a loan level."
    },
    {
      "duty": "Monitor and follow-up on commercial loans designated in a Flood Zone. Work with Loan Officers and in accordance with RESPA to ensure appropriate insurance."
    },
    {
      "duty": "Responsible for filing of UCC’s financing statements with the City, State or Registry. Track renewals for five year continuation and process UCC terminations."
    },
    {
      "duty": "Review and recommend adjustments to processes to optimize efficiency, customer experience and controls. Includes ensuring ongoing training on process and systems to fully leverage automated tools for efficiency, quality and control."
    },
    {
      "duty": "Implement and sustain strong control environment and disciplines, including: The development and maintenance of written operating procedures for all daily, monthly, quarterly, and yearly loan operations tasks. Maintaining controls to ensure: duties executed accurately and as scheduled, data quality on systems of record, and compliance with bank policy and laws and regulations."
    },
    {
      "duty": "Reconcile invoices including any requiring manual adjustments from Customer accounts to offset costs"
    },
    {
      "duty": "Responsible for timely and accurate preparation of payoff quotes; processing of payoff funds; preparation of discharges."
    },
    {
      "duty": "Responsible for processing approved charge off’s in accordance with policy and accounting standards"
    },
    {
      "duty": "Archiving paper records in accordance with retention procedures"
    },
    {
      "duty": "Maintaining exceptional customer service levels with internal and external customers. Executing on service requests within established SLA’s"
    },
    {
      "duty": "Responsible for preparation of wires for dealers and participations"
    },
    {
      "duty": "Works with the Product Development Team as needed to prepare for the roll out of new loan products. Assists with testing and implementation of those products, as well as training and updating of SOP’s to appropriately support the new product."
    },
    {
      "duty": "Assist with any internal/external loan system conversion with management support. Performs all testing of new system enhancements or program changes."
    }
  ],
  "skills": [
    {
      "skill": "Loan Operations",
      "experience": 5
    },
    {
      "skill": "Credit Analysis",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Financial Reconciliation",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Process Optimization",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Banking Systems",
      "experience": 5
    },
    {
      "skill": "Document Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred; at least 5 years of experience in commercial lending, credit, or loan servicing. Demonstrated capability and familiarity with Microsoft products utilizing Excel and Word. Strong analytical and technical support experience a strong plus."
    }
  ]
}