{
  "meta": [
    {
      "job_title": "Construction Project Manager",
      "job_category": "Construction",
      "job_class": "Project Manager",
      "sector": "Construction",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Construction Administration",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "MS Office",
      "experience": 5
    },
    {
      "skill": "Microsoft Project",
      "experience": 5
    },
    {
      "skill": "Site Inspection",
      "experience": 5
    },
    {
      "skill": "Building Codes",
      "experience": 5
    },
    {
      "skill": "Scheduling",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure the successful completion of project objectives on-time and within budget."
    },
    {
      "duty": "Attend Condominium Board and Association membership meetings to discuss details of projects."
    },
    {
      "duty": "Prepare and present comprehensive presentations to convey all project related information to the Condominium Board and Community."
    },
    {
      "duty": "Produce regularly scheduled communications in the form of weekly updates and monthly progress reports to convey all project related information to Board and Community."
    },
    {
      "duty": "Facilitate the timely execution of deliverables from all project participants."
    },
    {
      "duty": "Perform monthly budget and schedule reconciliation exercises to maintain up-to-date financials and timelines associated with the project."
    },
    {
      "duty": "Perform site inspections to ensure quality workmanship and compliance with contractual obligations."
    },
    {
      "duty": "Lead weekly Owner/Architect-Engineer/Contractor meetings and provide solutions to potential issues related to the project."
    },
    {
      "duty": "Assist with generating punch-list to ensure all deficiencies are identified."
    },
    {
      "duty": "Collect and review all final project close-out documents, final releases of lien, and final payment applications."
    },
    {
      "duty": "Prepare detailed overall project budgets, cashflow budgets, and pay app/invoice tracking sheets to properly track and project all project-related financials."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associates degree or higher in Architecture, Engineering, Construction Management or related field OR at least 3 years of experience in construction administration, architecture, engineering or similar field."
    }
  ]
}