{
  "meta": [
    {
      "job_title": "Automation Control Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Manufacturing",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Automation Control (PLC)",
      "experience": 5
    },
    {
      "skill": "Manufacturing Project Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Engineering Leadership",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Technical Communication",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Manufacturing Equipment Expertise",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify, develop, and support the selection of new equipment and new processes across the enterprise."
    },
    {
      "duty": "Apply both standard and advanced engineering techniques to drive reductions in cost while ensuring high quality and exceptional service."
    },
    {
      "duty": "Independently develop clear and specific objectives for given assignments that may require the investigation of several alternative solutions."
    },
    {
      "duty": "Contribute to long-term thinking and planning for improvement."
    },
    {
      "duty": "Develop expertise as an SME on manufacturing equipment."
    },
    {
      "duty": "Provide guidance to co-ops, technicians, and other engineers."
    },
    {
      "duty": "Effectively participate in a team setting to achieve results."
    },
    {
      "duty": "Effectively lead assigned projects of moderate to large scope for assessments or implementations of new manufacturing equipment or processes."
    },
    {
      "duty": "Assess current manufacturing equipment and processes and make recommendations on future solutions for equipment and processes."
    },
    {
      "duty": "Recommend and/or create and execute plans for process improvements and new processes based on expected results."
    },
    {
      "duty": "Identify, create, and apply best practices and standards within the operations group."
    },
    {
      "duty": "Provide analytical problem solving and process troubleshooting support in area of expertise."
    },
    {
      "duty": "Analyze or interpret process changes in a complex manner (e.g. DOE, DFMEA, PFMEA)."
    },
    {
      "duty": "Actively support the development of co-ops, technicians, and engineers."
    },
    {
      "duty": "Complete project definitions, Exhibit A/EPA, and CEPM as required on projects."
    },
    {
      "duty": "Be a corporate resource for technical questions concerning manufacturing processes and equipment."
    },
    {
      "duty": "Communicate progress through management updates and team meetings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree in a technical field plus appropriate continuous training"
    }
  ]
}