{
  "meta": [
    {
      "job_title": "Program Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the planning, execution, and delivery of complex programs, ensuring alignment with company objectives, timelines, and budgets."
    },
    {
      "duty": "Experienced with various development practices \n– Waterfall, Agile (Scrum & Kanban)."
    },
    {
      "duty": "Coordinate and collaborate with various teams, departments, and stakeholders to define program scope, goals, and deliverables."
    },
    {
      "duty": "Develop detailed program plans, including schedules, resource allocation, risk management, and communication strategies."
    },
    {
      "duty": "Monitor and track program progress, identifying potential risks and issues and implementing mitigation plans."
    },
    {
      "duty": "Facilitate regular program status meetings, ensuring effective communication among team members and stakeholders."
    },
    {
      "duty": "Provide leadership and guidance to project managers and teams, ensuring clarity of roles, responsibilities, and expectations."
    },
    {
      "duty": "Identify opportunities for process improvement and implement best practices to enhance program and project delivery."
    },
    {
      "duty": "Prepare and deliver program reports, presentations, and updates to senior management and stakeholders."
    },
    {
      "duty": "Evaluate program outcomes and performance metrics to measure success and identify areas for enhancement."
    },
    {
      "duty": "Stay up to date with industry trends, emerging technologies, and best practices in program and project management"
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": []
}