{
  "meta": [
    {
      "job_title": "Senior Financial Analyst",
      "job_category": "Accounting and Finance",
      "job_class": "Financial Analyst",
      "sector": "Finance",
      "salary": 67000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Budgeting",
      "experience": 3
    },
    {
      "skill": "Grants Management",
      "experience": 3
    },
    {
      "skill": "Accounting",
      "experience": 3
    },
    {
      "skill": "Excel",
      "experience": 3
    },
    {
      "skill": "Fiscal Policy Development",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Reporting",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Research and analyze complex information to resolve errors, modify data, and administer fiscal aspects of grant(s)."
    },
    {
      "duty": "Prepare and analyze fiscal and budgetary documentation, reports, and records using Ohio Administrative Knowledge System (OAKS) and agency fiscal databases."
    },
    {
      "duty": "Monitor, analyze, and approve accounting transactions and reconcile expenditures of state, federal, and private funds."
    },
    {
      "duty": "Develop and implement fiscal policies/procedures relative to federal/state grant guidelines."
    },
    {
      "duty": "Assist grant project managers and develop ledgers to track state, federal, and private funds expenditures."
    },
    {
      "duty": "Review and approve Notice of Awards and ensure funds unexpended by sub-recipients are returned to the department or grantor."
    },
    {
      "duty": "Perform miscellaneous tasks, including maintaining records, preparing documents, attending meetings, and providing cross-training to unit staff."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of graduate core program in business administration, accounting, finance or related field; 6 months of experience or training in accounting and/or finance to include an advanced level of experience in spreadsheet software."
    },
    {
      "credential": "OR completion of undergraduate core program in business administration, accounting, finance or related field; 18 months of experience or training in accounting and/or finance to include an advanced level of experience in spreadsheet software."
    },
    {
      "credential": "OR 42 months of experience or training in accounting and/or finance to include an advanced level of experience in spreadsheet software."
    },
    {
      "credential": "OR 12 months of experience as Financial Analyst."
    },
    {
      "credential": "OR successful completion of the Fiscal Academy may be substituted for 4 months of required accounting/fiscal experience."
    }
  ]
}