{
  "meta": [
    {
      "job_title": "Financial Controller",
      "job_category": "Accounting",
      "job_class": "Controller",
      "sector": "Finance",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepare monthly, quarterly, and annual financial statements and reports, as well as channel sales reports."
    },
    {
      "duty": "A/R - Customer payment application accurately and timely, issue credit memos, review accounts receivable aging to identify past due accounts, oversee collections and creating in house invoices."
    },
    {
      "duty": "A/P - process vendor invoices accurately and timely, check run or issuance of ACH, reconcile vendor statements, process expense reports, purchase order maintenance and maintain all vendor files for 1099 reporting."
    },
    {
      "duty": "HR - Manage payroll system (ADP) and all payroll related items including 401k, ICHRA (health insurance), Employee Handbook and insurance. Keep up to date with current HR trends and policies."
    },
    {
      "duty": "Monthly reconciliation which includes: Braintree, Chargeback management, Inventory adjustment, Expense recon, Bank and Credit Card accounts, Intercompany transaction as well as prepare journal entry if needed."
    },
    {
      "duty": "Participate in the development of and support the company's strategic plans"
    },
    {
      "duty": "Develop and manage financial controls in accordance with the company's procedures"
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Payroll Management",
      "experience": 10
    },
    {
      "skill": "Forecasting",
      "experience": 10
    },
    {
      "skill": "Accounts Payable",
      "experience": 10
    },
    {
      "skill": "Accounts Receivable",
      "experience": 10
    },
    {
      "skill": "Financial Reporting",
      "experience": 10
    },
    {
      "skill": "Policy Compliance",
      "experience": 10
    },
    {
      "skill": "Human Resources Management",
      "experience": 10
    },
    {
      "skill": "Tax Compliance",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in business, accounting, finance or related discipline, Accounting designation (CPA or CMA), or an equivalent combination of related experience and education, Minimum 10 years of accounting experience in a senior accounting or financial management role with at least 3 years of experience in human resources"
    }
  ]
}