{
  "meta": [
    {
      "job_title": "IT Support Specialist",
      "job_category": "Information Technology",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 65000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support and resolve help desk issues/tickets by gathering information to identify needs, security, and industry best practice solutions."
    },
    {
      "duty": "Installs, configures, and deploys pc, server hardware, and software, including operating systems, applications, and patches – (possible nights and weekend work), to support and maintain effective service operations throughout HACO-US."
    },
    {
      "duty": "Supports, troubleshoots, repairs, and maintains server issues and security for enterprise and large-scale applications."
    },
    {
      "duty": "Provides Activity Directory Management assistance to staff in managing user and computer accounts."
    },
    {
      "duty": "Troubleshoots, reviews, and resolves blocked websites; performs various duties related to web filter management."
    },
    {
      "duty": "Manages, deploys, configures, and maintains servers in a virtualized and traditional environment."
    },
    {
      "duty": "Actively monitor systems and networks. Diagnose and resolve complex software and networking issues and automate routine tasks."
    },
    {
      "duty": "Provides support for device management, including image development, Intune mobile device management (MDM), and application packaging."
    },
    {
      "duty": "Installs pc and server hardware and components such as disks, memory, and other components, models, and test changes in a test environment before implementing them on production systems."
    },
    {
      "duty": "Supports HACO-US directory services infrastructure, including hardware configuration and upgrades, group architecture, account maintenance, and MFA authentication for network access."
    },
    {
      "duty": "Creates and maintains written and verbal procedures; prepares written technical documentation, training material, standards, reports, and other documents as assigned."
    },
    {
      "duty": "Evaluates systems and alternate solutions; develop functional specifications, standards, and requirements for hardware and software purchase and design to ensure optimum system and end-user performance; make recommendations for changes and additional services."
    },
    {
      "duty": "Provides general networking and other technical support as needed."
    },
    {
      "duty": "Prepares and maintains various records and reports related to assigned activities."
    },
    {
      "duty": "In-depth technical experience with Office 365: Exchange Online, Teams, and SharePoint, including (management of user accounts, troubleshooting, and maintenance)."
    },
    {
      "duty": "Attends and participates in meetings, conferences, and in-service training."
    },
    {
      "duty": "Industry-standard best practices infrastructure principles, theories, and securities practices."
    },
    {
      "duty": "Understanding of networking protocols and topology. Use network management software, including Active Directory and computer management software applications."
    },
    {
      "duty": "Image development and deployment, including application delivery, electronic inventory tracking"
    },
    {
      "duty": "Networking concepts, practices, and troubleshooting techniques."
    },
    {
      "duty": "Knowledge and understanding of security, including user directory structures and group policy."
    },
    {
      "duty": "Develop functional specifications, standards, hardware and software purchase, and design requirements to assure optimum system and end-user performance."
    },
    {
      "duty": "Understand and carry out oral and written instructions"
    },
    {
      "duty": "Communicate clearly and concisely, both oral and written."
    },
    {
      "duty": "Establish and maintain cooperative and effective working relationships with others."
    },
    {
      "duty": "Keep current with technology changes and learn new systems/network methodology."
    },
    {
      "duty": "Plan and organize work. Work independently with little direction."
    },
    {
      "duty": "Perform work with constant interruptions."
    },
    {
      "duty": "Meet schedules and timelines."
    }
  ],
  "skills": [
    {
      "skill": "Help Desk Support",
      "experience": 5
    },
    {
      "skill": "Server Maintenance",
      "experience": 5
    },
    {
      "skill": "Network Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Hardware and Software Deployment",
      "experience": 5
    },
    {
      "skill": "Active Directory Management",
      "experience": 5
    },
    {
      "skill": "Network Monitoring",
      "experience": 5
    },
    {
      "skill": "Device Management",
      "experience": 5
    },
    {
      "skill": "Technical Documentation",
      "experience": 5
    },
    {
      "skill": "Office 365 Administration",
      "experience": 5
    },
    {
      "skill": "Industry Best Practices",
      "experience": 5
    },
    {
      "skill": "Networking Protocols",
      "experience": 5
    },
    {
      "skill": "Security Management",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Technology, Computer Science, or related field (Master's preferred)"
    }
  ]
}