{
  "meta": [
    {
      "job_title": "Business Development Executive",
      "job_category": "Business Development",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 115000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Business Development",
      "experience": 10
    },
    {
      "skill": "Sales Experience",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Client Relationship Management",
      "experience": 10
    },
    {
      "skill": "Sales Pipeline Management",
      "experience": 10
    },
    {
      "skill": "Emotional Intelligence",
      "experience": 10
    },
    {
      "skill": "Negotiation",
      "experience": 10
    },
    {
      "skill": "Microsoft Suite",
      "experience": 10
    },
    {
      "skill": "Google Suite",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the team to sell and close new business from development through proposal."
    },
    {
      "duty": "Develop and execute effective strategic solutions for new and existing customers."
    },
    {
      "duty": "Establish, build upon, and support effective communication and working relationships with clients, future clients, and industry leaders."
    },
    {
      "duty": "Create and foster positive client relationships through clear and effective communication of ideas and solutions."
    },
    {
      "duty": "Ensuring coordination of all customer-related communications and activities, including meetings and conference calls."
    },
    {
      "duty": "Responsible for overseeing administration and management of the sales pipeline including funnel, prospect tracking, and sales inquiry logs."
    },
    {
      "duty": "Providing weekly sales pipeline updates and monthly sales forecasting reports to the SVP, BusDev and others as necessary and appropriate."
    },
    {
      "duty": "Ensuring the highest level of support to customer base by maintaining a personal presence with key accounts while continuously prospecting, penetrating, and developing new prospects."
    },
    {
      "duty": "Engage with executive leadership and effectively present information to prospects, strategic business partners, top management, public groups, and/or boards of directors/investors."
    },
    {
      "duty": "Monitor and evaluate progress against stated expectations and align behavior with performance expectations."
    },
    {
      "duty": "Work from home and be comfortable with up to 35% travel to engage with prospective customers."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred"
    }
  ]
}