{
  "meta": [
    {
      "job_title": "Inside Sales Representative (Event-Focused)",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 4
    },
    {
      "skill": "Lead Generation",
      "experience": 4
    },
    {
      "skill": "Demand Generation",
      "experience": 4
    },
    {
      "skill": "Stakeholder Management",
      "experience": 4
    },
    {
      "skill": "Event Engagement",
      "experience": 4
    },
    {
      "skill": "Sales Demo",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Business Development",
      "experience": 4
    },
    {
      "skill": "B2B Sales",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify qualified prospects and navigate company structures to identify decision-makers."
    },
    {
      "duty": "Learn, leverage, and help evolve the demand-generation process."
    },
    {
      "duty": "Generate appointments by means of proactive outbound prospecting."
    },
    {
      "duty": "Stakeholder management; responsible for managing the relationship with the CXOs and top executives at various events."
    },
    {
      "duty": "Demonstrate the product to prospective customers at events and convey the value and ROI."
    },
    {
      "duty": "Serve as a brand ambassador, showcasing the solutions and fostering valuable connections at physical and virtual events."
    },
    {
      "duty": "Engage event attendees in meaningful conversations, skillfully qualifying leads to identify promising opportunities."
    },
    {
      "duty": "Identify potential business prospects to expand the reach of the Digital Adoption Platform (DAP)."
    },
    {
      "duty": "Drive traffic and maximize booth presence through targeted pre-event and during-event outreach."
    },
    {
      "duty": "Coordinate with remote teams to streamline lead management and ensure efficient coordination."
    },
    {
      "duty": "Track and analyze lead activity, providing valuable insights and recommendations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Sales, or related field (Master's preferred)"
    }
  ]
}