{
  "meta": [
    {
      "job_title": "Stylist",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Retail",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Point of Sale (POS) System",
      "experience": 5
    },
    {
      "skill": "Visual Merchandising",
      "experience": 5
    },
    {
      "skill": "Store Maintenance",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Phone Etiquette",
      "experience": 5
    },
    {
      "skill": "Merchandising",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maximize personal sales and profitability by providing optimum level of customer service and applying non-negotiable sales standards."
    },
    {
      "duty": "Demonstrate how new products can mix with existing stock and previous purchases, and communicate product and customer feedback to managers."
    },
    {
      "duty": "Apply Point of Sale knowledge to process needed transactions and handle multiple customers at fitting rooms following all policies and procedures."
    },
    {
      "duty": "Demonstrate effective phone etiquette through customer service and follow through with customer experience by utilizing thank you cards, business cards, and maintaining client book."
    },
    {
      "duty": "Ensure ease of customer experience through visual presentation and overall store maintenance, including cleaning, vacuuming, folding, sizing, steaming, and replenishing as assigned."
    },
    {
      "duty": "Actively participate in all merchandising activities including stock maintenance, order processing, stock receiving, product transfers, folding, and floor changes."
    },
    {
      "duty": "Maintain a professional appearance consistent with established dress code and image guidelines while actively supporting securing company assets through effective Asset Protection in compliance with company policies and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": []
}