{
  "meta": [
    {
      "job_title": "Contract Negotiator",
      "job_category": "Business Operations",
      "job_class": "Negotiator",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages complex contract negotiations with physician groups and facilities commercial product lines (e.g., Ancillaries, large physician groups, some smaller hospitals). Proactively builds relationships that nurture provider partnerships to support the local market strategy."
    },
    {
      "duty": "Initiates, nurtures and maintains effective channels of communication with matrix partners including but not limited to, Claims, Medical Management. Credentialing, Legal, Medical Economics, Compliance, Sales and Marketing."
    },
    {
      "duty": "Supports and provides direction to develop network analytics required for the network solution. Responsible for meeting unit cost targets, while preserving an adequate network, to achieve and maintain competitive position."
    },
    {
      "duty": "Identify and manages initiatives that improve total medical cost and quality. Prepares, analyzes, reviews, and projects financial impact of high spend or increasingly complex provider contracts and alternate contract terms."
    },
    {
      "duty": "Assists in resolving elevated and complex provider service complaints. Research problems and negotiates with internal/external partners/customers to resolve highly complex and/or escalated issues."
    },
    {
      "duty": "Manages key provider relationships and is accountable for critical interface with providers and business staff. Demonstrates comprehensive knowledge of providers in an assigned geographic area through understanding the interrelationships as well as the competitive landscape. Partner with Regulatory Affairs to ensure all network filings are timely and accurate."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Provider Contracting",
      "experience": 5
    },
    {
      "skill": "Healthcare Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience in related field, plus 5+ years of work 5-7 years of experience Negotiate competitive managed care agreements with complex providers, including hospital systems, PHOs, and large IPAs. Experience beyond degree within provider contracting and/or health insurance. Experience with Physician and Ancillary group contracting and negotiations. Experience negotiating delegated credentialing agreements. Experience in developing and managing key provider relationships including senior executives. Existing relationships with hospitals or large physician groups in Texas and/or Florida will be helpful."
    }
  ]
}