{
  "meta": [
    {
      "job_title": "Executive Assistant",
      "job_category": "Administrative",
      "job_class": "Assistant",
      "sector": "Management",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Coordinate, deconflict, and communicate executive schedule(s)."
    },
    {
      "duty": "Book travel and process expense reports."
    },
    {
      "duty": "Proactively assess Senior Vice President’s tasks and deliverables, taking on administrative tasks and enabling the SVP to prioritize and focus on critical business deliverables."
    },
    {
      "duty": "Handle and facilitate the flow of sensitive and confidential financial and personal information with absolute maturity, trust, and discretion."
    },
    {
      "duty": "Plan and manage various business meetings and functions, both internally and offsite, ranging from routine staff meetings to large-scale employee events."
    },
    {
      "duty": "Interface and communicate with customers, corporate executives, and public/government/military officials."
    },
    {
      "duty": "Lead teams/committees, create plans, and track progress on special projects."
    },
    {
      "duty": "Research, prepare and proofread reports, proposals, and presentations."
    },
    {
      "duty": "Receive and screen phone calls and visitors."
    },
    {
      "duty": "Attend various management level meetings, capturing and tracking minutes and/or action items."
    },
    {
      "duty": "Facilitate key messaging and flow of information between the SVP and various stakeholders/team members."
    },
    {
      "duty": "Function as trusted member of the senior leadership team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree or equivalent experience; Bachelor’s degree preferred."
    },
    {
      "credential": "Minimum 10 years of administrative support experience including at least 5 years directly supporting executive-level leaders in a large (greater than 500 employees) business."
    },
    {
      "credential": "Excellent interpersonal skills and ability to effectively interact with employees at all levels of an organization, from front-line employees to senior executive leadership."
    },
    {
      "credential": "Demonstrated excellent verbal and written communication skills."
    },
    {
      "credential": "Advanced knowledge of Microsoft Outlook, Word, Excel, PowerPoint software and other commonly used software applications (ex: Visio, Adobe Acrobat/Pro, Teams, Zoom, and other like applications)."
    },
    {
      "credential": "Ability to work independently and manage multiple priorities and tasks in a fast-paced, high-pressure environment."
    },
    {
      "credential": "Must be able to obtain and maintain security clearance."
    }
  ]
}