{
  "meta": [
    {
      "job_title": "GTM Advisor",
      "job_category": "Technology Advisory",
      "job_class": "Advisor",
      "sector": "Technology",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Strategic Direction",
      "experience": 5
    },
    {
      "skill": "Thought Leadership",
      "experience": 5
    },
    {
      "skill": "Product Development",
      "experience": 5
    },
    {
      "skill": "Startup Experience",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Deal Closing",
      "experience": 5
    },
    {
      "skill": "Travel Readiness",
      "experience": 5
    },
    {
      "skill": "Technology Trends Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Actively promote services and offerings to potential clients, with a particular focus on leveraging own network to generate referrals."
    },
    {
      "duty": "Identify new business opportunities and strategically refer services to key decision-makers within contacts."
    },
    {
      "duty": "Understand current client portfolio business objectives and challenges. Develop comprehensive strategies to align with goals and provide a roadmap for achieving success in new target markets."
    },
    {
      "duty": "Stay abreast of technological advancements, market trends, and industry best practices. Share insights and thought leadership with clients, internal teams, and industry forums. Contribute to the development of intellectual property, whitepapers, and thought leadership content."
    },
    {
      "duty": "Lead successful product development initiatives from ideation to launch."
    },
    {
      "duty": "Willingness to travel as needed to meet with clients and stakeholders."
    },
    {
      "duty": "Cultivate a thriving and supportive workplace culture and a robust capacity for collaboration."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Technology, Business, or a related field (Master's preferred)"
    }
  ]
}