{
  "meta": [
    {
      "job_title": "R&D Food Technologist",
      "job_category": "Food Science",
      "job_class": "Technologist",
      "sector": "Research and Development",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Food Science",
      "experience": 2
    },
    {
      "skill": "Nutritional Science",
      "experience": 2
    },
    {
      "skill": "Research and Development",
      "experience": 2
    },
    {
      "skill": "Lab Testing",
      "experience": 2
    },
    {
      "skill": "Food Formulation",
      "experience": 2
    },
    {
      "skill": "Quality Assurance",
      "experience": 2
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 2
    },
    {
      "skill": "Vendor Management",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Aid in the development of new and specified formulas for customers, from bench to consumer, meeting customer requirements for ingredients used, nutritional claims, product function, product taste, finished cost, and ease of manufacturing."
    },
    {
      "duty": "Create on a small scale what will be produced on the manufacturing floor. Supports the Senior R&D Food Technologist (Sensory Products) and R&D team."
    },
    {
      "duty": "Follow all company policies and procedures. Follow and ensure compliance to quality system and cGMP programs."
    },
    {
      "duty": "Assists in creating and quoting formulas that meet the customer’s needs and wants. Collaborate with various departments, including Sales, Purchasing, Quality Assurance, Lab Services, Production, and Formulations, to create a final product that satisfies the customer."
    },
    {
      "duty": "Consult with customers or their sales/account manager regarding parameters and goals of the project. Adjust ingredients, taste, and nutrition based on customer feedback."
    },
    {
      "duty": "Keeps laboratory notebook up to date and writes down comments and changes based on feedback. Maintains general organization and efficiency."
    },
    {
      "duty": "Create supplement and nutrition facts panels and other nutritional breakdowns on new and current formulas. Check individual ingredients to verify the customer can make certain claims such as gluten-free, non-GMO, vegan, Halal, etc. Ensure sure labels meet DHEA and NLEA standards. Stay up to date on FDA guidelines. Approve customer’s label proofs as needed."
    },
    {
      "duty": "Assist Quality Assurance and Lab Services in taste testing for new products, products in testing, and expired flavors. Review batch records when an issue exists and recalculate batches for production modifications."
    },
    {
      "duty": "Work with vendors to acquire proper and through documentation for current and new ingredients. Research vendors providing best tasting, highest quality, best functioning, and best valued ingredients, choosing those appropriate for the customer's formula."
    },
    {
      "duty": "Conducts research on ingredients and products as requested. Continue to research the food and supplement industry for new trends, new ingredients, processes for working with challenging ingredients, new regulations, labeling, new testing for allergens, etc."
    },
    {
      "duty": "Maintains general organization, cleanliness, and inventory of R&D laboratory by organizing materials and ingredients and maintaining related internal spreadsheets."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "B.A./B.S. in Food Science, Biology, Nutrition or Science related field (Master's preferred)"
    }
  ]
}