{
  "meta": [
    {
      "job_title": "AP Specialist",
      "job_category": "Engineering",
      "job_class": "Specialist",
      "sector": "Engineering",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Electrical Engineering",
      "experience": 5
    },
    {
      "skill": "AutoCAD",
      "experience": 3
    },
    {
      "skill": "Power Systems Design",
      "experience": 5
    },
    {
      "skill": "Solar Energy Systems",
      "experience": 5
    },
    {
      "skill": "Battery Systems",
      "experience": 5
    },
    {
      "skill": "EV Charging Systems",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Electrical Calculations",
      "experience": 5
    },
    {
      "skill": "Field Inspections",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    },
    {
      "skill": "Electrical Codes Knowledge",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design power, lighting, and grounding systems for Solar, Batteries, and Electric Vehicle (EV) Charging systems with a high level of complexity."
    },
    {
      "duty": "Produce plan sets in AutoCAD for AHJ submittals."
    },
    {
      "duty": "Perform electrical calculations including short circuit, cable, and conduit sizing, grounding, voltage drop, transformer, equipment sizing, and load calculations."
    },
    {
      "duty": "Lead the construction management of commercial solar projects to ensure that projects are installed per the contract, design drawings, and company standards."
    },
    {
      "duty": "Review and provide comments for electrical equipment & vendor drawing."
    },
    {
      "duty": "Conduct field inspections, which require the interpretation and implementation of contract specifications and drawings; note any deficiencies and follow up with contractors on remediation activities."
    },
    {
      "duty": "Oversee the commissioning and testing program for new commercial solar projects."
    },
    {
      "duty": "Provide electrical expertise concerning power conversion and electrical distribution equipment"
    },
    {
      "duty": "Provide expertise regarding electrical codes and grid standards as related to solar photovoltaic installations."
    },
    {
      "duty": "Develop project feasibility studies and conceptual designs (single-line diagram & power plan) for solar, battery, and EV charging projects."
    },
    {
      "duty": "Engage directly with clients, equipment manufacturers, project developers, and lenders as a matter of course through telephone calls and meetings."
    },
    {
      "duty": "Experience in the design and procurement of electrical equipment, including, medium voltage switchgear, generators, inverters, and step-up transformers."
    },
    {
      "duty": "Expertise with simulation tools such as SKM, Etap, Visual PVSyst software experience preferred."
    },
    {
      "duty": "Strong communication skills required."
    },
    {
      "duty": "Ability to scale company assets and access rooftops when necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors in Electrical Engineering, focus on power systems preferred. Professional Engineer (PE) License."
    }
  ]
}