{
  "meta": [
    {
      "job_title": "Epidemiologist",
      "job_category": "Healthcare",
      "job_class": "Public Safety",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Investigates, collects, & analyzes endemic or epidemic situation of infections, chronic diseases, or other health conditions pertaining to Emergency Medical Services (EMS), trauma care & the statewide trauma system, & Cardiac Arrest Registry to Enhance Survival (CARES) data"
    },
    {
      "duty": "Reviews & analyzes issues to be researched; Develops appropriate technical objectives & plans timelines & research methodology; Utilizes statistical computer software packages such as STATA, SAS, SPSS, Tableau, Tableau Prep, etc."
    },
    {
      "duty": "Extracts, receives & reviews electronic data submitted to the EMS Incident Reporting System (EMSIRS), the Ohio Trauma Registry (OTR) & workforce census data; Provides research & support to Quality Assurance (QA) program & administrator for the development, implementation & monitoring of QA initiatives designed to maintain & improve data quality, accuracy, integrity & confidentiality of all records; Extracts & analyzes data to identify reporting errors & missing data."
    },
    {
      "duty": "Works with team to develop & implement statistically relevant, value added internal & external dashboards, reports & displays for the appropriate sharing of healthcare data; Develops & implements data security, anonymization & data suppression techniques to ensure the anonymity & confidentiality of healthcare recipients & their providers for data dashboards containing sensitive information."
    },
    {
      "duty": "Relieves higher level epidemiologist & other team members by performing established routine data extracts coded, developed, & validated by other team members based on established refresh periods (i.e., Weekly, Monthly, Quarterly, etc.); Monitors & ensures refreshed datasets are transmitted successfully & resolves any questions, concerns, or issues with the data transfer process."
    },
    {
      "duty": "Assists supervisor, team, physicians or other professionals in investigation & analysis of data pertaining to emergency medical services, trauma care, the statewide trauma system, cardiac arrest data & provider workforce data in Ohio; Designs & implements statistically valid surveys to assess EMS & trauma system issues related to the delivery of care; Participates in the completion of scientific reports."
    },
    {
      "duty": "Represents & promotes EMS data systems at public & professional gatherings; Drafts &/or prepares reports, presentations & articles; Participates in projects to support the effective collection, analysis & dissemination of public health information; Acts as staff liaison representing the division & agency on internal & external committees, workgroups, presentations, task forces, etc., including but not limited to meeting facilitation, presentations & training."
    }
  ],
  "skills": [
    {
      "skill": "Statistical Analysis",
      "experience": 3
    },
    {
      "skill": "Data Collection",
      "experience": 3
    },
    {
      "skill": "Healthcare Research",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Epidemiology",
      "experience": 3
    },
    {
      "skill": "Public Health",
      "experience": 3
    },
    {
      "skill": "Health Data Security",
      "experience": 3
    },
    {
      "skill": "Data Anonymization",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of graduate core program in public health or preventive medicine; 3 courses or 9 mos. exp. in use of statistical computer software packages; 1 course or 3 mos. exp. in epidemiology; 1 course or 3 mos. exp. in physiology; 1 course or 3 mos. exp. in statistics; 1 course or 3 mos. exp. in human relations; 1 course or 3 mos. exp. in interviewing; 6 mos. exp. working in research or specific laboratory identifying or researching infectious or chronic diseases &/or related environmental health problems"
    }
  ]
}