{
  "meta": [
    {
      "job_title": "Service Desk Manager",
      "job_category": "Information Technology",
      "job_class": "Manager",
      "sector": "IT",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "IT Infrastructure Management",
      "experience": 5
    },
    {
      "skill": "Team Coaching",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Technical Support",
      "experience": 5
    },
    {
      "skill": "Customer Advocacy",
      "experience": 5
    },
    {
      "skill": "Active Directory",
      "experience": 5
    },
    {
      "skill": "Network Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Performance Metrics",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Continuous improvement of the day to day responsibilities of the Service Desk, including infrastructure, phone, and desktop support."
    },
    {
      "duty": "Build and maintain an environment of service excellence with a passionate focus on customer advocacy and satisfaction."
    },
    {
      "duty": "Develop weekly and monthly reports on help desk team’s productivity."
    },
    {
      "duty": "Monitor, mentor, coach and assist team members to deliver quality support."
    },
    {
      "duty": "Develop a dashboard that summarizes the performance and status of IT infrastructure operations."
    },
    {
      "duty": "Develop procedures to reduce incidents, requests, and problems identified, assigned, and managed in the ITSM."
    },
    {
      "duty": "Identify process and procedures to develop faster and less expensive ways for productivity."
    },
    {
      "duty": "Set goals and expectations for all daily tasks and projects."
    },
    {
      "duty": "Extensive knowledge of Active Directory, DNS, VSphere, Cisco Unified Communications, Telepresence, Palo Alto Networks Firewall, VMware vSphere, Cisco Meraki, VEEAM, SolarWinds, Trend Micro Antivirus."
    },
    {
      "duty": "Troubleshoot network, storage, server, cabling, Mac OS and Windows systems along with application elements of a system."
    },
    {
      "duty": "Document system changes through change management, team process and procedures, and system diagrams."
    },
    {
      "duty": "Assist in establishing performance metrics and measurement and reporting of established metrics."
    },
    {
      "duty": "Analyze, evaluate and prepare recommendations for system improvements, optimizations, and development."
    },
    {
      "duty": "Provide hardware and software technical assistance for support requests related to company computer systems and peripherals."
    },
    {
      "duty": "Support global offices during their off-hours."
    },
    {
      "duty": "Diagnose, troubleshoot, and resolve/escalate issues reported to the help desk."
    },
    {
      "duty": "Monitor, manage, and document all actions and solutions into ticketing system."
    },
    {
      "duty": "Respond to requests via email, in person, or over the phone using remote assistance tools."
    },
    {
      "duty": "Follow up on outstanding requests and ensure timely resolution."
    },
    {
      "duty": "Maintain inventory of company computer equipment, peripherals, and supplies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree and/or 5+ years of related work experience."
    }
  ]
}