{
  "meta": [
    {
      "job_title": "Associate Director of Policy, Governance, Audit and Compliance",
      "job_category": "Cybersecurity",
      "job_class": "Director",
      "sector": "Cybersecurity",
      "salary": 200000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cybersecurity Risk Management",
      "experience": 6
    },
    {
      "skill": "Compliance Management",
      "experience": 6
    },
    {
      "skill": "Governance Management",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Information Risk Management",
      "experience": 6
    },
    {
      "skill": "Cybersecurity Technology",
      "experience": 6
    },
    {
      "skill": "Legal and Regulatory Compliance",
      "experience": 6
    },
    {
      "skill": "Leadership",
      "experience": 6
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 6
    },
    {
      "skill": "Stakeholder Management",
      "experience": 6
    },
    {
      "skill": "People Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establishing an information management and protection framework for an effective enterprise-wide information governance program and direct day-to-day activities."
    },
    {
      "duty": "Identifying information management and protection laws and regulations and implement actions to ensure compliance."
    },
    {
      "duty": "Effectively representing the organization's positions and advocate internal and external policy to shape the development of new laws and regulations consistent with company objectives."
    },
    {
      "duty": "Developing and implementing a compliance monitoring system."
    },
    {
      "duty": "Coordinating a company-wide assessment process to identify potential risks and control solutions."
    },
    {
      "duty": "Creating internal partnerships with key stakeholders, such as business information security officers (BISOs), other Cybersecurity teams, technical teams in the business units, Legal, and Enterprise Risk Management to influence and align business-area actions."
    },
    {
      "duty": "Directing actions to ensure external stakeholders, such as suppliers, have policies and practices that are aligned with laws, regulations, and organizational programs."
    },
    {
      "duty": "Developing and overseeing the formalized programs related to compliance (ViSF, PCI) by evaluating the current landscape of each and developing plans for improved management which will include automation."
    },
    {
      "duty": "Proactively providing insightful recommendations across the internal environment to improve internal control procedures, increase audit efficiencies, and drive process optimization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or four or more years of work experience."
    },
    {
      "credential": "Professional management certification, such as CISA, CRISC, CISM, CISSP, or other related credentials."
    },
    {
      "credential": "Sound knowledge of business management and a working knowledge of information risk management, cybersecurity and IT compliance technologies; knowledge and understanding of relevant legal and regulatory requirements."
    },
    {
      "credential": "A degree."
    },
    {
      "credential": "Three or more years of people management experience."
    },
    {
      "credential": "Excellent verbal and written communication skills with the ability to influence the actions of internal stakeholders and manage relationships with external stakeholders."
    }
  ]
}