{
  "meta": [
    {
      "job_title": "Executive Briefing Experience Manager",
      "job_category": "Administrative",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Logistics Management",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Report Generation",
      "experience": 5
    },
    {
      "skill": "Concierge Services",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the general administrative support of the Briefing Program team and visiting customers."
    },
    {
      "duty": "Generate reports on briefing metrics and measures."
    },
    {
      "duty": "Maintain inventory of all supplies and customer giveaways."
    },
    {
      "duty": "Provide concierge-style service to all customers, including meeting and greeting customers, and escorting them to their briefing room."
    },
    {
      "duty": "Organize internal meetings and events other than briefings that take place in the Briefing Center."
    },
    {
      "duty": "Coordinate with security and reception desk, and serve as the point of contact for security, facilities, A/V, etc."
    },
    {
      "duty": "Coordinate the ordering of catering for all engagements, including the setup/breakdown and cleanup."
    },
    {
      "duty": "Manage vendor relationships with catering, hotels, transportation, and gifts."
    },
    {
      "duty": "Refresh all marketing collateral and maintain inventory."
    },
    {
      "duty": "Update the briefing schedule on a daily basis and share it with lobby receptionist."
    },
    {
      "duty": "Collect necessary information for customer engagements with the account team, including time, date, catering, hotels, special requests, etc."
    },
    {
      "duty": "Prepare all customer and account team name badges."
    },
    {
      "duty": "Manage pre-engagement arrangements prior to the start of the briefing, including cleaning and setup (meeting logistics – agenda, feedback forms, name tents, badges, A/V setup, pad/pen, etc.)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Hospitality Management, or related field (Master's preferred)"
    }
  ]
}