{
  "meta": [
    {
      "job_title": "HVAC Certified Mechanic",
      "job_category": "Mechanical Engineering",
      "job_class": "Mechanic",
      "sector": "Mechanical Engineering",
      "salary": 43665,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Repairs",
      "experience": 5
    },
    {
      "skill": "Blueprint Interpretation",
      "experience": 5
    },
    {
      "skill": "Refrigeration Mechanics",
      "experience": 5
    },
    {
      "skill": "Pneumatic Control Systems",
      "experience": 5
    },
    {
      "skill": "Preventive Maintenance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform installation, preventative maintenance, and repair on all steam generation units, absorption systems, reciprocating systems, cooling towers, air handling and water delivery systems, fans, and pumps."
    },
    {
      "duty": "Diagnose problems, order parts, repair, service equipment that uses Freon as the basic cooling vehicle, and develop solutions to installation and maintenance problems."
    },
    {
      "duty": "Inspect equipment regularly as part of preventive maintenance program, conduct required tests, anticipate malfunctions, and lubricate, adjust, and clean equipment as directed by the preventive maintenance work order."
    },
    {
      "duty": "Read and use blueprints, schematics, specifications, mechanical, electrical, and plumbing drawings in order to effect repairs; works from oral and written orders."
    },
    {
      "duty": "Maintain established departmental policies and procedures, objectives, quality assurance program, safety, environmental, and infection control standards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "High school graduation or equivalent required. Graduation from a trade school with specialization in refrigeration mechanics preferred. NYC Permit: Burning and NYC Refrigerant Certification"
    }
  ]
}