{
  "meta": [
    {
      "job_title": "Product Owner",
      "job_category": "Product Management",
      "job_class": "Owner",
      "sector": "Marketing",
      "salary": 125000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute the product roadmaps through the New Product Introduction (NPI) process to ensure the products meet customer requirements and offer a competitive advantage."
    },
    {
      "duty": "Analyze customer feedback, competitor positioning, and industry trends to find product solutions."
    },
    {
      "duty": "Collaborate with NPI teams as the voice of the customer and make timely trade-off decisions based on customer requirements, cost, and timing impacts."
    },
    {
      "duty": "Work within a matrixed organization to launch new products, meet business metrics, and achieve customer satisfaction."
    },
    {
      "duty": "Coordinate findings within the Product Management team and align them with the business goals and priorities."
    },
    {
      "duty": "Oversee all stages of NPI and liaison with Global and Regional Marketing to deliver updates."
    },
    {
      "duty": "Provide product expertise on competitors’ solutions to meet customer needs."
    },
    {
      "duty": "Manage and prioritize the product backlog based on changing market conditions."
    },
    {
      "duty": "Participate in all Scrum meetings and product sprints."
    },
    {
      "duty": "Develop go-to-market strategy to ensure a competitive advantage in the areas of most value to the customer."
    },
    {
      "duty": "Develop product artifacts such as positioning, messaging, presentations, marketing collateral, and demonstrations for use in launch and training."
    }
  ],
  "skills": [
    {
      "skill": "Product Management",
      "experience": 5
    },
    {
      "skill": "Agile",
      "experience": 5
    },
    {
      "skill": "Scrum",
      "experience": 5
    },
    {
      "skill": "Global Environment",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Spoken Communication",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "BS Degree in Technical or Science background"
    }
  ]
}