{
  "meta": [
    {
      "job_title": "Controller",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Financial Management",
      "salary": 160000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Management",
      "experience": 10
    },
    {
      "skill": "Investment Management",
      "experience": 10
    },
    {
      "skill": "Tax and Audit",
      "experience": 10
    },
    {
      "skill": "Cash Management",
      "experience": 10
    },
    {
      "skill": "Business Accounting",
      "experience": 10
    },
    {
      "skill": "Microsoft Excel",
      "experience": 10
    },
    {
      "skill": "ADP Payroll",
      "experience": 5
    },
    {
      "skill": "QuickBooks",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the Controllers department, overseeing Financial Statement preparation, Payroll, Audit, Tax, Treasury, and Business Affairs Functions."
    },
    {
      "duty": "Provide financial information and expertise to the Management Team and Key Stakeholders."
    },
    {
      "duty": "Oversee the Corporate Accounting Department for accurate and timely dissemination of financial management reports."
    },
    {
      "duty": "Manage the relationship with the company’s external Tax and Audit advisors."
    },
    {
      "duty": "Supervise aspects of the Financial Director’s Functions centered on Treasury, Accounts Payable and Accounts Receivable functions."
    },
    {
      "duty": "Manage the payroll process ensuring accurate calculations and payments to employees."
    },
    {
      "duty": "Responsible for Treasury functions including cash control and bank reconciliations."
    },
    {
      "duty": "Establish and maintain systems and controls to verify the integrity of all systems, processes, and data."
    },
    {
      "duty": "Create safeguards to minimize errors and improve efficiency in the Accounts Payable process."
    },
    {
      "duty": "Manage the Company’s Investment portfolio, create strategies, make recommendations to CEO, and manage tax and accounting aspects of investments."
    },
    {
      "duty": "Take charge of the Business Affairs area ensuring regulatory compliance in the areas of business registrations, licenses, and tax."
    },
    {
      "duty": "Perform ad-hoc analysis and projects, creating management reports to help the company better understand & summarize transactional activity."
    },
    {
      "duty": "Play a lead role in special projects and enhancements, including the upgrading of systems and processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in accounting or finance required. MBA / CPA certification preferred."
    },
    {
      "credential": "Investment Financial Experience required."
    },
    {
      "credential": "Expert level Microsoft Excel skills, ERP experience preferred."
    },
    {
      "credential": "Experience working with multiple companies."
    },
    {
      "credential": "Knowledge of ADP payroll & QuickBooks software."
    }
  ]
}