{
  "meta": [
    {
      "job_title": "Senior Director of Accounting",
      "job_category": "Accounting",
      "job_class": "Director",
      "sector": "Management",
      "salary": 150000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the overall general ledger and reporting functions in the accounting group."
    },
    {
      "duty": "Ensure quality and accuracy of financial information for internal and external financial reporting."
    },
    {
      "duty": "Maximize the utilization of the Company's accounting and financial reporting systems."
    },
    {
      "duty": "Drive the effectiveness of international accounting and global corporate financial consolidation."
    },
    {
      "duty": "Responsible for ensuring adherence to Company policies related to accounting, transactional processing, and financial reporting."
    },
    {
      "duty": "Lead the recognition of capitalized assets, compliance with applicable U.S. GAAP, and property tax reporting."
    },
    {
      "duty": "Ensure accuracy and adequacy of recognized liabilities, including accounts payable, accrued expenses, debt, and others."
    },
    {
      "duty": "Ensure revenue recognition in accordance with ASC606 and manage audits with external and internal parties."
    },
    {
      "duty": "Manage the payroll team and review payroll pay register, stock transactions, and monthly commission payments."
    },
    {
      "duty": "Lead accounts payable team, ensure accuracy of payments, improve and automate AP processes, and maintain company policies."
    },
    {
      "duty": "Ensure employees are paid accurately and tax wage reporting is appropriate."
    }
  ],
  "skills": [
    {
      "skill": "CPA",
      "experience": 5
    },
    {
      "skill": "Public Accounting",
      "experience": 5
    },
    {
      "skill": "MS Excel",
      "experience": 5
    },
    {
      "skill": "ERP",
      "experience": 5
    },
    {
      "skill": "U.S. GAAP",
      "experience": 5
    },
    {
      "skill": "Payroll",
      "experience": 5
    },
    {
      "skill": "Lease Accounting",
      "experience": 5
    },
    {
      "skill": "Sales Tax",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "CPA required, preferably with public accounting experience. Bachelor's degree required, MBA a plus."
    }
  ]
}