{
  "meta": [
    {
      "job_title": "Program Coordinator",
      "job_category": "Social Work",
      "job_class": "Coordinator",
      "sector": "Services",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Crisis Intervention",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Community Integration",
      "experience": 5
    },
    {
      "skill": "Data Collection",
      "experience": 5
    },
    {
      "skill": "Behavioral Analysis",
      "experience": 5
    },
    {
      "skill": "Health Services",
      "experience": 5
    },
    {
      "skill": "Program Facilitation",
      "experience": 5
    },
    {
      "skill": "QA Audits",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Training",
      "experience": 5
    },
    {
      "skill": "Conflict Mediation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate and facilitate the development of support plans and assessments for individuals on the caseload."
    },
    {
      "duty": "Provide professional supervision in the day-to-day program management of services for clients with developmental disabilities."
    },
    {
      "duty": "Advocate for appropriate services and assure that the person has choice in all areas of their life."
    },
    {
      "duty": "Assist with locating resources to help individuals achieve their personal goals and increase their independence."
    },
    {
      "duty": "Promote cooperative working relationships and positive team atmosphere both internally and externally with providers, agencies, families, coworkers, and the individuals served."
    },
    {
      "duty": "Complete thorough, accurate, and timely assessments, plans, and other documentation tasks necessary to ensure ongoing funding for services."
    },
    {
      "duty": "Monitor delivery of supports and ensure accurate implementation and data collection of service and support plans."
    },
    {
      "duty": "Develop positive behavioral strategies and supports to assist people with maladaptive behaviors and help increase utilization of positive coping mechanisms."
    },
    {
      "duty": "Conduct announced and unannounced home visits monthly to document contracted living arrangements and satisfaction of the individuals served."
    },
    {
      "duty": "Make weekly phone contact with providers and individuals served to give ongoing support."
    },
    {
      "duty": "Facilitate various requirements such as Host Home Day, IDT meetings, Incident Reports, and QA recommendations."
    },
    {
      "duty": "Collaborate with the Health Services Department and Provider Specialists regarding health and Host Home status of all individuals served."
    },
    {
      "duty": "Help coordinate internal moves for individuals in new Host Homes when the current supports are no longer appropriate."
    },
    {
      "duty": "Provide person-specific training to independent contractors on health and safety requirements, program supports, and required documentation."
    },
    {
      "duty": "Attend workshops, seminars, professional meetings, and internal trainings to keep abreast of current changes in the field."
    },
    {
      "duty": "Follow and exemplify the organization’s vision, mission, and values."
    },
    {
      "duty": "Perform other duties as assigned by supervisor within the scope of the position and reflective of professional experience, education, and ability."
    },
    {
      "duty": "Adhere to the company’s standards of conduct and comply with all company policies, procedures, and protocols."
    },
    {
      "duty": "Passion and commitment to serve persons with developmental disabilities with dignity and acceptance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Social Work, Psychology, or closely related field (preferred); or equivalent experience working with individuals with intellectual and developmental disabilities."
    }
  ]
}