{
  "meta": [
    {
      "job_title": "GIS Analyst",
      "job_category": "Data Analysis",
      "job_class": "Analyst",
      "sector": "Technology",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "GIS Database Design",
      "experience": 3
    },
    {
      "skill": "Data Management",
      "experience": 3
    },
    {
      "skill": "Geospatial Analysis",
      "experience": 3
    },
    {
      "skill": "Programming",
      "experience": 3
    },
    {
      "skill": "Spatial Modeling",
      "experience": 3
    },
    {
      "skill": "Emergency Response Analysis",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support and participate in the design and development of the geospatial database."
    },
    {
      "duty": "Oversee data flow, management, and distribution activities to support GIS access and use within the organization."
    },
    {
      "duty": "Maintain up-to-date and accurate geospatial documentation for reference."
    },
    {
      "duty": "Develop GIS-related software applications and provide complex analysis on modeled GIS data."
    },
    {
      "duty": "Conduct spatial analysis, including overlay operations, proximity analysis, and spatial modeling."
    },
    {
      "duty": "Research, compile data, and create maps and/or web applications to present geospatial data."
    },
    {
      "duty": "Provide support for emergency or high-priority programming or data analysis utilizing GIS software and statistical techniques to derive insights."
    },
    {
      "duty": "Recommend and establish standards and procedures for the production of high-priority GIS data, reports, interactive maps, and associated services."
    },
    {
      "duty": "Design and develop integrations with other operational systems and data to produce maps, web applications, and dashboards for presenting data findings and derive insights."
    },
    {
      "duty": "Write programs and develop user interfaces, menus, and macro-level commands to meet high-priority GIS needs."
    },
    {
      "duty": "Ensure compliance with data privacy regulations and security protocol to protect sensitive data."
    },
    {
      "duty": "Engage in a variety of projects requested by a range of clients to support GIS needs."
    },
    {
      "duty": "Front-level response for emergency or high-priority programming or data forensic analysis."
    },
    {
      "duty": "Develop and maintain the GIS computing infrastructure."
    },
    {
      "duty": "Research, develop, and recommend technology, price, schedule, and other elements to meet specific customer needs relating to geospatial data."
    },
    {
      "duty": "Train users and programmers to ensure maintenance, usage, and application are appropriate."
    },
    {
      "duty": "Work with clients to determine GIS needs and architectural considerations to assist in defining the scope of work."
    },
    {
      "duty": "Document research and development work while providing timely reporting of project status."
    },
    {
      "duty": "Perform other duties as requested or assigned."
    }
  ],
  "subjective_elements": [],
  "education_certification": []
}