{
  "meta": [
    {
      "job_title": "Sr Auditor - IT Controls and Compliance",
      "job_category": "Auditing",
      "job_class": "Senior Auditor",
      "sector": "IT",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "IT Control Audit",
      "experience": 10
    },
    {
      "skill": "Sarbanes Oxley (SOX)",
      "experience": 10
    },
    {
      "skill": "COBIT Audit",
      "experience": 10
    },
    {
      "skill": "Information Technology Governance",
      "experience": 10
    },
    {
      "skill": "Information Security Risk Assessment",
      "experience": 10
    },
    {
      "skill": "IT Processes",
      "experience": 10
    },
    {
      "skill": "Cloud Security",
      "experience": 10
    },
    {
      "skill": "Identity Management",
      "experience": 10
    },
    {
      "skill": "Program Management",
      "experience": 10
    },
    {
      "skill": "Excel",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads, manages & executes audits of the information technology control design and effectiveness in accordance with information technology & security, authoritative sources including the Lennar Enterprise Security Office corporate standards; Sarbanes Oxley (SOX); Control Objectives for Information and Related Technology (COBIT); or International Organization of Standards (ISO)."
    },
    {
      "duty": "Leads & manages audits, projects, activities, and remediation plans to mitigate information technology and security risks within LTS."
    },
    {
      "duty": "Assesses the information technology control environment and recommends enhancements and improvements to control activities, measures, and routines."
    },
    {
      "duty": "Defines information technology policy, standards, and framework and proactively bridges the gap between control requirements, technical issues, and business risks."
    },
    {
      "duty": "Proactively manages changes in the industry, information technology governance, and external risk compliance landscape."
    },
    {
      "duty": "Ensure information technology risk management practices are embedded in the enterprise and that systems and data criticality and sensitivity are defined."
    },
    {
      "duty": "Constructs corrective action plans for resolution of control weaknesses and provides expert guidance on how to avoid and prevent similar situations in the future."
    },
    {
      "duty": "Define and deliver key performance indicators on audit issue and control weakness closure rate."
    },
    {
      "duty": "Conduct testing and validation of remediation action plans and enhancements to control routines."
    },
    {
      "duty": "Demons effective working relationships with key stakeholders."
    },
    {
      "duty": "Incorporates business strategy into the decision-making process, mentors less experienced associates on strategies."
    },
    {
      "duty": "Influences others and works with integrity; upholds organizational values."
    },
    {
      "duty": "Sensitive and responsive to internal and external needs."
    },
    {
      "duty": "Promotes a supportive and collaborative teamwork environment."
    },
    {
      "duty": "Evaluates interdependencies; thinks critically when solving problems."
    },
    {
      "duty": "Behaves as a role model for proper behavior related to diversity."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Computer Science, MIS or related business degree (Master's preferred)"
    }
  ]
}