{
  "meta": [
    {
      "job_title": "NetSuite ERP Director/Manager",
      "job_category": "Information Technology",
      "job_class": "Director/Manager",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "NetSuite functional configurations management and NetSuite administration",
      "experience": 10
    },
    {
      "skill": "NetSuite ERP Consultant Certification and/or NetSuite Administrator Certification",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "RF-Smart WMS, SCIS, Suite Projects, ARM, integration tools (Boomi, Workato, C-Data)",
      "experience": 8
    },
    {
      "skill": "System Change Management",
      "experience": 10
    },
    {
      "skill": "System implementation",
      "experience": 10
    },
    {
      "skill": "Financial Reporting",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive strategies, road map, and implementations for NetSuite ERP."
    },
    {
      "duty": "Be the subject matter expert on NetSuite for business users."
    },
    {
      "duty": "Manage daily change management support process, by assigning maintenance tasks including hands-on execution of more complex tasks."
    },
    {
      "duty": "Manage NetSuite configurations over global settings preferences, custom record types, fields, forms, roles and permissions, page layouts, templates, searches and reports, scripting, workflows, and dashboards to address business process requirements within NetSuite."
    },
    {
      "duty": "Support leadership’s road map to deploy NetSuite across the company by managing implementations activities."
    },
    {
      "duty": "Make recommendations to leadership and business partners regarding system optimization as appropriate."
    },
    {
      "duty": "Manage and route all support requests and users’ administrative needs and provide training as necessary."
    },
    {
      "duty": "Lead business process automation to enable configuration related tasks to support NetSuite enhancements across subsidiaries."
    },
    {
      "duty": "Work cross-functionally with the data team, accounting, and subsidiaries’ general managers."
    },
    {
      "duty": "Responsible for operating effectiveness of internal controls in compliance with Sarbanes Oxley (SOX)."
    },
    {
      "duty": "Manage system documentation and NetSuite policies and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Information Systems, Accounting, Finance, or Business or equivalent experience required (Masters Degree preferred)"
    },
    {
      "credential": "NetSuite ERP Consultant Certification and/or NetSuite Administrator Certification (Required)"
    }
  ]
}