{
  "meta": [
    {
      "job_title": "Real-Time Market Transmission Operations Adviser",
      "job_category": "Operations",
      "job_class": "Adviser",
      "sector": "Energy",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Market Operations",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "System Operations",
      "experience": 7
    },
    {
      "skill": "Communication",
      "experience": 7
    },
    {
      "skill": "Analysis",
      "experience": 7
    },
    {
      "skill": "Stakeholder Management",
      "experience": 7
    },
    {
      "skill": "Utilities Balancing",
      "experience": 7
    },
    {
      "skill": "Energy Grid Operations",
      "experience": 7
    },
    {
      "skill": "Market Enhancement",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide subject matter expertise in regional strategy and policy recommendations related to energy market activities including the real-time energy and day-ahead market operations."
    },
    {
      "duty": "Lead and manage the functional group, directing day-to-day activities, providing guidance, and overseeing project initiatives."
    },
    {
      "duty": "Plan, analyze, design, and support projects enabling continued participation/integration in market initiatives and new market expansion."
    },
    {
      "duty": "Oversee and manage all Balancing Authority Area market tools, as well as procedures utilized in real-time operations."
    },
    {
      "duty": "Act as a SME in the market stakeholder processes and/or other market related initiatives, collaborating with other business units and identifying, analyzing, and resolving real-time issues."
    },
    {
      "duty": "Identify and coordinate changes needed to accommodate market enhancement releases and integration for new real-time energy and day-ahead market entities."
    },
    {
      "duty": "Participate on various advisory committees and task forces, providing input into team employee performance reviews and flagging performance and personnel issues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Engineering, Business, Economics, or related field; or equivalent combination of education and related experience"
    }
  ]
}