{
  "meta": [
    {
      "job_title": "Briefing Engagement Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage multiple briefings from start to finish and act as the single point of contact to sales and services counterparts."
    },
    {
      "duty": "Interact with all levels of employees, serving as a liaison between the account owner and the various Workmates needed to fulfill the agenda for each briefing event."
    },
    {
      "duty": "Manage day-to-day customer briefings involving various internal teams as well as high-level external customers."
    },
    {
      "duty": "Provide heavy scheduling support, including calendar invites and outreach to various teams to confirm availability."
    },
    {
      "duty": "Follow a pre-determined process to draft agendas, schedule against those agendas, and host meetings on the day they take place."
    },
    {
      "duty": "Juggle various competing timelines and ensure each event stays on track and on time."
    },
    {
      "duty": "Confidently push back on account teams when necessary to ensure the best possible outcome for the briefing."
    },
    {
      "duty": "Collaborate closely with CXC team, technology support team, logistics team, catering, etc. to bring all elements of the briefing together."
    },
    {
      "duty": "Communicate at an executive level via email, phone, Slack, etc."
    },
    {
      "duty": "Manage additional special projects as needed by the CXC team."
    },
    {
      "duty": "Support in developing ongoing best practices."
    }
  ],
  "skills": [
    {
      "skill": "Executive Level Communication",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Event Coordination",
      "experience": 6
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 6
    },
    {
      "skill": "Scheduling and Calendar Management",
      "experience": 6
    },
    {
      "skill": "Team Collaboration",
      "experience": 6
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration or related field (Master's preferred)"
    }
  ]
}