{
  "meta": [
    {
      "job_title": "Medical Assistant",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform direct patient care including vital signs, procedures, and treatments under the supervision of a licensed Physician and Practice Manager."
    },
    {
      "duty": "Perform assigned clerical duties, maintain and cooperate in department-specific education, and quality improvement programs."
    },
    {
      "duty": "Demonstrate a professional and caring image at all times while maintaining patient confidentiality."
    },
    {
      "duty": "Adhere to the Florida Health Care Plans Policy and Procedures, practicing only within the scope of education, training, and/or experience."
    }
  ],
  "skills": [
    {
      "skill": "Medical Assisting",
      "experience": 1
    },
    {
      "skill": "CPR Certification",
      "experience": 1
    },
    {
      "skill": "Patient Care",
      "experience": 1
    },
    {
      "skill": "Clerical Duties",
      "experience": 1
    },
    {
      "skill": "Professionalism",
      "experience": 1
    },
    {
      "skill": "Confidentiality",
      "experience": 1
    },
    {
      "skill": "Clear Communication",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Scribing",
      "experience": 1
    },
    {
      "skill": "Medical Terminology",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of a Medical Assistant Program from an accredited school or one year previous medical assistant experience in a medical practice. Current certification or the ability to obtain certification through AAMA, NAHP, or RMA with ARMA or AMT within one year of employment. Current Professional Rescuer CPR Certification (only acceptable programs are American Heart Association and the American Red Cross) or ability to obtain certification within 90 days of employment. Reliable transportation and ability to drive to various facilities as needed."
    }
  ]
}