{
  "meta": [
    {
      "job_title": "Collections Manager",
      "job_category": "Arts & Culture",
      "job_class": "Manager",
      "sector": "Museum",
      "salary": 18,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Collections Management",
      "experience": 5
    },
    {
      "skill": "Archives Management",
      "experience": 5
    },
    {
      "skill": "Research Skills",
      "experience": 5
    },
    {
      "skill": "Recordkeeping",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, manage, and execute the processing of objects and archival materials acquired by the museum through gift, purchase, or loan."
    },
    {
      "duty": "Maintain collection, archival, and exhibit material inventory, and manage collections, archival, and exhibit materials stock replenishment."
    },
    {
      "duty": "Conduct initial assessment for proposed objects or archival materials and develop object or archival housing."
    },
    {
      "duty": "Produce monthly Collections Committee reports that include department updates, object-management reports, and details of proposed acquisitions."
    },
    {
      "duty": "Facilitate care and security of collections at the museum, exhibits, research library, and off-site storage."
    },
    {
      "duty": "Create and implement inventory schedule, and work with other staff on exhibition installations."
    },
    {
      "duty": "Train and supervise the work of ancillary personnel such as other staff, interns, and volunteers when required."
    },
    {
      "duty": "Oversee digitization process with volunteers or grant-funded contractors."
    },
    {
      "duty": "Manage photo orders and requests from the public, and work in partnership with the Outreach and Public Programs Manager to fulfill orders."
    },
    {
      "duty": "Track department volunteer hours and perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or certificate in collections management, archives, or library science with a minimum of two (2) years of experience (paid or volunteer); preferred Master’s degree in collections management or library science or equivalent work experience."
    }
  ]
}