{
  "meta": [
    {
      "job_title": "Program Manager II",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Retail Project Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Project Tracking",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Retail Research",
      "experience": 5
    },
    {
      "skill": "Fixture Design",
      "experience": 5
    },
    {
      "skill": "Artwork Production",
      "experience": 5
    },
    {
      "skill": "AV Retail Display",
      "experience": 5
    },
    {
      "skill": "Telco Operations",
      "experience": 5
    },
    {
      "skill": "Creative Layout",
      "experience": 5
    },
    {
      "skill": "Print Production",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Initiate, progress, and deliver retail project activities in partnership with the Global VM Lead."
    },
    {
      "duty": "Act as a key point of contact between global fixture vendor partners, graphic companies, channel marketing managers, creative and marketing teams."
    },
    {
      "duty": "Track and manage the financial aspect of projects and use internal payment systems and tools for payment activities."
    },
    {
      "duty": "Work closely with team members to ensure all project activities are on budget."
    },
    {
      "duty": "Identify areas to value engineer, negotiate with vendors, and maintain project trackers to ensure timely execution."
    },
    {
      "duty": "Organize vendor partner conference calls weekly to track and update progress, ensuring all deadline dates are on track."
    },
    {
      "duty": "Prepare internal communications to convey and drive understanding of project plans and activity status."
    },
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote freight and logistics services."
    },
    {
      "duty": "Lead a team of marketing specialists, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's online presence, optimizing the website and social media channels for maximum engagement and conversions."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    },
    {
      "duty": "Work on internal process development and collaborate with team members to drive efficiencies for physical merchandising initiatives."
    },
    {
      "duty": "Thrive in a constantly changing environment with a focus on detail and first-hand experience in 3rd party retail, fixture design, and implementation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 0,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Project Management or a related field (Master's preferred)"
    }
  ]
}