{
  "meta": [
    {
      "job_title": "CIS Conflict Navigator",
      "job_category": "Conflict Resolution",
      "job_class": "Navigator",
      "sector": "Legal Services",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Conflict Resolution",
      "experience": 3
    },
    {
      "skill": "Mediation",
      "experience": 3
    },
    {
      "skill": "Case Development",
      "experience": 2
    },
    {
      "skill": "Social Services",
      "experience": 3
    },
    {
      "skill": "Referral Coordination",
      "experience": 2
    },
    {
      "skill": "Database Management",
      "experience": 2
    },
    {
      "skill": "Community Outreach",
      "experience": 2
    },
    {
      "skill": "Event Coordination",
      "experience": 2
    },
    {
      "skill": "Written Communication",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct initial case development and respond to dispute resolution inquiries received through the CIS Helpline and CIS email."
    },
    {
      "duty": "Outreach to the other side of the dispute, including those who may have knowledge of the situation, such as housing case managers, property managers, social workers, etc., when appropriate."
    },
    {
      "duty": "Clarify issues, concerns, needs, and interests of all parties involved and complete City and County Client Intake Forms for residents and tenants who qualify for free services."
    },
    {
      "duty": "Provide referrals to legal assistance and social service supports, when appropriate, and prepare written summaries of dispute resolution inquiries."
    },
    {
      "duty": "Attend mediations as support to the participants and the mediator, and perform aftercare check-ins with participants, post mediation."
    },
    {
      "duty": "Assist with scheduling meetings and facilitation and/or mediation, assist with in-person visits to promote CIS, and appearances at public events."
    },
    {
      "duty": "Support outreach of the CIS program and assist managing CIS database functions as needed, and help coordinate referral resources."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree."
    },
    {
      "credential": "At least 20 hours of mediation training and/or equivalent experience."
    }
  ]
}