{
  "meta": [
    {
      "job_title": "Physical Therapist",
      "job_category": "Healthcare",
      "job_class": "Therapist",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Physical Therapy",
      "experience": 5
    },
    {
      "skill": "Patient Evaluation",
      "experience": 5
    },
    {
      "skill": "Muscle Testing",
      "experience": 5
    },
    {
      "skill": "Rehabilitation",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "Supervision",
      "experience": 5
    },
    {
      "skill": "Interdisciplinary Communication",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Professional Judgment",
      "experience": 5
    },
    {
      "skill": "Safety Protocols",
      "experience": 5
    },
    {
      "skill": "Customer Relations",
      "experience": 5
    },
    {
      "skill": "Teamwork",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direct physical therapy to patients, evaluating and treating individuals with a focus on restoring function following trauma or disease."
    },
    {
      "duty": "Use special physical therapy tests and measurements to evaluate patients and develop treatment plans."
    },
    {
      "duty": "Administer physical therapy treatments using various techniques such as therapeutic exercise, manual therapy, and modalities to relieve pain and restore function."
    },
    {
      "duty": "Document patient treatment data, progress notes, and discharge summaries."
    },
    {
      "duty": "Instruct patients and their families in home program and supervise patient's plan of care when carried out by a physical therapist assistant."
    },
    {
      "duty": "Represent department in meetings, attend patient care conferences, and provide in-services for other hospital departments."
    },
    {
      "duty": "Use effective time management to complete patient care assignments and meet departmental productivity standards."
    },
    {
      "duty": "Participate in professional activities for continued self-development and growth of technical knowledge and skills."
    },
    {
      "duty": "Maintain an optimistic and professional image, and exhibit excellent customer relations to patients, visitors, physicians, and co-workers."
    },
    {
      "duty": "Conform to the service expectation policy and adhere to safety protocols and safe delivery of care."
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of a physical therapy educational program approved by the State Board of Physical Therapy Examiners"
    },
    {
      "credential": "Licensed physical therapist in the State of South Carolina by the State Board of Physical Therapy Examiners"
    },
    {
      "credential": "CPR Certification"
    }
  ]
}