{
  "meta": [
    {
      "job_title": "Product Manager - Trading Technology",
      "job_category": "Product Management",
      "job_class": "Manager",
      "sector": "Financial Technology",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Product Strategy and Development",
      "experience": 5
    },
    {
      "skill": "C++ Programming",
      "experience": 5
    },
    {
      "skill": "Python Programming",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Requirements Gathering",
      "experience": 5
    },
    {
      "skill": "Product Lifecycle Management",
      "experience": 5
    },
    {
      "skill": "User-Centric Focus",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Agile Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead product strategy and development initiatives for trading technology products."
    },
    {
      "duty": "Utilize C++ and Python proficiency to guide engineering teams in translating product vision into functional software solutions."
    },
    {
      "duty": "Conduct market analysis to identify trends, competitor offerings, and emerging technologies for strategic decision-making."
    },
    {
      "duty": "Gather and prioritize requirements for new trading tools and technologies, then transform them into well-defined product specifications."
    },
    {
      "duty": "Own the entire product lifecycle, from ideation to launch, ensuring timely delivery and exceeding user expectations."
    },
    {
      "duty": "Foster effective communication between engineering, design, and trading teams, ensuring a shared understanding of product goals and progress."
    },
    {
      "duty": "Maintain a deep understanding of user needs and advocate for user-centered design principles to create intuitive and user-friendly products."
    },
    {
      "duty": "Collaborate with compliance and risk management teams to ensure products adhere to regulatory requirements and best practices for risk mitigation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Engineering, Finance, or a related field. MBA is a plus."
    }
  ]
}