{
  "meta": [
    {
      "job_title": "Senior Pipe Stress Engineer",
      "job_category": "Engineering",
      "job_class": "Senior Engineer",
      "sector": "Oil & Gas",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Piping Stress Engineering",
      "experience": 15
    },
    {
      "skill": "Offshore Experience",
      "experience": 20
    },
    {
      "skill": "CAESAR II Software",
      "experience": 15
    },
    {
      "skill": "FEA Analysis",
      "experience": 15
    },
    {
      "skill": "AutoCAD",
      "experience": 15
    },
    {
      "skill": "HAZOP Participation",
      "experience": 15
    },
    {
      "skill": "PDMS",
      "experience": 15
    },
    {
      "skill": "Materials Knowledge",
      "experience": 15
    },
    {
      "skill": "Project Scheduling",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Apply expert knowledge to develop innovative solutions to technically challenging projects."
    },
    {
      "duty": "Organize work, monitor, report, and achieve progress to schedule."
    },
    {
      "duty": "Provide input to project scheduling for dependencies, durations, and manpower requirements."
    },
    {
      "duty": "Review technical requirements for Piping Stress Engineering and establish stress Design Basis/philosophy for various load cases."
    },
    {
      "duty": "Conduct pipe stress engineering of piping systems as per ASME codes using CAESAR II software program."
    },
    {
      "duty": "Perform static analysis using CAESAR II for various load cases such as dead weight, sustained loads, thermal expansion/contraction, wave acceleration, etc."
    },
    {
      "duty": "Perform evaluation of nozzle loads utilizing WRC 107/297 capability of Caesar II program."
    },
    {
      "duty": "Conduct FEA evaluation of stresses at nozzles and for user-calculated SIFs."
    },
    {
      "duty": "Coordinate design of exclusive pipe supports as needed."
    },
    {
      "duty": "Extract engineering data from CAD drawings and computer models."
    },
    {
      "duty": "Develop detailed requisitions for pipe stress equipment and materials."
    },
    {
      "duty": "Review vendor drawing submittals and conduct technical bid evaluation."
    },
    {
      "duty": "Develop and issue parameters, data sheets, and varied construction documents."
    },
    {
      "duty": "Guide technically to CAD designer, drafters, and engineers working on the same pipe stress project."
    },
    {
      "duty": "Participate in reviews of PFD's, P&ID's, Piping ISOs, and Structural Drawings."
    },
    {
      "duty": "Assist with job interviews, conduct performance reviews, and make recommendations for hiring."
    },
    {
      "duty": "Responsible for engineering quality and timeliness in a highly cross-functional engineering environment."
    },
    {
      "duty": "Prepare documentation, reports, correspondence, procedures, specifications, and technical calculations."
    },
    {
      "duty": "Develop piping schematics and layouts based on customer requirements and specifications."
    },
    {
      "duty": "Provide technical follow-up and support on piping matters, from proposal stage to aftermarket."
    },
    {
      "duty": "Respond to classification and customer comment letters."
    },
    {
      "duty": "Good knowledge with piping components materials and specifications. "
    },
    {
      "duty": "Basic understanding of process requirements and operations."
    },
    {
      "duty": "Able to do material take-offs and center of gravity calculations."
    },
    {
      "duty": "Willing to travel if required to participate in HAZOPs, project reviews, fabrication site visits for approximately two weeks."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Mechanical Engineering (Master's preferred)"
    }
  ]
}