{
  "meta": [
    {
      "job_title": "Data Governance Manager",
      "job_category": "Data Management",
      "job_class": "Manager",
      "sector": "Asset Management",
      "salary": 125000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Governance",
      "experience": 10
    },
    {
      "skill": "Data Quality Improvement",
      "experience": 10
    },
    {
      "skill": "Business Strategy",
      "experience": 10
    },
    {
      "skill": "Stakeholder Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Change Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish and implement the communication and training plans for organization-wide Data Governance."
    },
    {
      "duty": "Maintain the Data Governance Framework initiatives and implements changes according to change management procedures as part of the continuous improvement cycle."
    },
    {
      "duty": "Establish and maintain a Data Governance Council charter."
    },
    {
      "duty": "Liaise with business process owners for the implementation of data-related business process improvements."
    },
    {
      "duty": "Facilitate Data Governance Council meetings and provide leadership and guidance to council members to support them in achieving the data governance program objectives."
    },
    {
      "duty": "Support Data Governance Council in estimating high-level budget and resource requirements for data governance initiatives."
    },
    {
      "duty": "Monitor the progress of the Data Governance Program and associated data quality initiatives, according to defined metrics."
    },
    {
      "duty": "Collaborate with business process owners to develop and implement data-related business process improvements."
    },
    {
      "duty": "Support the data governance program objectives by working with stakeholders to define and maintain appropriate data quality standards and related policies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in IT, Data Management, or a related field (Master's preferred)"
    }
  ]
}