{
  "meta": [
    {
      "job_title": "Technical Support Specialist - Tier I",
      "job_category": "Technical Support",
      "job_class": "Specialist",
      "sector": "IT Consulting",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Troubleshooting",
      "experience": 2
    },
    {
      "skill": "Microsoft Windows Desktop Support",
      "experience": 2
    },
    {
      "skill": "Active Directory",
      "experience": 2
    },
    {
      "skill": "Network Connectivity",
      "experience": 2
    },
    {
      "skill": "Data Documentation",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide first-tier support to end users for PC, server, or mainframe applications and hardware."
    },
    {
      "duty": "Interact with network services, software systems engineering, and/or applications development to restore service and/or correct core problems."
    },
    {
      "duty": "Simulate or recreate user problems to resolve operating difficulties."
    },
    {
      "duty": "Recommend system modifications to reduce user problems."
    },
    {
      "duty": "Follow standard help desk operating procedures to accurately log all requests using the in-house tracking system."
    },
    {
      "duty": "Complete initial client contact and work to quickly resolve issues."
    },
    {
      "duty": "Troubleshoot software and hardware issues."
    },
    {
      "duty": "Complete account creation, unlocks, and resets, new computer setup, monitoring of alerts, gather information, and troubleshoot client issues."
    },
    {
      "duty": "Complete basic file restores, basic software and hardware installations."
    },
    {
      "duty": "Monitor and document the status of support requests until a resolution is reached."
    },
    {
      "duty": "Build rapport with various types of business clients."
    },
    {
      "duty": "Previous experience in Microsoft Windows desktop support, remote desktop support, Citrix, Microsoft Server, Microsoft Office products, troubleshooting network connectivity issues, Active Directory, back-up solutions, Apple products, and mobile device support is a plus."
    },
    {
      "duty": "Willingness to work overtime, nights, weekends, holidays, and on-call schedule."
    },
    {
      "duty": "Reliability and ability to handle stressful situations and carry up to 40 lbs."
    },
    {
      "duty": "Perform background check when required."
    }
  ],
  "subjective_elements": [
    {
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or GED. Associate’s degree in computer science or business is preferred but not required. Technical field certifications and educational certifications are a plus."
    }
  ]
}