{
  "meta": [
    {
      "job_title": "Associate Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Manufacturing",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technical Solutions",
      "experience": 3
    },
    {
      "skill": "Process Knowledge",
      "experience": 3
    },
    {
      "skill": "Change Management",
      "experience": 3
    },
    {
      "skill": "Collaboration",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Mentoring",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the completion of complex projects, manage own time to meet agreed targets and help to develop plans for work activities on own projects within a team."
    },
    {
      "duty": "Identify, execute and support continuous improvement opportunities and projects."
    },
    {
      "duty": "Trouble-shoot and provide sustainable solutions for root-cause processing and safety problems."
    },
    {
      "duty": "Effectively use the site business processes to support production e.g. change control, deviations, six sigma method investigations, etc."
    },
    {
      "duty": "Responsible for product knowledge management during tech transfer into the site and during manufacturing campaigns."
    },
    {
      "duty": "Work to implement a culture of Right-First Time through partnerships with Operations and provide leadership in the use of Operational Excellence (OE) principles to optimize our technical and business processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree2+ years’ experienceDemonstrated ability to provide technical solutions for problems through product and process knowledgeUnderstanding of process manufacturing/ computer systemsAbility to manage change and strong collaborative skillsProactive and effective communication within and across shiftsMentoring and interpersonal skills"
    }
  ]
}