{
  "meta": [
    {
      "job_title": "Cloud Network Engineer",
      "job_category": "Engineering",
      "job_class": "Senior",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve and support in a senior role of Cloud Network Engineering, Operations, and/or Architecture."
    },
    {
      "duty": "Design and drive high priority network initiatives and projects in both cloud and hybrid cloud models."
    },
    {
      "duty": "Evaluate network infrastructure and connectivity solutions, and make recommendations to migrate applications and data workloads to a Cloud-based model."
    },
    {
      "duty": "Work in collaboration with leadership, enterprise business partners, vendors, and project teams."
    },
    {
      "duty": "Participate in the development of documentation and tools to enable support organizations to resolve technical issues, including complex Cloud architecture, design, and service-related issues."
    },
    {
      "duty": "Provide technical expertise to project managers and stakeholders about migrating and transitioning applications to Cloud-based services and operating and maintaining applications once migrated."
    },
    {
      "duty": "Handle special projects or initiatives when required."
    },
    {
      "duty": "Work closely with vendors and carriers when necessary."
    },
    {
      "duty": "Develop and maintain network scripts to allow operations to deploy and configure environments after operational turnover."
    },
    {
      "duty": "Share deep technical network knowledge, guidance, and mentoring for high visibility Cloud solutions, implementations, and migration initiatives for the enterprise network."
    },
    {
      "duty": "Provide high-value through deep network engagement, requirements, design, implementation, integration, performance, optimization, and support of Cloud technology solutions aligning with business and overall infrastructure enhancement needs and requirements."
    },
    {
      "duty": "Participate in the development of metrics and implementation of same."
    },
    {
      "duty": "Provide technical guidance/mentoring to others such as network operations."
    },
    {
      "duty": "Participate in the network assessment, design, connectivity, process, and ongoing operation for connecting to various cloud vendors."
    },
    {
      "duty": "Oversee and coordinate business projects, planning, maintenance, and network connectivity for one or more major Business Units."
    },
    {
      "duty": "Assist with the migration of existing applications to new cloud hosting platforms."
    },
    {
      "duty": "Provide senior-level network engineering, design, and operation consultation with leadership, project teams, and end users to identify network runtime requirements and perform feasibility analysis on potential changes related to security and network architecture."
    },
    {
      "duty": "Work closely with leadership to develop future plans, resource requirements, migrations strategies, and project schedules."
    },
    {
      "duty": "Participate in potential refactoring, rebuild, or redesign required during Cloud migration."
    },
    {
      "duty": "Create documentation to install, replace, and upgrade network cloud components."
    },
    {
      "duty": "Provide Cloud product & service evaluation, testing, lab, and mockup solutions as needed."
    },
    {
      "duty": "Serve as a senior network resource in the Hybrid Cloud enterprise journey encompassing ongoing architecture, design, planning, configuration, implementation, testing, operation, and documentation of the enterprise network."
    },
    {
      "duty": "Participate in assigned network integration projects and deployments and ensure solutions are delivered to meet business requirements."
    },
    {
      "duty": "Provide feedback to leadership and peers to risks identified during business impact analysis, site risk assessments, and disaster recovery planning."
    },
    {
      "duty": "Architect, engineer, operate, and maintain custom network integration with Cloud platform specific to customer needs."
    },
    {
      "duty": "Maintain relevancy and knowledge in current cloud, evolving, emerging networking technologies."
    },
    {
      "duty": "Maintain technical knowledge and business acumen within our own discipline or function."
    }
  ],
  "skills": [
    {
      "skill": "Cloud Network Engineering",
      "experience": 4
    },
    {
      "skill": "Cloud Operations",
      "experience": 4
    },
    {
      "skill": "Cloud Architecture",
      "experience": 4
    },
    {
      "skill": "Network Infrastructure Evaluation",
      "experience": 4
    },
    {
      "skill": "Network Connectivity Solutions",
      "experience": 4
    },
    {
      "skill": "Enterprise Collaboration",
      "experience": 4
    },
    {
      "skill": "Technical Documentation",
      "experience": 4
    },
    {
      "skill": "Network Scripting",
      "experience": 4
    },
    {
      "skill": "Mentoring",
      "experience": 4
    },
    {
      "skill": "Business Impact Analysis",
      "experience": 4
    },
    {
      "skill": "Disaster Recovery Planning",
      "experience": 4
    },
    {
      "skill": "Customer Communication",
      "experience": 4
    },
    {
      "skill": "Cloud Integration",
      "experience": 4
    },
    {
      "skill": "Business Acumen",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Computer Science, Information Systems, Computer Networking"
    }
  ]
}