{
  "meta": [
    {
      "job_title": "Financial Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Modeling",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Hospitality Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Excel",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and maintain intricate financial models that support inclusive wellness packages, events, membership programs, unique programming, retail, and pre/post-stay revenue opportunities."
    },
    {
      "duty": "Collaborate with cross-functional teams to gather data, assumptions, and insights required for building comprehensive financial models."
    },
    {
      "duty": "Analyze historical data and industry trends to formulate key assumptions for occupancy rates, number of guests, treatment bookings, retail sales, and other revenue streams."
    },
    {
      "duty": "Incorporate industry-standard metrics such as RevPAR (Revenue Per Available Room), ADR (Average Daily Rate), and other relevant performance indicators into financial models."
    },
    {
      "duty": "Utilize a universal system of accounts for the lodging industry to ensure consistency and accuracy in financial reporting."
    },
    {
      "duty": "Create staffing models that align with projected guest demand, revenue expectations, and service quality standards."
    },
    {
      "duty": "Collaborate with marketing and sales teams to incorporate promotional activities, marketing spend, and other relevant factors into financial projections."
    },
    {
      "duty": "Produce pro-formas and pre-opening budgets that provide a comprehensive overview of projected income, expenses, and profitability for wellness-focused properties."
    },
    {
      "duty": "Conduct scenario analyses to assess the financial impact of different assumptions and variables on the overall business performance."
    },
    {
      "duty": "Prepare clear and insightful financial presentations for internal stakeholders and external partners."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Accounting, Economics, or a related field; Master's degree or relevant certifications (CFA, CPA) preferred"
    }
  ]
}