{
  "meta": [
    {
      "job_title": "Operations Support Specialist",
      "job_category": "Administrative",
      "job_class": "Support",
      "sector": "Client Experience",
      "salary": 48000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medical Claim Payment Review",
      "experience": 1
    },
    {
      "skill": "HIPAA Compliance",
      "experience": 1
    },
    {
      "skill": "Healthcare Background",
      "experience": 2
    },
    {
      "skill": "Microsoft Products",
      "experience": 2
    },
    {
      "skill": "General Office Equipment",
      "experience": 2
    },
    {
      "skill": "Project Management",
      "experience": 2
    },
    {
      "skill": "Problem-Solving",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review and process correspondence from providers, members sand payors according to standard operating procedures."
    },
    {
      "duty": "Receive and triage inbound calls from members, providers, and payers."
    },
    {
      "duty": "Perform outbound advocacy calls to members."
    },
    {
      "duty": "Manage various systems and databases."
    },
    {
      "duty": "Provide daily updates to management and clients as needed."
    },
    {
      "duty": "Generate reports."
    },
    {
      "duty": "Manage communication via email and Microsoft Teams."
    },
    {
      "duty": "Confirms that all documentation processes adhere to Zelis standards regarding privacy, compliance, legal aspects, and HIPAA standards."
    },
    {
      "duty": "Maintain production standards according to department guidelines."
    },
    {
      "duty": "Performs other related responsibilities as assigned."
    },
    {
      "duty": "Maintain a keen awareness of and ensure strict adherence to Zelis standards concerning privacy and confidentiality."
    },
    {
      "duty": "Receive comprehensive instructions for assignments and seeks guidance to determine subsequent actions."
    },
    {
      "duty": "Ability to follow detailed instructions and carry through."
    },
    {
      "duty": "Exhibit proficiency in pertinent job responsibilities, enabling a gradual increase in autonomy."
    },
    {
      "duty": "Maintain a professional demeanor and strictly upholds the confidentiality of administrative matters and files."
    },
    {
      "duty": "Demonstrate adeptness in managing and prioritizing multiple tasks."
    },
    {
      "duty": "Thrive under pressure and consistently meets deadlines."
    },
    {
      "duty": "Tackles complex assignments that demand sound judgment and proactive problem-solving."
    },
    {
      "duty": "Strong organizational skills needed to prioritize responsibilities and effectively complete work."
    },
    {
      "duty": "Exhibits exceptional task management capabilities, efficiently handling multiple tasks as needed."
    },
    {
      "duty": "Possesses excellent project management skills."
    },
    {
      "duty": "Meticulous attention to detail and a focus on the impact of actions are crucial attributes."
    },
    {
      "duty": "Recognizes deviations from experienced observations."
    },
    {
      "duty": "Completes work in a timely fashion and accordance with established deadlines. Alerts leadership in advance if deadlines are unable to be achieved."
    },
    {
      "duty": "Ability to lift and move approximately thirty (30) pounds on a non-routine basis. Ability to sit for extended periods."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience in a healthcare setting. A minimum of 2 years of experience in a medical field or healthcare environment."
    }
  ]
}