{
  "meta": [
    {
      "job_title": "Development Associate, Annual Giving",
      "job_category": "Fundraising",
      "job_class": "Associate",
      "sector": "Nonprofit",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direct administrative support for giving programs, giving board and volunteer groups, as well provide support for the annual Days of Giving and brick program."
    },
    {
      "duty": "Maintain master spreadsheet for Giannini Society, Dean's Circles, and Parent Leadership Circle (PLC)."
    },
    {
      "duty": "Assist with donor mailings, parent events, and stewardship/donor mailings."
    },
    {
      "duty": "Assist with planning and execution of parent events and programs, assist with coordination of on-campus student activities."
    },
    {
      "duty": "Draft emails and letters for renewals, lapsed members, and new acquisitions."
    },
    {
      "duty": "Facilitate design schedules (brochures, postcards) and manage website updates."
    },
    {
      "duty": "Assist with stewardship plan for each new/renewing member and assist with development of giving society newsletters."
    },
    {
      "duty": "Order and manage SWAG items/inventory and track renewal reminder process."
    },
    {
      "duty": "Assist with management of The Associates, UNCSA’s volunteer organization and design process for brochures and postcards."
    },
    {
      "duty": "Assist with visit scheduling, top parent prospects identification, and service plaques management."
    },
    {
      "duty": "Assist with management of the Associates Portal and serve as a resource for the Associates for questions about volunteer opportunities and the Portal."
    },
    {
      "duty": "Assist with fulfillment of Days of Giving donor mailings and after event follow-up."
    },
    {
      "duty": "Assist with annual brick solicitation and coordinate brick fulfillment with vendor."
    }
  ]
}