{
  "meta": [
    {
      "job_title": "Engineering Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Energy",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Engineering Design",
      "experience": 7
    },
    {
      "skill": "Technical Expertise",
      "experience": 7
    },
    {
      "skill": "Financial Analysis",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Expert Witness",
      "experience": 7
    },
    {
      "skill": "Training and Mentorship",
      "experience": 7
    },
    {
      "skill": "Documentation",
      "experience": 7
    },
    {
      "skill": "Safety Promotion",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and lead teams in studies, plans, criteria, specifications, calculations, evaluations, design documents, performance assessments, integrated systems analysis, cost estimates, budgets, associated with the planning, design, licensing, construction, commissioning, operation, and maintenance of electric generation, transmission, distribution, and telecommunication facilities/systems."
    },
    {
      "duty": "Provide consultation and recommendations to the Company and other business units/customers after studying company or customer-owned systems, processes, equipment, vehicles, or facilities."
    },
    {
      "duty": "Review financial data from budget and actual costs of projects and provide technical expertise to strategic, legislative, and operational decisions."
    },
    {
      "duty": "Plan, write, and perform tasks for documentation deliverables and projects."
    },
    {
      "duty": "Participate in department planning, field/site walkdowns, meetings/conference calls, provide budget recommendations, and monitor performance for the accomplishment of committed results."
    },
    {
      "duty": "Serve as an expert in specialized areas and act as an expert witness or provide expert opinions as required."
    },
    {
      "duty": "Provide recommendations to management, implement action plans to improve performance and cost-effectiveness, and provide detailed technical training, mentorship, peer review, and/or guidance to others."
    },
    {
      "duty": "Participate in technical and industry societies and committees to enhance knowledge of new technologies or issues in areas of company interest and make recommendations for business decisions regarding strategy for new technologies and/or engineering techniques and tools."
    },
    {
      "duty": "Influence project decisions having a significant impact on the company and apply technical knowledge to help promote a safe work environment and enhance customer satisfaction."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 150,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science degree in Engineering or Licensed Professional Engineer (PE)"
    }
  ]
}