{
  "meta": [
    {
      "job_title": "Family Partner ACCU",
      "job_category": "Social Work",
      "job_class": "Family Partner",
      "sector": "Healthcare",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Peer Support",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Trauma-Informed Care",
      "experience": 5
    },
    {
      "skill": "Advocacy",
      "experience": 5
    },
    {
      "skill": "Family Engagement",
      "experience": 5
    },
    {
      "skill": "Care Planning",
      "experience": 5
    },
    {
      "skill": "Outreach Strategies",
      "experience": 5
    },
    {
      "skill": "Educational Groups",
      "experience": 5
    },
    {
      "skill": "System Navigation",
      "experience": 5
    },
    {
      "skill": "Cultural Sensitivity",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Professional Boundaries",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide individualized, strengths-based peer support, psychoeducation, and guidance to caregivers and families of youth being cared for by the Adolescent Continuing Care Units (ACCUs)."
    },
    {
      "duty": "Contribute to and implement a multidisciplinary plan of care that supports and amplifies family voice."
    },
    {
      "duty": "Deliver trauma-informed care to youth and families that recognizes and capitalizes on their strengths."
    },
    {
      "duty": "Develop and implement outreach strategies to families to support engagement and active participation in services provided by the ACCUs."
    },
    {
      "duty": "Conduct educational and training groups for patients, families, and staff relating to family support."
    },
    {
      "duty": "Identify services and supports to meet the needs of family members as identified in the individual care plans and links families with these needed supports."
    },
    {
      "duty": "Attend meetings with caregivers and professionals."
    },
    {
      "duty": "Support caregivers in developing self-care strategies."
    },
    {
      "duty": "Conduct systems work as needed to facilitate sustainable discharge plans."
    },
    {
      "duty": "Promote and support collaboration between and among the caregivers participating in ACCUs services and with other service providers."
    },
    {
      "duty": "Provide ongoing caregiver-to-caregiver support (including support groups) and modeling of positive collaboration and advocacy strategies for caregivers and youth."
    },
    {
      "duty": "Model self-care and advocacy for families and support them as they interface with various service providers and systems of care."
    },
    {
      "duty": "Work closely with the multidisciplinary team to ensure activities and interventions increase caregiver skills and encourage family cohesion."
    },
    {
      "duty": "Partner with the multidisciplinary team to deliver trauma-informed care to youth and families that recognizes and capitalizes on their strengths."
    },
    {
      "duty": "Conducts systems work as needed to facilitate sustainable discharge plans."
    },
    {
      "duty": "Attend meetings with caregivers and professionals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Associate or bachelors degree in a human services field with at least one (1) year working directly with youth experiencing serious emotional disturbance or other developmental/behavioral challenges OR a high school diploma/GED and at least two (2) years of experience working with youth experiencing serious emotional disturbance or other developmental behavioral challenges."
    }
  ]
}