{
  "meta": [
    {
      "job_title": "Insurance Policy Manager",
      "job_category": "Insurance",
      "job_class": "Policy Manager",
      "sector": "Insurance",
      "salary": 80000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Annual Policy Renewal (Property, Casualty, D&O, Aviation, Marine Cargo or any other renewals assigned). Participate in renewal strategy meetings and proactively manage renewal timeline for the Client team. Gather, validate and reconcile data for submissions. Review, analyze and advise on quotes and proposals comparison to the leadership team. Follow through and complete post-binding open items. Update claims instructions upon completion of the policy renewal."
    },
    {
      "duty": "Administrative Tasks. Review contracts for inbound and/or outbound insurance requirements. Manage COI issuance as requested. Maintain invoices tracker. Maintain Client viaOne system portal for reporting. Maintain Monolistic States online portal for claims and payroll reporting."
    },
    {
      "duty": "Claims Management. Proactively manage relationship with Client (TPA) and work through transitional issues from client. Participate in Sedgwick semi-annual claims review. Take meeting notes and follow up on key open items out of the meetings. Review and analyze monthly loss run report from Sedgwick and advise any material changes of loss trend, loss reserves and injury causes. Participate in ad hoc claim discussions for litigation, monoplisitc states and legacy claims closure."
    },
    {
      "duty": "Loss Control Program. Design Client risk control program. Collaborate with Client internal departments in reviewing and tracking effective risk controls."
    },
    {
      "duty": "Policy and Procedures. Draft and update new Client policy and procedures for risk management as we transition out of currently Client."
    }
  ],
  "skills": [
    {
      "skill": "Corporate Risk Management",
      "experience": 5
    },
    {
      "skill": "Claims Management",
      "experience": 5
    },
    {
      "skill": "Working at Fortune 500 companies",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Teams",
      "experience": 5
    },
    {
      "skill": "Microsoft Word",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Microsoft PowerPoint",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum Bachelor Degree; MBA preferred. Active Professional Licenses in Insurance"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ]
}