{
  "meta": [
    {
      "job_title": "Integrated Master Scheduler",
      "job_category": "Engineering",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Integrated Master Scheduling",
      "experience": 5
    },
    {
      "skill": "MS Project",
      "experience": 5
    },
    {
      "skill": "Critical Path Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide support to the development, implementation, and maintenance of an integrated master schedule (IMS)."
    },
    {
      "duty": "Monitor and measure progress, identify program-wide issues, and address tasks received from project management and external agencies with respect to integrated master schedules and plans."
    },
    {
      "duty": "Assist in the development of critical paths and SRAs."
    },
    {
      "duty": "Assist with the integration of activities of all functions in the contract, ensuring that they flow smoothly together to achieve objective results."
    },
    {
      "duty": "Assist in the definition of problems in the conduct of the program, and propose and help implement workable solutions to remedy those problems, which will require extrapolative thinking."
    },
    {
      "duty": "Clearly communicate issues and resolutions to project management in both written and verbal means."
    },
    {
      "duty": "Prepare presentations to senior management containing metrics and explanations of data."
    },
    {
      "duty": "Responsible for contract deliverables related to the Integrated Master Schedule (IMS) and Integrated Master Plan (IMP)."
    },
    {
      "duty": "Assist in the coordination of program-wide review meetings with appropriate personnel, coordinate agendas and minutes, and assist in the closure of assigned follow-up actions resulting from program-wide reviews."
    },
    {
      "duty": "May lead program review meetings for scheduling."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in any field. MS Project OpenPlan/Cobra certification preferred."
    }
  ]
}