{
  "meta": [
    {
      "job_title": "CFO",
      "job_category": "Finance",
      "job_class": "CFO",
      "sector": "Management",
      "salary": 150000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage all day-to-day finance and accounting operations, compliance and government contracting functions."
    },
    {
      "duty": "Manage cash forecasting and management as well as oversee the annual budgeting process and annual audit."
    },
    {
      "duty": "Lead the strategic financial planning and analysis effort as well as provide analysis and guidance to the executive team and Board."
    },
    {
      "duty": "Assist with the development and expansion of services as needed— such as government program billing, real estate development and other strategic priorities."
    },
    {
      "duty": "Oversee the preparation and presentation of financial reports, projections and analyses to the executive team, Board and other pertinent audiences."
    },
    {
      "duty": "Lead the financial evaluation and due diligence of potential growth opportunities in consultation with the executive team and the Board."
    },
    {
      "duty": "Manage the relationships with financial institutions, investment advisors and property management company."
    },
    {
      "duty": "Serve as liaison for financial issues to the Board, participating in regular Board and committee meetings."
    },
    {
      "duty": "Oversee compliance in all aspects of the organization – including contract review, reporting requirements, business licenses, investor relations and audits."
    },
    {
      "duty": "Ensure compliance with all agreements with lender and investor partners in a Low-Income Housing Tax Credit property."
    },
    {
      "duty": "Responsibility for asset management with respect to a Low-Income Housing Tax Credit property."
    },
    {
      "duty": "Providing financial oversight and perspective on contracts which the organization may enter."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 150,
      "introvert_extrovert": 75
    }
  ],
  "education_certification": [
    {
      "credential": "Advanced degree in business or finance required (Master's preferred)"
    }
  ]
}