{
  "meta": [
    {
      "job_title": "AEM Architect",
      "job_category": "Software Engineering",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "AEM Architecture",
      "experience": 5
    },
    {
      "skill": "Software Design",
      "experience": 5
    },
    {
      "skill": "Adobe Experience Manager",
      "experience": 5
    },
    {
      "skill": "Architectural Alignment",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Technical Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    },
    {
      "skill": "Agile Development",
      "experience": 3
    },
    {
      "skill": "Adobe Experience Manager Certification",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Translate user requirements into innovative and effective software design solutions, considering feasibility, functionality, and integration with existing systems and platforms."
    },
    {
      "duty": "Create high-level architectural specifications that align with business needs and goals."
    },
    {
      "duty": "Provide expertise on cross-application implications and architectural alignment for software projects."
    },
    {
      "duty": "Collaborate closely with stakeholders to identify and negotiate opportunities for applying architecture standards and guidelines."
    },
    {
      "duty": "Approve business requirements, estimation, functional specifications, testing strategies, and other activities to ensure architectural alignment."
    },
    {
      "duty": "Leverage your knowledge of AEM to design, implement, and optimize AEM Sites solutions."
    },
    {
      "duty": "Set up and configure Adobe Experience Manager environments and infrastructure."
    },
    {
      "duty": "Work within the Adobe Managed Services and Adobe Experience Manager as a Cloud Service environments, ensuring seamless integration and performance optimization."
    },
    {
      "duty": "Stay up-to-date with industry trends and emerging technologies related to AEM and digital experience platforms."
    },
    {
      "duty": "Mentor and guide team members on AEM best practices, architecture principles, and implementation strategies."
    },
    {
      "duty": "Collaborate with cross-functional teams including developers, designers, project managers, and business stakeholders to deliver high-quality AEM solutions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or a related field (Master's preferred)"
    }
  ]
}