{
  "meta": [
    {
      "job_title": "Accounting Assistant",
      "job_category": "Accounting/Finance",
      "job_class": "Assistant",
      "sector": "Finance",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage receivable discount program for a specific portfolio of Scoular’s customers."
    },
    {
      "duty": "Research contracts and invoices in the main trade application."
    },
    {
      "duty": "Prepare and maintain necessary bank reconciliations for Scoular and its subsidiaries."
    },
    {
      "duty": "Book journal entries in selected areas and apply/clear all drafts presented for payment."
    },
    {
      "duty": "Process payables and send out daily communications to the corporate accounting and finance groups."
    },
    {
      "duty": "Play a key role in testing and implementing the cash disbursement process within Scoular’s IT financial management software project."
    },
    {
      "duty": "Perform daily reconciliations for the main operating and certain subsidiary bank accounts."
    },
    {
      "duty": "Prepare the monthly cash reconciliations for all outlying location banks."
    },
    {
      "duty": "Perform recordkeeping and booking journal entries for selected corporate service areas."
    },
    {
      "duty": "Clear items in the subledger and review all drafts sent daily from the bank. Also assist employees company-wide on an as-needed basis."
    },
    {
      "duty": "Perform testing and aid in the integration of the IT transformation project with respect to the cash disbursement process."
    },
    {
      "duty": "Enter and calculate daily and monthly FX rates as a backup role."
    },
    {
      "duty": "Complete daily Futures Hedging Maintenance Requirement reconciliations and entries to the subledger system."
    }
  ],
  "skills": [
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Independent Problem Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Applications",
      "experience": 5
    },
    {
      "skill": "Bank Reconciliations",
      "experience": 5
    },
    {
      "skill": "Cash Disbursement Process",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting, Finance, or Business (Master's preferred)"
    }
  ]
}