{
  "meta": [
    {
      "job_title": "Visitor Center Guide & Docent Coordinator",
      "job_category": "Educational Outreach",
      "job_class": "Coordinator",
      "sector": "Education",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Coordinate the comprehensive execution of public programs, encompassing both on-site and virtual astronomy experiences during daytime and evening hours."
    },
    {
      "duty": "Collaborate with team members from conceptualization and documentation to rehearsal, presentation, audience evaluation, and subsequent enhancements."
    },
    {
      "duty": "Coordinate and recruit volunteer docents and staff guides to run public programs."
    },
    {
      "duty": "Coach and train staff and volunteers in the best techniques of program presentation and communication."
    },
    {
      "duty": "Document guides and docent functions in the Guide/Docent Manual(s) and Training Presentation(s)"
    },
    {
      "duty": "Occasionally lead engaging programs when volunteers or other staff are unavailable."
    },
    {
      "duty": "Provide excellent customer service to guests, volunteers and supporters/donors."
    },
    {
      "duty": "Assist the NOIRLab evaluation specialist with program assessment and evaluation tasks, including attendance tracking, collecting visitor feedback, and utilizing insights for ongoing program enhancements."
    },
    {
      "duty": "Support the KPVC Operations Manager, assist with the development of new public and school programs for instance special events to introduce potential or supporting stakeholders to the observatory, the visitor program, and the Windows Center."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a relevant field such as astronomy, earth science, science education or other directly relevant field."
    }
  ]
}