{
  "meta": [
    {
      "job_title": "President / Chief Operating Officer",
      "job_category": "Leadership",
      "job_class": "Executive",
      "sector": "Management",
      "salary": 250000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with the CEO to set and drive organizational vision, strategy, and hiring."
    },
    {
      "duty": "Translate strategy into actionable steps, implementing organization-wide goal setting, performance management, and operational planning."
    },
    {
      "duty": "Oversee company operations and employee productivity, ensuring team members thrive and organizational goals are met."
    },
    {
      "duty": "Lead in the areas of recruiting, onboarding, professional development, performance management, and retention."
    },
    {
      "duty": "Mentor and coach managers, production, and field service workers."
    },
    {
      "duty": "Together with the CEO and CFO, establish and monitor key metrics (KPIs) for various business units."
    },
    {
      "duty": "Spearhead continuous improvement and LEAN programs in manufacturing and service."
    },
    {
      "duty": "Oversee and prioritize safety and quality standards."
    },
    {
      "duty": "Assist CFO with financial projections and play a role in the implementation of technology and systems to boost efficiency."
    }
  ],
  "skills": [
    {
      "skill": "Operational Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Recruiting",
      "experience": 10
    },
    {
      "skill": "Performance Management",
      "experience": 10
    },
    {
      "skill": "Continuous Improvement",
      "experience": 10
    },
    {
      "skill": "Financial Projections",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Mentoring",
      "experience": 10
    },
    {
      "skill": "Safety Standards",
      "experience": 10
    },
    {
      "skill": "Quality Management",
      "experience": 10
    },
    {
      "skill": "Technology Implementation",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in engineering, Operations, Operations Management, Business Administration, or a related field. MBA is a plus but not required."
    },
    {
      "credential": "7-10 years of significant operational leadership - ideally in a manufacturing and/or field service environment."
    },
    {
      "credential": "Prior experience in roles like President, COO, VP of Operations, or similar leadership positions."
    },
    {
      "credential": "A track record of introducing LEAN and/or Six Sigma continuous improvement techniques, leading to operational enhancements."
    }
  ]
}