{
  "meta": [
    {
      "job_title": "Network Engineering Manager",
      "job_category": "Network Engineering",
      "job_class": "Manager",
      "sector": "Technology",
      "salary": 160000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for building and leading a team to deliver technology products and services that meet business outcomes."
    },
    {
      "duty": "Ensures people development through coaching, mentoring, feedback, and hands-on career development."
    },
    {
      "duty": "Develops a technology strategy and ensures technology solutions comply with applicable standards."
    },
    {
      "duty": "Advocates and advances modern, Agile solution delivery practices and evangelizes great design, engineering, and organizational practices."
    },
    {
      "duty": "Manages relationships with the business and technology leaders, and vendors for technical products."
    },
    {
      "duty": "Leads and creates followership in Communities of Practice in the organization."
    },
    {
      "duty": "Directs the physical and logical engineering deliverables, workflow, and priorities for Global Networks."
    },
    {
      "duty": "Understands the dynamics of risk vs. speed vs. quality and how these choices impact costs/finances and commitments."
    },
    {
      "duty": "Interfaces directly with internal and external customers, network architecture and engineering, deployment and product/service management, operations, vendors, consultants, and contractors."
    },
    {
      "duty": "Solves problems, makes key decisions, and represents the strategic vision and goals of the organization to various stakeholders and shareholders."
    },
    {
      "duty": "Participates in exceptions or new standard reviews and directs the installation of all work."
    },
    {
      "duty": "Works globally in a federated model with regional execution."
    },
    {
      "duty": "Understands how to schedule large, multi-technology projects for deployment and how to leverage projects, change windows, and initiatives to create long-term strategic value."
    },
    {
      "duty": "Critical in the technology delivery lifecycle across networks, the entire infrastructure group, and lines of business initiatives."
    },
    {
      "duty": "Participates in major IT projects, design and deployment, and has strong skills in Scripting, Scripting (Python, Ansible, PowerShell), ITIL, SDN (ACI/NSX, Arista CloudVision), SD-WAN, Automation Skills (Expect, Rancid, REST/SOAP), and various equipment manufacturers including CISCO, Juniper, Arista, Brocade, EMC, HP/Aruba, etc."
    },
    {
      "duty": "Solves problems, makes key decisions, and represents the strategic vision and goals of the organization to various stakeholders and shareholders."
    }
  ],
  "skills": [
    {
      "skill": "Project and Service Delivery",
      "experience": 15
    },
    {
      "skill": "Design and Deployment services",
      "experience": 15
    },
    {
      "skill": "Scripting (Python, Ansible, PowerShell)",
      "experience": 15
    },
    {
      "skill": "SDN (ACI/NSX, Arista CloudVision)",
      "experience": 15
    },
    {
      "skill": "SDWAN",
      "experience": 15
    },
    {
      "skill": "Automation Skills – Expect, Rancid, REST/SOAP",
      "experience": 15
    },
    {
      "skill": "Agile environment",
      "experience": 15
    },
    {
      "skill": "Equipment manufacturers (CISCO, Juniper, Arista, Brocade, EMC, HP/Aruba, etc)",
      "experience": 15
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in engineering, computer science, MIS, related field and/or technical training. Advanced technical/business degree is a plus"
    }
  ]
}