{
  "meta": [
    {
      "job_title": "Analyst, Strategy & Portfolio Innovation - Built Environment",
      "job_category": "Strategy & Portfolio Innovation",
      "job_class": "Analyst",
      "sector": "Built Environment",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "MS Excel",
      "experience": 5
    },
    {
      "skill": "Strategic Thinking",
      "experience": 5
    },
    {
      "skill": "MS BI",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Intelligence Research",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate the organization's strategic plans to ensure successful growth and profitability of the Built Environment Customer Operating Unit."
    },
    {
      "duty": "Conduct environmental scans and perform financial analysis to support business and strategic planning."
    },
    {
      "duty": "Identify and evaluate acquisitions, divestitures, and organic business opportunities in line with long-range goals."
    },
    {
      "duty": "Monitor market intelligence, conduct market research, and manage knowledge related to the industry."
    },
    {
      "duty": "Support strategy, business development, and corporate initiatives, collaborating with business lines across Regional and Functional areas."
    },
    {
      "duty": "Prioritize and execute activities required to support strategies, priorities, and special initiative projects."
    },
    {
      "duty": "Compile and analyze financial information, develop revenue and expense analyses, and evaluate investment opportunities."
    },
    {
      "duty": "Conduct industry, market, competitive, and stakeholder intelligence research and analyses."
    },
    {
      "duty": "Work with leadership on the management of overall business strategy and long-range planning activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "University degree (Equivalent to a U.S. Bachelor’s degree) in Business Administration, Finance, Management, or related field plus generally 5 plus years of related experience. Master’s degree is a strong plus."
    }
  ]
}