{
  "meta": [
    {
      "job_title": "Analyst, Strategy & Portfolio Innovation",
      "job_category": "Strategy",
      "job_class": "Analyst",
      "sector": "Marketing",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "MS Excel",
      "experience": 5
    },
    {
      "skill": "Capital IQ",
      "experience": 5
    },
    {
      "skill": "OctoParse",
      "experience": 5
    },
    {
      "skill": "MS BI",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Strategic Thinking",
      "experience": 5
    },
    {
      "skill": "Business Strategy",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate the organization's strategic plans for the Built Environment Customer Operating Unit."
    },
    {
      "duty": "Conduct environmental scans and perform financial analysis to support business and strategic planning."
    },
    {
      "duty": "Identify and evaluate acquisitions, divestitures, and organic business opportunities aligned with long-range goals."
    },
    {
      "duty": "Monitor market intelligence, research, and knowledge management."
    },
    {
      "duty": "Support strategy, business development, and corporate initiatives by collaborating with business lines across Regional and Functional areas."
    },
    {
      "duty": "Assist in executing activities required to support strategies, priorities, and special initiative projects."
    },
    {
      "duty": "Evaluate investment opportunities for strategic and financial value and communicate recommendations to business leaders."
    },
    {
      "duty": "Compile and analyze financial information, and develop integrated revenue and expense analyses, projections, reports, and presentations."
    },
    {
      "duty": "Present findings on competitive environments and conduct industry, market, competitive, and stakeholder intelligence research and analyses."
    },
    {
      "duty": "Work with leadership on the management of overall business strategy and long-range planning activities."
    },
    {
      "duty": "Conduct industry, market, competitive, and stakeholder intelligence research and analyses."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "University degree in Business Administration, Finance, Management, or related field, plus 5+ years of related experience. Master’s degree is a strong plus."
    }
  ]
}