{
  "meta": [
    {
      "job_title": "Field Supervisor",
      "job_category": "Security",
      "job_class": "Supervisor",
      "sector": "Security",
      "salary": 40000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Site Supervision",
      "experience": 3
    },
    {
      "skill": "Security Operations",
      "experience": 5
    },
    {
      "skill": "Training and Coaching",
      "experience": 4
    },
    {
      "skill": "Emergency Response",
      "experience": 3
    },
    {
      "skill": "Report Writing",
      "experience": 4
    },
    {
      "skill": "Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform day and night site visits to inspect and supervise Security Professionals in the field."
    },
    {
      "duty": "Address escalation of after-hours and cold start calls to ensure sufficient coverage at customer sites."
    },
    {
      "duty": "Work with Operations Managers to coach, counsel, discipline, train, and manage relationships with Security Professionals."
    },
    {
      "duty": "Conduct on-the-job training of new employees assigned to post or when changes to post orders are made."
    },
    {
      "duty": "Respond to call-offs that occur during the shift and identify replacements."
    },
    {
      "duty": "Respond to client or site emergencies as they arise and ensure appropriate communication to Operations and Branch Manager."
    },
    {
      "duty": "In the event of an abandoned or open post, identify available qualified personnel to fill the post as quickly as possible."
    },
    {
      "duty": "Maintain all current BSIS licenses and ensure a working knowledge of all posts within the regional area of responsibility."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent. Some college education or business classes desirable."
    },
    {
      "credential": "Minimum 3-5 years of professional-level experience required, and prior experience in the security industry, law enforcement, and/or military highly desired."
    },
    {
      "credential": "Valid Driver’s License with at least one year of driving experience and a clean driving record. Ability to safely operate a vehicle required."
    },
    {
      "credential": "Energetic and focused personality with the ability to take initiative and manage deadlines."
    },
    {
      "credential": "Excellent attendance and punctuality. Ability to work in a very independent environment."
    },
    {
      "credential": "Ability to write effective and concise reports in neat, legible handwriting is required."
    },
    {
      "credential": "Working knowledge of Microsoft Office software."
    },
    {
      "credential": "Professional, articulate, and able to use good independent judgment and discretion."
    },
    {
      "credential": "Outstanding verbal and written communication skills. Ability to successfully interact at all levels of the organization, including with clients, while functioning as a team player."
    }
  ]
}