{
  "meta": [
    {
      "job_title": "Warehouse Worker",
      "job_category": "Warehouse",
      "job_class": "Worker",
      "sector": "Logistics",
      "salary": 46800,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Warehouse Equipment Operation",
      "experience": 2
    },
    {
      "skill": "Material Handling",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Safety Protocols",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Selecting products throughout the warehouse leveraging warehouse equipment that may include single or double electric pallet jacks, reach lifts or forklifts and other duties as assigned by site leadership."
    },
    {
      "duty": "Use of VoCollect, RF Scan-guns or reading manual tickets."
    },
    {
      "duty": "High-energy individual with a strong work ethic."
    },
    {
      "duty": "Self-motivated with the ability to work with limited supervision."
    },
    {
      "duty": "Independent decision maker as needed to accomplish tasks."
    },
    {
      "duty": "Flexible work schedule due to changing operational needs."
    },
    {
      "duty": "Ability to provide accurate entry of data and handle administrative tasks as assigned."
    },
    {
      "duty": "Sit or stand for periods in the office as well as the warehouse environment (concrete flooring and changing temperatures)."
    },
    {
      "duty": "Walking throughout the warehouse during shift."
    },
    {
      "duty": "Joining the travel team, seeing the country and learning how all our sites operate."
    },
    {
      "duty": "Embracing a high-performance culture by building strong relationships, challenging the status quo, working hard to deliver results, and paying it forward in communities."
    },
    {
      "duty": "Ensure compliance with safety procedures."
    },
    {
      "duty": "Assist in other areas of the warehouse as needed and perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent"
    }
  ]
}