{
  "meta": [
    {
      "job_title": "Social Media Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Social Media Management",
      "experience": 5
    },
    {
      "skill": "Content Creation",
      "experience": 5
    },
    {
      "skill": "Social Media Analytics",
      "experience": 5
    },
    {
      "skill": "Social Media Advertising",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Creative Campaign Design",
      "experience": 5
    },
    {
      "skill": "Marketing Calendar Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute strategies across all social media platforms to increase brand awareness, engagement, web traffic, and monetization."
    },
    {
      "duty": "Create and maintain the overall marketing calendar and objectives, including brand awareness, customer acquisition/member retention, and engagement/conversions."
    },
    {
      "duty": "Execute the day-to-day management and maintenance of all social media channels, including posting daily scheduled content and maintaining a relevant highlights section."
    },
    {
      "duty": "Storytell through compelling content both photography and videography - that drives high-value engagement from the audience and grows followers."
    },
    {
      "duty": "Conceptualize and produce social-first content (IG/Reels, IGS, TikTok, etc.) that accomplishes our objectives, encourages engagement, expands our reach, connects with our audience, and conveys our value."
    },
    {
      "duty": "Monitor social media conversations and trends related to our brand, industry, and competitors. Gather insights, analyze data, and provide actionable recommendations to improve our social media strategies and enhance customer engagement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Communication, or a related field (Master's preferred)"
    }
  ]
}