{
  "meta": [
    {
      "job_title": "Sales Lead",
      "job_category": "Sales",
      "job_class": "Lead",
      "sector": "Sales",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Retail Sales",
      "experience": 4
    },
    {
      "skill": "Recruitment",
      "experience": 4
    },
    {
      "skill": "Merchandising",
      "experience": 4
    },
    {
      "skill": "Training and Development",
      "experience": 4
    },
    {
      "skill": "Coaching",
      "experience": 4
    },
    {
      "skill": "Safety Procedures",
      "experience": 4
    },
    {
      "skill": "Loss Prevention",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and support the execution of brand standards and create a positive teammate experience."
    },
    {
      "duty": "Build and hire a strong team by observing in-store interviews and department tours."
    },
    {
      "duty": "Plan, organize, and control 30-days out with the guidance of Assistant Store Manager; including building an effective approach and aligning on necessary workforce to execute daily assignments, game plans, projects, or store events."
    },
    {
      "duty": "Strategically leverage teammates to ensure brand standards are met, programs and processes are executed daily, and tasks are delegated based on their priority level."
    },
    {
      "duty": "Assist the store leadership team with general supervision in the store in accordance with Company policies and procedures."
    },
    {
      "duty": "Assist with training teammates on company procedures and programs; this includes onboarding new teammates and cross-training current teammates."
    },
    {
      "duty": "Prioritize coaching and developing oneself and others; provides hands-on coaching and teaches the “why” behind tasks, plans, and processes."
    },
    {
      "duty": "Lead by example to support the vision of the organization and store by helping teammates understand how their responsibilities directly align to the common purpose, organizational goals, and delivering a hassle-free shopping experience."
    },
    {
      "duty": "Create an inclusive store environment where everyone (teammates & customers) feels welcome and safe and is treated with respect."
    },
    {
      "duty": "Adhere to established policies and procedures related to safety, loss prevention, and standard operating procedures."
    },
    {
      "duty": "Take an all-hands-on-deck approach to support the team across the store."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": []
}