{
  "meta": [
    {
      "job_title": "Procurement Specialist",
      "job_category": "Supply Chain",
      "job_class": "Specialist",
      "sector": "Logistics",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Learn and assist with all activities associated with sourcing and supply, including but not limited to raw material sourcing, raw material procurement to support the production plan, domestic and international logistics, CBP informed compliance, and department metrics."
    },
    {
      "duty": "Learn material purchasing strategy developed by department leadership team to meet department goals."
    },
    {
      "duty": "Prepare purchase orders based on production schedule, safety stock requirements, and inventory goals while minimizing freight and material spend."
    },
    {
      "duty": "Maintains system item purchasing attributes as directed by department leadership team."
    },
    {
      "duty": "Maintain procurement records such as items or services purchased, costs, delivery, product quality, performance, and inventories."
    },
    {
      "duty": "Maintain department strategy documentation by commodity."
    },
    {
      "duty": "Analyze freight spend for all raw material shipments."
    },
    {
      "duty": "Analyze economic order quantity based on freight spend, pricing tiers, inventory strategy, and carrying costs."
    },
    {
      "duty": "Maintain material additional cost database as directed by department leadership including freight, duties, and surcharges."
    },
    {
      "duty": "Learn all aspects of CBP informed compliance."
    },
    {
      "duty": "Assist department leadership transitioning compliance manual to electronic resource."
    },
    {
      "duty": "Assist department leadership maintaining informed compliance documentation."
    },
    {
      "duty": "Maintain HTS database."
    },
    {
      "duty": "Perform routine international shipment entry audits."
    }
  ],
  "skills": [
    {
      "skill": "Procurement",
      "experience": 2
    },
    {
      "skill": "Logistics",
      "experience": 2
    },
    {
      "skill": "Compliance",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Pursuing an undergraduate degree in Business, Organizational Management, Supply chain, or related field."
    }
  ]
}