{
  "meta": [
    {
      "job_title": "Travel Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify and nurture relationships with customers who are sure to love the experience."
    },
    {
      "duty": "Establish warm and positive relationships with the sales team so that we drive more upgrade business."
    },
    {
      "duty": "Think creatively as to motivating the sales team to make their warm lead calls and upgrade calls."
    },
    {
      "duty": "Build smart sales plans for your team to help them (and you) overachieve."
    },
    {
      "duty": "Be prepared to do business on the customer’s terms."
    },
    {
      "duty": "Be able to solve complex challenges through provocative thinking."
    },
    {
      "duty": "Always be interested in the success of your colleagues, and share proven strategies and tactics that help everyone win."
    },
    {
      "duty": "Help clear obstacles for your team and work to help solve problems creatively."
    },
    {
      "duty": "Establish and maintain excellent relationships across the rest of the business."
    },
    {
      "duty": "Be an enforcer of integrity in the way we conduct ourselves and live up to our brand values everyday."
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Motivational Skills",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Creative Problem Solving",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or equivalent combination of relevant sales experience.Minimum 5 years in travel or hospitality sales preferred.2 years travel industry sales management experienceAn in-depth knowledge of travel market and its sales strategies across a variety of segments.An appreciation for how paramount customer experiences are for us to be successful.A proven performance track record of sales results.An ability to think outside of industry norms.A passion to deliver on future results.Creativity and a desire to change things for the better.An energy that lights us up.A sense of unbridled optimism."
    }
  ]
}