{
  "meta": [
    {
      "job_title": "Executive Director of Medical Affairs",
      "job_category": "Medical",
      "job_class": "Director",
      "sector": "Management",
      "salary": 200000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Lead and participate in the creation and execution of medical strategies for scientific communications with key external stakeholders, such as KOLs, investigators, society leadership, etc."
    },
    {
      "duty": "Facilitate strategic alignment between and within the clinical and research AnaptysBio teams."
    },
    {
      "duty": "Provide strategic pull-through into various externally facing materials as external educational needs expand."
    },
    {
      "duty": "Assist with publication strategies, publications development, and publications process implementation."
    },
    {
      "duty": "Support KOL and investigator engagement strategies including collaborations with VP, Medical Affairs for leading Strategic Councils and advisory boards."
    },
    {
      "duty": "Drive development of externally facing materials for the scientific communities we work with in a variety of therapeutic areas, including but not limited to Dermatology and Rheumatology."
    },
    {
      "duty": "Support congress planning activities for ~20 conferences/year."
    },
    {
      "duty": "Attend prioritized congresses for meeting coverage and any subsequent KOL or investigator engagements."
    },
    {
      "duty": "Stay abreast of new developments in clinical paradigms, treatment guidelines, peer-reviewed publications and trends in therapeutic areas of focus."
    },
    {
      "duty": "Lead efforts to develop consistent and agreed upon language in scientific platforms and lexicons for each program and respective therapeutic areas."
    },
    {
      "duty": "Develop strong cross-functional relationships at AnaptysBio to ensure Medical Affairs strategies align with corporate objectives and specific team’s needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Advanced degree in life science field (e.g. PharmD, MD, PhD, etc.)"
    }
  ]
}