{
  "meta": [
    {
      "job_title": "Director of Engineering",
      "job_category": "Engineering",
      "job_class": "Director",
      "sector": "Engineering",
      "salary": 180000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage both product and process workflow within the Houston-based engineering team and interface with Korea-based engineering group."
    },
    {
      "duty": "Lead the management of technology readiness, specification, design, manufacturing, validation, product support, packaging, and repairs related to existing line of integrally geared centrifugal compressors for API and non-API customers."
    },
    {
      "duty": "Manage R&D activities related to enhancement of existing products and development of new products."
    },
    {
      "duty": "Establish rules & tools related to the selection and application of components and whole machines for applications targeted by company products."
    },
    {
      "duty": "Manage a growing engineering team with multiple focus points including product and packaging of existing product lines and development of new products, as well as after-market support."
    },
    {
      "duty": "Build an effective team that can transition the work of packaging company products from a Korean-centric to a USA-centric operation."
    },
    {
      "duty": "Manage and grow the company’s USA-based R&D capabilities in cooperation with Hanwha-Korea."
    },
    {
      "duty": "Support the after-market needs of the company’s existing installed fleet in North and South America."
    },
    {
      "duty": "Develop and maintain a set of design guidelines (rules & tools) to allow efficient product selection and application to relevant customer needs."
    },
    {
      "duty": "Prepare periodic reports as instructed and required for company management and obtain internal approvals as required."
    },
    {
      "duty": "Ability to manage multiple remote resources and coordinate activities across multiple offices, multiple internal organizations, and business partners. Ability to adapt to fast-paced, multi-faceted working environment and new businesses."
    },
    {
      "duty": "Work closely with the Executive team to develop and execute the company’s strategic plan and adjust as necessary to changes in the strategic plan. Author (or co-author) technical papers, white papers, presentation material and be willing to present on behalf of company."
    },
    {
      "duty": "Establish, monitor and assess individual goals and performance management objectives (MBO’s) for the engineering team in accordance with company policy. Complete job performance evaluations of all direct reports as well as developing and mentoring future leaders within the Engineering team. Strive for continual improvement of areas of responsibility. Organize the engineering department structure as necessary to maximize efficiency of all phases of the product/packaging design, R&D and implementation efforts. Compliance with legal and ethical requirements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science degree in Mechanical Engineering or other related engineering discipline."
    },
    {
      "credential": "Knowledge in project management and familiarity with Oil & Gas, Power, and/or Gas Processing markets is a plus."
    }
  ]
}