{
  "meta": [
    {
      "job_title": "HR Systems Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HCM System Maintenance",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish and maintain a project roadmap for technology enhancements, system updates, and new system implementations for the human resource (HR) division."
    },
    {
      "duty": "Provides leadership, direction, oversight, and support for all HR data and systems."
    },
    {
      "duty": "Establishes and manages the data governance component of the people systems."
    },
    {
      "duty": "Translates business objectives into system requirements to optimize HR business processes and workflow designs which in turn creates efficiencies for the employee/manager experience."
    },
    {
      "duty": "Manages the effective and efficient execution of department operations. Maintains data and analytics (HRIS) to include supporting system processes in all HR functional areas. Ensures compliance with all applicable laws, regulations, and governmental requirements."
    },
    {
      "duty": "Manages all support and maintenance requirements of systems or end users in areas of accountability. Ensures continuous improvement and compliance with policies, practices, and regulations."
    },
    {
      "duty": "Reviews requests, identify issues, reconcile discrepancies, research and analyze data and provide supporting documentation."
    },
    {
      "duty": "Manages employees through coaching, appraising, and motivating."
    },
    {
      "duty": "Interprets data specifications required; which may include working closely with information technology liaisons to update HR-related software, and create dashboards and interfaces."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Human Resources, Business, or Information Systems (Preferred)"
    }
  ]
}