{
  "meta": [
    {
      "job_title": "Physical Therapist Assistant",
      "job_category": "Healthcare",
      "job_class": "Therapist",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Instructs, motivates, safeguards, and assists patients as they practice exercises or functional activities. Observes patients during treatments to compile and evaluate data on their responses and progress and provides results to the physical therapist in person or through progress notes. Confers with physical therapy staff and others to discuss and evaluate patient information for planning, modifying, and coordinating treatment. Communicates with and instructs caregivers and family members on patient therapeutic activities and treatment plans. Transports patients to and from treatment areas, lifting and transferring them according to positioning requirements. Secures patients into or onto therapy equipment. Administers active and passive manual therapeutic exercises, therapeutic massage, aquatic physical therapy, and heat, light, sound, and electrical modality treatments such as ultrasound. Measures patients’ range-of-joint motion, body parts, and vital signs to determine effects of treatments or for patient evaluations. Monitors operation of equipment and records use of equipment and administration of treatment. Fits patients for orthopedic braces, prostheses, and supportive devices such as crutches. Conducts therapy practice within defined standards of care. Upholds professional and ethical standards. Communicates effectively with other professional and support staff to achieve positive patient outcomes. Practices facility and departmental policies and procedures, objectives, quality improvement program, safety, environmental, and infection control standards. Accurately documents on a timely basis. Enhances professional growth and development of self and others through participation in educational programs, in-service meetings, and workshops. Keeps up to date on professional literature. Maintains and applies accurate working knowledge of various funding sources and requirements to ensure reimbursement of services. Travel between facilities as needed to provide care to patients. Provide in-person or telehealth services as appropriate. Follow infection control policy and practices of MJ Care and assigned facility."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree from an accredited Physical Therapy Assistant school. Current state license and/or certification to provide physical therapist assistant services in good standing. Valid National Provider Identifier (NPI)."
    }
  ]
}