{
  "meta": [
    {
      "job_title": "Marine Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Renewables",
      "salary": 195000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Marine Operations",
      "experience": 5
    },
    {
      "skill": "Logistics Planning",
      "experience": 5
    },
    {
      "skill": "Offshore Windfarm Installation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Marine Coordination",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and execute marine operations with a focus on offshore logistics from site of manufacture to staging port or site of installation offshore US East Coast."
    },
    {
      "duty": "Ensure alignment and co-ordination across all planned marine operation activities working closely with schedulers, contractors and subject matter experts."
    },
    {
      "duty": "Establish policies and procedures related to marine co-ordination functions during the construction of an offshore windfarm and identify value improvement."
    },
    {
      "duty": "Work closely with European based marine team, and mostly Europe based marine contractors."
    },
    {
      "duty": "Be the SBMT port logistics representative in WTG staging activities."
    },
    {
      "duty": "Be involved in establishing and operating the Marine Coordination center, and coordination during execution of the Empire Wind installation operations."
    },
    {
      "duty": "Be the Marine liaison with USCG, MWS and other NYC harbor operations."
    },
    {
      "duty": "Lead a team of engineering specialists, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze offshore wind farm installation procedures and identify areas for improvement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's of Engineering (preferably in marine, civil, mechanical or other relevant engineering degree)"
    }
  ]
}