{
  "meta": [
    {
      "job_title": "Distribution Center Manager – Tier 2",
      "job_category": "Logistics",
      "job_class": "Manager",
      "sector": "Supply Chain",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Warehouse Management Systems (WMS)",
      "experience": 5
    },
    {
      "skill": "Transportation Management Systems (TMS)",
      "experience": 5
    },
    {
      "skill": "Enterprise Resource Planning (ERP) Systems",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Strategic Thinking",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure a safe work environment by leading safety programs, ensuring associate receive safety training and certifications, enforcing safety procedures, and addressing safety issues."
    },
    {
      "duty": "Create and implement technical, professional and leadership development plans for team leads and assistant managers. Ensure development plans are created and executed for associates."
    },
    {
      "duty": "Utilize effective coaching, teaching and training to develop successful team members."
    },
    {
      "duty": "Drive employee initiatives to create and promote an environment where team members are involved, empowered, and committed to the success of the Company."
    },
    {
      "duty": "Develop and execute strategies for recognition, engagement and teambuilding."
    },
    {
      "duty": "Design and implement staffing strategies to ensure work force is flexible and can respond to variations in work flow while meeting budgetary and operational targets."
    },
    {
      "duty": "Develop and maintain contingency plans for time sensitive operations (unscheduled absences, customer issues, systems malfunctions, inventory exceptions, equipment issues)."
    },
    {
      "duty": "Direct daily operations including workflow scheduling, monitoring of productivity and quality, process troubleshooting and all other activities required to ensure safety, inventory accuracy, on-time deliveries and exceptional customer satisfaction."
    },
    {
      "duty": "Plan, organize, and monitor the receiving, storage, assembly (if applicable) and distribution of all items received from vendors."
    },
    {
      "duty": "Ensure that inventory is accurate and organized at all times and maintain proper inventory levels."
    },
    {
      "duty": "Perform relocation, replenishment and consolidation of product as required."
    },
    {
      "duty": "Administer preventative maintenance cycles and fleet/equipment repair needs."
    },
    {
      "duty": "Develop recommendations to annual budget. Manage and administer distribution center budget."
    },
    {
      "duty": "Ensure all records and reports regarding distribution center activity are prepared on a timely basis and effectively maintained."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associates degree in Business, Logistics, or related field or commensurate experience. Bachelor’s degree preferred."
    }
  ]
}