{
  "meta": [
    {
      "job_title": "Engineering Project Manager",
      "job_category": "Engineering",
      "job_class": "Project Manager",
      "sector": "Technology",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Risk Management",
      "experience": 6
    },
    {
      "skill": "Medical Device Development",
      "experience": 7
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 6
    },
    {
      "skill": "ISO 13485",
      "experience": 6
    },
    {
      "skill": "PMP Certification",
      "experience": 6
    },
    {
      "skill": "MS Project",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads or leverages cross functional teams to evaluate, develop and manage projects for new product development and ongoing lifecycle management of products, processes and therapies."
    },
    {
      "duty": "Oversees and manages the operational aspects of ongoing projects and serves as liaison between project management and planning, project team, and line management."
    },
    {
      "duty": "Manages the development and implementation process of a company’s products and services involving departmental or cross-functional teams focused on the delivery of new or existing products and processes."
    },
    {
      "duty": "Reviews status of projects and budgets; manages schedules and prepares status reports."
    },
    {
      "duty": "Monitors the project from initiation through delivery. Assesses project issues and develops resolutions to meet productivity, quality, and client-satisfaction goals and objectives."
    },
    {
      "duty": "Develops mechanisms for monitoring project progress and for intervention and problem solving with project managers, line managers, and clients."
    },
    {
      "duty": "Gathers requirements, works on requirements planning, requirements elicitation and requirements management to ensure they meet demands of project’s key stakeholders."
    },
    {
      "duty": "Communicates with stakeholders, obtains stakeholder engagement to ensure the end products or processes will solve the business problems."
    },
    {
      "duty": "Creation of project plans and tracking of deliverables in a MS Project format."
    },
    {
      "duty": "Tracks and accounts for risks in the project schedule and works with the project team to build contingency in tasks where needed."
    },
    {
      "duty": "Able to use data to make informed recommendations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "PMP Certification or other formal Project Management training and experience"
    }
  ]
}