{
  "meta": [
    {
      "job_title": "Portfolio Management Associate",
      "job_category": "Finance",
      "job_class": "Associate",
      "sector": "Finance",
      "salary": 23,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Functions as the primary contact for customer concerns regarding situations that would occur after a loan is funded, such as collection issues, unsolicited marketing materials, invoice tracking, account executives, rates, etc."
    },
    {
      "duty": "Responsible for managing cases within their portfolio for daily returned payments; includes reaching out to customer to resolve the payment and provide instructions to accounting on how to reprocess the payment."
    },
    {
      "duty": "Responsible for monitoring and maintaining assigned accounts- customer calls, account adjustments, small balance write off, customer reconciliations and processing credit memos."
    },
    {
      "duty": "Reconcile customer disputes as they pertain to payment of outstanding balances that are due."
    },
    {
      "duty": "Accountable for reducing delinquency for assigned accounts, which entails a high volume of phone calls to customers."
    },
    {
      "duty": "Enlist the efforts of sales and senior management when necessary to accelerate the collection process."
    },
    {
      "duty": "Must communicate and follow up effectively with the Sales Department regarding customer accounts on a timely basis."
    },
    {
      "duty": "Prepare monthly delinquency notices."
    },
    {
      "duty": "Provide excellent and considerate customer service and internal and external customer interface."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Account Management",
      "experience": 2
    },
    {
      "skill": "Financial Analysis",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Microsoft Office",
      "experience": 2
    },
    {
      "skill": "Billing and Collections",
      "experience": 2
    },
    {
      "skill": "Critical Thinking",
      "experience": 2
    },
    {
      "skill": "Organization",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Finance or related field"
    }
  ]
}