{
  "meta": [
    {
      "job_title": "PACS System Manager",
      "job_category": "Healthcare IT",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Clinical System Implementation",
      "experience": 3
    },
    {
      "skill": "System Maintenance",
      "experience": 3
    },
    {
      "skill": "Documentation",
      "experience": 3
    },
    {
      "skill": "Training",
      "experience": 3
    },
    {
      "skill": "Radiology Information Systems",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plans, designs, and maintains Picture Archive and Computer Systems (PACS) or similar clinical image archiving and viewing solutions."
    },
    {
      "duty": "Implements and maintains PACS systems including image data maintenance, image archive and display."
    },
    {
      "duty": "Works with information technology to efficiently process data information."
    },
    {
      "duty": "Acts as a liaison between clinical staff, radiologists/cardiologists, and ordering physicians in system design."
    },
    {
      "duty": "Trains clinical staff and other users on system usage, acquisition, QC, display, and archival of electronic images."
    },
    {
      "duty": "Integrates PACS system to provide efficient image interpretation processes."
    },
    {
      "duty": "Performs other duties as requested by management."
    },
    {
      "duty": "Minimum three (3) years of experience in the clinical area."
    },
    {
      "duty": "Bachelor's degree in management information systems, health care management, radiological technology, or related field OR four (4) years of experience in a directly related field."
    },
    {
      "duty": "Demonstrated knowledge of radiology/cardiology information systems, word-processing, spreadsheet/graphics, and database applications."
    },
    {
      "duty": "Excellent communication skills, verbal and written, as well as the ability to vary communication according to the expertise of the user."
    },
    {
      "duty": "Demonstrated abilities in leadership, interpersonal, and organizational skills."
    },
    {
      "duty": "Additional system experience may be substituted for the clinical experience."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 120,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in management information systems, health care management, radiological technology, or related field (Master's preferred)"
    }
  ]
}