{
  "meta": [
    {
      "job_title": "MEP Coordinator",
      "job_category": "Construction",
      "job_class": "Coordinator",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinates and schedules installations performed by the mechanical, electrical/controls, HVAC, plumbing, and fire protection contractors."
    },
    {
      "duty": "Provides overall direction and control of the installation of all electrical, plumbing, mechanical, sheet metal, insulation, sprinkler systems, and life safety systems."
    },
    {
      "duty": "Evaluates the complexity of the mechanical/electrical design and estimates both the construction costs and maintenance."
    },
    {
      "duty": "Serves as a technical resource in meeting with owners and architects, discussing the mechanical/electrical systems within the building in technical terms."
    },
    {
      "duty": "Attends weekly meetings with owners, architects, and subcontractors and outlines work to be performed by the mechanical and electrical subcontractors."
    },
    {
      "duty": "Ensures that all mechanical/electrical shop drawings are submitted by the subs in a timely manner and examines all shop drawings for completeness."
    },
    {
      "duty": "Plans the daily and weekly activities for each craft within the construction schedule and provides detailed technical instructions for each foreman."
    },
    {
      "duty": "Inspects all field construction work in progress, including subcontracted work, and ensures that uniformly high-quality workmanship is maintained during each construction segment."
    },
    {
      "duty": "Resolves any technical problems encountered with the architect and inspects and coordinates the installation of all life safety systems, smoke evacuation systems, pressurized portions of the building, etc."
    },
    {
      "duty": "Reviews all change orders carefully to ensure that building code requirements are met and that cost estimates are reasonable and customary."
    },
    {
      "duty": "Refers recurring problems to the MEP Manager for resolution."
    },
    {
      "duty": "Performs detailed inspections of work in progress to ensure quality of installation, and to ensure adequacy of the system."
    },
    {
      "duty": "Plans the daily and weekly activities for each craft within the construction schedule and provides detailed technical instructions for each foreman."
    },
    {
      "duty": "Assists the Project Manager as necessary in estimating change orders and provides technical guidance and assistance in resolving day to day construction problems encountered."
    },
    {
      "duty": "Establishes contact early with city fire department inspectors and reviews all shop drawings and ensures their adequacy and completeness to meet local codes."
    },
    {
      "duty": "Inspects piping during installation and ensures that required insulation is placed correctly and reviews exposed pipe for heat tracing and freeze protection."
    },
    {
      "duty": "Inspects all work in progress for quality and completeness."
    }
  ],
  "skills": [
    {
      "skill": "Mechanical/Electrical Engineering Concepts",
      "experience": 5
    },
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Project Coordination",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Technical Resource",
      "experience": 5
    },
    {
      "skill": "Building Code Compliance",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in related field preferred but not required."
    }
  ]
}