{
  "meta": [
    {
      "job_title": "Patent Prosecution Legal Assistant",
      "job_category": "Legal",
      "job_class": "Assistant",
      "sector": "Legal",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform secretarial functions associated with firm administrative tasks, including processing new client/matter requests, client bills, time reports and expense reports."
    },
    {
      "duty": "Takes dictation and transcribes, composes correspondence for client-related matters."
    },
    {
      "duty": "Performs word processing of drafts, revisions and final documents for client-related matters, including correspondence, memoranda, bills, timesheets and project work, as needed."
    },
    {
      "duty": "Preparation of prosecution filings for review and approval by attorneys/agents (including preparation of IDSs, terminal disclaimers, restriction requirements, shell amendments, etc.)."
    },
    {
      "duty": "Handles filing of all Foreign/U.S. applications through PCT Easy/EFS Web and keeping up with upgrades relating to electronic filing systems."
    },
    {
      "duty": "Monitors client files and deadlines in PAIR and Pattsy Wave. Preparation and filing of assignment recordation on-line with the USPTO."
    },
    {
      "duty": "Calculates filing cost estimates. Copies, distributes, sends (electronically and/or via mail, courier or express service), files and otherwise handles completed work."
    },
    {
      "duty": "Coordinates travel arrangements."
    },
    {
      "duty": "Maintains physical and electronic files, contacts, and maintains dockets of cases for attorney. Coordinates meetings and appointments, and properly receives clients/guests, as requested; keeps appointment calendar for attorney (including hearings, court appearances and other commitments)."
    }
  ],
  "skills": [
    {
      "skill": "Patent Prosecution",
      "experience": 5
    },
    {
      "skill": "US Patent and Trademark rules",
      "experience": 5
    },
    {
      "skill": "Microsoft Office (Word, Excel, Outlook)",
      "experience": 5
    },
    {
      "skill": "PCT Easy/EFS Web",
      "experience": 5
    },
    {
      "skill": "Conflict Checking",
      "experience": 5
    },
    {
      "skill": "Electronic Filing Systems",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Legal Studies, Paralegal, or a related field (Certification in Patent Prosecution preferred)"
    }
  ]
}