{
  "meta": [
    {
      "job_title": "Principal Enterprise Architect - Data Platforms",
      "job_category": "Technology",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 180000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Platform Architecture",
      "experience": 8
    },
    {
      "skill": "Cloud Data Platforms",
      "experience": 8
    },
    {
      "skill": "ETL and BI Tools",
      "experience": 8
    },
    {
      "skill": "Integration Standards",
      "experience": 8
    },
    {
      "skill": "SOA Integration",
      "experience": 8
    },
    {
      "skill": "Data Analysis",
      "experience": 8
    },
    {
      "skill": "Technical Leadership",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and develop the Enterprise Data Program by working with IT leadership in implementing modern data platform strategy, methodologies, programs, processes, standards, organizational structure, metrics, and data structures."
    },
    {
      "duty": "Collaborate with senior IT leadership and senior business to drive and deliver strategic data programs across the organization."
    },
    {
      "duty": "Define and implement data and analytic strategies and roadmaps, driving and enabling data capabilities."
    },
    {
      "duty": "Identify new data platforms and technologies to deliver the enterprise data needs."
    },
    {
      "duty": "Oversee the delivery of conceptual end-to-end platform artifacts and facilitate programs for Data Platform Governance, Data Quality, Data Security, and Data Platform usage standards and patterns."
    },
    {
      "duty": "Ensure alignment of enterprise data platform architecture with business and technology strategy needs and roadmaps by communicating to business and technology partners."
    },
    {
      "duty": "Define and establish a technical strategy, standards, and guidelines in the data platform architecture domain in collaboration with other architects and mentor technical leaders on modern data architecture practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 125
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS degree in Information Technology, Computer Science, or a related field of study and a minimum of 8 years of experience in architecture/design in relevant technology disciplines; or any combination of education and experience."
    }
  ]
}