{
  "meta": [
    {
      "job_title": "Senior Construction Accountant",
      "job_category": "Accounting",
      "job_class": "Senior",
      "sector": "Construction",
      "salary": 100000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for maintaining financial records and ensuring that financial transactions are properly recorded."
    },
    {
      "duty": "Verifies the accuracy of entries to ledger accounts and reconciles subsidiary ledger accounts to the general ledger."
    },
    {
      "duty": "Prepares complex balance sheets, profit and loss statements, and other financial reports."
    },
    {
      "duty": "Analyzes current costs, revenues, financial commitments, and obligations incurred to predict future revenues and expenses."
    },
    {
      "duty": "Ensures accurate and timely reporting of all financial data in accordance with GAAP."
    },
    {
      "duty": "Monitors revenue and expenses while coordinating collection, consolidation, and review of all financial data."
    },
    {
      "duty": "Verifies the accuracy of all job costs as well as reconciling all subsidiary ledgers to the general ledger."
    },
    {
      "duty": "Prepares monthly and annual reports on expenditures and implements corrective actions when necessary."
    },
    {
      "duty": "Prepares monthly Work in Progress Schedules."
    },
    {
      "duty": "Develops and maintains systems of control for accounting transactions."
    },
    {
      "duty": "Creates, audits, and maintains effective chart of accounts and ensures costs are coded accurately."
    },
    {
      "duty": "Performs monthly closing of all assigned accounts ensuring detailed and accurate reconciliations are documented and filed for all balance sheet and income statement accounts."
    },
    {
      "duty": "Manages expense allocations from various departments and ensures accurate account coding."
    },
    {
      "duty": "Obtains and maintains a thorough understanding of the financial reporting and general ledger structure."
    },
    {
      "duty": "Manages all aspects of financial and accounting systems and processes including compliance, A/P, A/R and revenue accounting, payroll, fixed assets and general ledger functions, and internal financial reporting."
    },
    {
      "duty": "Supports audit requirements including internal, external, and compliance audits."
    },
    {
      "duty": "Assists with special projects as requested by Controller and CFO."
    },
    {
      "duty": "Assists the accounting department and outside vendors to ensure financial accuracy, cost control, and reporting."
    },
    {
      "duty": "Preserves confidentiality of sensitive information."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree with an emphasis in Accounting."
    }
  ]
}