{
  "meta": [
    {
      "job_title": "IT Support Specialist",
      "job_category": "Information Technology",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Delivering tier 1-3 support services to the Miami and Latam Region, and being the primary point of contact for the Latam HQ office."
    },
    {
      "duty": "Offering a diverse range of services including Cybersecurity, Risk Management, Project Coordination, Technical Advisory, Mediation, and Training."
    },
    {
      "duty": "Providing primary support for the Latam HQ personnel and handling IT-related incidents and service requests."
    },
    {
      "duty": "Managing services such as facilities, security & access control, HR support, technical support, asset management, VoIP (telephony), inventory, purchase requisitions for the IT department, training, general and network infrastructure."
    },
    {
      "duty": "Handling network infrastructure administration (CISCO Meraki Routing, Switching, and firewall) as well as security administration for network infrastructure."
    },
    {
      "duty": "Coordinating cybersecurity incidents, notifications, and daily incidents and security reports."
    },
    {
      "duty": "Administering domain and Active Directory, phone system, mediation between group companies, and server administration support and consulting."
    },
    {
      "duty": "Acting as the main contact in LATAM for the installation and support of engineering applications and participating in core IT solutions meetings."
    },
    {
      "duty": "Evaluating and making recommendations regarding IT purchases and solutions, providing project management and coordination, and serving as an escalation point for business IT-related problems or inquiries."
    },
    {
      "duty": "Constantly participating in the core IT solutions meetings that provide solutions and direction for the company."
    }
  ],
  "skills": [
    {
      "skill": "IT Support",
      "experience": 4
    },
    {
      "skill": "Network and Telecom Systems",
      "experience": 3
    },
    {
      "skill": "Scripting",
      "experience": 1
    },
    {
      "skill": "MS Windows Client/Desktop Systems",
      "experience": 3
    },
    {
      "skill": "Server Administration",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Cisco Routing, Switching, and Security",
      "experience": 3
    },
    {
      "skill": "ITIL V3 or V4",
      "experience": 3
    },
    {
      "skill": "IT Purchases and Solutions Evaluation",
      "experience": 4
    },
    {
      "skill": "Customer Support",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 2
    },
    {
      "skill": "System Administration",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Information Technology, Computer Science, or a related field. Industry applicable certifications are a plus."
    }
  ]
}