{
  "meta": [
    {
      "job_title": "Financial Controller",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Reporting",
      "experience": 8
    },
    {
      "skill": "Metrics and KPI Analysis",
      "experience": 8
    },
    {
      "skill": "Internal Controls",
      "experience": 8
    },
    {
      "skill": "SOX Compliance",
      "experience": 8
    },
    {
      "skill": "Process Improvement",
      "experience": 8
    },
    {
      "skill": "Financial Analysis",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Head the company's revenue accounting group, focusing on a precise, punctual, and anticipatable close process and cycle operations."
    },
    {
      "duty": "Institute a recurring analysis process for assessing AR aging, collection patterns, and the reserve for implicit price concessions."
    },
    {
      "duty": "Establish a regular process for evaluating KPIs in the revenue cycle. Generate an executive-level dashboard displaying metrics such as month-to-month accrual comparisons, actuals vs. estimates, revenue per hour trends, and gross margin percentages."
    },
    {
      "duty": "Oversee the monthly reconciliation of all cash and significant accounts receivable GL accounts, ensuring timely and consistent completion."
    },
    {
      "duty": "Collaborate with the Chief Accounting Officer and Corporate Controller to implement and execute internal controls over financial reporting."
    },
    {
      "duty": "Execute controls and support inquiries from external auditors, facilitating a smooth audit process."
    },
    {
      "duty": "Proactively communicate risks, opportunities, challenges, and regular progress updates to accounting group management."
    },
    {
      "duty": "Actively engage in cross-functional company-wide projects and process improvement initiatives."
    },
    {
      "duty": "Utilize experience in implementing best practices to elevate the overall effectiveness and efficiency of the accounting function."
    },
    {
      "duty": "Provide financial and operational support for the company's strategic initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting; CPA license or MBA highly preferred"
    }
  ]
}