{
  "meta": [
    {
      "job_title": "Product Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "The Project Manager is responsible for managing the life cycle and organization of the product from start to finish including identifying potential products and adaptations."
    },
    {
      "duty": "Create business models and analyze competitive landscape."
    },
    {
      "duty": "Develop and monitor data-driven analytics."
    },
    {
      "duty": "Mentor employees to help them achieve individual & team objectives."
    },
    {
      "duty": "Define the product strategy and roadmap."
    },
    {
      "duty": "Lead the entire product lifecycle, from conception to launch, and manage ongoing product enhancements and updates."
    },
    {
      "duty": "Conduct market research and competitive analysis to identify market demands, trends, and gaps ensuring our product offerings meet customer needs."
    },
    {
      "duty": "Define product requirements, create detailed product roadmaps, and prioritize development efforts based on business objectives and customer feedback."
    },
    {
      "duty": "Collaborate with cross-functional teams, including engineering, design, and marketing, to deliver high-quality products on time and within budget."
    },
    {
      "duty": "Monitor key product metrics and performance indicators, analyze data, and make data-driven recommendations for product improvements."
    },
    {
      "duty": "Build and maintain strong relationships with OEM / Special Order customers, understanding their needs and ensuring their satisfaction."
    },
    {
      "duty": "Act as the primary point of contact for key accounts, addressing any concerns or issues, and providing proactive support."
    },
    {
      "duty": "Collaborate closely with sales and customer success teams to identify opportunities for growth and expansion within accounts."
    },
    {
      "duty": "Required to be or become proficient in company ERP, Reporting, and other computer-specific applications."
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree in related field and/or 2-5 years of business experience. Required to be or become proficient in company ERP, Reporting, and other computer-specific applications. Strong written, verbal, and collaboration skills."
    }
  ]
}