{
  "meta": [
    {
      "job_title": "Project Manager Internal 3",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership Skills",
      "experience": 5
    },
    {
      "skill": "Engineering Knowledge",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Decision Making",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the Project Manager External in clarifying customer requirements and specifications, during the request for proposal (RFP) and proposal."
    },
    {
      "duty": "Design and develop technical specification, and timeline, milestones and budget needed in the project."
    },
    {
      "duty": "Coordinate resources and monitor and report progress and milestones regularly to all stakeholders."
    },
    {
      "duty": "Negotiate or contribute to negotiations with suppliers and vendors."
    },
    {
      "duty": "Responsible for meeting all project milestones and technical objectives."
    },
    {
      "duty": "Monitor the budget adherence and may take actions to minimize non-conformance costs."
    },
    {
      "duty": "Check project results, design respective test procedures and monitor test results."
    },
    {
      "duty": "Ensure proper documentation of project results, and of all products or technologies delivered."
    },
    {
      "duty": "Adhere to PM standards defined, and manage and coordinate all temporarily assigned project staff."
    },
    {
      "duty": "Facilitate the execution of project/program solution plan for complex projects or programs."
    },
    {
      "duty": "Responsible for delivery of complex project/program plans."
    },
    {
      "duty": "Support the project/program management role (definition of schedule, budget, risk, change, opportunity and resource allocation management) for complex projects or programs."
    },
    {
      "duty": "Act as a functional or business process resource on projects or programs."
    },
    {
      "duty": "Facilitate execution of continuous improvement plan."
    },
    {
      "duty": "Perform an active role in maintaining client relationships and sales opportunities."
    },
    {
      "duty": "Maintain client relationships and sales opportunities."
    },
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote freight and logistics services."
    },
    {
      "duty": "Lead a team of marketing specialists, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's online presence, optimizing the website and social media channels for maximum engagement and conversions."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Engineering degree, preferably in Mechanical/Production engineering"
    }
  ]
}