{
  "meta": [
    {
      "job_title": "Support Specialist, Customer Service",
      "job_category": "Customer Service",
      "job_class": "Specialist",
      "sector": "Customer Support",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Verbal Communication",
      "experience": 3
    },
    {
      "skill": "Written Communication",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Multitasking",
      "experience": 3
    },
    {
      "skill": "PC Literacy",
      "experience": 3
    },
    {
      "skill": "Bilingual Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide friendly, engaging experiences through verbal and written communication for every customer interaction, aiming for first contact resolution."
    },
    {
      "duty": "Maintain availability in phone and web queues as required to meet service standards."
    },
    {
      "duty": "Multi-task between customer contact channels to address inquiries, concerns, or issues, ensuring responsiveness meets customer and performance goals."
    },
    {
      "duty": "Research and resolve complex customer situations."
    },
    {
      "duty": "Enter summary notes into the CRM system and forward relevant information to the appropriate personnel for resolution."
    },
    {
      "duty": "Verify and update customer records for accuracy."
    },
    {
      "duty": "Engage and educate customers about programs, promotions, and specific offerings."
    },
    {
      "duty": "Track forwarded customer inquiries to ensure timely resolution."
    },
    {
      "duty": "Assist customers with web portals and online shopping."
    },
    {
      "duty": "Escalate customer issues to higher-level support staff when necessary."
    },
    {
      "duty": "Conduct follow-up calls to rate the quality of issue resolution."
    },
    {
      "duty": "Collaborate with personnel to answer inquiries, resolve issues, or address service-related concerns."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or GED.1 year of experience in a technical customer service contact center is highly preferred."
    }
  ]
}