{
  "meta": [
    {
      "job_title": "Technical Lead",
      "job_category": "Software Engineering",
      "job_class": "Lead",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Software Development",
      "experience": 10
    },
    {
      "skill": "System Integration",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Business Product Analysis",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Agile Development",
      "experience": 7
    },
    {
      "skill": "Unit Testing",
      "experience": 7
    },
    {
      "skill": "Mentoring",
      "experience": 7
    },
    {
      "skill": "UX/UI Standards",
      "experience": 7
    },
    {
      "skill": "Security Controls",
      "experience": 7
    },
    {
      "skill": "Monitoring Capabilities",
      "experience": 7
    },
    {
      "skill": "Automated Testing",
      "experience": 7
    },
    {
      "skill": "Agile Methodologies",
      "experience": 7
    },
    {
      "skill": "Knowledge Transfer",
      "experience": 7
    },
    {
      "skill": "Code Development",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team and actively deliver technically complex solutions."
    },
    {
      "duty": "Perform system integration support for all project work that aligns with architectural standards."
    },
    {
      "duty": "Partner with business product owners to understand the end goal and offer solutions and recommendations during the design."
    },
    {
      "duty": "Develop customized coding, software integration, perform analysis, and configure solutions using tools specific to the project or the area, and able to adhere to corporate UX/UI standards."
    },
    {
      "duty": "Lead and participate in the development, testing, implementation, maintenance, and support of highly complex solutions in adherence to company standards."
    },
    {
      "duty": "Build non-functional monitoring capabilities and provide escalated support for highly complex applications in production."
    },
    {
      "duty": "Build and maintain security controls and monitoring in support of company standards."
    },
    {
      "duty": "Lead complex projects and participate in larger, more complex initiatives."
    },
    {
      "duty": "Solve complex technical and operational problems. Mentor and coach teammates with less experience."
    },
    {
      "duty": "Direct and oversee the work of a small team while contributing individually."
    },
    {
      "duty": "In an Agile environment: Responsible for delivering high-quality working software and automating manual/reusable tasks working directly, and engage with, the business from the beginning of the design work. Actively participate in refining user stories. Responsible for designing, developing, and maintaining automated unit testing, and supporting integration and functional testing. Responsible for providing automated monitoring capabilities, providing warranty support, and providing knowledge transfer to production support. Develop code in accordance with the acceptance criteria established by the Product Owner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree and six to ten years of experience or equivalent education and software engineering training or experience. Master’s degree preferred."
    }
  ]
}