{
  "meta": [
    {
      "job_title": "Manager, Data, and Reporting",
      "job_category": "Data",
      "job_class": "Manager",
      "sector": "Analysis",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "MS-SQL Database",
      "experience": 6
    },
    {
      "skill": "Cognos Analytics",
      "experience": 4
    },
    {
      "skill": "Tableau Desktop",
      "experience": 4
    },
    {
      "skill": "SQL Server Integration Services",
      "experience": 4
    },
    {
      "skill": "JIRA",
      "experience": 3
    },
    {
      "skill": "Analytical Data Modeling",
      "experience": 4
    },
    {
      "skill": "SQL Management Studio",
      "experience": 4
    },
    {
      "skill": "Data Management",
      "experience": 6
    },
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Database Platform Tools",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the integration of data from various internal and external sources into the data warehouse model."
    },
    {
      "duty": "Oversee the day-to-day operations of the Data team of ETL/Report developers."
    },
    {
      "duty": "Assist in designing, developing, and implementing critical business intelligence initiatives and projects."
    },
    {
      "duty": "Define changes to the warehouse model and enhance processes to populate or modify warehouse data."
    },
    {
      "duty": "Architect reporting solutions on multiple projects and initiatives."
    },
    {
      "duty": "Strategically work with departments to discover KPI or data reporting needs."
    },
    {
      "duty": "Update existing BI reports and create new key performance metrics specific to drive business decisions."
    },
    {
      "duty": "Plan, diagram, and map all existing and new data connections for upcoming business intelligence engagements."
    },
    {
      "duty": "Prioritize analysis requests to balance the tactical and strategic information needs of the business."
    },
    {
      "duty": "Monitor oversight and optimize data pipelines and refreshes."
    },
    {
      "duty": "Manage and organize the Cognos development framework according to industry best practices."
    },
    {
      "duty": "Manage common administrative tasks in JIRA and liaise with Project Management staff."
    },
    {
      "duty": "Mentor and train on Cognos report development to accelerate and enhance analytic reports."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in computer science, Information Technology, Software Applications, or related field (Master's preferred)"
    }
  ]
}