{
  "meta": [
    {
      "job_title": "Plant Manager",
      "job_category": "Production",
      "job_class": "Manager",
      "sector": "Manufacturing",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct, and coordinate activities concerned with production of company product(s)."
    },
    {
      "duty": "Plan and direct production activities and establish production priorities for products in keeping with effective operations and cost factors."
    },
    {
      "duty": "Interact with State, County, and independent inspection personnel."
    },
    {
      "duty": "Maintain clear and precise records according to internal program."
    },
    {
      "duty": "Pre-pour and post-pour inspection of precast concrete products to assure products conform to specifications."
    },
    {
      "duty": "Testing of concrete to assure concrete meets project specifications."
    },
    {
      "duty": "Perform moisture test and sieve analysis."
    },
    {
      "duty": "Spread test / Slump."
    },
    {
      "duty": "Coordinate production activities with procurement, maintenance, and quality control activities to obtain optimum production and utilization of human resources, machines, and equipment."
    },
    {
      "duty": "Reviews and analyzes production, quality control, maintenance, and operational reports to determine causes of nonconformity with product specifications, and operation or production problems."
    },
    {
      "duty": "Compile, store, and retrieve equipment checklist."
    },
    {
      "duty": "Innovation, testing, and development of new products."
    },
    {
      "duty": "On-going teaching, training, and development of personnel."
    },
    {
      "duty": "Conduct safety and production meetings."
    },
    {
      "duty": "Order sufficient raw materials to meet anticipated demands."
    },
    {
      "duty": "Maintain property inventory control procedures over materials to minimize shrinkage and waste."
    },
    {
      "duty": "Inform owner on a timely basis of any plant activity, issues, or concerns that might impact customer service."
    },
    {
      "duty": "Communicate daily with corporate office and personnel in a polite and cordial manner."
    },
    {
      "duty": "Set and keep the pace for timeliness of work being done."
    },
    {
      "duty": "Confer with management personnel to establish production and quality control standards, manage budget and cost controls, and to obtain data regarding types, quantities, specifications, and delivery dates of products ordered."
    },
    {
      "duty": "Maintain a clean and safe work area."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Production Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Innovation Management",
      "experience": 5
    },
    {
      "skill": "Procurement Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or General Education Degree (GED) is required."
    },
    {
      "credential": "ACI Concrete field testing - Grade 1."
    },
    {
      "credential": "Must be able to create and understand shop drawings."
    },
    {
      "credential": "Bachelor's degree in Engineering or a related field (Master's preferred)"
    }
  ]
}