{
  "meta": [
    {
      "job_title": "Technical Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Aerospace",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 10
    },
    {
      "skill": "Customer Engagement",
      "experience": 10
    },
    {
      "skill": "Profitability Management",
      "experience": 10
    },
    {
      "skill": "Negotiation",
      "experience": 10
    },
    {
      "skill": "Fleet Intelligence",
      "experience": 10
    },
    {
      "skill": "Microsoft Software",
      "experience": 10
    },
    {
      "skill": "Contract Negotiation",
      "experience": 10
    },
    {
      "skill": "Business Analysis",
      "experience": 10
    },
    {
      "skill": "Customer Service",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maximize the value of all product lines by engaging with Customers to capture orders, improving profitability, reducing inventory, and enhancing the customer experience."
    },
    {
      "duty": "Create and lead sales campaigns, expand customer knowledge, and effectively extend the usable lifetime of the product lines."
    },
    {
      "duty": "Increase organic sales; Educate customers/DOD/ Government agencies regarding product portfolio; Negotiate proposals; Collate In-Service Fleet Intelligence."
    },
    {
      "duty": "Prepare and manage daily customer quotations and orders; Ensure on-time Order Deliveries."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree Required; Minimum of 10 years of experience in the Aerospace Industry; Extensive Knowledge of the Aerospace Industry; Preferred U.S DoD Service background; Knowledge and experience negotiating commercial contracts; Experience with government FAR/DFARS; Ability to write reports, proposals, business correspondence, and procedure manuals; Ability to read, analyze, and interpret general business periodicals, professional journals, technical procedures, or governmental regulations related to the Aerospace Industry; Proficient in Windows, Microsoft Software (Word, Excel, PowerPoint), CRM Dynamics, MS Teams, etc.; Must be able to independently work and travel within a region or internationally; Broad commercial and business awareness, including the ability to understand cost benefit analysis and long term reduced total cost."
    }
  ]
}