{
  "meta": [
    {
      "job_title": "Business Development Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identifying revenue opportunities within the prospect base through various inbound and outbound marketing programs and other activities."
    },
    {
      "duty": "Researching prospective customers, identifying key players, and generating interest to expand the list of sales qualified leads."
    },
    {
      "duty": "Effectively presenting Impetus Product suite and Services to C-level and senior executive clients."
    },
    {
      "duty": "Working closely with sales, account management and business development teams to support achievement of territory’s quota objectives."
    },
    {
      "duty": "Finding upsell opportunities within existing Impetus prospects and customers."
    },
    {
      "duty": "Identifies and helps to develop strategic relationships with technology partners."
    },
    {
      "duty": "Keeping management informed of all activity, including timely preparation of reports using appropriate tools and reporting mechanisms, used inside the company to track interactions with prospects and customers."
    },
    {
      "duty": "Occasional travel might be needed for trade shows and/or customer/prospect visits."
    },
    {
      "duty": "Collaborating with our organization in India, as and when required to achieve your goals."
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Lead Generation",
      "experience": 5
    },
    {
      "skill": "Client Presentation",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Strategic Relationship Development",
      "experience": 5
    },
    {
      "skill": "Business Reporting",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Cross-Cultural Collaboration",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Management, or a related field (Master's preferred)"
    }
  ]
}