{
  "meta": [
    {
      "job_title": "Controls Installation Technician",
      "job_category": "HVAC/Installation",
      "job_class": "Technician",
      "sector": "HVAC",
      "salary": 56000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the installation of building automation systems."
    },
    {
      "duty": "Use a variety of hand tools, interpreting control drawings, plans, and specifications to install temperature control systems including conduit, enclosures, wiring and end devices."
    },
    {
      "duty": "Prepares for on-site installation by examining building layout, anticipating difficulties, gathering materials and coordinating on-site work, and coordinating with other trades as necessary."
    },
    {
      "duty": "Documents work by completing paperwork on each job, including daily time, progress, and duration; and maintaining files."
    },
    {
      "duty": "Represents the company by serving as the direct customer contact and is responsible for servicing products and equipment on assigned projects, ensuring customer satisfaction by identifying, analyzing, diagnosing and repairing equipment and systems at customer’s location."
    },
    {
      "duty": "Inspects vehicles by checking vehicle condition and literature supplies."
    },
    {
      "duty": "Maintains tools and equipment by inspecting for signs of wear. Continually enforces safety to the highest standards and maintains security and accountability of company issued and procured assets by recording use, wear and conditions."
    },
    {
      "duty": "Regular travel requirements with occasional overnight stays. Display team effort and dedication to customer by maintaining flexibility to work overtime and weeks as the business requires, including occasional overnight stays."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 20,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent required, and typically at least 2-5 years of experience in HVAC/Controls. Technical School or formal training is preferred."
    },
    {
      "credential": "Operating knowledge of Microsoft office software and working proficiency with handheld computer (i.e. Smartphone, iPad). Knowledge of low voltage electricity, electronics (board level troubleshooting), direct digital controls, and building control techniques."
    },
    {
      "credential": "Current or future participation in ABC electrical apprenticeship program is desired."
    },
    {
      "credential": "Must possess a valid driver’s license for a minimum of 12 months, with no major or frequent traffic violations including, but not limited to: DUI, Hit & Run, License Suspension, Reckless / Careless Driving or multiple smaller infractions or preventable collisions in the previous 3 years."
    },
    {
      "credential": "Previous experience with DDC controls system preferred."
    },
    {
      "credential": "Must be able to safely and legally operate a vehicle using a seat belt Must be able to wear helmets, safety goggles, fall protection harness and safety boots to safely perform job duties"
    }
  ]
}