{
  "meta": [
    {
      "job_title": "Sr. Manager, Learning Operations",
      "job_category": "Learning & Development",
      "job_class": "Manager",
      "sector": "Learning & Development",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Operational Excellence",
      "experience": 7
    },
    {
      "skill": "Logistics Management",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Communication Management",
      "experience": 7
    },
    {
      "skill": "Problem Solving",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Process Improvement",
      "experience": 7
    },
    {
      "skill": "Vendor Management",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and manage operational processes, policies, and infrastructure for learning solutions."
    },
    {
      "duty": "Drive continuous improvement of learning operations in collaboration with peers."
    },
    {
      "duty": "Refine current procedures to maximize efficiency of how learning programs are scheduled, delivered, tracked, and measured."
    },
    {
      "duty": "Manage user adoption efforts for the online learning subscriptions and learning management system (CSOD)."
    },
    {
      "duty": "Manage complex scheduling systems and processes."
    },
    {
      "duty": "Manage vendor onboarding, contract renewals, payment scheduling, and Talent Management budgetingprocess."
    },
    {
      "duty": "Identify and track relevant metrics and dashboards to evaluate effectiveness and efficiencies of learning operations."
    },
    {
      "duty": "Develop and oversee communication plan and strategy to market classes, engage targeted audiences, and increase attendance."
    },
    {
      "duty": "Manage day-to-day operations of vendor teams executing services."
    },
    {
      "duty": "Provide support to team members for course registrations, cancellations, and general questions regarding learning at WestRock."
    },
    {
      "duty": "Create campaigns and strategies to drive usage of WRK LEARN and solutions contained within."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred or an equivalent combination of education and experience."
    },
    {
      "credential": "Experience with Cornerstone on Demand learning management system a plus."
    },
    {
      "credential": "Experience with Smartsheet work management platform a plus."
    }
  ]
}