{
  "meta": [
    {
      "job_title": "Global Partner Programs Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 190000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Partner Program Management",
      "experience": 10
    },
    {
      "skill": "Channel Incentive Programs",
      "experience": 10
    },
    {
      "skill": "Cross-Functional Collaboration",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Public Cloud Ecosystem",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and implement partner programs globally to recruit, onboard, and enable partners to drive incremental revenue for partners and Datadog."
    },
    {
      "duty": "Develop partner programs communications and content strategy in conjunction with marketing, partners solution architect, and enablement teams to enhance the overall partner experience."
    },
    {
      "duty": "Communicate partner programs strategy, value proposition, and operations externally to partners, customers, analysts, and internally to field teams."
    },
    {
      "duty": "Manage and evolve DPN partner agreements and contracting processes, working in close coordination with Datadog legal, Deal Desk, and Sales Operations teams."
    },
    {
      "duty": "Work closely with systems and marketing operations teams to ensure the DPN Partner Portal provides partners an easy to use and engaging platform to manage their Datadog practice."
    },
    {
      "duty": "Own partner program metrics and reporting to key internal stakeholders, working in collaboration with GTM Strategy and Operations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Marketing, or a related field (Master's preferred)"
    }
  ]
}