{
  "meta": [
    {
      "job_title": "Registered Client Service Associate",
      "job_category": "Client Service",
      "job_class": "Associate",
      "sector": "Financial Services",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Cultivate and enhance new and existing client relationships through active communication with clients, processing client requests, resolving inquiries, providing guidance and making sure key information and documentation remains current."
    },
    {
      "duty": "Identify and assist with Firm services and solutions that support clients' needs including banking products and services and secure, and digital offerings."
    },
    {
      "duty": "Confirm authorization and authenticate client when processing requests."
    },
    {
      "duty": "Onboard and maintain client accounts, including collecting client information and required documentation, capturing and assessing risk, processing money movement transactions and handling estate needs as examples."
    },
    {
      "duty": "Input orders at the direction of clients and/or Financial Advisor(s), discuss reinvestment options and corporate actions with clients at the direction of Financial Advisors."
    },
    {
      "duty": "Prepare financial plans, client reports, and other materials for client meetings."
    },
    {
      "duty": "Review and take appropriate action on client account alerts."
    },
    {
      "duty": "Partner with Financial Advisor(s) in developing a business plan and delivering against a client service model."
    },
    {
      "duty": "Support the team's marketing strategy by maintaining marketing materials, including digital and social media platforms, and planning client events and seminars."
    },
    {
      "duty": "Actively engage in available training and education programs – including firm strategic priorities, professional development and staying current on policies, procedures and new platforms and attend scheduled targeted/monthly field service professional and/or training calls."
    },
    {
      "duty": "Perform administrative duties that support Financial Advisors in daily business practices, including but not limited to, telephone coverage, business travel arrangements, coordination of client meetings, prepare travel & expense reports, and file & calendar maintenance."
    },
    {
      "duty": "Proactively participate in firm initiatives directed by local management."
    },
    {
      "duty": "Regularly seek opportunities to use firm resources for peer sharing and collaborating with Financial Advisors."
    }
  ],
  "skills": [
    {
      "skill": "Client Relationship Management",
      "experience": 2
    },
    {
      "skill": "Financial Services",
      "experience": 2
    },
    {
      "skill": "Banking Products Knowledge",
      "experience": 2
    },
    {
      "skill": "Financial Planning",
      "experience": 2
    },
    {
      "skill": "Marketing Support",
      "experience": 2
    },
    {
      "skill": "Administrative Support",
      "experience": 2
    },
    {
      "skill": "Training and Education",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "Active Series 7 (GS), and Series 66 (AG/RA) or Series 63 (AG) and Series 65 (RA)"
    },
    {
      "credential": "High School Diploma/Equivalency"
    },
    {
      "credential": "College degree preferred"
    }
  ]
}