{
  "meta": [
    {
      "job_title": "Branch Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales and Service Techniques",
      "experience": 5
    },
    {
      "skill": "Financial Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Supervisory Skills",
      "experience": 5
    },
    {
      "skill": "Community Networking",
      "experience": 5
    },
    {
      "skill": "Sales Coaching",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Confidentiality Management",
      "experience": 5
    },
    {
      "skill": "Sales Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the growth and operation of a CommunityAmerica branch location."
    },
    {
      "duty": "Leads staff in reaching their individual, team, and credit union goals through effective one-on-one coaching and team meetings."
    },
    {
      "duty": "Oversees an interactive, consultative, interview process that deepens member relationships by providing financial direction to assist members in meeting their goals."
    },
    {
      "duty": "Ensures that proper policies, guidelines, and procedures are in place to meet the strategic goals of the branch and ensure fiscal responsibility for the Credit Union."
    },
    {
      "duty": "Overall branch market penetration through member acquisition, relationship expansion, and member retention for assigned branch market."
    },
    {
      "duty": "Coach, mentor, and provide development opportunities for staff."
    },
    {
      "duty": "Proactively support and coach to an exceptional level of cross-selling credit union products or services to existing and potential members through a consultative sales approach."
    },
    {
      "duty": "Focus on determining members’ needs, cross-selling appropriate services, and continually building and enhancing member relationships."
    },
    {
      "duty": "Convey information to members on products and services in an enthusiastic and positive manner."
    },
    {
      "duty": "Refers to Financial Planning Services and the Credit Union’s mortgage department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Three (3) or more years’ experience in a financial institution in a management role along with a four (4) year degree in a related field preferred. Additional management experience may be considered in lieu of a four (4) year degree."
    },
    {
      "credential": "Demonstrated track record of leading sales teams to achieve organizational goals."
    },
    {
      "credential": "Strong understanding of coaching techniques."
    },
    {
      "credential": "Strong sales background."
    },
    {
      "credential": "History of working in a fast-paced environment."
    },
    {
      "credential": "Strong connection with the local community."
    }
  ]
}