{
  "meta": [
    {
      "job_title": "Key Account Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Lead the growth and development opportunities within regional multi-unit accounts and c-stores across customized and branded product portfolios."
    },
    {
      "duty": "Manage and grow existing customer base, including Large Regional Multi-Unit Restaurant Chains and Convenience Stores."
    },
    {
      "duty": "Establish strategic partnerships focused on delivering long-term, sustainable growth."
    },
    {
      "duty": "Work with VP of Sales, Director of Field Sales, Director of Marketing and RSM’s prioritizing and executing plans against development opportunities with existing business."
    },
    {
      "duty": "Effectively leverage program support (trade funds) and other resources."
    },
    {
      "duty": "Develop new, innovative selling tools and techniques for field execution."
    },
    {
      "duty": "Lead, develop, and coordinate the execution of new regional business and C-store opportunities across the assigned Region."
    },
    {
      "duty": "Collaborate with Marketing on segment specific database with all identified accounts prioritized to include customer profiles, competitive situation, and volume opportunity by customer type."
    },
    {
      "duty": "Generate a minimum of $5+MM annually in incremental revenue and open 10+ new Regional Chains and/or C-store customers."
    },
    {
      "duty": "Work with frontline in improving selling skills/executional capabilities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business, marketing, sales, or similar required."
    },
    {
      "credential": "Strong Multi-Unit Foodservice and/or C-store or relevant food industry role 5+ years."
    },
    {
      "credential": "Open to Travel 50% of the time within region (customer visits and Innovation Center)."
    }
  ]
}