{
  "meta": [
    {
      "job_title": "Cook",
      "job_category": "Food Service",
      "job_class": "Cook",
      "sector": "Food Service",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Food Preparation",
      "experience": 2
    },
    {
      "skill": "Kitchen Equipment Maintenance",
      "experience": 2
    },
    {
      "skill": "Menu Planning",
      "experience": 2
    },
    {
      "skill": "Food Safety and Sanitation",
      "experience": 2
    },
    {
      "skill": "Time Management",
      "experience": 2
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the preparation and presentation of a full variety of foods for the menu, including soups, sauces, casseroles, stir frys, meats, cold foods, and vegetables."
    },
    {
      "duty": "Adheres to standardized recipes; established portion sizes; and quality, taste, and presentation standards as set forth by the Department of Dining Service."
    },
    {
      "duty": "Assists in the ongoing training of kitchen personnel."
    },
    {
      "duty": "Maintains the kitchen, kitchen equipment, and related areas in a safe and sanitary condition at all times. Corrects or reports any safety and sanitation hazards."
    },
    {
      "duty": "Adheres to the policy of “clean as you go.” Assists in the daily, weekly, and periodic cleaning and maintenance duties."
    },
    {
      "duty": "Maintains the storage areas, utilizing proper storage techniques, including enforcing a first in, first out (FIFO) policy for all foodstuffs."
    },
    {
      "duty": "Is familiar with all food preparation procedures including the regular use of standardized recipes, batch cooking, portion control charts, production sheets, and service summary reports."
    },
    {
      "duty": "Maintains and enforces the established energy conservation techniques and guidelines."
    },
    {
      "duty": "Adheres to the policies and procedures of the Department of Dining Services and Princeton University."
    },
    {
      "duty": "Assists with production, service, and clean-up of special functions on and off campus."
    },
    {
      "duty": "Performs other tasks as directed by university management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma"
    }
  ]
}