{
  "meta": [
    {
      "job_title": "Application Support Specialist",
      "job_category": "Technology",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Problem Tracking",
      "experience": 5
    },
    {
      "skill": "Programming",
      "experience": 5
    },
    {
      "skill": "Diagnosis",
      "experience": 5
    },
    {
      "skill": "Debugging",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Application Support",
      "experience": 5
    },
    {
      "skill": "Technical Analysis",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Resolving complex technical issues for Truist's Network applications."
    },
    {
      "duty": "Tracking, diagnosing, and root-cause analysis of complex issues, including programming and debugging activities."
    },
    {
      "duty": "Responding to and investigating incidents or service tickets in a timely manner."
    },
    {
      "duty": "Analyzing and observing trends with technical issues and developing recommendations for long-term improvements."
    },
    {
      "duty": "Documenting all relevant end-user interactions and steps taken to resolve incidents."
    },
    {
      "duty": "Communicating status of issue resolution to internal customers."
    },
    {
      "duty": "Engaging and managing outside vendors for technical support."
    },
    {
      "duty": "Leading moderately complex projects and participating in larger, more complex initiatives."
    },
    {
      "duty": "Solving complex technical and operational problems."
    },
    {
      "duty": "Acting as a resource for teammates with less experience."
    },
    {
      "duty": "Having people management responsibilities for a small team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 125
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree and five years of experience in development or application support, or an equivalent combination of education and work experience."
    },
    {
      "credential": "In-depth knowledge in information systems and ability to identify, apply, and implement best practices."
    },
    {
      "credential": "Understanding of key business processes and competitive strategies related to the IT function."
    },
    {
      "credential": "Ability to solve complex problems by applying best practices."
    },
    {
      "credential": "Ability to provide direction and mentor less experienced teammates."
    },
    {
      "credential": "Ability to interpret and convey complex, difficult, or sensitive information."
    }
  ]
}