{
  "meta": [
    {
      "job_title": "Territory Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide overall leadership of all functions within the assigned territory of the parking garage/building services business."
    },
    {
      "duty": "Oversee the development and implementation of new processes, techniques, and service procedures within the territory."
    },
    {
      "duty": "Direct all aspects of the sales cycle including solicitation, relationship development of new customers, proposal development, and oversight of repair and restoration projects."
    },
    {
      "duty": "Develop and implement sales plans in support of growth and profitability objectives."
    },
    {
      "duty": "Anticipate future needs, methods, and products and advise on these developments/requirements."
    },
    {
      "duty": "Negotiate and resolve conflicts with customers and ensure that bid scope is reflected in sales contracts."
    },
    {
      "duty": "Lead the management and oversight of repair and restoration projects."
    },
    {
      "duty": "Consult with new and existing customers as requested."
    },
    {
      "duty": "Conduct Territory team meetings for the purpose of reporting and communicating activities, policies, procedures, and results of the departments, and for coordination of functional, company, group, and corporate goals."
    },
    {
      "duty": "Maintain expenses within the yearly budget and submit reports as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s in engineering field, construction management, business management, or related program (Master's preferred)"
    },
    {
      "credential": "Minimum of two years of parking garage, design, and hands-on construction and field experience"
    }
  ]
}