{
  "meta": [
    {
      "job_title": "Site Material Specialist",
      "job_category": "Logistics",
      "job_class": "Specialist",
      "sector": "Supply Chain",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Procurement and Material Management",
      "experience": 5
    },
    {
      "skill": "Logistics Supervision",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Vendor Communication",
      "experience": 5
    },
    {
      "skill": "Documentation Management",
      "experience": 5
    },
    {
      "skill": "Project Site Management",
      "experience": 5
    },
    {
      "skill": "Compliance Support",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "MS Office Tools",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and maintain an extensive comprehension of Procurement and Material Management processes."
    },
    {
      "duty": "Act as the primary connection between the site team and the Procurement team for material-related matters."
    },
    {
      "duty": "Supervise global and domestic transportation logistics for materials destined for the project site."
    },
    {
      "duty": "Coordinate with shippers to ensure timely deliveries in alignment with construction schedules."
    },
    {
      "duty": "Communicate with vendors, suppliers, and the construction team to manage delivery schedules and address material-related concerns."
    },
    {
      "duty": "Attain proficiency in utilizing different components of the Procurement module, including Requisitions, Purchase Orders, Purchase Contracts, Owner Supplied, Receiving, and Reports."
    },
    {
      "duty": "Possess strong expertise in inventory management, material tracking, and auditing."
    },
    {
      "duty": "Aid in generating, processing, and gathering pertinent documentation for various Material Receiving Reports, delivery projections, material inventory listings, and Warranty Claims, involving stakeholders such as owners, construction teams, and logistics personnel."
    },
    {
      "duty": "Provide guidance to Field Engineers and Project Administrative Assistants to facilitate the processing and archiving of shipping documentation."
    },
    {
      "duty": "Compile and distribute daily receiving and inventory reports to the project team."
    },
    {
      "duty": "Update the material tracker on a daily basis and furnish the team with necessary information."
    },
    {
      "duty": "Collaborate with Safety, Compliance, and Quality teams to support construction activities on the project site."
    },
    {
      "duty": "Cultivate and maintain strong relationships with clients, subcontractors, vendors, and the site team, thereby enhancing the company's reputation."
    },
    {
      "duty": "Assist the site management team in embodying and promoting the company's values and culture while maintaining a professional demeanor."
    },
    {
      "duty": "Conduct weekly site visits to monitor inventory and identify potential instances of damaged, surplus or unusable material."
    },
    {
      "duty": "Assist in the final stages of inventory recovery and the demobilization of the jobsite."
    },
    {
      "duty": "Execute supplementary assignments as directed by the supervisor."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Adept knowledge of Procurement and Material Management processes."
    },
    {
      "credential": "Possession of a valid driver's license and an impeccable motor vehicle driving record (MVR)."
    },
    {
      "credential": "Proficiency in Microsoft Office tools (Word, Excel, Outlook), as well as Visio."
    },
    {
      "credential": "Effective communication skills encompassing verbal, written, and presentation abilities, along with motivation, record-keeping, and supervisory acumen."
    },
    {
      "credential": "Capability to organize and prioritize a multitude of tasks."
    },
    {
      "credential": "Proficiency in delivering presentations to groups comprising 10 or more individuals."
    },
    {
      "credential": "Anticipate Site Material Specialists to relocate to the project site for the entirety of each construction assignment (average project duration of 6-9 months)."
    }
  ]
}