{
  "meta": [
    {
      "job_title": "Director of FP&A",
      "job_category": "Finance",
      "job_class": "Director",
      "sector": "Finance",
      "salary": 135000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Management",
      "experience": 8
    },
    {
      "skill": "Team Management",
      "experience": 8
    },
    {
      "skill": "Government & Public Sector Finance",
      "experience": 8
    },
    {
      "skill": "Financial Regulation",
      "experience": 8
    },
    {
      "skill": "Strategic Thinking",
      "experience": 8
    },
    {
      "skill": "Excel",
      "experience": 8
    },
    {
      "skill": "ERP Systems",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the FP&A department with strategic direction and day-to-day operations, including the functions of capital finance, treasury, enrollment planning, risk management, and payroll."
    },
    {
      "duty": "Collaborate with the Director of Budget to ensure that all financial planning captures both operational and capital needs, factoring in sources of funding such as debt, mill levy overrides, sales/lease proceeds, and all other strategic mechanisms."
    },
    {
      "duty": "Prepare and maintain a multi-year capital financial plan that reflects the priorities and strategic assets of corporate goals."
    },
    {
      "duty": "Lead the development of a multi-year capital financial plan that addresses both sources and uses of capital funds over a minimum of a five-year period."
    },
    {
      "duty": "Oversee the payroll function and Director of Payroll."
    },
    {
      "duty": "Present information to various internal and external stakeholder groups. Collaborate with communications to develop any necessary collateral and material for significant capital financial plans."
    },
    {
      "duty": "Monitor guidance and regulations pertaining to financial management and risk management. Adhere to Governmental Accounting Standards Board (GASB) guidance and ensure financial management follows all necessary rules and laws."
    },
    {
      "duty": "Monitor, assess, and report on financial impacts of prospective Colorado legislation. Support the CFO as directed in communicating potential impacts to legislators and lobbyists."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree required. Preference for an advanced degree or finance-specific certification."
    }
  ]
}