{
  "meta": [
    {
      "job_title": "Security Advisory Lead",
      "job_category": "Security",
      "job_class": "Consultant",
      "sector": "Management",
      "salary": 150000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Transform client maturity, improve control environments, and create new client offerings."
    },
    {
      "duty": "Define and lead engagements, sell meaningful services, and grow and manage a diverse team."
    },
    {
      "duty": "Influence, shape, and grow the Security Advisory practice, working with the North America Security Advisory Lead."
    },
    {
      "duty": "Drive multi-million sales and revenues and be responsible for achieving and building out a strong consultancy project pipeline."
    },
    {
      "duty": "Understand clients' security needs, solve unique problems, and work with clients from the earliest visions to the final experience."
    },
    {
      "duty": "Shape commercial models, risk, and go-to-market across a range of security capabilities including Strategy & GRC, IAM, Data Protection, and Cloud."
    },
    {
      "duty": "Shape, define, and guide transformative projects which enhance maturity, define strategy, solve technology issues, optimize business processes, provide assurance, strengthen controls, reduce security risk, and enable new secure ways of working."
    },
    {
      "duty": "Help drive industry-aligned focus, bringing together GTM offerings and taking them to industry verticals via sales teams."
    },
    {
      "duty": "Grow and nurture internal talent, passing on knowledge and experience to create the leaders of the future."
    },
    {
      "duty": "Hire consulting specialists, ex-technologists, people from industry, pre-sales architects, academics, and those who have branched out."
    }
  ],
  "skills": [
    {
      "skill": "Security Advisory",
      "experience": 5
    },
    {
      "skill": "Consulting Commercial Models",
      "experience": 5
    },
    {
      "skill": "Cloud Security/Infrastructure",
      "experience": 5
    },
    {
      "skill": "IAM",
      "experience": 5
    },
    {
      "skill": "Data Protection",
      "experience": 5
    },
    {
      "skill": "Strategy & GRC",
      "experience": 5
    },
    {
      "skill": "Industry Alignment",
      "experience": 5
    },
    {
      "skill": "Advisory Skills",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Cyber Security, Computer Science, IT, or a related field (Master's preferred)"
    }
  ]
}