{
  "meta": [
    {
      "job_title": "Metrology and Calibration Specialist",
      "job_category": "Engineering",
      "job_class": "Specialist",
      "sector": "Technical",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Calibrate, adjust, and maintain measuring and indicating instruments to conform to set standards, including temperature, relative humidity, differential pressure, CO2, flow, conductivity, resistivity, speed, time, and pressure."
    },
    {
      "duty": "Investigate OOT events using root cause analysis, metrics, technical knowledge, and historical experience to identify and remediate."
    },
    {
      "duty": "Responsible for maintaining calibration and interpreting engineering and architectural drawings, including floor plans, reflected ceiling plans, power plans, panel schedules, and Piping & Instrumentation Diagrams (P&IDs)."
    },
    {
      "duty": "Monitor and respond to alarms generated from the Qualified Environmental Monitoring System, including off-hours and weekends."
    },
    {
      "duty": "Write and review calibration procedures, prepare documentation, input data, and generate reports associated with calibration work orders to ensure current Good Manufacturing Practices (cGMP) and change control procedures are followed."
    }
  ],
  "skills": [
    {
      "skill": "Calibration",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 5
    },
    {
      "skill": "Engineering Drawings Interpretation",
      "experience": 5
    },
    {
      "skill": "Documentation Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum B.S. degree with 2 years of industry experience, or A. degree with 5 years of industry experience, or GED with 10 years of industry experience."
    },
    {
      "credential": "Certification from an accredited body, ASQ CCT Certification or equivalent, is required (within 1 year of hire)"
    }
  ]
}