{
  "meta": [
    {
      "job_title": "Enterprise Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Financial Budgeting",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Technology Implementations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage complex enterprise projects from initiation to closeout, ensuring successful implementation of hardware, software, and civil requirements."
    },
    {
      "duty": "Collaborate closely with customers and support teams to coordinate the installation of products, using analytical skills and a keen eye for detail to ensure systems work as designed."
    },
    {
      "duty": "Manage the overall financial budget of the project to maintain and improve the originating budget and gross margin."
    },
    {
      "duty": "Communicate effectively with clients, subcontractors, branch personnel, and support, creating all required customer submittals."
    },
    {
      "duty": "Obtain price quotes from subcontractors, ensure contract agreements are in place, and meet insurance requirements for all subcontractors prior to beginning work."
    },
    {
      "duty": "Produce a positive work environment, create strong relationships, and enhance the product experience."
    },
    {
      "duty": "Attend weekly customer project meetings (virtual and on-site) and monthly customer meetings at customer corporate office."
    },
    {
      "duty": "Work with Microsoft Suite and customer administrative tools, and engage in local travel during the design phase and implementation."
    },
    {
      "duty": "Embrace obstacles, seek out alternative solutions, and provide ideas and recommendations to better serve customers, internally and externally."
    },
    {
      "duty": "Complete other tasks as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent (Technology, Business Administration, or Construction related majors preferred)"
    },
    {
      "credential": "PMP certification preferred"
    }
  ]
}