{
  "meta": [
    {
      "job_title": "Dust Collection Engineer and DHA Consultant",
      "job_category": "Engineering",
      "job_class": "Consultant",
      "sector": "Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Process Safety Engineering",
      "experience": 7
    },
    {
      "skill": "Industrial Ventilation Design",
      "experience": 7
    },
    {
      "skill": "NFPA Standards",
      "experience": 7
    },
    {
      "skill": "Hazard Analysis",
      "experience": 7
    },
    {
      "skill": "Technical Writing",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Microsoft Office",
      "experience": 7
    },
    {
      "skill": "AutoCAD",
      "experience": 7
    },
    {
      "skill": "Strong Communication",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Utilize specialized expertise in the design and specification of dust collector systems to provide valuable insights and guidance to clients."
    },
    {
      "duty": "Collaborate closely with clients engaged in hazardous material handling, particularly in chemical and combustible dust manufacturing, fostering strong and trustworthy relationships."
    },
    {
      "duty": "Lead and conduct thorough engineering studies and hazard assessments, including combustible dust hazard analysis (DHAs) and related services."
    },
    {
      "duty": "Provide peer review of engineering and hazard assessment reports to ensure accuracy and completeness of analysis and recommendations."
    },
    {
      "duty": "Collaborate with clients and laboratory teams to offer insights into combustible dust and chemical reactivity testing practices, including sampling plans, test methods, and result interpretation."
    },
    {
      "duty": "Deliver comprehensive Training Courses to clients, equipping their staff with the necessary knowledge to operate and maintain dust collection equipment effectively while adhering to engineering best practices."
    },
    {
      "duty": "Share expert knowledge through presentations at Industry Conferences and Trade Shows."
    },
    {
      "duty": "Contribute to industry knowledge by publishing technical articles and white papers."
    },
    {
      "duty": "Engage in general engineering operations, encompassing drafting, technical writing, and calculations."
    },
    {
      "duty": "Utilize strong communication skills to cultivate and enhance customer relationships, thereby driving further business growth."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering or a related field (Advanced degree or certification advantageous)"
    }
  ]
}