{
  "meta": [
    {
      "job_title": "Real Estate Manager",
      "job_category": "Real Estate",
      "job_class": "Manager",
      "sector": "Real Estate",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Real Estate Transactions",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Property Appraisal",
      "experience": 5
    },
    {
      "skill": "Supervision",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Due Diligence",
      "experience": 5
    },
    {
      "skill": "Title Review",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Legal Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive land acquisition plans, overseeing a portfolio of complex land acquisition projects."
    },
    {
      "duty": "Lead negotiations requiring the highest degree of discretion, technical knowledge, initiative, and judgment."
    },
    {
      "duty": "Manage the property appraisal process, including scoping, interpreting appraisal reports, and preparing necessary instruments for land and real property rights acquisition."
    },
    {
      "duty": "Coordinate with consultants providing property appraisal, land survey, environmental site assessment, and other services."
    },
    {
      "duty": "Oversee the title report examination process to identify potential title issues and coordinate with involved parties on the closing of real property transactions."
    },
    {
      "duty": "Investigate conflicts of interest and negotiate resolutions to protect Park District property."
    },
    {
      "duty": "Develop program standards, goals, and objectives in line with the Park District’s mission and Master Plan."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree from an accredited college or university with major course work in real estate, economics, public administration, business administration, or a related field (Master's preferred)"
    }
  ]
}