{
  "meta": [
    {
      "job_title": "Buyer / Planner",
      "job_category": "Procurement",
      "job_class": "Planner",
      "sector": "Supply Chain",
      "salary": 65000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the procurement of expense, capital and indirect materials / services requested by internal departments."
    },
    {
      "duty": "Executes direct materials / services purchases required to manufacture AVITA products to ensure customer demand is met."
    },
    {
      "duty": "Issues purchase orders for the procurement of direct materials as required by sales forecast and the master production schedule."
    },
    {
      "duty": "Processes purchase requisitions for expense, capital and indirect materials and services."
    },
    {
      "duty": "Monitors status of open purchase orders to ensure on-time delivery of all materials including timely resolution, communication, and mitigation of potential problems."
    },
    {
      "duty": "Manages and resolves purchase order issues regarding invoice discrepancies, returns, and quality problems with suppliers."
    },
    {
      "duty": "Identifies supply chain risks and provides proposals to mitigate material shortages."
    },
    {
      "duty": "Maintains material master planning parameters for direct materials (reorder point, MOQ, lead time, safety stocks) to ensure timely purchase order placement."
    },
    {
      "duty": "Negotiates purchase orders details such as price, payment terms, delivery schedule to drive most favorable results for the company."
    },
    {
      "duty": "Initiates the supplier approval process for new suppliers who affect the quality system."
    },
    {
      "duty": "Creates and maintains new suppliers in the ERP system."
    },
    {
      "duty": "Collaborates with internal customers and provides a high level of customer service."
    },
    {
      "duty": "Ensures compliance to company goals and objectives, policies and procedures, and FDA regulations."
    },
    {
      "duty": "Remains current on all assigned duties by reviewing related procedures."
    },
    {
      "duty": "Occasionally travel to AVITA Ventura and / or domestic suppliers."
    }
  ],
  "skills": [
    {
      "skill": "Procurement",
      "experience": 3
    },
    {
      "skill": "Supply Chain Management",
      "experience": 3
    },
    {
      "skill": "MRP",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Negotiation",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "ERP System",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "BS/BA in Procurement, Supply Chain, Business, or equivalent work experience"
    }
  ]
}