{
  "meta": [
    {
      "job_title": "Asset Control Technician",
      "job_category": "Operations",
      "job_class": "Technician",
      "sector": "Oil & Gas",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "SAP PM",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Microsoft Excel",
      "experience": 1
    },
    {
      "skill": "Microsoft Outlook",
      "experience": 1
    },
    {
      "skill": "Microsoft PowerPoint",
      "experience": 1
    },
    {
      "skill": "Microsoft SharePoint",
      "experience": 1
    },
    {
      "skill": "Microsoft Teams",
      "experience": 1
    },
    {
      "skill": "Microsoft Word",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Logistics",
      "experience": 1
    },
    {
      "skill": "WellMaster",
      "experience": 1
    },
    {
      "skill": "Wellview",
      "experience": 1
    },
    {
      "skill": "Access",
      "experience": 1
    },
    {
      "skill": "PowerPoint",
      "experience": 1
    },
    {
      "skill": "Spotfire",
      "experience": 1
    },
    {
      "skill": "Data Analysis",
      "experience": 1
    },
    {
      "skill": "Trainer",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Building new functional locations and trackable equipment in SAP-PM for financial tracking, maintenance analysis, and environmental reporting."
    },
    {
      "duty": "Conducting analysis of facility & equipment cost after project completion in SAP-PM, and recording and reconciling discrepancies as needed."
    },
    {
      "duty": "Generating quality check reports SAP data to ensure SAP-PM Asset register meets business requirements and reconcile, as needed."
    },
    {
      "duty": "Screening and tracking material transfers to ensure all required data is provided prior to processing."
    },
    {
      "duty": "Processing material transfers to ensure financial movement for equipment is properly reflected in SAP for new and used equipment."
    },
    {
      "duty": "Monitoring and maintaining PM Yard inventories in SAP-PM."
    },
    {
      "duty": "Conducting quarterly PM and 3rd Party Yard reconciliations."
    },
    {
      "duty": "Participating in annual asset control audit to track and reconcile audit findings, as needed."
    },
    {
      "duty": "Providing training on asset control policies, material transfer process, and the identification of controllable and BU-trackable equipment."
    },
    {
      "duty": "Compiling data to provide performance monitoring reports as needed."
    },
    {
      "duty": "Collaborating with other groups such as Planning & Scheduling, Supply Chain, Materials Management, Projects, and Operations to develop an environment of continuous improvement."
    },
    {
      "duty": "Identifying and preserving sensitive and confidential information with limited supervision."
    },
    {
      "duty": "Identifying circumstances that require SAP workflows or financial movement requests to Global Finance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Current/Valid driver's license"
    },
    {
      "credential": "1+ years of administrative support experience"
    },
    {
      "credential": "1+ years of experience in the oil and gas industry"
    },
    {
      "credential": "Basic knowledge of SAP PM"
    },
    {
      "credential": "Basic level of proficiency with Microsoft O365 applications: Excel, Outlook, PowerPoint, SharePoint, Teams and Word"
    },
    {
      "credential": "Willing and able (with or without reasonable accommodation) to travel 10% of the time on a yearly basis"
    },
    {
      "credential": "1+ years of experience with inventory management and logistics"
    },
    {
      "credential": "1+ years of experience with WellMaster and Wellview"
    },
    {
      "credential": "Basic level of proficiency with Access, PowerPoint and Spotfire"
    },
    {
      "credential": "Basic level of proficiency with building and manipulating complex spreadsheets"
    },
    {
      "credential": "Basic level of proficiency with recognizing oilfield equipment"
    },
    {
      "credential": "Effective trainer with an ability to instruct and mentor others on processes and procedures"
    },
    {
      "credential": "Takes ownership of actions and follows through on commitments by holding others accountable and standing up for what is right"
    },
    {
      "credential": "Builds effective solutions based on available information and makes timely decisions that are safe and ethical"
    },
    {
      "credential": "Delivers positive results through realistic planning to accomplish goals"
    }
  ]
}