{
  "meta": [
    {
      "job_title": ".NET Full Stack Developer with Angular",
      "job_category": "Software Engineering",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, test, and maintain robust and scalable web applications using .NET and Angular technologies."
    },
    {
      "duty": "Collaborate with UI/UX designers to implement user-friendly interfaces and ensure seamless user experiences."
    },
    {
      "duty": "Design and implement RESTful APIs for communication between front-end and back-end systems."
    },
    {
      "duty": "Work with databases, creating and optimizing database schemas, and writing efficient queries."
    },
    {
      "duty": "Participate in code reviews to ensure code quality, performance, and adherence to coding standards."
    },
    {
      "duty": "Troubleshoot and debug issues in both front-end and back-end components and provide timely resolutions."
    },
    {
      "duty": "Collaborate with cross-functional teams, including product managers and other developers, to define and implement software solutions."
    },
    {
      "duty": "Stay updated with industry trends and best practices in Full Stack development and contribute ideas to enhance team productivity and product quality."
    },
    {
      "duty": "Continuously refactor and improve code to maintain a high level of code quality and performance."
    },
    {
      "duty": "Participate in Agile development methodologies, including sprint planning, stand-ups, and retrospectives."
    }
  ],
  "skills": [
    {
      "skill": ".NET Development",
      "experience": 5
    },
    {
      "skill": "Angular",
      "experience": 5
    },
    {
      "skill": "RESTful API Design",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Code Review",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Cross-functional Collaboration",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    }
  ]
}