{
  "meta": [
    {
      "job_title": "Customer Success Manager",
      "job_category": "Customer Success",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Success",
      "experience": 5
    },
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "CRM Tools",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive the growth of Sentry by providing a next-generation customer success motion that maximizes customer value from the Sentry platform."
    },
    {
      "duty": "Maintain long-term account health and strong relationships by providing continued value and support to existing customers."
    },
    {
      "duty": "Collaborate with internal teams to execute Executive Business Reviews, build detailed Strategic Customer Success Plans, and establish critical goals for expansion."
    },
    {
      "duty": "Advocate customer product needs, feedback, and issues cross-departmentally, and program-manage customer expectations."
    },
    {
      "duty": "Craft innovative, successful, repeatable strategies to expand the reach within the portfolio and navigate complex Org mapping to identify and target engineering teams not using the product."
    },
    {
      "duty": "Consistently meet and exceed ARR targets for Renewals and Expansions as a Pod, and perform internal quarterly Strategic Business Reviews to outline the health of the portfolio and present Strategic Success Plans with the Executive team."
    },
    {
      "duty": "Help customers make the best out of their investment with Sentry by driving product adoption, sharing best practices, and implementing growth and optimization strategies for maximum value."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent and a dedication to ongoing learning"
    }
  ]
}