{
  "meta": [
    {
      "job_title": "Associate Music Publicist, Festivals",
      "job_category": "Public Relations",
      "job_class": "Associate",
      "sector": "Arts, Entertainment, and Media",
      "salary": 54000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Music Industry Experience",
      "experience": 3
    },
    {
      "skill": "Event Management",
      "experience": 3
    },
    {
      "skill": "Writing",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Research",
      "experience": 5
    },
    {
      "skill": "Social Media Management",
      "experience": 5
    },
    {
      "skill": "Promotions",
      "experience": 5
    },
    {
      "skill": "Radio Relations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage day-to-day campaigns within the Festival division, including pitch and press release drafting, reporting, pitching, research, opportunity coordination, logistics management, influencer program management, radio relations, and on-site festival work."
    },
    {
      "duty": "Coordinate editorial relationships across festival campaigns and develop creative angles for editorial pitching."
    },
    {
      "duty": "Update campaign planners, coordinate earned media opportunities, and manage influencer program by keeping the database updated and presenting ticket trade coverage opportunities across the festival roster."
    },
    {
      "duty": "Coordinate commercial and college radio relations for festivals, attend on-site festival events, and work with festival team management to implement earned media opportunities on-site."
    },
    {
      "duty": "Coordinate social media takeovers, distribute social content, and maintain a shared contact database."
    },
    {
      "duty": "Ensure the use of company project management tools, contribute to inter-team communications, and weekly calls with promo and artist teams."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a relevant field (Preferred)"
    }
  ]
}