{
  "meta": [
    {
      "job_title": "Home Study and Post Release Services Caseworker",
      "job_category": "Case Management",
      "job_class": "Case Worker",
      "sector": "Non-Profit",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Case Management",
      "experience": 1
    },
    {
      "skill": "Child and Youth Work",
      "experience": 1
    },
    {
      "skill": "Family Reunification",
      "experience": 1
    },
    {
      "skill": "Community Resource Coordination",
      "experience": 1
    },
    {
      "skill": "Mental Health Support",
      "experience": 1
    },
    {
      "skill": "Bilingual (English/Spanish)",
      "experience": 1
    },
    {
      "skill": "Crisis Management",
      "experience": 1
    },
    {
      "skill": "Cultural Sensitivity",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct in-person home visits to promote safety and stabilization of children released from federal care to their sponsor."
    },
    {
      "duty": "Assess the need for different levels of care and develop individualized strength-based service plans."
    },
    {
      "duty": "Coordinate referrals and address barriers in relevant service need areas (e.g. legal, education, medical, mental health)."
    },
    {
      "duty": "Support unaccompanied children and sponsors with enrollment and access to community services."
    },
    {
      "duty": "Provide psychoeducation to children and sponsors on relevant topics and family reunification stressors."
    },
    {
      "duty": "Monitor progress, safety, and well-being of children, including indications of trafficking, abuse, and neglect."
    },
    {
      "duty": "Create and revise safety plans as needed and serve as a mandated reporter."
    },
    {
      "duty": "Network and develop partnerships to educate providers on children’s needs and reinforce partnerships in relevant areas."
    },
    {
      "duty": "Write case notes, enter data, and complete reports in a time-sensitive manner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in social work, education, psychology, sociology, or other behavioral science (MSW Preferred)"
    },
    {
      "credential": "Ability to read and write in Spanish and English"
    }
  ]
}