{
  "meta": [
    {
      "job_title": "Senior Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Supply Chain",
      "salary": 160000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Deliver on all project management activities for an assigned project or program from Initiation through Closure"
    },
    {
      "duty": "Demonstrate natural leadership and communication skills to instill confidence in business executive team of your expertise and capability"
    },
    {
      "duty": "Manage projects in any functional area of a business, i.e. Manufacturing, Supply Chain, HR, Finance, etc."
    },
    {
      "duty": "Manage multiple projects or programs simultaneously. Potentially across multiple businesses, across time zones, internationally, etc. Includes travel nationally and internationally as required by the project"
    },
    {
      "duty": "Adopt, utilize and enhance the standard company tools, processes and templates"
    },
    {
      "duty": "Work with a continuous improvement mind-set so that all activities become inputs and improvements for future projects"
    },
    {
      "duty": "Identify and manage project and program interdependencies"
    },
    {
      "duty": "Manage external parties involved in an assigned project"
    },
    {
      "duty": "Manage project completion, handover to steady-state, and post-implementation reviews"
    },
    {
      "duty": "Ensure compliance with company policies for health, safety, and environment"
    },
    {
      "duty": "Ensure compliance with company policies for governmental and local laws and regulations"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Project Management Professional (PMP) certified"
    },
    {
      "credential": "Bachelor's degree in Business or a related field (Master's preferred)"
    }
  ]
}