{
  "meta": [
    {
      "job_title": "Property & Casualty Field Adjuster",
      "job_category": "Insurance",
      "job_class": "Adjuster",
      "sector": "Insurance",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Claims Management",
      "experience": 5
    },
    {
      "skill": "Litigation Management",
      "experience": 5
    },
    {
      "skill": "Insurance Investigation",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Subrogation",
      "experience": 5
    },
    {
      "skill": "Legal Services",
      "experience": 5
    },
    {
      "skill": "Case Analysis",
      "experience": 5
    },
    {
      "skill": "Reinsurance Reporting",
      "experience": 5
    },
    {
      "skill": "Continuing Education",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Investigate and manage large and complex property and liability claims for Insurance Trust members and TPA clients."
    },
    {
      "duty": "Field inspections for large and significant liability losses and effective litigation management."
    },
    {
      "duty": "Independently negotiate settlements with members, claimants or their legal representatives."
    },
    {
      "duty": "Identify subrogation opportunities and work with defense counsel to obtain recoveries."
    },
    {
      "duty": "Attend mediations, trials, depositions, workshops, seminars, and training for members."
    },
    {
      "duty": "Conduct investigations by contacting members/claimants/city attorney, analyzing lawsuits, determining potential coverage exclusions, and identifying potential fraud."
    },
    {
      "duty": "Responsible for identifying claim exposures requiring reinsurance reporting, preparing reinsurance status reports, maintaining proper reserves, and obtaining properly executed settlement documents."
    },
    {
      "duty": "Professional development through continuing education courses and seminars, participating in industry-related courses, and attaining insurance/claims designations."
    },
    {
      "duty": "Research and review of publications, media reports, and judicial opinions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Over five years of practical multi-Line claims experience."
    },
    {
      "credential": "Valid Class C Driver's License and North Carolina Adjuster License must be maintained."
    }
  ]
}