{
  "meta": [
    {
      "job_title": "Content Specialist",
      "job_category": "Assessment & Qualifications",
      "job_class": "Specialist",
      "sector": "Education",
      "salary": 58000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Project Lead – Responsible for daily functions of one or more handscoring contracts including resource planning, developing item specific training, coordinating with program and project managers, managing the Scoring Directors, Supervisors, and Scorers, and performing post-project work and data analysis."
    },
    {
      "duty": "Content Expertise – Thorough knowledge of science topics for Elementary, Middle, and High School Science, and ability to apply state and national science standards. Expected to apply science expertise throughout item development and scoring process, including in meetings with clients and educators. Comfortable with providing expertise, managing, and scoring Math assessments."
    },
    {
      "duty": "Logistics and Communication –Clear communication to various roles daily is required, including communication via chat, email, phone, posted reports, and videoconference meetings. In-person and virtual interactions with the customer and other educators. Strong ability to work in a team environment."
    },
    {
      "duty": "Training and Coaching – Mentoring and training Scoring Directors, Supervisors, and Scorers. Must be able to train Science and potentially Math items to a varied scorer population."
    }
  ],
  "skills": [
    {
      "skill": "Science Knowledge",
      "experience": 5
    },
    {
      "skill": "Math Knowledge",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Training and Mentoring",
      "experience": 5
    },
    {
      "skill": "Logistics Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Virtual Communication",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Life Science or Physical Sciences (Master’s preferred)"
    }
  ]
}