{
  "meta": [
    {
      "job_title": "Line Cook",
      "job_category": "Culinary",
      "job_class": "Line Cook",
      "sector": "Hospitality",
      "salary": 24000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Professional Cooking",
      "experience": 3
    },
    {
      "skill": "Knife Handling",
      "experience": 3
    },
    {
      "skill": "Food Preparation",
      "experience": 3
    },
    {
      "skill": "Menu Execution",
      "experience": 3
    },
    {
      "skill": "Food Safety and Handling",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Creativity",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Well-versed on all menu items and able to produce consistent and quality dishes in fast-paced and demanding environments on all stations."
    },
    {
      "duty": "Assist with inventory to support the kitchen operating at a sustainable food cost."
    },
    {
      "duty": "Watch wastage, cooking temps, and quality to reduce additional costs, and influence others on the cost of product and its contribution to the profit and loss of the company."
    },
    {
      "duty": "Production and a-la-carte dish(s) execution, including weekend feast ideas and family meal."
    },
    {
      "duty": "Delegate tasks as needed and ensure proper procedure is followed when clocking in and out for shifts as well as breaks."
    },
    {
      "duty": "Support Executive Sous and Jr. Sous with end of service meeting."
    },
    {
      "duty": "Maintain company target goals and consistent experience for Soho House Standards for service; 3-8-10."
    },
    {
      "duty": "Positive influence for teams under pressure and provide a welcoming work environment that increases staff morale."
    },
    {
      "duty": "Attend “Cook House” trainings and support the mentoring and education of new and existing team members on areas they are looking to grow."
    },
    {
      "duty": "Be flexible on whatever duties or tasks you are asked to perform and be available to help and collaborate with other stations if requested or needed."
    },
    {
      "duty": "Complete any additional tasks as deemed business appropriate by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Food Handler’s Certificate"
    }
  ]
}