{
  "meta": [
    {
      "job_title": "Assistant Community Manager",
      "job_category": "Administration",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Conflict Resolution",
      "experience": 3
    },
    {
      "skill": "Business Correspondence",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Property Management",
      "experience": 1
    },
    {
      "skill": "Real Estate",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Field and respond promptly to homeowner inquiries via phone, email, work order, letter, and/or in person."
    },
    {
      "duty": "Interact with vendors and assist with addressing emergency requests as necessary."
    },
    {
      "duty": "Update notes within homeowner accounts of all conversations/correspondence with homeowners."
    },
    {
      "duty": "Maintain property files and unit files."
    },
    {
      "duty": "Receive, process, and track Architectural Review Applications from homeowners."
    },
    {
      "duty": "Assist Community Manager with requests for proposals, repair quotes, insurance notification lists."
    },
    {
      "duty": "Assist in preparing homeowner CC&R violation letter and communicate results of hearings to homeowners within the time frames set by state statues or governing documents as needed."
    },
    {
      "duty": "Assist homeowners with Associa corporate programs (website, portals, etc.) in accordance with Community Manager direction, client enrollment, and local office protocol."
    },
    {
      "duty": "Participate in Associa training including Associa University webinars, etc."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 85,
      "student_teacher": 65,
      "introvert_extrovert": 95
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED Required, Associates or Bachelor's Degree a plus, At least one year of Customer Service experience is required, At least one year of Community Association Management or relevant experience is preferred, Experience with a high call volume is preferred, Valid driver's license"
    }
  ]
}