{
  "meta": [
    {
      "job_title": "Coverage Analysis Manager",
      "job_category": "Administration",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Clinical Research",
      "experience": 9
    },
    {
      "skill": "Managerial Experience",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Training and Supervision",
      "experience": 5
    },
    {
      "skill": "Medicare Coverage Analyses",
      "experience": 5
    },
    {
      "skill": "Billing and Coding",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and execute day-to-day operations related to Coverage Analyses (CAs) and supervise OCAA staff."
    },
    {
      "duty": "Provide analyses for planning and development of OCAA, review research protocols, and assess the billable nature of items and services in the context of clinical research."
    },
    {
      "duty": "Provide training to CA Analysts and Campus departments on the coverage analysis process, perform operational process review and implementation, and ensure Quality Assurance (QA)."
    },
    {
      "duty": "Perform coverage analyses including the development of the coverage analysis (CA) grid and billing justifications of varying complexity, in compliance with UCSD policies."
    },
    {
      "duty": "Administer website, update SOPs, review metrics, and track productivity and timelines. Focus efforts on operationalizing clinical research efforts for OCAA."
    },
    {
      "duty": "Comprehend and apply Medicare rules, SB 37, NCD 310.1, and other regulations relevant to clinical research. Apply regulations to the billing of routine costs for clinical research and work with numerous databases and electronic information."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in related area plus five years of related experience/training, managerial experience, and proven success in managing and leading a dynamic team of experienced and new analysts."
    }
  ]
}