{
  "meta": [
    {
      "job_title": "Planning Manager",
      "job_category": "Planning",
      "job_class": "Manager",
      "sector": "Procurement",
      "salary": 100000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support and assist the Director of Planning and Procurement in overseeing the demand for the CSI product portfolio and coordinating with manufacturing entities and suppliers."
    },
    {
      "duty": "Ensure accurate PO status/review, product demand forecasting, and product transportation tracking."
    },
    {
      "duty": "Align with the daily activities of customer order fulfillment and facilitate interactions between Sales, Logistics, and other key departments."
    },
    {
      "duty": "Consult with the Planning Specialist to resolve product allocation and reallocation issues, investigate and resolve complex customer issues."
    },
    {
      "duty": "Analyze Demand and align factory resources to Sales forecast and orders."
    },
    {
      "duty": "Develop rolling Sales Forecasts in collaboration with Sales Team and Director of Planning and Procurement."
    },
    {
      "duty": "Collaborate with key departments to prioritize, reconcile, and re-allocate supply in shortage situations, considering customer obligations."
    },
    {
      "duty": "Ensure accurate booking and provisioning of order types in a timely manner."
    },
    {
      "duty": "Work cross-functionally to review non-standard orders and agreements, support Customer PO review, and translate demand/forecast into product production/demand activities."
    },
    {
      "duty": "Assist in operationalizing new product introductions and automation projects."
    },
    {
      "duty": "Review existing policies and processes, recommend changes to upper management, ensure business activities are performed ethically and in compliance with standards."
    },
    {
      "duty": "Support ISO 9001 activities and adhere to environmental, health, and safety rules and policies."
    }
  ],
  "skills": [
    {
      "skill": "SAP",
      "experience": 5
    },
    {
      "skill": "Sales Force",
      "experience": 4
    },
    {
      "skill": "MS Suite applications (Excel, PowerPoint, Word)",
      "experience": 5
    },
    {
      "skill": "MS Power BI",
      "experience": 4
    },
    {
      "skill": "Statistics",
      "experience": 5
    },
    {
      "skill": "Cross-functional collaboration",
      "experience": 5
    },
    {
      "skill": "Attention to detail",
      "experience": 5
    },
    {
      "skill": "Project management",
      "experience": 5
    },
    {
      "skill": "Ethical standards and compliance",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 110,
      "student_teacher": 70,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS Degree required"
    },
    {
      "credential": "5+ years planning experience required"
    }
  ]
}