{
  "meta": [
    {
      "job_title": "Grant Proposal Writer",
      "job_category": "Writing",
      "job_class": "Research",
      "sector": "Research",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Grant Writing",
      "experience": 5
    },
    {
      "skill": "Research Proposal Development",
      "experience": 5
    },
    {
      "skill": "Federal Grant Regulations",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "NIH Grants",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Detail Orientation",
      "experience": 5
    },
    {
      "skill": "Grant Management Software",
      "experience": 5
    },
    {
      "skill": "Deadlines Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Gather, organize, and synthesize materials from multiple stakeholders to develop informative, cohesive, and persuasive research proposal in tandem with subject matter experts."
    },
    {
      "duty": "Understand and explain federal grant regulations, guidelines, and the Uniform Guidance to non-experts."
    },
    {
      "duty": "Consult with various key stakeholders to obtain information necessary for the development of fundable proposals, including addressing specific grant criteria."
    },
    {
      "duty": "Evaluate the overall needs of proposals and assist in determining proposal strategy, direction, and course of action."
    },
    {
      "duty": "Track, manage, and communicate timelines and deadlines to achieve timely proposal submissions."
    },
    {
      "duty": "Aid in the development, revision, and provide feedback on drafts provided by others, including letters of support, executive summaries, research plans, facilities, data management plans, and organizational resources."
    },
    {
      "duty": "Proofread proposals for clarity, coherence, organization, and adherence to call for proposal, including minor typographical and other writing errors."
    },
    {
      "duty": "Assist with budget narrative."
    },
    {
      "duty": "Maintain up-to-date knowledge of sponsor, state, and federal regulations governing submission of proposals for external funding."
    },
    {
      "duty": "Generate high-quality LOI’s, proposals, narratives, applications, and supporting documents in response to solicitations consistent with all organization policies and procedures, and the requirements and guidelines of the funding agencies."
    },
    {
      "duty": "Generate revenues for research and programs through timely submission of well-researched, well-written, and well-documented grant proposals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a related field; Master's degree preferred"
    }
  ]
}