{
  "meta": [
    {
      "job_title": "RPA Systems Analyst",
      "job_category": "IT",
      "job_class": "Systems Analyst",
      "sector": "Software Engineering",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Robotic Process Automation",
      "experience": 3
    },
    {
      "skill": "Business Process Mapping",
      "experience": 3
    },
    {
      "skill": "Blue Prism",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "VB / HTML/ SQL",
      "experience": 3
    },
    {
      "skill": "Microsoft Suite",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Functions as an integrator between the end users and Robotic Process Automation team, helping to create automation solutions to meet business needs."
    },
    {
      "duty": "Participates or leads in various types of meetings or workshops to understand, map, and help shape detailed business processes to define and design automation solutions, developing as-is and to-be process flows."
    },
    {
      "duty": "Responsible for the definition, design, configuration, testing, and initial deployment of new, modified and/or enhanced Robotic Process Automations."
    },
    {
      "duty": "Designs and configures RPA processes and objects in Blue Prism (processes, outputs, exception paths, and error handling) that are efficient, well-structured, maintainable, and easy to understand."
    },
    {
      "duty": "Creates testing documentation and performs testing activities, including integration testing, end-to-end (business process) testing, and user acceptance testing."
    },
    {
      "duty": "Works within project planning constraints, communicating any identified project risks and issues to the delivery/project manager accordingly and providing inputs to the change control process."
    },
    {
      "duty": "Good organizational and project management skills with experience of managing, analyzing, and/or overseeing a diverse portfolio of activities."
    },
    {
      "duty": "Good communication skills."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of Bachelor’s Degree required. Previous experience with Robotic Process Automation and Blue Prism required."
    }
  ]
}