{
  "meta": [
    {
      "job_title": "Security Project Manager",
      "job_category": "Security",
      "job_class": "Manager",
      "sector": "Security",
      "salary": 92996,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "The primary focus of the position is the management and execution of assigned projects. Using the principals of project management, lead the implementation of strategic initiatives, including new business transition."
    },
    {
      "duty": "Partner with Account Managers to successfully complete client based projects specific to contract compliance, program development or to facilitate promotion of the group."
    },
    {
      "duty": "Act as subject matter expert for specific operational functions including, but not limited to, Security Operations Centers and Data Centers."
    },
    {
      "duty": "Lead the identification and implementation of standardized processes in support of the client's Event development."
    },
    {
      "duty": "Work with all levels in the organization to identify, analyze and solve problems and create opportunities for continuous improvement."
    },
    {
      "duty": "Maintain confidentiality of all information and data."
    },
    {
      "duty": "Keep records and prepare accurate and timely reports both manually and through automated methods."
    },
    {
      "duty": "Perform other related duties and responsibilities as assigned or required."
    },
    {
      "duty": "Actively participate in community and business related organizations."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Operational Expertise",
      "experience": 5
    },
    {
      "skill": "Continuous Improvement",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Data Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Preferred four-year degree in Business Administration, Criminal Justice, or related field. 5+ years experience in a similar role/environment. 3+ years of security industry experience is a plus."
    }
  ]
}