{
  "meta": [
    {
      "job_title": "Finance Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "IFRS",
      "experience": 10
    },
    {
      "skill": "Account Reconciliation",
      "experience": 10
    },
    {
      "skill": "Microsoft Excel",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "CPA",
      "experience": 8
    },
    {
      "skill": "Internal Controls",
      "experience": 10
    },
    {
      "skill": "Blackline",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the overall accounting activities of the various companies, including review of account reconciliations and journal entries."
    },
    {
      "duty": "Manage the close process, ensuring all general ledger reconciliation workpapers are accurate, include adequate supporting documentation, and are prepared in accordance with ATG."
    },
    {
      "duty": "Coordinate and manage mid-year audit reviews and year-end audit including the provision of requested schedules to support financial trends and balances."
    },
    {
      "duty": "Compute and post IFRS entries including, but not limited to IFRS 15 and 16."
    },
    {
      "duty": "Work with team to identify and create efficient processes, effectuating a smooth month-end close cycle."
    },
    {
      "duty": "Ensure compliance with all corporate accounting policies and internal controls."
    },
    {
      "duty": "Manage, mentor, and train staff accountants for all companies."
    },
    {
      "duty": "Collaborate with teams and personnel throughout ATG to accomplish mutual objectives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business administration with an Accounting emphasis Minimum 7-10 years’ experience in accounting with a focus on general ledger reconciliation and the month-end close process Prior management experience CPA preferred"
    }
  ]
}