{
  "meta": [
    {
      "job_title": "Corporate Pilot",
      "job_category": "Aviation",
      "job_class": "Pilot",
      "sector": "Aviation",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Pilot",
      "experience": 10
    },
    {
      "skill": "FAA Regulations Knowledge",
      "experience": 10
    },
    {
      "skill": "Flight Planning",
      "experience": 10
    },
    {
      "skill": "Aircraft Maintenance Knowledge",
      "experience": 10
    },
    {
      "skill": "Safety Management System",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assume Pilot duties of the Company G280 aircraft in Part 91 operations."
    },
    {
      "duty": "Prepare flight plans, according to weather conditions and patterns to ensure the safest and most efficient means of travel."
    },
    {
      "duty": "Promote a team environment and proactively contribute to the Safety Management System."
    },
    {
      "duty": "Provide necessary and required passenger in-flight services."
    },
    {
      "duty": "Notify the Maintenance team of any problems with the aircraft and follow proper MEL procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150
    },
    {
      "student_teacher": 50
    },
    {
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Possess an Airline Transport Pilot license and have an FAA Medical Certificate – First Class Exam or the ability to obtain one.Minimum of 3,500 hours total flight time, 1,500 hours Multi-Engine, and 1000 hours of Turbine.4,500 hours total flight time, 500 hours Turbine PIC for Captain, preferred5,500 hours total flight time, 1000 hours Turbine PIC for Senior Captain, preferredTyped rated in a jet aircraft. Mid-size/super mid-size type rating preferred Valid passport with no restrictions and no FAA violations or enforcementsReside or be willing to relocate within 1 hour of Austin, MNMust be a Citizen or National of the United States, a lawful, permanent resident, or have authorization to work in the United StatesApplicants must not now, or in the future, require sponsorship for an employment visa"
    }
  ]
}