{
  "meta": [
    {
      "job_title": "Senior Clinical Program Manager",
      "job_category": "Clinical Research",
      "job_class": "Manager",
      "sector": "Healthcare",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Contribute to the development of clinical project plans and implementation of those plans in accordance with corporate and regulatory objectives."
    },
    {
      "duty": "Direct oversight of clinical operation activities (trial management, site monitoring, vendor management, Trial Master Files, and others) for one or more clinical programs."
    },
    {
      "duty": "Development and approval of key study documents in conjunction with other functional area leads assigned to a project (e.g. protocols, project plans and timelines, statistical analysis plans, final study reports, etc.)."
    },
    {
      "duty": "Identify, resolve, and escalate issues that jeopardize timely clinical study completion."
    },
    {
      "duty": "Lead study site selection in collaboration with internal team and vendor(s)."
    },
    {
      "duty": "Identify and select vendors based on clinical trial needs and constraints related to resourcing or budget."
    },
    {
      "duty": "Actively manage vendors to ensure study activities are performed to expected quality and timeliness."
    },
    {
      "duty": "Build and manage relationships with sites."
    },
    {
      "duty": "Ensure audit readiness status for clinical trials."
    },
    {
      "duty": "Develop clinical trial budgets, resources, and reforecasting projections."
    },
    {
      "duty": "Communicate study updates to internal teams/senior management."
    },
    {
      "duty": "Contribute to the development of Clinical Operations goals and objectives and help drive the initiatives that meet those goals and objectives."
    },
    {
      "duty": "Contribute to the development of Clinical Operations SOPs and associated guidelines and templates."
    },
    {
      "duty": "Monitor departmental compliance with required training and adherence to all corporate and departmental SOPs, GCP/ICH guidelines and QC/QA procedures."
    }
  ],
  "skills": [
    {
      "skill": "Clinical Project Planning",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Clinical Trial Budgeting",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Stakeholder Communication",
      "experience": 5
    },
    {
      "skill": "SOP Development",
      "experience": 5
    },
    {
      "skill": "Training Compliance",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a clinical, scientific, or related discipline (Advanced degree preferred)"
    }
  ]
}