{
  "meta": [
    {
      "job_title": "Gas and Chemical Systems (GCS) Systems Engineer",
      "job_category": "Engineering",
      "job_class": "Systems Engineer",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Systems Engineering",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Data Manipulation (SQL, Pandas/Numpy)",
      "experience": 5
    },
    {
      "skill": "Industrial Communication Networks",
      "experience": 5
    },
    {
      "skill": "Programming (JavaScript, C#, Python)",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "System Testing and Commissioning",
      "experience": 5
    },
    {
      "skill": "Process Gas and Chemical Systems",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Comprehensively own, maintain, support, implement, and improve specialty and bulk gas and chemical Management and Monitoring Systems."
    },
    {
      "duty": "Review vendor software proposals, engineering support systems, and coordinate Systems implementations and changes for a large set of newly installed equipment."
    },
    {
      "duty": "Interact with on-site Equipment Engineering teams and Operations & Maintenance Technician teams to support Control Systems for Chemical, Gas, and Slurry operations."
    },
    {
      "duty": "Provide expertise and ownership for GCS Systems and improvements, interacting with operations teams, construction teams, and equipment vendors."
    },
    {
      "duty": "Effectively communicate and coordinate with Engineers and Technicians to provide technical support, system issue resolution, and collaboration for improved safety, quality, and system reliability."
    },
    {
      "duty": "Develop innovative projects to improve the reliability and operation of Samsung & GCS systems, and develop site standards and training material to specify GCS Systems requirements."
    },
    {
      "duty": "Evaluate process requirements and specifications of new Systems as they relate to GCS operations and maintenance, act as the visionary for GCS Systems, and coordinate with Korean HQ to ensure alignment and knowledge sharing with the parent organization."
    },
    {
      "duty": "Support the installation and commissioning process for setting up new Systems and incorporating new equipment into GCS systems, communicate technical information within the department through presentations, and work on 1st shift."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree in Computer Science, Computer Engineering, Industrial Engineering, Electrical Engineering or related technical field. Minimum of 5 years of System Development or Systems Engineering experience in an industrial manufacturing environment."
    }
  ]
}