{
  "meta": [
    {
      "job_title": "Senior Procurement Manager",
      "job_category": "Procurement",
      "job_class": "Manager",
      "sector": "Procurement",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Procurement Strategy",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Cost Management",
      "experience": 5
    },
    {
      "skill": "Vendor Negotiation",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Strategic Sourcing",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Supplier Relationship Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Technology Adoption",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops raw material strategies that support Company's business objectives and deliver reliable, cost-effective outcomes to customers, both internal and external."
    },
    {
      "duty": "Builds and leads relationships with key partners including paper, and other raw materials."
    },
    {
      "duty": "Works with Finance to identify key cost saving opportunities, develops initiatives and objectives for these opportunities, and executes a strategy to realize such savings."
    },
    {
      "duty": "Identifies and enhances the current estimating process to enable a single source program for processing estimates so that all Company's facilities can produce pricing for each other remotely."
    },
    {
      "duty": "Enables the training and implementation for estimating improvements for ongoing growth and equipment including workflow adjustments. Is this consistent with the company pricing strategy?"
    },
    {
      "duty": "Establishes strategic service models with partners, negotiating competitive volume and contractual rates for all Company's facilities."
    },
    {
      "duty": "Identifies and enhances the current outsourcing process to gain leverage from combined volumes from all Company's facilities and establish preferred vendor lists with contracts."
    },
    {
      "duty": "Drives continuous improvement in cost, quality, and service options."
    },
    {
      "duty": "Leads the deployment, management, and adoption of technology including managing Company processes via PrintStream."
    },
    {
      "duty": "Establish measurable KPI's, create, and maintain data and reporting tools to properly represent department performance and improvement."
    },
    {
      "duty": "Oversees development, monitoring, and reporting of department budget."
    },
    {
      "duty": "Identifies and implements best practice approaches to improve all aspects of the planning, ensuring the company has a service and cost advantage."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Procurement or related field of study or an equivalent level of experience in a manufacturing related industry. Prefer experience in a procurement and estimating leadership role within the direct mail marketing/print industry."
    }
  ]
}