{
  "meta": [
    {
      "job_title": "Product Manager",
      "job_category": "Product Management",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Product Lifecycle Management",
      "experience": 5
    },
    {
      "skill": "Customer-Centric Strategy",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "User Testing/Prototyping",
      "experience": 5
    },
    {
      "skill": "Agile Software Development",
      "experience": 5
    },
    {
      "skill": "Business Intelligence/Analytics",
      "experience": 5
    },
    {
      "skill": "GTM Strategies",
      "experience": 5
    },
    {
      "skill": "Written and Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Agile Certification",
      "experience": 0
    },
    {
      "skill": "Pragmatic Marketing Certification",
      "experience": 0
    },
    {
      "skill": "Project Management Certification",
      "experience": 0
    },
    {
      "skill": "Scrum Master Certification",
      "experience": 0
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct opportunity assessments and market analysis for the product portfolio to support retention, organic growth, and cross-sell opportunities."
    },
    {
      "duty": "Be the lead advisor for the product portfolio and drive recommendations for the product lifecycle planning process."
    },
    {
      "duty": "Own the ideation and planning of user discovery activities to define business problems and test/validate solutions."
    },
    {
      "duty": "Lead analysis projects leveraging necessary data to transform findings into actionable information – ultimately feeding into strategic business planning."
    },
    {
      "duty": "Understand customer trends and be personally accountable for building in the voice of the customer throughout the product lifecycle."
    },
    {
      "duty": "Define, recruit for, and execute early adopter programs."
    },
    {
      "duty": "Support the transition from one lifecycle stage to the next by leading fit/gap analysis, migration planning, end of life planning, etc."
    },
    {
      "duty": "Serve as a subject matter expert and product spokesperson for the product portfolio."
    },
    {
      "duty": "Establish key performance indicators across the product portfolio to measure different objectives throughout the product lifecycle."
    },
    {
      "duty": "Support the go-to-market activities focused on achieving identified outcomes for the product, such as win/loss analysis, roadmap planning, competitive analysis, pricing/packaging, and product launches."
    },
    {
      "duty": "Demonstrate an ability to prioritize across different focus areas of the roadmap to a release level, weighing the overall capacity of an engineering team and the ability to deliver against product priorities."
    },
    {
      "duty": "Work directly with Agile development teams to create, design, refine, groom, and complete work tickets that produce high-quality software."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a technical, human factors, or business field (Master's preferred)"
    },
    {
      "credential": "Agile, Pragmatic Marketing, Project Management, Scrum Master certifications are preferred"
    }
  ]
}