{
  "meta": [
    {
      "job_title": "Director of Finance and Accounting",
      "job_category": "Finance",
      "job_class": "Director",
      "sector": "Finance",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 7
    },
    {
      "skill": "Accounting Principles",
      "experience": 7
    },
    {
      "skill": "Tax Compliance",
      "experience": 7
    },
    {
      "skill": "Budgeting",
      "experience": 7
    },
    {
      "skill": "Financial Reporting",
      "experience": 7
    },
    {
      "skill": "Continuous Improvement",
      "experience": 7
    },
    {
      "skill": "GAAP",
      "experience": 7
    },
    {
      "skill": "Payroll Management",
      "experience": 7
    },
    {
      "skill": "YE Tax Filings",
      "experience": 7
    },
    {
      "skill": "Bookkeeping",
      "experience": 7
    },
    {
      "skill": "MS Excel",
      "experience": 7
    },
    {
      "skill": "Yardi/Real Page/PMS",
      "experience": 7
    },
    {
      "skill": "CPA/CMA Certification",
      "experience": 7
    },
    {
      "skill": "ERP Systems",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage all financial responsibilities for upcoming real estate developed communities utilizing cash and accrual accounting principles to prepare financial statements, reports, and implement and maintain internal financial controls and procedures."
    },
    {
      "duty": "Coordinate with department leaders related to the company’s manufacturing efforts, sourcing, procurement budgeting and forecasting, and implementing the financial procedures related to the company’s ongoing efforts."
    },
    {
      "duty": "Coordinate and maintain relationships with vendors, suppliers, insurance companies, banks, and worker compensation carrier."
    },
    {
      "duty": "Assist in the preparation of monthly, quarterly, and annual financial statements, budgets, and projections."
    },
    {
      "duty": "Assist Company tax advisors and personnel with compliance with state and federal regulations and tax preparations and filings."
    },
    {
      "duty": "Recommend improvements to financial processes and systems and stay updated with industry trends and best practices in bookkeeping, especially in construction, real estate, and property management sectors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Accounting, Finance, or related field (Master’s preferred)"
    },
    {
      "credential": "CPA or CMA certification preferred, but not necessarily required"
    },
    {
      "credential": "Proficient in financial systems and tools, including ERP systems, Microsoft Office suite, and financial reporting software"
    }
  ]
}