{
  "meta": [
    {
      "job_title": "Network Manager",
      "job_category": "Information Technology",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 125000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage, review, analyze and recommend plans for the installation, expanding and/or modifying of the Department of Human Services voice and data network systems."
    },
    {
      "duty": "Manage the general administration and operation of security access appliances (firewalls) providing access to Department of Human Services network servers and applications."
    },
    {
      "duty": "Manage staff experts and vendor consultants in WAN routing, data communications systems and protocols, firewall security, and various other LAN-WAN hardware, software and related services."
    },
    {
      "duty": "Manage the provision of specialized telecommunications circuits for the transmission of voice/data throughout the Department of Human Services."
    },
    {
      "duty": "Manage the development, implementation, and operation of data center networks for the Department of Human Services."
    },
    {
      "duty": "Manage the development, implementation, operation, and quality control of network monitoring and measurement systems."
    },
    {
      "duty": "Research replacements/upgrades to network voice/data communications equipment, obtain proposals from vendors to evaluate the cost of new equipment, and attend product demonstrations in order to prepare functional comparisons."
    },
    {
      "duty": "Manage staff training programs designed to enhance skills and knowledge."
    },
    {
      "duty": "Approve recommendations regarding the need for software and equipment replacement and initiate actions to reduce the costs of production."
    }
  ],
  "skills": [
    {
      "skill": "Network Architecture",
      "experience": 8
    },
    {
      "skill": "Infrastructure Design",
      "experience": 8
    },
    {
      "skill": "Information Systems Leadership",
      "experience": 8
    },
    {
      "skill": "Network Hardware",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Wireless Access Points",
      "experience": 5
    },
    {
      "skill": "Network Experience",
      "experience": 5
    },
    {
      "skill": "Technical Proficiency",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {}
  ]
}