{
  "meta": [
    {
      "job_title": "Inside Sales Representative (Event-Focused)",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Lead Generation",
      "experience": 3
    },
    {
      "skill": "Account Management",
      "experience": 3
    },
    {
      "skill": "Outbound Prospecting",
      "experience": 3
    },
    {
      "skill": "Stakeholder Management",
      "experience": 3
    },
    {
      "skill": "Negotiation",
      "experience": 3
    },
    {
      "skill": "Event Planning",
      "experience": 2
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 3
    },
    {
      "skill": "Presentation Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify qualified prospects and navigate company structures to identify decision-makers."
    },
    {
      "duty": "Generate appointments by means of proactive outbound prospecting and nurture leads through various outreach mechanisms."
    },
    {
      "duty": "Work closely with the Field Marketing team to identify various events, build a strategy for engagement, and demonstrate Whatfix capabilities."
    },
    {
      "duty": "Manage relationships with CXOs and top executives at various events, demonstrating the Whatfix demo to prospective customers and conveying the value and ROI."
    },
    {
      "duty": "Tie up leads that will turn into business through persistence and teach strong selling and influencing skills."
    },
    {
      "duty": "Serve as a brand ambassador for Whatfix, showcasing solutions and fostering valuable connections at physical and virtual events."
    },
    {
      "duty": "Engage event attendees in meaningful conversations, skillfully qualifying leads and driving traffic to maximize booth presence."
    },
    {
      "duty": "Coordinate with remote teams to streamline lead management and provide valuable insights to optimize lead generation strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "3-5 years prior new business sales experience in SaaS"
    }
  ]
}