{
  "meta": [
    {
      "job_title": "Clinical Project Manager",
      "job_category": "Healthcare",
      "job_class": "Project Manager",
      "sector": "Clinical Research",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Clinical Study Management",
      "experience": 5
    },
    {
      "skill": "Good Clinical Research Practice (GCP)",
      "experience": 5
    },
    {
      "skill": "In Vitro Diagnostics",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage clinical studies, including protocol development, CRF development, budget/contract negotiation, and regulatory document management."
    },
    {
      "duty": "Design, initiate, and coordinate in vitro diagnostic studies to collect data to support regulatory submissions and for use in future product development."
    },
    {
      "duty": "Take responsibility of ensuring the execution of clinical studies with the goal of adhering to target timelines, budget, and quality."
    },
    {
      "duty": "Conduct and/or assist clinical teammates with on-site visits, including qualifications through close-outs; training clinical sites on implementation and conduct of study protocols."
    },
    {
      "duty": "Monitor conduct/compliance of clinical studies as related to GCP, SOPs, and regulatory requirements, utilizing knowledge of the diagnostic area sufficient to perform source data verification."
    },
    {
      "duty": "Assist clinical sites with IRB submission/documentation, as needed."
    },
    {
      "duty": "Proactively anticipate and identify issues; implement solutions, propose corrective actions in areas relevant to the role."
    },
    {
      "duty": "Evaluate and communicate the impact of risks, develop project quality and risk management plans for performance."
    },
    {
      "duty": "Manage staff and overcome challenges to ensure proper monitoring of studies and completion of project deliverables in accordance with project plan."
    },
    {
      "duty": "Manage cross-functional project team including protocol development team, regulatory team, physicians/investigators, study coordinators, study nurses, study recruiters, clinical research managers, and research associate."
    },
    {
      "duty": "Assist in identification, evaluation, and selection of investigative sites."
    },
    {
      "duty": "Provide leadership to develop new study-related documents, including protocols and SOPs, Informed Consents, and programming of eCRF."
    },
    {
      "duty": "Communicate the status of the projects on a regular basis to the sponsors, principal investigator, and stakeholder teams using graphic illustrations and concise report."
    },
    {
      "duty": "Ensure the scientific integrity of clinical studies and oversee clinical and research laboratory data QA/QC processes at the clinical trial sites."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Clinical Research, Health Sciences, or a related field (Master's preferred)"
    }
  ]
}