{
  "meta": [
    {
      "job_title": "Data Analyst",
      "job_category": "Data Analysis",
      "job_class": "Analyst",
      "sector": "Data Analysis",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Excel",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "Power BI",
      "experience": 5
    },
    {
      "skill": "Python",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Visualization Tools",
      "experience": 5
    },
    {
      "skill": "Modelling Software",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Analyses business data, trends, and recommends business action to enhance, modify, or create new business strategy."
    },
    {
      "duty": "Conducts business data analysis, using appropriate methods of data collection, modeling, visualization, problem solving, and analytical models."
    },
    {
      "duty": "Analyses transactional data and recommends business action to further sales and profitability objectives."
    },
    {
      "duty": "Create deep dive analyses to study key area trends and opportunities to take action that drive customer satisfaction and business improvements."
    },
    {
      "duty": "Run ad-hoc analyses to identify and recommend innovative options to drive business strategy, using data visualization, modeling tools/software, and programming languages like Tableau, Power BI, Oracle Analytics, Python, Power Query, Alteryx, Power Excel."
    },
    {
      "duty": "Research to identify industry trends and best practices. Evaluate key area trends and developing/implementing innovative programs/improvements. Analyze performance against banner, group and departmental objectives."
    },
    {
      "duty": "Monitors approved “Key Performance Indicators” (KPI’s) and identifying trends as well as suggest steps to improve results were warranted. Communicating KPI results on a weekly, monthly and quarterly basis to various departments in the organization and providing other ad hoc analytics as requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree in business, data science, math, or related field (Master’s Degree in Data Science considered an asset)"
    }
  ]
}