{
  "meta": [
    {
      "job_title": "Data Analyst",
      "job_category": "Information Technology",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 85000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for designing, developing, and maintaining interactive and visually appealing reports, dashboards, and data visualizations."
    },
    {
      "duty": "Collaborate with cross-functional teams to identify key business questions and define analytics requirements."
    },
    {
      "duty": "Gather, clean, validate, and transform large and complex datasets from various sources."
    },
    {
      "duty": "Develop and maintain data models, reports, dashboards, and visualization tools to provide insights to stakeholders."
    },
    {
      "duty": "Conduct in-depth data analysis to identify patterns, trends, and correlations that inform strategic business decisions."
    },
    {
      "duty": "Create and present comprehensive reports and presentations that effectively communicate analytical findings and recommendations to technical and non-technical stakeholders."
    },
    {
      "duty": "Monitor and evaluate data quality, integrity, and completeness, and ensure data accuracy and consistency."
    },
    {
      "duty": "Identify opportunities for process improvement and develop strategies to optimize business performance."
    },
    {
      "duty": "Stay current with industry trends, best practices, and emerging business intelligence and analytics technologies."
    },
    {
      "duty": "Collaborate with IT teams to optimize data infrastructure, implement data governance practices, and ensure data security."
    },
    {
      "duty": "Develop and implement efficient data models and relationships for accurate and timely reporting."
    },
    {
      "duty": "Generates standard and custom statistical and analytical reports as requested using the ERP system. Output report design can be Microsoft Excel, Power BI, SQL reports, or other relevant software programs."
    },
    {
      "duty": "Analyzes operational data and displays strong analytical and reasoning skills by leveraging reports to identify areas for operational improvements and efficiencies."
    },
    {
      "duty": "Experience in software application support analysis, modifications, enhancement, design, implementation, testing, validation, and troubleshooting."
    },
    {
      "duty": "Extract datasets from the data warehouse and other applications as necessary and conduct detailed research into data and performance changes identified in dashboard reports."
    },
    {
      "duty": "Ability to understand and create complex functions; ability to read/write technical documents, emails and great customer service skills and interest."
    },
    {
      "duty": "Experience working with production staff to identify, analyze, and document problems, software design deficiencies, or enhancements within the software."
    },
    {
      "duty": "Experience in Information Systems, accounting, and software development, with the manufacturing industry desirable."
    },
    {
      "duty": "Experience working closely with the infrastructure teams to ensure that the applications and interfaces are designed and implemented based on valid standards and in accordance with sound practice."
    },
    {
      "duty": "Ability to Identify and assist in resolving issues that arise within the department relating to the satisfactory operation of the software module(s) both during and after installation."
    },
    {
      "duty": "Automate the creation of reports to maximize the efficiency of the ERP software."
    },
    {
      "duty": "Experience working with vendor staff to identify process changes, software improvements, and hardware needs to maximize system efficiency."
    },
    {
      "duty": "Good time management skills. Experience balancing multiple projects simultaneously and responding to changing deadlines and priorities."
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "SQL Development",
      "experience": 3
    },
    {
      "skill": "Power BI Reporting",
      "experience": 3
    },
    {
      "skill": "Crystal Reports",
      "experience": 3
    },
    {
      "skill": "Microsoft BI Suite (Visual Studio, Power Query)",
      "experience": 3
    },
    {
      "skill": "Data Extraction, Transformation, and Loading (ETL) Processes",
      "experience": 3
    },
    {
      "skill": "Technical Writing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Five years of equivalent hands-on work experience and college-level coursework in computer science, information systems, or related fields. Proven experience as an Application SME or similar role, with a strong track record of delivering high-quality reports and dashboards. 3 to 5+ years of SQL development and experience working with relational databases. 3+ years of Power BI Reporting. 3+ Crystal Reports and Microsoft BI Suite (Visual Studio, Power Query). Familiarity with data extraction, transformation, and loading (ETL) processes and tools. Strong foundation in design and development. Microsoft Certification."
    }
  ]
}