{
  "meta": [
    {
      "job_title": "Junior AV and Media Technician",
      "job_category": "Information Technology",
      "job_class": "Technician",
      "sector": "Software Engineering",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the setup, maintenance, and troubleshooting of audiovisual equipment, including cameras, microphones, projectors, and video conferencing systems."
    },
    {
      "duty": "Perform routine maintenance, upgrades, and repairs on desktop computers, laptops, and peripheral devices."
    },
    {
      "duty": "Install, configure, and troubleshoot software applications to ensure optimal functionality."
    },
    {
      "duty": "Diagnose and resolve hardware and software issues through various communication channels."
    },
    {
      "duty": "Collaborate closely with team members to provide prompt technical solutions."
    },
    {
      "duty": "Maintain accurate records of technical issues, resolutions, and preventive maintenance."
    },
    {
      "duty": "Assist in managing hardware, software licenses, and spare parts inventory."
    },
    {
      "duty": "Contribute to the creation and update of technical documentation and user guides."
    },
    {
      "duty": "Provide on-site audiovisual support for college events, conferences, and classes."
    },
    {
      "duty": "Execute basic installation tasks, such as cable pulling, pre-wiring, and cable termination."
    },
    {
      "duty": "Assist in setting up equipment staging, including microphones, speakers, projectors, and AV control panels."
    },
    {
      "duty": "Troubleshoot basic audiovisual equipment issues."
    },
    {
      "duty": "Assist in preparing reports, logs, and documentation systems."
    },
    {
      "duty": "Stay up-to-date with emerging technologies and industry trends."
    },
    {
      "duty": "Participate in training sessions to enhance technical skills."
    }
  ],
  "skills": [
    {
      "skill": "Audiovisual Equipment Maintenance",
      "experience": 3
    },
    {
      "skill": "Desktop Maintenance",
      "experience": 3
    },
    {
      "skill": "Software Installation and Configuration",
      "experience": 3
    },
    {
      "skill": "Technical Troubleshooting",
      "experience": 3
    },
    {
      "skill": "Record-Keeping",
      "experience": 3
    },
    {
      "skill": "On-site Support",
      "experience": 3
    },
    {
      "skill": "Basic Installation Tasks",
      "experience": 3
    },
    {
      "skill": "Technical Documentation",
      "experience": 3
    },
    {
      "skill": "Emerging Technologies",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent; relevant technical certifications preferred"
    }
  ]
}