{
  "meta": [
    {
      "job_title": "Communications Specialist",
      "job_category": "Communications",
      "job_class": "Specialist",
      "sector": "Communication",
      "salary": 55000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Social Media Management",
      "experience": 5
    },
    {
      "skill": "Graphic Design",
      "experience": 5
    },
    {
      "skill": "Research Analysis",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Creativity",
      "experience": 5
    },
    {
      "skill": "Accountability",
      "experience": 5
    },
    {
      "skill": "Diversity and Inclusion",
      "experience": 5
    },
    {
      "skill": "Technology Proficiency",
      "experience": 5
    },
    {
      "skill": "Public Relations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement communication strategies to increase organizational visibility and support the sharing of information and resources."
    },
    {
      "duty": "Coordinate with staff and partners to create print, radio, and TV interviews and content for newsletters and other print materials."
    },
    {
      "duty": "Manage social media platforms, including Facebook, Instagram, Twitter, and blogs, and utilize emerging technologies for increased engagement."
    },
    {
      "duty": "Conduct research and critically analyze sources related to agriculture, conservation, and natural resources."
    },
    {
      "duty": "Juggle multiple tasks, prioritize, and meet deadlines effectively through strong time management skills."
    },
    {
      "duty": "Work with partners to produce educational and impactful resources, and document impact for reporting project deliverables."
    },
    {
      "duty": "Demonstrate a passion for diversity, equity, and inclusion, and build culturally sensitive relationships."
    },
    {
      "duty": "Utilize technology fluency for word processing, website development, graphic design, and spreadsheet software, including experience with specific platforms and software."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in agricultural communications, journalism, mass communications, marketing, sociology, public relations, biology, environmental studies, or related fields (Experience in journalism, broadcasting, local food systems, public relations, and/or marketing is a plus)"
    }
  ]
}