{
  "meta": [
    {
      "job_title": "Retail Account Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 65478,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Staff Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Conflict Management",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Customer Focus",
      "experience": 5
    },
    {
      "skill": "Motivating and Directing Others",
      "experience": 5
    },
    {
      "skill": "Drive for Results",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise the day to day security operations of an assigned client site"
    },
    {
      "duty": "Manage a team of security officers, site and/or shift supervisors including hiring/selection, scheduling, payroll, training, coaching, development and support"
    },
    {
      "duty": "Ensure the client site is provided with high-quality security services to protect people and property"
    },
    {
      "duty": "Build, improve and maintain effective relationships with both client and employees"
    },
    {
      "duty": "Coordinate necessary support services to effectively manage client site to meet or exceed financial and operational goals and provide quality customer service"
    },
    {
      "duty": "Ensure all required reporting and contract compliance requirements are met"
    },
    {
      "duty": "Assure regular communication of issues or program with Client"
    },
    {
      "duty": "Handle any escalated security issues or emergency situations appropriately"
    },
    {
      "duty": "Other management responsibilities as determined by Client or District Manager."
    },
    {
      "duty": "Communicate staffing needs via Requisition Form; assist recruiters in identifying, interviewing and hiring quality candidates."
    },
    {
      "duty": "Develop staff in both technical and professional skills through performance management (coaching, counseling, disciplining, MSO training, annual formal performance evaluations, recognition, etc.)"
    },
    {
      "duty": "Assure that employee grievances are heard and resolved (with help from appropriate support employees, as required) and that personnel records are updated and accurate (Change of Status forms, rosters, etc.)"
    },
    {
      "duty": "Assure communication of policies, company announcements and job openings through a consistently updated READ file at each site."
    },
    {
      "duty": "Meet all contractual scheduled hours with a minimum of unbilled overtime."
    },
    {
      "duty": "Coordinate and/or conduct site-specific OJT, client-specific training, and annual refresher training for security personnel, as well as meet Allied Universal’s corporate training standards."
    },
    {
      "duty": "Develop / maintain operational procedures so that a valid, site-specific OPM and post orders are always available for emergency reference by the security staff."
    },
    {
      "duty": "Manage uniforms, equipment, supplies and vehicles utilized at the account(s), maintaining appropriate inventories and maintenance checklists."
    },
    {
      "duty": "Take a proactive role in communicating with the client and meeting his needs; meet with regularly, listen to issues, provide security and technical expertise and solutions. Ensure complete customer satisfaction."
    },
    {
      "duty": "Capably utilize WinTeam for scheduling and billing, and to produce reports (such as Scheduling Activity, invoice Aging by tiers, Training Summary and Training Detail reports) that require interpretation and action for effective business management."
    },
    {
      "duty": "Enforce Allied Universal policies as outlined in the handbooks, executive memos and on the portal."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Four year degree in Criminal Justice, Business Administration or related field (Master's preferred)"
    }
  ]
}