{
  "meta": [
    {
      "job_title": "Family Law Attorney",
      "job_category": "Legal",
      "job_class": "Attorney",
      "sector": "Legal",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Research and develop case information, evidence, and settlement options."
    },
    {
      "duty": "Track cases and handle trial preparations with senior attorney."
    },
    {
      "duty": "Work with paralegals/legal assistants to execute case strategy and manage high level/high asset cases."
    },
    {
      "duty": "Keep cases on track with organized files; monitoring calendars; meeting deadlines; documenting actions; researching case law; inputting information into file database and case management software; confirming case status with support staff and communicating regularly with clients."
    },
    {
      "duty": "Examine legal data to determine advisability of defending lawsuit."
    },
    {
      "duty": "Document actions by completing forms, reports, logs, and records."
    },
    {
      "duty": "Communicate regularly with clients and maintain contact with people involved in the case; preparing for depositions; reviewing standard court documents; drafting letters; writing and reviewing discovery; dictating responses to opposing counsel; generating status reports."
    },
    {
      "duty": "Keep clients informed by maintaining contact; communicating case progress."
    },
    {
      "duty": "Prepare case summaries and materials for mediation conferences; preparing pleadings; monitoring discovery responses; organizing materials for team case review."
    },
    {
      "duty": "Organize evidence; preparing exhibits; scheduling witnesses; ensuring that witnesses are ready/prepared when needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Juris Doctor (J.D.) degree from an accredited law school"
    }
  ]
}