{
  "meta": [
    {
      "job_title": "Clinical Research Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for clinical study activities, coordination, adherence to protocols and serves as a liaison between study participants, Principal Investigator (PI), and other research staff."
    },
    {
      "duty": "General oversight of research portfolio as it pertains to the clinical coordination of the studies."
    },
    {
      "duty": "Collaborates with the team to create and communicate a plan of care that allows for safe and effective collection of clinical research data."
    },
    {
      "duty": "Facilitates and delivers the education of the interdisciplinary team on study requirements."
    },
    {
      "duty": "Coordinates research participant study visits and triage study participants by phone and provides clinical information to the study participants."
    },
    {
      "duty": "Recruits study participants and/or leads recruitment activities."
    },
    {
      "duty": "Completes and documents study participant enrollment, assessment/reassessment, education, and follow-up activities as well as coordinate study participant interventions as required and/or has oversight of the research activity."
    },
    {
      "duty": "Prepares data spreadsheets for PI and/or department and updates investigation binders and completes Case Report Forms."
    },
    {
      "duty": "May prepare IRB submissions, assist with data compilation, assist with grant proposals, publication preparation, and presentations."
    },
    {
      "duty": "May oversee grant activities post award through closure including, monitoring budgets, compliance, and progress reports."
    }
  ],
  "skills": [
    {
      "skill": "Research Coordination",
      "experience": 3
    },
    {
      "skill": "Clinical Nursing",
      "experience": 2
    },
    {
      "skill": "Clinical Research",
      "experience": 2
    },
    {
      "skill": "BLS (AHA)",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Nursing or a related field (Master's preferred)"
    }
  ]
}