{
  "meta": [
    {
      "job_title": "Project Manager - GIS & Data",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "IT and Business",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads the development of the overall approach for the project, its major time frames, and the definition of its major deliverables to address and meet the desired goals and outcomes."
    },
    {
      "duty": "Leads regular interactions with the executive sponsor to inform, alert, negotiate, and maintain a continuing good relationship and shared vision for the project outcome."
    },
    {
      "duty": "Establishes and ensures appropriate governance functions for the program in accordance with enterprise policies, practices, and on behalf of the executive sponsor or SRO (senior responsible owner)."
    },
    {
      "duty": "Directs the creation and maintenance of the required program documentation and artifacts."
    },
    {
      "duty": "Develops and controls the program budget and manages expenditures within agreed spending plans."
    },
    {
      "duty": "Ensures and balances the availability of the required skills and competencies across project teams within the program."
    },
    {
      "duty": "Leads reviews with the executive sponsor and stakeholders to identify organic or specific project needs and/or changes and directs the development of appropriate approaches to address."
    },
    {
      "duty": "Leads the development and maintenance of stakeholder mapping, communications, and reporting."
    },
    {
      "duty": "Acts as an advisor and builds and maintains relationships across the wider stakeholder community."
    },
    {
      "duty": "Leads the oversight of the project’s execution, their progress compared with the plan, and the production of agreed deliverables."
    },
    {
      "duty": "Monitors and coordinates dependencies across the project and resolves potential conflicts."
    },
    {
      "duty": "Directs or approves the establishment of framework/guidelines for the use of contractors and professional service providers and determines their use across the project."
    },
    {
      "duty": "Supports and facilitates agenda setting for project stakeholder meetings."
    }
  ],
  "skills": [
    {
      "skill": "IT",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Governance",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Strategy Planning",
      "experience": 5
    },
    {
      "skill": "Resource Management",
      "experience": 5
    },
    {
      "skill": "Technology Management",
      "experience": 5
    },
    {
      "skill": "Agile Methodology",
      "experience": 5
    },
    {
      "skill": "Financial Planning",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Project",
      "experience": 5
    },
    {
      "skill": "JIRA",
      "experience": 5
    },
    {
      "skill": "Digital Business",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s or master’s degree in IT, Business, or a related field (Master's preferred)"
    }
  ]
}