{
  "meta": [
    {
      "job_title": "Senior Program Financial Analyst",
      "job_category": "Financial Analysis",
      "job_class": "Senior Analyst",
      "sector": "Defense Industry",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 7
    },
    {
      "skill": "Compliance Management",
      "experience": 7
    },
    {
      "skill": "Negotiation",
      "experience": 7
    },
    {
      "skill": "Business Relationship Management",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Budgeting",
      "experience": 7
    },
    {
      "skill": "Government Compliance",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "IT and ERP Systems",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide critical financial leadership and analysis to ensure compliance and accurate cost assessments."
    },
    {
      "duty": "Champion negotiation, advocacy, and goal alignment across internal and external stakeholders."
    },
    {
      "duty": "Maintain effective business relationships with government, industry primes, and foreign customers."
    },
    {
      "duty": "Navigate complex analytical studies, monitor trends, and translate results into actionable insights."
    },
    {
      "duty": "Provide essential support for government compliance, audits, and financial reporting."
    },
    {
      "duty": "Grasp contract design and structure, including competitive and sole source procurements."
    },
    {
      "duty": "Contribute to acquisition planning strategies and proposal preparations, including cost estimating and risk mitigation."
    },
    {
      "duty": "Lead in program and finance management, touching areas such as budgeting, cost analysis, earned value management, and risk management."
    },
    {
      "duty": "Uphold the organization's mission, values, and culture while driving the use of IT and ERP systems."
    },
    {
      "duty": "Deliver claims and litigation support, contributing to the organization's overall business operations knowledge."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Finance, Accounting, or a related field (Master's preferred)"
    }
  ]
}