{
  "meta": [
    {
      "job_title": "Lean and Six Sigma Specialist",
      "job_category": "Manufacturing",
      "job_class": "Specialist",
      "sector": "Manufacturing",
      "salary": 90000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide expert guidance to clients in the development, implementation, and improvement of manufacturing operations systems using lean and six sigma thinking, principles, and techniques."
    },
    {
      "duty": "Foster enhancement of the client's operational processes by spearheading strategic initiatives aimed at amplifying manufacturing's incremental productivity commitments and fostering a culture of operational excellence."
    },
    {
      "duty": "Lead the development and hands-on practical implementation of Lean Enterprise methodologies and educational endeavors."
    },
    {
      "duty": "Assume the role of a leader for training and coaching team members, ensuring uniformity and adherence to prescribed methods, workshops, or projects."
    },
    {
      "duty": "Introduce and bolster the adoption of novel tools within designated domains."
    },
    {
      "duty": "Cultivate a problem-solving ethos and possess the capability to train and facilitate the resolution of both simple and intricate issues."
    },
    {
      "duty": "Champion transformative endeavors, driving continuous process improvement within manufacturing and transactional spheres."
    },
    {
      "duty": "Function as a subject matter expert in Lean practices, offering coaching and guidance, while orchestrating teams to attain their continuous improvement objectives."
    },
    {
      "duty": "Display leadership by challenging conventional wisdom, establishing and overseeing metrics and gauges, and cultivating a workforce well-versed in the application of Lean tools and techniques."
    },
    {
      "duty": "Evaluate and propose projects/programs that present avenues for advancements in pivotal measurement areas (Safety, Quality, Delivery, and Cost), with the aim of realizing projected outcomes."
    },
    {
      "duty": "Skillfully manage multiple projects amid evolving priorities and targets."
    }
  ],
  "skills": [
    {
      "skill": "Lean Thinking",
      "experience": 5
    },
    {
      "skill": "Six Sigma Methodology",
      "experience": 5
    },
    {
      "skill": "Operational Excellence",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Training and Coaching",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Metrics and Measurement",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Continuous Improvement",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Manufacturing, Engineering, Business, or a related field (Master's preferred)"
    }
  ]
}