{
  "meta": [
    {
      "job_title": "Senior Project Manager, HC Technology",
      "job_category": "Project Management",
      "job_class": "Senior Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "PeopleSoft HCM",
      "experience": 5
    },
    {
      "skill": "HR Technology Implementation",
      "experience": 5
    },
    {
      "skill": "Business Transformation",
      "experience": 5
    },
    {
      "skill": "Certification/Licensure",
      "experience": 5
    },
    {
      "skill": "Medical Examination",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Business Process Improvement",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Initiate, control, and oversee HC Technology business transformation and upgrade initiatives."
    },
    {
      "duty": "Lead major HC systems projects, process design, and HC systems configuration."
    },
    {
      "duty": "Work with HC, IT, and business sponsors to determine and coordinate the project lifecycle, create project scope, estimate costs, define project schedule, and assign tasks."
    },
    {
      "duty": "Evaluate business scope/objectives, assess impacts, and develop cost-effective solutions in collaboration with IT."
    },
    {
      "duty": "Manage multiple projects, link projects to business initiatives, ensure adherence to project management standards, and assume ultimate responsibility for project success."
    },
    {
      "duty": "Consult with Project Sponsors, develop business requirements documents, project charters, work breakdown structures, project schedules, and risk management plans."
    },
    {
      "duty": "Coordinate and facilitate project team meetings, gather status input, escalate issues, and maintain project documentation for future reference and audit requirements."
    },
    {
      "duty": "Facilitate post-implementation reviews, lessons learned exercises, and project closure activities."
    },
    {
      "duty": "Provide PeopleSoft HCM subject matter expertise, critique business process and system enhancements, and provide input on department goals and objectives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Human Resources, Business Administration, Computer Science, or a related field. In lieu of a Bachelor’s Degree, four (4) years of managing projects and HR Technology implementations experience."
    },
    {
      "credential": "Project Management Professional"
    },
    {
      "credential": "Human Resources Information Professional"
    }
  ]
}