{
  "meta": [
    {
      "job_title": "Accounts Payable Specialist",
      "job_category": "Finance",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Accounts Payable",
      "experience": 3
    },
    {
      "skill": "Financial Analysis",
      "experience": 2
    },
    {
      "skill": "Accounting Software (e.g. QuickBooks)",
      "experience": 3
    },
    {
      "skill": "Microsoft Excel",
      "experience": 3
    },
    {
      "skill": "Vendor Communication",
      "experience": 3
    },
    {
      "skill": "Statement Reconciliation",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    },
    {
      "skill": "Analytical Thinking",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish and nurture positive relationships with vendors, fostering effective communication and timely payment resolution."
    },
    {
      "duty": "Verify the accuracy of invoices, purchase orders, and payment requests. Accurately input and code invoices into the accounting system for processing."
    },
    {
      "duty": "Perform thorough reconciliation of vendor statements against accounts payable records to ensure accuracy and resolve discrepancies."
    },
    {
      "duty": "Maintain organized and detailed records of all accounts payable transactions and related documents. Ensure compliance with document retention policies and financial regulations."
    },
    {
      "duty": "Continuously evaluate accounts payable processes and identify opportunities for efficiency enhancements. Propose and implement process improvements to streamline workflows and reduce errors."
    },
    {
      "duty": "Gather and consolidate various operational overhead accounts, such as utilities, vehicle payments, and general operating expenses. Implement strategies to centralize and streamline the processing of operational overhead accounts."
    },
    {
      "duty": "Analyze operational expenses to identify trends and areas for cost-saving opportunities. Collaborate with the finance team to provide insights on expense management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent; Associate's degree or relevant certification preferred."
    }
  ]
}