{
  "meta": [
    {
      "job_title": "Sr. IT Technologist - SAP Tester",
      "job_category": "IT",
      "job_class": "Technologist",
      "sector": "IT",
      "salary": 85000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for preparing test scripts, developing new test cases, executing scripts, and preparing test reports."
    },
    {
      "duty": "Completing all steps of the MSCM, including interpretation of functional requirements and confirming requirements with functional business analysts."
    },
    {
      "duty": "Assisting in unit, integration, performance, and user acceptance testing."
    },
    {
      "duty": "Successfully resolving issues within defined service levels, isolating issues, determining root cause, and outlining effective options to resolve issues."
    },
    {
      "duty": "Interacting with colleagues and business partners to confirm requirements, as well as ensure solution meets needs."
    },
    {
      "duty": "Creating & updating appropriate documentation."
    },
    {
      "duty": "Utilizing applicable tools to facilitate adequate systems testing, monitoring & troubleshooting."
    },
    {
      "duty": "Contributing to identifying and implementing continuous improvement concepts to increase efficiency and maximize value to clients."
    },
    {
      "duty": "Maintaining a broad understanding of current testing software technologies."
    },
    {
      "duty": "Working independently to estimate, design, and deliver solutions."
    },
    {
      "duty": "Maintaining a productive relationship with Stakeholders, Process Owners, Technical and Functional Peers through effective communications and collaboration."
    },
    {
      "duty": "Developing and maintaining a strong practical understanding of technologies currently deployed within the department."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in IT or related field"
    }
  ]
}