{
  "meta": [
    {
      "job_title": "Senior IT Project Manager",
      "job_category": "IT",
      "job_class": "Manager",
      "sector": "IT",
      "salary": 125000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage project schedule - create long and short-term plans, set targets for milestones, and adhere to deadlines."
    },
    {
      "duty": "Manage action items - identify, prioritize, assign, monitor, and control action items throughout all phases of the project."
    },
    {
      "duty": "Manage budget - monitor time tracking, track actual project costs compared to planned budget, and define action items to manage variances."
    },
    {
      "duty": "Manage change requests - identify, manage, and facilitate change control decisions to client contract terms and/or project deliverables that have been signed off and placed under change control."
    },
    {
      "duty": "Manage decisions - manage day-to-day project decisions and evaluate formal decisions with significant impact on project outcomes."
    },
    {
      "duty": "Manage issues - identify, prioritize, assign, monitor, and close issues through all project phases."
    },
    {
      "duty": "Manage project staff - changes to the project team as they roll on and off the project."
    },
    {
      "duty": "Manage project status - generate metrics needed for project status, deliver project status information and guidance to the project team."
    },
    {
      "duty": "Manage risks and dependencies - avoid, mitigate, or minimize negative impacts to the project if realized."
    },
    {
      "duty": "Project Governance - establish and maintain appropriate Project Management governance, aligned to existing standards within the company."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Business Planning and Implementation",
      "experience": 5
    },
    {
      "skill": "Information Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Business, Information Technology, or related field and 7 plus years of relevant experience, or equivalent combination of education and experience."
    },
    {
      "credential": "Working knowledge in Process Design and Information Technology."
    },
    {
      "credential": "Participation in complex change programs a plus."
    },
    {
      "credential": "Strong leadership, motivational, and project delivery skills."
    },
    {
      "credential": "Demonstrable track record of delivering IT projects on time and on budget."
    }
  ]
}