{
  "meta": [
    {
      "job_title": "Accounting Associate",
      "job_category": "Accounting",
      "job_class": "Associate",
      "sector": "Corporate",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Computer-oriented Accounting",
      "experience": 1
    },
    {
      "skill": "Accounts Payable Processing",
      "experience": 1
    },
    {
      "skill": "Accounts Receivable Processing",
      "experience": 1
    },
    {
      "skill": "Data Entry",
      "experience": 1
    },
    {
      "skill": "Microsoft Office",
      "experience": 1
    },
    {
      "skill": "Excel",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Draft client invoices, prepare all required invoice supporting documents, and verify for completeness and compliance with financial policies and procedures."
    },
    {
      "duty": "Process project manager edits of invoices and generate invoices for mailing or entry into client electronic invoice payment systems."
    },
    {
      "duty": "Set up new projects and new schedule of rates in accounting system in a timely manner."
    },
    {
      "duty": "Edit projects as requested by Project Managers."
    },
    {
      "duty": "Close projects."
    },
    {
      "duty": "Record time adjustments as requested."
    },
    {
      "duty": "Process monthly past due statements and follow up with collection calls."
    },
    {
      "duty": "Interact with clients, vendors, and various departments for information and problem resolution."
    },
    {
      "duty": "Prepare and issue weekly management and project status reports."
    },
    {
      "duty": "Support Accounting department in a variety of clerical accounting functions such as compiling and sorting documents, calculating and/or verifying amounts, posting transactions, and filing and maintaining accounting records."
    },
    {
      "duty": "Assist with annual audits."
    },
    {
      "duty": "Serve as back up to other accounting functions such as accounts payable, accounts receivable, and payroll."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or the equivalent, college level accounting credit preferred."
    }
  ]
}