{
  "meta": [
    {
      "job_title": "People and Operations Associate",
      "job_category": "HR",
      "job_class": "Associate",
      "sector": "HR",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Written, Verbal, & Interpersonal Communication",
      "experience": 2
    },
    {
      "skill": "Problem Solving",
      "experience": 2
    },
    {
      "skill": "Critical Thinking",
      "experience": 2
    },
    {
      "skill": "Planning Skills",
      "experience": 2
    },
    {
      "skill": "Time Management",
      "experience": 2
    },
    {
      "skill": "Attention to Detail",
      "experience": 2
    },
    {
      "skill": "Decision Making",
      "experience": 2
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Teaching",
      "experience": 3
    },
    {
      "skill": "Microsoft Suite",
      "experience": 3
    },
    {
      "skill": "Business Standards",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Training Plans",
      "experience": 3
    },
    {
      "skill": "Organizational Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure the efficient and effective functioning of the People and Operations department, including overseeing daily tasks, coordinating with other departments, and providing administrative support."
    },
    {
      "duty": "Manage the revenue-generating DEI (Diversity, Equity, and Inclusion) B2B training program."
    },
    {
      "duty": "Monitor and analyze operational performance, ensuring compliance with all applicable laws and regulations."
    },
    {
      "duty": "Maintain accurate records of operations activities and identify and resolve operational issues promptly."
    },
    {
      "duty": "Provide support to other departments as needed and develop and maintain relationships with vendors and suppliers."
    },
    {
      "duty": "Manage inventory levels and ordering process and perform benefits administration, new hires, terminations, and employee change requests."
    },
    {
      "duty": "Administer leave programs, including FMLA, WC, and STD, and support employees on fundamental employee relations questions and inquiries regarding policies and procedures."
    },
    {
      "duty": "Consult with management, providing HR guidance as needed, and oversee training programs that include web-based seminars, printed manuals, group sessions, training videos, and more."
    },
    {
      "duty": "Determine training needs and requirements for an organization or group by meeting with managers and organizations, review existing training materials to determine appropriateness and relevance, and modify or create course materials and training manuals to meet specific training needs."
    },
    {
      "duty": "Monitor training programs and manuals to ensure they are practical and up-to-date and make updates as necessary, and maintain an understanding of new educational and training techniques and methods."
    },
    {
      "duty": "Specialize in a particular industry and keep current on the activities and needs of that industry by attending regular meetings, conferences, and seminars."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in education, human resources, or a related field is preferred. Instructional experience in a group business/non-profit setting is required."
    }
  ]
}