{
  "meta": [
    {
      "job_title": "ANAPLAN Consultant",
      "job_category": "Computer/IT Analyst",
      "job_class": "Consultant",
      "sector": "IT",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Hands on Modelling experience in ANAPLAN projects, including implementations, upgrades, rollouts, and/or support."
    },
    {
      "duty": "Design and build Anaplan models and modules to address business planning and forecasting requirements."
    },
    {
      "duty": "Develop complex calculations, data imports, exports, and integration workflows while adhering to Anaplan best practices."
    },
    {
      "duty": "Translate existing solutions, spreadsheets, and business problems into sophisticated Anaplan multi-dimensional models."
    },
    {
      "duty": "Performing data integration between external systems like SAP ECC, S/4HANA, Workday, SAP BW, BPC, and Anaplan."
    },
    {
      "duty": "Monitoring data flows to and from internal systems to ensure all data is up-to-date and accurate."
    },
    {
      "duty": "Continuing to develop & keep Anaplan current as they provide new releases across the platform."
    },
    {
      "duty": "Supporting the design and gathering of business requirements for enhancements in the Anaplan models."
    },
    {
      "duty": "Owns configuration and maintenance of centralized models and Data Hub."
    },
    {
      "duty": "Anaplan security design based on the workspace, model, module, etc."
    },
    {
      "duty": "Space management, archival of data in Anaplan, and best practices around it."
    },
    {
      "duty": "Experience in Enterprise Financial Planning software."
    },
    {
      "duty": "Experience in Guiding & providing Training to End Users around ANAPLAN- software solutions."
    },
    {
      "duty": "Application of systems analysis techniques and procedures, including consulting with users, to determine hardware, software, or system functional specifications."
    },
    {
      "duty": "Design, development, documentation, analysis, creation, testing, or modification of computer systems or programs in Financial Planning software."
    }
  ],
  "skills": [
    {
      "skill": "ANAPLAN Modelling",
      "experience": 10
    },
    {
      "skill": "Data Integration",
      "experience": 8
    },
    {
      "skill": "SAP Integration",
      "experience": 7
    },
    {
      "skill": "Financial Planning Software",
      "experience": 10
    },
    {
      "skill": "Systems Analysis",
      "experience": 8
    },
    {
      "skill": "Training and Development",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 90,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, IT, or related field (Master's preferred)"
    },
    {
      "credential": "Specialized knowledge and certification in ANAPLAN"
    }
  ]
}