{
  "meta": [
    {
      "job_title": "BI Manager",
      "job_category": "IT",
      "job_class": "Manager",
      "sector": "IT",
      "salary": 143397,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Management",
      "experience": 15
    },
    {
      "skill": "Analytics",
      "experience": 15
    },
    {
      "skill": "Business Intelligence",
      "experience": 15
    },
    {
      "skill": "SQL",
      "experience": 15
    },
    {
      "skill": "M&A Integration",
      "experience": 10
    },
    {
      "skill": "SPC LOB Technology Initiatives",
      "experience": 10
    },
    {
      "skill": "MS PowerBI Analytical platform",
      "experience": 15
    },
    {
      "skill": "Strategic Thinking",
      "experience": 15
    },
    {
      "skill": "Leadership",
      "experience": 15
    },
    {
      "skill": "MS SQL Server",
      "experience": 15
    },
    {
      "skill": "Data Reporting",
      "experience": 15
    },
    {
      "skill": "Data Quality Assurance",
      "experience": 15
    },
    {
      "skill": "Problem Solving",
      "experience": 15
    },
    {
      "skill": "Project Management",
      "experience": 15
    },
    {
      "skill": "Collaboration",
      "experience": 15
    },
    {
      "skill": "Communication",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage a team of BI professionals and oversee their development, growth, and performance."
    },
    {
      "duty": "Partner with stakeholders, process specialists, business, and IT Data Warehouse Team to elicit and document business requirements for new reports."
    },
    {
      "duty": "Translates data results into written reports, tables, graphs, and charts to convey information to management."
    },
    {
      "duty": "Design, develop, and maintain reports and analytical tools. Perform quality assurance against new reports or other team member reports."
    },
    {
      "duty": "Perform ongoing monitoring and refinement of reports and provide technical support for existing reports, dashboards, or other tools."
    },
    {
      "duty": "Create ad hoc reports and views on a frequent basis to assist management in understanding, researching, and analyzing issues."
    },
    {
      "duty": "Teach and advocate the use of business intelligence tools across levels of the organization and handle Data Warehouse help desk tickets as assigned."
    },
    {
      "duty": "Participate in due diligence and evaluation of systems and developing integration timeline and communications."
    },
    {
      "duty": "Participate in cross-organizational teams to develop solutions meeting the needs of SP&C."
    },
    {
      "duty": "Manage BI Analyst progress on reports, as assigned and perform other duties as assigned. Some travel may be required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 30,
      "introvert_extrovert": 125
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in data analytics, data science, computer science, management information systems, finance, statistics, or related field required; MBA or post-graduate degree preferred."
    }
  ]
}