{
  "meta": [
    {
      "job_title": "Senior Operations Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Distribution",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead an inbound and outbound operation at the Distribution Center, overseeing the activities of warehouse workers and ensuring compliance with safety programs and OSHA regulations."
    },
    {
      "duty": "Develop, engage, and supervise a team of frontline supervisors and hourly associates, providing mentoring, training, and career progression guidance."
    },
    {
      "duty": "Identify and lead process improvement initiatives, review productivity requirements, and evaluate performance objectives and metrics to assess productivity requirements."
    },
    {
      "duty": "Monitor staffing levels, communicate procedures with associates and management, and enforce company policies while counseling associates in work-related activities and career development."
    },
    {
      "duty": "Lead and monitor the development strategy for all direct salary reports, and ensure accurate loading of stock into delivery vehicles with necessary documents."
    },
    {
      "duty": "Prepare reports for the Distribution Center Director."
    }
  ],
  "skills": [
    {
      "skill": "Operations Management",
      "experience": 10
    },
    {
      "skill": "Safety Compliance",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Process Improvement",
      "experience": 10
    },
    {
      "skill": "Performance Evaluation",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Communication",
      "experience": 10
    },
    {
      "skill": "Problem Solving",
      "experience": 10
    },
    {
      "skill": "Financial Management",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business or equivalent (Master's preferred)"
    },
    {
      "credential": "Intermediate to advanced user knowledge of Microsoft, including database, spreadsheet, and Warehouse Management Systems"
    }
  ]
}