{
  "meta": [
    {
      "job_title": "Project Manager I",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Resource Planning",
      "experience": 3
    },
    {
      "skill": "Salesforce CRM",
      "experience": 3
    },
    {
      "skill": "ERP Systems",
      "experience": 3
    },
    {
      "skill": "Quality Control",
      "experience": 3
    },
    {
      "skill": "Conflict Resolution",
      "experience": 3
    },
    {
      "skill": "Event Coordination",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Estimate and develop customer contracts in an accurate and detailed manner."
    },
    {
      "duty": "Facilitate resource planning and scheduling with internal departments including Design, CAD, Technical Services and Field Service."
    },
    {
      "duty": "Facilitate cross-functional internal teams, to ensure that major project schedule milestones are achieved, internal lead times are protected, and that the customer receives a seamless, turnkey service experience."
    },
    {
      "duty": "Assist with quality control of peer quotes to ensure accuracy and maintain credibility with customers."
    },
    {
      "duty": "Apply critical thinking skills to resolve conflict, navigate complex situations, troubleshoot non-typical project conditions, and actively resolve open or escalated issues."
    },
    {
      "duty": "Proactively close out projects to ensure customer satisfaction and timely payment."
    },
    {
      "duty": "Support paid campaign strategies and social media strategies and execution."
    },
    {
      "duty": "Support the global marketing team as needed."
    },
    {
      "duty": "Trade show and event coordination."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree (B.A. or B.S.) in Construction Management or Manufacturing Engineering preferred, and one (1) to three (3) years of related experience, or equivalent combination of education and experience."
    }
  ]
}