{
  "meta": [
    {
      "job_title": "Director, Procurement Systems",
      "job_category": "Procurement",
      "job_class": "Director",
      "sector": "Procurement",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Procurement Management",
      "experience": 10
    },
    {
      "skill": "Process Improvement",
      "experience": 10
    },
    {
      "skill": "Supplier Collaboration",
      "experience": 10
    },
    {
      "skill": "Contract Negotiation",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Training and Development",
      "experience": 10
    },
    {
      "skill": "ERP Systems",
      "experience": 10
    },
    {
      "skill": "Inventory Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide strategy and roadmap for business requirements, as well as daily leadership for the support for internal users of the current and future Procurement systems."
    },
    {
      "duty": "Identify and address process inefficiencies, bottlenecks, and compliance gaps through process improvements and automation to drive transformational change in the performance of our Procure-to-Pay processes."
    },
    {
      "duty": "Implement best practices for inventory management, demand planning, and supplier collaboration to ensure product availability and minimize stockouts."
    },
    {
      "duty": "Continuously challenge current state processes with data-driven business cases and help build a continuous improvement culture."
    },
    {
      "duty": "Support Category Managers with spend analytics, reporting, and value creation activities tracking."
    },
    {
      "duty": "Develop and publish metrics in support of continuous improvement objectives."
    },
    {
      "duty": "Create and modify procure-to-pay policy and procedures."
    },
    {
      "duty": "Leads and develops team to align individual and department goals to deliver outstanding internal customer service and meet business objectives to enable our practices to better serve our patients."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Supply Chain, Logistics, or related field (Master’s degree and professional supply chain certifications a plus)"
    }
  ]
}