{
  "meta": [
    {
      "job_title": "Compensation Analyst",
      "job_category": "Human Resources",
      "job_class": "Analyst",
      "sector": "Human Resources",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist with the design, development, analysis, and implementation components of the full compensation life cycle including job descriptions, job matching to market data, salary structure creation, benchmarking, salary planning, and communications."
    },
    {
      "duty": "Analyze survey data and recommend pay range assignments for employee compensation changes."
    },
    {
      "duty": "Assure through analysis, audits, and reports that the compensation program is consistently administered in compliance with company policies and government regulations."
    },
    {
      "duty": "Participate in the design, development, and implementation of compensation redesign including compensation strategy/methodology, customized career framework, job documentation/descriptions based on career framework, and salary structure recommendations."
    },
    {
      "duty": "Participate in salary surveys, and analyze data from survey sources to determine internal and external competitiveness as it relates to the organization's compensation strategy/methodology."
    },
    {
      "duty": "Prepare compensation recommendations for promotions and demotions based on hospital system’s policies and practices; prices new jobs utilizing salary surveys or slotting."
    },
    {
      "duty": "Conduct the job evaluation process and consult with HR partners and core leaders who are creating or revising positions to develop job descriptions that meet internal standards and that reflect actual essential functions and minimum requirements."
    },
    {
      "duty": "Review job descriptions for content and request revisions as necessary to clarify or enhance the quality and consistency."
    },
    {
      "duty": "Conduct analysis of jobs, hourly wages, salaries, and incentives in order to evaluate internal equity, external competitiveness, and legal compliance of the organization’s pay practices."
    },
    {
      "duty": "Assist in the administration of the performance appraisal and salary administration programs, reviewing changes in wages in conformance to policy."
    },
    {
      "duty": "Assist in the development and implementation of compensation communication and education materials and programs."
    },
    {
      "duty": "Participate in hospital-wide projects to support the continuous improvement efforts of the Human Resources department."
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business, or a related field (Master's preferred)"
    }
  ]
}