{
  "meta": [
    {
      "job_title": "Director of Sales",
      "job_category": "Sales",
      "job_class": "Director",
      "sector": "Sales",
      "salary": 145000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Align the region to company & sales objectives with clear business strategy through active participation in regional strategic planning, gap strategy development, forecasting, sales resource planning, and budgeting."
    },
    {
      "duty": "Meet assigned targets for profitable sales volume, forecast accuracy, and other key financial performance objectives."
    },
    {
      "duty": "Lead and manage the sales organization within assigned region with respect to sales action plans, expense budgets, competitively valued proposals, and highly targeted sales campaigns, while operating within established budgetary and business guidelines."
    },
    {
      "duty": "Build customer relationships across the region and actively work with the team to design, prepare, and deliver sales presentations to close strategic opportunities."
    },
    {
      "duty": "Lead training and development initiatives for the sales team."
    },
    {
      "duty": "Provide leadership to the sales team, while fostering a culture of accountability, trust, adaptability, professional development, high-performance, and ethical behavior."
    },
    {
      "duty": "Lead sales organization change initiatives by continuously assessing the needs of sales and partnering with senior sales leaders to raise concerns and provide solutions, best practices, and offer improvements while simultaneously removing obstacles that impede sales teams from achieving their goals."
    },
    {
      "duty": "Monitor and analyze educational trends across the region, actively reviewing state, county, and local policy to actively assist sales teams developing territory sales strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s or Master’s degree in Education, Technology or Business"
    }
  ]
}