{
  "meta": [
    {
      "job_title": "Inventory Accountant",
      "job_category": "Accounting",
      "job_class": "Accountant",
      "sector": "Finance",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work closely with cross-functional counterparts in our distribution centers and supply chain functions to develop and maintain policies and processes to handle new or existing transaction streams."
    },
    {
      "duty": "Monitor all transactions involving inventory to ensure the perpetual inventory records are maintained and discrepancies are investigated and resolved."
    },
    {
      "duty": "Review and report financial and physical inventory results and reconcile variances."
    },
    {
      "duty": "Journalize month end close and responsible for ensuring the close process is completed smoothly and accurately."
    },
    {
      "duty": "Prepare various audit and financial statement schedules and required ad hoc analyses."
    },
    {
      "duty": "Assist with creating, monitoring, and reporting KPI’s for all aspects of inventory and cost accounting."
    },
    {
      "duty": "Review, analyze and input documents received from vendors and external parties for warehouse, duties, freight, finished goods, and other miscellaneous invoices."
    },
    {
      "duty": "Maintaining and validating inventory to ensure costing integrity."
    },
    {
      "duty": "Identify key areas for improvement and implement processes to increase efficiency."
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Cost Accounting",
      "experience": 3
    },
    {
      "skill": "Audit Preparation",
      "experience": 3
    },
    {
      "skill": "ERP Systems",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "Degree in accounting. Public account experience preferred."
    }
  ]
}