{
  "meta": [
    {
      "job_title": "Scientist II",
      "job_category": "Life Sciences",
      "job_class": "Scientist",
      "sector": "BioSpecimen Management",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Microbiological Techniques",
      "experience": 4
    },
    {
      "skill": "Cell Culture",
      "experience": 4
    },
    {
      "skill": "Microbial Taxonomy",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Laboratory Safety",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 4
    },
    {
      "skill": "Client Interaction",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute assigned project activities using established procedures and applying scientific knowledge to manipulate human cell lines, microorganisms, and other biological material."
    },
    {
      "duty": "Perform standard microbiological techniques to culture diverse bacterial isolates under aerobic and anaerobic conditions for banking and delivery to clients."
    },
    {
      "duty": "Maintain and optimize the growth of diverse microbes under various conditions."
    },
    {
      "duty": "Analyze alternative approaches to solve problems or develop new perspectives on existing solutions."
    },
    {
      "duty": "Maintain an effective scientific knowledge base and use broad scientific concepts to resolve problems of moderate scope and complexity."
    },
    {
      "duty": "Summarize experimental results and review conclusions with supervisor/project leader."
    },
    {
      "duty": "Accountable for electronic records management and use of validated systems ensuring information is recorded accurately and consistently."
    },
    {
      "duty": "Perform work according to established internal safety guidelines and procedures, and as specified by appropriate external regulatory agencies."
    },
    {
      "duty": "Participate in routine lab maintenance, lab safety, and compliance implementation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Molecular Biology, Cellular Biology, or Microbiology or related field and 4+ years of relevant experience (Master’s preferred)"
    }
  ]
}