{
  "meta": [
    {
      "job_title": "Talent Acquisition Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Human Resources",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Recruitment Strategies",
      "experience": 5
    },
    {
      "skill": "Candidate Evaluation",
      "experience": 5
    },
    {
      "skill": "Fashion Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Sourcing Techniques",
      "experience": 5
    },
    {
      "skill": "ATS Management",
      "experience": 5
    },
    {
      "skill": "Employer Branding",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Affirmative Action",
      "experience": 5
    },
    {
      "skill": "Brand Ambassadorship",
      "experience": 5
    },
    {
      "skill": "Onboarding Process",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Partner with hiring managers to determine staffing needs and develop comprehensive recruitment plans tailored to the apparel industry's requirements."
    },
    {
      "duty": "Train hiring managers on our ATS system, and best practices to effectively conduct interviews."
    },
    {
      "duty": "Utilize various sourcing methods, including job boards, social media, networking events, and industry-specific platforms, to attract a diverse pool of qualified candidates."
    },
    {
      "duty": "Screen, interview, and assess potential candidates to ensure their skills, experience, and cultural fit align with our company values and objectives."
    },
    {
      "duty": "Conduct reference checks and collaborate with HR colleagues to verify background information of potential hires."
    },
    {
      "duty": "Maintain and update the applicant tracking system (ATS) with accurate and current candidate data."
    },
    {
      "duty": "Manage affirmative action to ensure equal employment opportunities."
    },
    {
      "duty": "Act as a brand ambassador for Liberated Brands, ensuring a positive candidate experience throughout the recruitment process."
    },
    {
      "duty": "Implement effective employer branding strategies to enhance our company's reputation as an employer of choice in our industry."
    },
    {
      "duty": "Monitor industry trends and competitive intelligence to develop innovative recruitment approaches and strategies."
    },
    {
      "duty": "Participate in recruitment events, job fairs, and industry conferences to promote our company and establish connections with potential candidates."
    },
    {
      "duty": "Collaborate with internal stakeholders to enhance the onboarding process for new hires, ensuring a smooth transition into the company."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business Administration, Fashion Merchandising, or a related field."
    }
  ]
}