{
  "meta": [
    {
      "job_title": "Solution Architect",
      "job_category": "Engineering",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technical Architecture",
      "experience": 5
    },
    {
      "skill": "Agile",
      "experience": 5
    },
    {
      "skill": "Cloud Technologies",
      "experience": 5
    },
    {
      "skill": "Mobile Technologies",
      "experience": 5
    },
    {
      "skill": "Technical Leadership",
      "experience": 5
    },
    {
      "skill": "Proposal Development",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Systems Development",
      "experience": 5
    },
    {
      "skill": "Systems Engineering",
      "experience": 5
    },
    {
      "skill": "Technical Writing",
      "experience": 5
    },
    {
      "skill": "Public Sector IT",
      "experience": 5
    },
    {
      "skill": "Enterprise Architecture",
      "experience": 5
    },
    {
      "skill": "Information Security",
      "experience": 5
    },
    {
      "skill": "DevOps",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "AI and Automation",
      "experience": 5
    },
    {
      "skill": "User Experience",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop comprehensive technical architecture, design, and blueprint of IT solutions for Federal programs."
    },
    {
      "duty": "Apply industry best practices and federal architecture standards to develop tailored solutions during proposal development."
    },
    {
      "duty": "Apply analytical, problem-solving, and communication skills to find and present technology solutions aligned with customer requirements."
    },
    {
      "duty": "Work closely with Capture and Proposal Managers, Partners, and the Operations division to shape innovative and high-quality solutions."
    },
    {
      "duty": "Own the technical volume, level of effort estimations, and overall solutions design following proposal submission and contract award."
    },
    {
      "duty": "Lead brainstorming sessions, provide technical reviews, design concepts for graphics, technical research, and proposal content authoring."
    },
    {
      "duty": "Present technology solutions to leadership, customers, and Federal CIOs."
    },
    {
      "duty": "Collaborate with Business Development and Capture teams throughout the business development cycle."
    },
    {
      "duty": "Create and manage technical response development for proposals using virtual communications tools."
    },
    {
      "duty": "Evaluate the technical response for accuracy, cohesiveness, compliance, and compelling solution conveyance."
    },
    {
      "duty": "Provide consulting, delivery, and operational support and expertise for projects."
    },
    {
      "duty": "Support the start-up and delivery of won proposals, assisting in job interviews, work assignments, and briefing executive leadership."
    },
    {
      "duty": "Represent the organization as a technology solutions expert at industry events, customer engagements, and Federal technology forums."
    },
    {
      "duty": "Perform engineering duties on current contracts as a subject matter expert and help adopt new technologies or meet complex contract deliverables."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Engineering, Business, or related technical discipline (Master's preferred)"
    },
    {
      "credential": "Professional certifications such as AWS, Microsoft, Cyber Security, Agile, and DevOps are strongly desired."
    },
    {
      "credential": "Experience supporting Federal agencies including CMS, DHA, DHS, VA, HHS, and NIH."
    },
    {
      "credential": "Public Trust Clearance or the ability to obtain one."
    }
  ]
}