{
  "meta": [
    {
      "job_title": "Product Manager/Sr. Manager",
      "job_category": "Product Management",
      "job_class": "Senior Manager",
      "sector": "Technology",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Product Management",
      "experience": 5
    },
    {
      "skill": "Cybersecurity",
      "experience": 5
    },
    {
      "skill": "Agile Methodology",
      "experience": 5
    },
    {
      "skill": "B2B Product Launch",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Technology Integration",
      "experience": 5
    },
    {
      "skill": "Data Privacy",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and own the product vision and roadmap, from technical frameworks to customer-facing features encompassing advanced data security."
    },
    {
      "duty": "Create backlogs, working regularly with the team to refine and add detail where needed; Collaborate closely with technology teams."
    },
    {
      "duty": "Define metrics and utilize data-driven insights to create cutting-edge data protection capabilities, ensuring data privacy and integrity and enabling the continuous improvement of UX/UI design."
    },
    {
      "duty": "Lead user research efforts to understand data security pain points and develop innovative features."
    },
    {
      "duty": "Explore the integration of state-of-the-art technologies to enhance our data security platform."
    },
    {
      "duty": "Navigate complex cybersecurity and regulatory environments to ensure compliance and effectiveness."
    },
    {
      "duty": "Understand and maintain awareness of competitors and verticals; prepare ad-hoc reports related to financial position, competitive position and market potential as needed."
    },
    {
      "duty": "Manage stakeholder expectations within and/or across functions, including Engineering, Operations, Marketing, and Sales."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Computer Science, Engineering, or related fields. MBA or equivalent experience desired."
    }
  ]
}