{
  "meta": [
    {
      "job_title": "Procurement Manager",
      "job_category": "Supply Chain",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Procurement",
      "experience": 10
    },
    {
      "skill": "Contract Negotiation",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Vendor Management",
      "experience": 10
    },
    {
      "skill": "Change Management",
      "experience": 10
    },
    {
      "skill": "Stakeholder Communication",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Process Improvement",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "SAP",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and optimize the procurement coordination and contract management process to ensure the timely acquisition of materials and services."
    },
    {
      "duty": "Manage and mitigate change order requests while ensuring regulatory compliance and promoting best practices in procurement processes."
    },
    {
      "duty": "Align procurement strategies to support business needs and optimize the use of frameworks in procurement."
    },
    {
      "duty": "Oversee material expediting to meet project milestones and avoid delays, acting as the liaison between business teams, suppliers, and material management."
    },
    {
      "duty": "Promote a culture of collaboration, innovation, and quality across business areas, while providing continuous growth and development to advance business objectives."
    },
    {
      "duty": "Communicate and influence all levels of management to provide strategic input for business plans and decision making."
    },
    {
      "duty": "Design and provide wide-scale training to internal customers, prioritize objectives, and mediate cross-functional issues."
    },
    {
      "duty": "Provide strategic leadership working across multiple operating companies and geographic locations to articulate the business needs relative to procurement."
    },
    {
      "duty": "Facilitate collaborative decision-making to minimize contractual and commercial risk while optimizing savings and efficiencies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree. Master’s degree a plus. PMP Certification preferred."
    }
  ]
}