{
  "meta": [
    {
      "job_title": "Construction Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Real Estate",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage, oversee, and coordinate all facets of architectural and engineering design, permitting, pre-construction, project budgeting, scheduling, bidding, award, construction, and close-out phase of projects."
    },
    {
      "duty": "Review pre-construction and design documents as necessary to assure owner and client standards and policies are met for project compliance and successful on-time completion."
    },
    {
      "duty": "Understand regulatory agencies with jurisdiction and assist, as needed, with permitting issues for local, State and Federal requirements to ensure all permits are secured as promptly as possible."
    },
    {
      "duty": "Prepare and manage reports to upper management with respect to the status and progress of projects, including narrative and photographical documentation of progress."
    },
    {
      "duty": "Organize regularly scheduled construction status meetings with detailed meeting minutes tracking actions items, project progress and requests for information."
    },
    {
      "duty": "Perform on-site inspections for quality of work, quality of materials, conformity with plans and specifications, code compliance, on site safety and general progress of the construction."
    },
    {
      "duty": "Develop and implement quality control programs/checklists on projects."
    },
    {
      "duty": "Manage tenant relationships throughout all phases of each project. Maintain relationships with client/owners, vendors, Property Management, Asset Management, GC’s, Subcontractors, architects, engineers, and all other pertinent parties involved/required for successful execution."
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Permitting",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Tenant Relationships Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, architecture, engineering, or related field (Master's preferred)"
    }
  ]
}