{
  "meta": [
    {
      "job_title": "Business Analyst",
      "job_category": "Business Analysis",
      "job_class": "Analyst",
      "sector": "Technology",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Utilize high technical aptitude and skills, coupled with business intelligence and a deep understanding of the customer's needs for specific SDLC requirement artifacts."
    },
    {
      "duty": "Act as an interface between business units, technology teams, and support teams."
    },
    {
      "duty": "Serve as the subject matter expert for applicable knowledge area(s), including assisting development and QA with data and root cause analysis, and acting as a consultant to Business and/or Clients as needed."
    },
    {
      "duty": "Lead and facilitate requirement solicitation sessions for assigned projects, driving collaboration amongst project team members to ensure timely delivery and management of requirements through project execution."
    },
    {
      "duty": "Collaborate with BA Team and Development teams to ensure baseline requirement artifacts are kept up-to-date."
    },
    {
      "duty": "Write descriptions of business needs and business program functions, including creating process and data flow diagrams, workflow diagrams, test scripts, training curriculum, and quality assurance/audit procedures."
    },
    {
      "duty": "Draft raw curriculum to support the development of training materials relevant to approved client business processes."
    },
    {
      "duty": "Establish and maintain positive client business relationships across the organization, including guiding others in understanding client businesses, processes, and priorities."
    }
  ],
  "skills": [
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Technical Aptitude",
      "experience": 5
    },
    {
      "skill": "Interface Management",
      "experience": 5
    },
    {
      "skill": "Subject Matter Expertise",
      "experience": 5
    },
    {
      "skill": "Requirement Facilitation",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Process and Data Flow Diagramming",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent experience preferred"
    },
    {
      "credential": "5 plus years in the role of Business Analyst, Business System Analyst, or System Analyst for technology-based projects"
    },
    {
      "credential": "5 years of experience as a team member on technology-based projects in highly complex business-to-business and/or outsourced client environments"
    },
    {
      "credential": "Strong knowledge of the benefit enrollment life cycle"
    },
    {
      "credential": "Extensive experience with EDI 834 and some experience with EDI 820"
    },
    {
      "credential": "Extensive knowledge and experience with data mapping specific to enrollment data"
    },
    {
      "credential": "Intermediate to extensive exposure to XML schemas and canonical structures"
    },
    {
      "credential": "Strong knowledge of Software Development Lifecycle (SDLC) methodologies (Waterfall, Iterative, Agile, etc.)"
    },
    {
      "credential": "Experience with process and data flow diagramming"
    },
    {
      "credential": "Prefer knowledge of enterprise modeling applications, such as Enterprise Architect, ProVision and/or other modeling and/or languages, including UML"
    },
    {
      "credential": "Business process reengineering skills a plus"
    },
    {
      "credential": "Ability to travel as needed"
    },
    {
      "credential": "Excellent verbal, written, and interpersonal skills"
    }
  ]
}