{
  "meta": [
    {
      "job_title": "Account Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Government Sales",
      "experience": 5
    },
    {
      "skill": "Enterprise Sales",
      "experience": 10
    },
    {
      "skill": "Technical Background",
      "experience": 8
    },
    {
      "skill": "Consultative Selling",
      "experience": 8
    },
    {
      "skill": "Strategic Thinking",
      "experience": 8
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 8
    },
    {
      "skill": "Contract Negotiation",
      "experience": 8
    },
    {
      "skill": "Market Strategy Development",
      "experience": 8
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 8
    },
    {
      "skill": "Team Collaboration",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive revenue and cloud adoption in a defined account base."
    },
    {
      "duty": "Develop, articulate, and implement account plans aligned to AWS's strategic direction."
    },
    {
      "duty": "Identify specific prospects/partners/channels to collaborate with to serve the customer."
    },
    {
      "duty": "Create valued relationships with Partners."
    },
    {
      "duty": "Work closely with customers to ensure that they understand relevant cloud use cases, are successful using AWS services, and are able to build the governance model(s) and technical resources required to fully embrace operating in the cloud."
    },
    {
      "duty": "Collaborate with AWS’s Legal and Capture Management teams to manage complex contract negotiations."
    },
    {
      "duty": "Maintain an accurate and robust pipeline and forecast of business opportunities by engaging with prospects, partners, and key customers."
    },
    {
      "duty": "Prepare and deliver business reviews to the senior management team regarding quarterly and yearly strategies that align with revenue growth expectations."
    },
    {
      "duty": "Accelerate cloud adoption and ensure customer satisfaction."
    },
    {
      "duty": "Frequent customer meetings in Columbus, Ohio are required. This position is based in the Columbus, OH metro area."
    },
    {
      "duty": "Differentiate AWS through deep business and technical relationships and understand the customer's strategic goals and environment."
    },
    {
      "duty": "Have daily interactions with customers and our eco-system of partners to ensure success of cloud migration projects and the long-term transformation of government IT."
    },
    {
      "duty": "Participate in industry events, conferences, and trade shows."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS degree or equivalent work experience"
    }
  ]
}