{
  "meta": [
    {
      "job_title": "Spanish Teacher",
      "job_category": "Education",
      "job_class": "Teacher",
      "sector": "Education",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive lesson plans designed to support mastery of grade-level essential outcomes consistent with school goals and objectives."
    },
    {
      "duty": "Understand how learners acquire competencies in Spanish, understand varied methodologies and approaches used in teaching and learning languages, and draw upon this knowledge to design strategies appropriate to the learning goals."
    },
    {
      "duty": "Demonstrate instructional practices that engage students in conceptual thinking, promote problem-solving and creativity, and challenge students to achieve high standards of content mastery."
    },
    {
      "duty": "Take ownership of student academic progress and show an active interest in student achievement."
    },
    {
      "duty": "Provide individual and small-group instruction to adapt delivery to meet the needs of students with varying academic skill levels."
    },
    {
      "duty": "Support an atmosphere that accelerates each student's academic, spiritual, social, and emotional growth and achievement in alignment with the school’s mission."
    },
    {
      "duty": "Successfully collaborate and help students apply course content across the curriculum."
    },
    {
      "duty": "Support lessons through effective use of technology tools (Mercy HS is an Apple Distinguished school)."
    },
    {
      "duty": "Create a culturally responsive learning environment and pedagogy."
    },
    {
      "duty": "Contribute as a team player and a supportive member of the Mercy community."
    },
    {
      "duty": "Sustain an effective system of shared leadership and responsibility throughout the school."
    },
    {
      "duty": "Work effectively and willingly with students of diverse backgrounds including race, culture, and socio-economic status."
    },
    {
      "duty": "Have effective verbal and written communication skills in interacting with various stakeholders."
    }
  ],
  "education_certification": [
    {
      "credential": "State of Michigan teaching certification with an FF endorsement. Preference for applicants with a Master’s Degree."
    }
  ]
}