{
  "meta": [
    {
      "job_title": "Affiliate Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, execute, and manage the affiliate marketing strategy to meet acquisition and revenue goals."
    },
    {
      "duty": "Identify and recruit new affiliates, influencers, and partners to expand the affiliate network."
    },
    {
      "duty": "Build and maintain strong relationships with affiliates, providing them with the necessary resources and support to ensure their success."
    },
    {
      "duty": "Monitor affiliate activity, analyze performance metrics, and optimize campaigns to enhance conversion rates and ROI."
    },
    {
      "duty": "Collaborate with the marketing and creative teams to provide affiliates with updated marketing materials, promotions, and product information."
    },
    {
      "duty": "Stay updated on industry trends, competitive landscape, and compliance guidelines to ensure program alignment with best practices."
    },
    {
      "duty": "Negotiate and manage commission structures, contracts, and payout processes for affiliates."
    },
    {
      "duty": "Regularly communicate with affiliates to provide performance updates, address inquiries, and share insights for improvement."
    }
  ],
  "skills": [
    {
      "skill": "Affiliate Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Recruitment and Activation",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Performance Analysis",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Compliance Knowledge",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (or equivalent work experience)"
    }
  ]
}