{
  "meta": [
    {
      "job_title": "Client Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "salary": 135000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the primary interface for TbV Tier 2 Master Agents and build strong relationships with them."
    },
    {
      "duty": "Identify opportunities and lead account strategy and planning discussions with Master Agents."
    },
    {
      "duty": "Develop and influence Master Agent distribution growth strategy for TbV Retail."
    },
    {
      "duty": "Work closely with channel leadership in the consumer experience, sales, and analytics organizations to drive and manage distribution growth of accounts."
    },
    {
      "duty": "Produce and present creative, compelling proposals, presentations, and business reviews to express Total by Verizon's key initiatives and expectations from a distribution and growth perspective."
    },
    {
      "duty": "Assess the performance of each agent and retailer, and develop a tailored plan on a monthly basis to improve productivity."
    },
    {
      "duty": "Measure and monitor KPIs for respective Indirect Partners, developing and executing plans to meet and exceed sales targets."
    },
    {
      "duty": "Negotiate effectively to balance the needs of all involved."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or four or more years of work experience, and two or more years of Indirect channel experience (MBA, or M.S. in related fields preferred)."
    }
  ]
}