{
  "meta": [
    {
      "job_title": "Senior Energy Engineer",
      "job_category": "Engineering",
      "job_class": "Senior",
      "sector": "Energy Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Energy Engineering",
      "experience": 10
    },
    {
      "skill": "Engineering Management",
      "experience": 10
    },
    {
      "skill": "Project Development",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Energy Conservation Measures",
      "experience": 10
    },
    {
      "skill": "Whole-building Modeling",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Technical Writing",
      "experience": 10
    },
    {
      "skill": "Proficiency in AutoCad and Revit",
      "experience": 10
    },
    {
      "skill": "Problem Solving",
      "experience": 10
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 10
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 10
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as an engineering resource for internal team to guide, coach, and develop talent."
    },
    {
      "duty": "Lead technical team during all phases of Energy Savings Performance Contract (ESPC) project development including overall responsibility in conducting energy audits, site investigations, Energy Conservation Measure (ECM) scope development, energy savings calculations, and development of cost estimates for large, commercial, and institutional facilities."
    },
    {
      "duty": "Identify and quantify energy conservation opportunities associated with HVAC systems, energy management and control systems, building envelope, boiler, and chilled water central plant systems in ESPC Projects."
    },
    {
      "duty": "Be knowledgeable of relevant codes to include UMC, UPC, NEC, to be able to review drawings and specifications."
    },
    {
      "duty": "Coordinate, schedule, and perform site visits with clients and Iconergy personnel to perform site inspections, gather site data, and coordinate with owner personnel as needed."
    },
    {
      "duty": "Analyze, evaluate, and summarize utility data, HVAC trend data, BAS data, electrical metering data, and production data as needed to support development of projects."
    },
    {
      "duty": "Screen and develop initial costs and savings for ECMs to assess viability within an ESPC project."
    },
    {
      "duty": "Regularly review ECMs with team during progression of projects to ensure development of cost-effective projects."
    },
    {
      "duty": "Develop and execute project development approaches, schedules, and budgets with the technical team to establish accountability of deliverables."
    },
    {
      "duty": "Review and gain approval of measurement and verification (M&V) plans with technical team."
    },
    {
      "duty": "Write draft scopes of work for ECMs for internal Design Engineers and Construction Managers to be later refined for bidding in the marketplace."
    },
    {
      "duty": "Write detailed ECM descriptions to be included in proposal submissions and review ECM descriptions written by the technical team."
    },
    {
      "duty": "Lead technical discussions of scope, savings, and M&V methods with team and clients."
    },
    {
      "duty": "Collaborate with a team that encourages and supports you to work independently and take pride in the work that you do."
    },
    {
      "duty": "Think critically about different approaches and implement the ones that are most appropriate for the situation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in engineering (Mechanical or Electrical Engineering Preferred). Master’s degree preferred."
    }
  ]
}