{
  "meta": [
    {
      "job_title": "Sous Chef",
      "job_category": "Culinary",
      "job_class": "Chef",
      "sector": "Hospitality",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Culinary Skills",
      "experience": 5
    },
    {
      "skill": "Food Ordering",
      "experience": 3
    },
    {
      "skill": "Team Management",
      "experience": 3
    },
    {
      "skill": "Food Safety",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 2
    },
    {
      "skill": "Training",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Control and/or assist with the day-to-day culinary operations of the venue within the policies and guidelines set forth by the company, including the ensurance of appropriate levels of staffing."
    },
    {
      "duty": "Assist with maintaining a professional company image, including kitchen cleanliness, proper uniforms and appearance standards."
    },
    {
      "duty": "Uphold consistent product and service standards of the highest quality."
    },
    {
      "duty": "Control and/or assist with the control of BOH food costs through appropriate ordering, maintaining weekly inventory, reviewing financial reports and taking appropriate actions."
    },
    {
      "duty": "Ensure a safe working environment to reduce the risk of injury and accidents."
    },
    {
      "duty": "Maintain kitchen organization and cleanliness in compliance with Company and Health Department standards."
    },
    {
      "duty": "Recruit, interview and hire supervisory and hourly team members; supervise and motivate; take disciplinary action and recommend terminating hourly team members when necessary."
    },
    {
      "duty": "Train employees, as assigned, in an ongoing basis."
    },
    {
      "duty": "Lead by example to other team members and mentor new staff."
    },
    {
      "duty": "Carrying or lifting items weighing up to 75 pounds. Moving about the kitchen in a safe and secure manner. Handling food, objects, products and utensils effectively and safely. Bending, stooping, standing and kneeling. Withstand potential climate temperature changes in assigned work area."
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED equivalent required. Culinary arts courses/certifications or related degree preferred."
    }
  ]
}