{
  "meta": [
    {
      "job_title": "Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish long-term sales/marketing strategy, i.e., new product roadmap, technology roadmap, focus/target customers."
    },
    {
      "duty": "Lead and manage promotional activities such as, i.e., web, brochures, trade show, direct sales, Social media."
    },
    {
      "duty": "Create, maintain, and communicate the company's Unique value propositions, internally and externally."
    },
    {
      "duty": "Implement and manage sales tactics to support the needs, goals, and objectives of the company and the corporation."
    },
    {
      "duty": "Direct staffing, training, and performance evaluations to develop and control the sales program."
    },
    {
      "duty": "Direct sales to key customers/accounts."
    },
    {
      "duty": "Develop and implement strategic business development and growth initiatives as it relates to products (Wire, Cable, Connectors, Cable Assemblies)."
    },
    {
      "duty": "Provide regular quantitative and subjective market feedback related to the market segments and product lines."
    },
    {
      "duty": "Participate in developing and maintaining a media relations and product line branding program to promote the product and capability features in the selected markets and product lines."
    },
    {
      "duty": "Support the sales effort by making on-site customer visits and receiving customer visits."
    },
    {
      "duty": "Support the process of opportunity management and lead generation residing in Salesforce.com."
    },
    {
      "duty": "Identify adjacent markets or new product needs and develop a strategic plan to generate sales and growth in the selected markets and product lines."
    },
    {
      "duty": "Ensure accurate forecasting by using and analyzing tools, including PowerBI, Salesforce, and IFS."
    },
    {
      "duty": "Guide outside team in establishing and maintaining an opportunity pipeline that supports the business plan objectives."
    },
    {
      "duty": "Interface with Inside Sales Manager to develop a cohesive value add process for upselling and organic growth within the existing customer base."
    },
    {
      "duty": "Able to read and interpret multi-million long-term agreements proposals and lead the specialist team to establish a winning strategy for the Client and the company to present, negotiate, and close."
    },
    {
      "duty": "Extensive travel throughout the US and Canada. Periodic travel to other counties is possible (UK, Europe, etc…). Potential travel could consist of 2-3 weeks on the road."
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Market Analysis",
      "experience": 7
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Forecasting",
      "experience": 7
    },
    {
      "skill": "Negotiation",
      "experience": 7
    },
    {
      "skill": "Market Feedback",
      "experience": 7
    },
    {
      "skill": "Business Development",
      "experience": 7
    },
    {
      "skill": "Account Management",
      "experience": 7
    },
    {
      "skill": "Salesforce Management",
      "experience": 7
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree (B.A.) from four-year college or university and five to ten years related experience in sales and management or equivalent combination of education and experience."
    },
    {
      "credential": "5-10 years of field application engineer or technical adviser with customer interface for interconnect products for ruggedized applications, preferably in one or several of the targeted sectors such as Energy, Defense, Marine, Subsea, and industrial markets."
    }
  ]
}