{
  "meta": [
    {
      "job_title": "Reservations & Guest Experience Team Manager",
      "job_category": "Hospitality",
      "job_class": "Manager",
      "sector": "Hospitality",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 3
    },
    {
      "skill": "Computer Skills",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 3
    },
    {
      "skill": "Travel Logistics",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Smoothly lead guests through the booking process by building rapport and confidence."
    },
    {
      "duty": "Demonstrate strong sales aptitude with the ability to up-sell, cross-sell, and overcome objections."
    },
    {
      "duty": "Work with partner companies to ensure all reservations are accounted for."
    },
    {
      "duty": "Strive to achieve all personal and office-wide sales goals."
    },
    {
      "duty": "Troubleshoot and resolve reservation questions and issues."
    },
    {
      "duty": "Answer guest emails, chats, texts, and phone calls and attend to their requests in a timely way."
    },
    {
      "duty": "Follow up with guests during and after their stay for feedback."
    },
    {
      "duty": "Plan, prepare, and track guest gifts."
    },
    {
      "duty": "Manage lost and found between Guest Experience and Housekeeping Teams."
    },
    {
      "duty": "Obtain and maintain a comprehensive knowledge of all lodging properties, policies, and procedures."
    },
    {
      "duty": "Deliver exemplary guest service to satisfy and surpass guest expectations and ensure a world-class experience."
    },
    {
      "duty": "Share feedback from guest comments with our Homeowner Team and Marketing Team to improve properties and market them more accurately."
    },
    {
      "duty": "Communicate with all departments on any changes or updates with guests that impact the other department."
    },
    {
      "duty": "Work with guests on refunds if they have issues during their stay."
    },
    {
      "duty": "Travel to Winter Park as needed for in-person meetings and trainings with team members."
    },
    {
      "duty": "All other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "College or University degree preferred in Communication/Public Relations or a minimum of one year experience in a guest services role."
    },
    {
      "credential": "Valid driver’s license."
    },
    {
      "credential": "Excellent computer skills, ability to learn new software quickly."
    },
    {
      "credential": "Outstanding customer service skills including full fluency in speaking, reading, and writing English."
    },
    {
      "credential": "Ability to interact in a friendly and comfortable manner with staff and guests via phone and in person."
    },
    {
      "credential": "Detail and team-oriented."
    },
    {
      "credential": "Ability to reason and create solutions in unexpected and possibly stressful situations."
    },
    {
      "credential": "Dependable and punctual."
    },
    {
      "credential": "Able to lift at least 25 pounds."
    }
  ]
}