{
  "meta": [
    {
      "job_title": "Commercial Real Estate Appraiser",
      "job_category": "Real Estate",
      "job_class": "Appraiser",
      "sector": "Property",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Commercial Appraisal",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct commercial property appraisals using state-of-the-art report writing software and custom-designed appraisal templates."
    },
    {
      "duty": "Utilize local and national publications and a national database for unique appraisal assignments."
    },
    {
      "duty": "Manage property database with appraiser-verified data for land sales, leases, improved sales, cap rates, and expense comparables."
    },
    {
      "duty": "Analyze appraiser-verified data and collaborate with research assistants to produce high-quality appraisal reports and advisory services."
    },
    {
      "duty": "Work remotely from home or in a professional office environment, offering flexibility in work location."
    },
    {
      "duty": "Possess at least five years of commercial appraisal experience and demonstrate exceptional attention to detail and written/verbal communication skills."
    },
    {
      "duty": "Enjoy a competitive compensation package and benefits including health, dental, vision plans, and a matching retirement program."
    },
    {
      "duty": "Be part of a well-respected appraisal company in Nevada with opportunities for professional growth."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Real Estate, Business, or a related field (Master's preferred)"
    }
  ]
}