{
  "meta": [
    {
      "job_title": "Quality Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Manufacturing",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish Quality Systems and foundation for new programs, new product lines and new equipment"
    },
    {
      "duty": "Develop and update Manufacturing Quality Charts (MQC) / Process Control Plans"
    },
    {
      "duty": "Gage development, confirmation, and Gage R&R. (CF Approval)"
    },
    {
      "duty": "Analyze new process for improvements and failure modes with cross functional team (PFMEA development and updates)"
    },
    {
      "duty": "Negotiate appropriate quality judgement levels with customer (Boundary Samples)"
    },
    {
      "duty": "Develops CIS for new processes"
    },
    {
      "duty": "Color and Grain matching"
    },
    {
      "duty": "Analysis of process for stability and capability"
    },
    {
      "duty": "Support QC to improve / correct quality concerns for mass production parts"
    },
    {
      "duty": "Develops all customer documentation for new parts – Inspection Standard, Sample Data Sheet"
    },
    {
      "duty": "Develop / design checking fixture concepts for new parts (working with CF builder)"
    },
    {
      "duty": "Responsible for all part approval documentation submitted to the customer"
    },
    {
      "duty": "Attends all required trials for responsible parts (internal and at customer)"
    },
    {
      "duty": "Ability to work with other departments to find root cause and develop countermeasure for issues"
    },
    {
      "duty": "Maintain awareness and understand the roles and responsibilities regarding the environmental policies, management system, and objectives and targets by attending the required training. Perform all tasks in accordance with the EMS procedures and practices and minimize the impact of their activities on the environment."
    }
  ],
  "skills": [
    {
      "skill": "PPAP Documentation",
      "experience": 3
    },
    {
      "skill": "ISO/IATF Documentation",
      "experience": 3
    },
    {
      "skill": "SPC Studies",
      "experience": 3
    },
    {
      "skill": "Problem Solving (5 why, 8-D, etc.)",
      "experience": 3
    },
    {
      "skill": "Statistical Analysis",
      "experience": 3
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 3
    },
    {
      "skill": "Cross-functional Team Collaboration",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree in Engineering or technical-related discipline, 2-3 year Quality or Engineering experience in a manufacturing environment or equivalent combination of education and experience. (Master's preferred)"
    }
  ]
}