{
  "meta": [
    {
      "job_title": "Principal Executive Compensation Consultant",
      "job_class": "Principal",
      "job_category": "Compensation",
      "sector": "HR",
      "salary": 180000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Executive Compensation Expertise",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Data Analytics",
      "experience": 10
    },
    {
      "skill": "Qualitative Analysis",
      "experience": 10
    },
    {
      "skill": "Financial Acumen",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead moderate to complex projects covering areas of executive compensation and drive their delivery."
    },
    {
      "duty": "Assist in preparing materials for Compensation Committee Meetings, including competitive data and plan design alternatives and effects, and providing support in preparation of quarterly Cap Table, quarterly budget to actual reconciliation and updated forecast of share utilization."
    },
    {
      "duty": "Conduct executive market pricing activities including job matching, data analytics, job pricing, and executive compensation survey submissions."
    },
    {
      "duty": "Manage executive compensation communication plans and serves as a single point of contact for senior leaders within the organization to provide information and consultation on their total rewards package."
    },
    {
      "duty": "Oversee administration of Board of Director compensation including quarterly and annual retainers, dividend payments and tracking company holdings"
    },
    {
      "duty": "Assist in the due diligence analysis for mergers and acquisitions."
    },
    {
      "duty": "Stay apprised and report on legislation, regulations and media articles about compensation."
    },
    {
      "duty": "Prepares compensation analyses provides guidance related to off-cycle officer compensation adjustments, promotions, new hires and severance agreements."
    },
    {
      "duty": "Assists the compensation team in other analyses, calculations, and projects as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "12+ years of experience in HR with 10 years in total rewards/compensation"
    }
  ]
}