{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Nursing",
      "job_class": "Professional",
      "sector": "Health Care",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identifying patient's alterations in health and assessing the patient's human response to health problems."
    },
    {
      "duty": "Implementing nursing interventions based on theoretical concepts from nursing and other arts and sciences."
    },
    {
      "duty": "Evaluating the effectiveness of nursing interventions to achieve optimal patient outcomes."
    },
    {
      "duty": "Supervising/directing care provided by licensed practical nurses and unlicensed assistive personnel."
    },
    {
      "duty": "Assigning/delegating care to other qualified members of the health care team."
    },
    {
      "duty": "Coordinating care between other professional disciplines as needed."
    },
    {
      "duty": "Performing unit-based activities that contribute to a positive work and professional environment."
    },
    {
      "duty": "Providing and coordinating care to achieve the organization's mission of excellent patient care and nursing's vision of setting a new standard of excellence."
    },
    {
      "duty": "Committed to patient advocacy and innovative patient care in a climate of trust and collaboration."
    }
  ],
  "skills": [
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Decision Making",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Empathy",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "BSN and professional nursing board certification preferred at time of hire. All nurses hired after April 30, 2014 without a BSN will be required to obtain a BSN within three years of hire."
    },
    {
      "credential": "Current RN license in the state of Florida."
    }
  ]
}