{
  "meta": [
    {
      "job_title": "BI Manager",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "IT",
      "salary": 143397,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Business Analytics",
      "experience": 15
    },
    {
      "skill": "Statistical Analysis",
      "experience": 15
    },
    {
      "skill": "Data Management",
      "experience": 15
    },
    {
      "skill": "Team Management",
      "experience": 15
    },
    {
      "skill": "MS PowerBI",
      "experience": 15
    },
    {
      "skill": "SQL",
      "experience": 15
    },
    {
      "skill": "Project Management",
      "experience": 15
    },
    {
      "skill": "Data Analysis",
      "experience": 15
    },
    {
      "skill": "Communication Skills",
      "experience": 15
    },
    {
      "skill": "Strategic Thinking",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage a team of BI professionals, overseeing their development and performance."
    },
    {
      "duty": "Collaborate with stakeholders, business, and IT Data Warehouse Team to elicit and document business requirements for new reports."
    },
    {
      "duty": "Translate data results into written reports, tables, graphs, and charts to convey information to management."
    },
    {
      "duty": "Design, develop, and maintain reports and analytical tools, ensuring quality assurance and ongoing monitoring."
    },
    {
      "duty": "Provide technical support for existing reports, dashboards, or other tools, and analyze errors and inconsistencies in the data."
    },
    {
      "duty": "Teach and advocate the use of business intelligence tools across levels of the organization, handle Data Warehouse help desk tickets, and report project status to management."
    },
    {
      "duty": "Participate in due diligence and evaluation of systems for M&A Integration, and contribute to cross-organizational teams for SPC LOB Technology Initiatives."
    },
    {
      "duty": "Perform other duties as assigned, with some travel may be required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in data analytics, data science, computer science, management information systems, finance, statistics, or related field required; MBA or post-graduate degree preferred"
    }
  ]
}