{
  "meta": [
    {
      "job_title": "Patient Services Representative Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides administrative support to ensure high quality, patient-centered care."
    },
    {
      "duty": "Oversight of Patient Service Representatives on and off site to include training and managing duties such as patient relations, checking in patients, scheduling appointments, collecting relevant insurance information, accepting payments for services, responding to all incoming communication channels, and answering phones."
    },
    {
      "duty": "Flexibility in work schedule, with sometimes same day notice due to emergencies, being available to open and/or close the facility locations is a requirement."
    },
    {
      "duty": "Flexibility in working at an alternate site location, with sometimes same day notice due to emergencies, is a requirement."
    },
    {
      "duty": "Cross coverage in other departments with Interventional Psychiatric services such as TMS and Spravato, with sometimes same day notice due to emergencies, is a requirement."
    },
    {
      "duty": "Coordinates and prepares agendas for Patient Service Representative staff meetings."
    },
    {
      "duty": "Participates in the hiring process for Patient Service Representatives in collaboration with the company CEO and Medical Director."
    },
    {
      "duty": "Conducts new hire orientation specific to EMR usage & foundational training."
    },
    {
      "duty": "Orders and maintains stock of supplies for facility."
    },
    {
      "duty": "Manages patient and/or family complaints and provides ongoing conflict resolution, as needed."
    },
    {
      "duty": "Ensures the environment is safe and free of safety hazards for staff members and patients, including the management of work-related illnesses."
    },
    {
      "duty": "Schedules and coordinates pharma and business development related meals and in-services."
    },
    {
      "duty": "Manages break room cleaning schedule."
    },
    {
      "duty": "Coordinates with other site managers and company CEO staff appreciation events and activities for location."
    },
    {
      "duty": "Participates in company team building activities & opportunities."
    },
    {
      "duty": "Attends management meetings and ongoing education/training as scheduled and when requested."
    },
    {
      "duty": "Participates in building tours, marketing activities, and recruiting as requested and when scheduled."
    },
    {
      "duty": "Available to providers for assistance and questions as requested."
    },
    {
      "duty": "Submits service tickets and work orders for IT related items, building repairs, EMR service requests, and housekeeping requests."
    }
  ],
  "skills": [
    {
      "skill": "Patient Registration",
      "experience": 5
    },
    {
      "skill": "Electronic Medical Record System",
      "experience": 5
    },
    {
      "skill": "Medical Insurance Claims",
      "experience": 5
    },
    {
      "skill": "Leadership Experience",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Behavioral Health Experience",
      "experience": 2
    },
    {
      "skill": "Clinic or Hospital Experience",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Associate Degree Required, Bachelor's Degree Preferred in Healthcare Administration, Business, or related field"
    }
  ]
}