{
  "meta": [
    {
      "job_title": "Die Cutter Operator",
      "job_category": "Manufacturing",
      "job_class": "Operator",
      "sector": "Manufacturing",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Experienced in a die-cutting process utilizing high-speed cutting equipment (Bobst)."
    },
    {
      "duty": "Department duties will include make-ready; in-process running, in-process testing, stripping, non-conforming product identification including cartons identified to have excessive board curl, and finished goods identification."
    },
    {
      "duty": "Operate Bobst 106 sheet-fed die-cutting machines with stripping and blanking section."
    },
    {
      "duty": "Perform troubleshooting activities on die-cutting machines and web press."
    },
    {
      "duty": "Perform quality checks and complete the appropriate paperwork for the department."
    },
    {
      "duty": "Ensure cleanliness of work area, ensuring GMP guidelines are consistently satisfied."
    },
    {
      "duty": "Adhere to OSHA guidelines on Safety, Hazard Mitigation, Personal Protective Equipment, and proper Machine Operation."
    },
    {
      "duty": "Consistently communicate department challenges with department managers providing solutions."
    },
    {
      "duty": "Shares an obligation to protect and strengthen Graphic Packaging International’s good reputation in our relationships with customers, employees, suppliers, competitors, investors, and governmental agencies, and to act consistently with our core values: Integrity, Respect, Accountability, Relationships, and Teamwork."
    },
    {
      "duty": "Experience working in a fast-paced manufacturing environment, meeting production performance indicators."
    },
    {
      "duty": "Heavy Machine Operator Experience."
    },
    {
      "duty": "Strong verbal and written communication and interpersonal skills."
    },
    {
      "duty": "Compensatory closely related work experience required in lieu of degree."
    },
    {
      "duty": "Three or more years of experience operating die-cutting machinery."
    },
    {
      "duty": "Technical and problem-solving skills."
    },
    {
      "duty": "Must be quality-conscious and customer oriented."
    },
    {
      "duty": "Must be able to read and interpret English."
    },
    {
      "duty": "General schedule is an M-F assignment."
    },
    {
      "duty": "Employee must be willing to work alternate schedules occasionally; that may include early mornings, nights, and/or weekends and be punctual while doing so."
    },
    {
      "duty": "While performing the duties of this job, the employee is regularly required to stand and frequently is required to walk for extended periods up to 8 hours."
    },
    {
      "duty": "The employee must frequently lift and/or move up to 30 pounds with or without mechanical assistance."
    },
    {
      "duty": "Reading computer screen or other electronic devices."
    },
    {
      "duty": "Use of various mechanical equipment."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": []
}