{
  "meta": [
    {
      "job_title": "Field Supervisor",
      "job_category": "Security",
      "job_class": "Supervisor",
      "sector": "Security",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform day and night site visits to inspect and supervise Security Professionals (SPs) in the field."
    },
    {
      "duty": "Address escalation of 'after hours' and 'cold start' calls to ensure sufficient coverage at customer sites."
    },
    {
      "duty": "Work with Operations Managers to coach, counsel, discipline, train, and manage relationships with SPs."
    },
    {
      "duty": "Conduct on-the-job training of new employees assigned to post, or when changes to post orders are made, including orientation, review of post orders, and how to respond to emergency situations or client needs."
    },
    {
      "duty": "Respond to call-offs that occur during the shift, identify replacements, and assist with scheduling for call-offs or other changes at the site."
    },
    {
      "duty": "Identify and forward personnel problems at posts to Operations Manager and Corporate HR Director; may be required to write reports or assist with investigations."
    },
    {
      "duty": "Administer counseling or disciplinary actions at the specific direction of Branch/Corporate HR management."
    },
    {
      "duty": "Distribute information to posts as directed by Branch or Corporate office and respond to client or site emergencies as they arise."
    },
    {
      "duty": "Responsible for maintaining all current BSIS licenses and ensuring a working knowledge of all posts within their regional area of responsibility."
    }
  ],
  "skills": [
    {
      "skill": "Supervision",
      "experience": 4
    },
    {
      "skill": "Training",
      "experience": 4
    },
    {
      "skill": "Security Industry Knowledge",
      "experience": 4
    },
    {
      "skill": "Scheduling",
      "experience": 4
    },
    {
      "skill": "Communication",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum high school diploma or equivalent required. Some college education or business classes desirable."
    },
    {
      "credential": "Minimum 3 – 5 years of professional-level experience required and prior experience in the security industry, law enforcement, and/or military highly desired."
    },
    {
      "credential": "Energetic and focused personality with a demonstrated ability to take initiative, successfully handle and prioritize multiple competing assignments and effectively manage deadlines."
    },
    {
      "credential": "Must possess a valid Driver’s License with at least one year of driving experience, a clean driving record, and the ability to safely operate a vehicle required."
    },
    {
      "credential": "Licensing requirements are subject to state and/or local laws and regulations and may be required prior to employment."
    },
    {
      "credential": "Working knowledge of Microsoft Office software a considerable plus."
    },
    {
      "credential": "Professional, articulate and able to use good independent judgment and discretion. Outstanding verbal and written communication skills required."
    }
  ]
}