{
  "meta": [
    {
      "job_title": "Education Program Director",
      "job_category": "Education",
      "job_class": "Program Director",
      "sector": "Management",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Instructional Practices",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Educational Leadership",
      "experience": 5
    },
    {
      "skill": "Professional Learning",
      "experience": 5
    },
    {
      "skill": "School Operations",
      "experience": 5
    },
    {
      "skill": "Enrollment Process",
      "experience": 5
    },
    {
      "skill": "IEP Process",
      "experience": 5
    },
    {
      "skill": "Student Counseling",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create a positive school culture and increase student achievement through consistent implementation of instructional practices and strategies."
    },
    {
      "duty": "Oversee all site operations and act as the liaison between the site and the school districts' designated contacts."
    },
    {
      "duty": "Provide vision and leadership to support student achievement and effective operations by supervising staff, developing and implementing performance management plans, and identifying professional learning needs."
    },
    {
      "duty": "Participate in the employment and selection process to ensure an effective site team is in place."
    },
    {
      "duty": "Ensure the safety of staff and students by maintaining the site and classrooms for operation and ensuring compliance with specific state requirements."
    },
    {
      "duty": "Drive the enrollment process from referral to last day of attendance, ensuring timely classroom placement and managing classroom rosters according to student need and state requirements."
    },
    {
      "duty": "Instruct, monitor, and evaluate all staff and students in the use of learning materials and resources to ensure fidelity of instruction and student performance/evaluation."
    },
    {
      "duty": "Participate in the assurance and accreditation processes to ensure that the site meets performance plans."
    },
    {
      "duty": "Prepare and present required reports on student progress, achievement, and activities to ensure accuracy in numerical analysis and presentation."
    },
    {
      "duty": "Compile, analyze, and use assessment data to measure student growth and guide instruction and/or academic intervention for each student and site."
    },
    {
      "duty": "Maintain accurate and complete records of students' progress and development as required by state laws and policies."
    },
    {
      "duty": "Ensure compliance with mandatory requirements including IEP process, state testing, and policies."
    },
    {
      "duty": "Manage student behavior by applying appropriate support or disciplinary measures when necessary."
    },
    {
      "duty": "Provide support, encouragement, and counseling to students with academic problems."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in education, special education, psychology, counseling, behavioral analysis, social work, behavioral science, or rehabilitation issued by an accredited postsecondary institution."
    },
    {
      "credential": "Administrative credential granted by an accredited postsecondary educational institution and two years of experience with pupils with disabilities, or equivalent credentials/licenses."
    }
  ]
}