{
  "meta": [
    {
      "job_title": "Sr. Mobile Application Developer",
      "job_category": "Software Engineering",
      "job_class": "Senior",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cross-platform/Native iOS and Android Application development",
      "experience": 7
    },
    {
      "skill": "Web technologies AngularJs, Angular, NodeJs, Ionic Framework and adjacent technologies such as Node and Webpack",
      "experience": 6
    },
    {
      "skill": "Experience working with remote data via JSON and XML format and REST and SOAP APIs",
      "experience": 6
    },
    {
      "skill": "Experience with IONIC Framework",
      "experience": 3
    },
    {
      "skill": "Web development experience which includes the programming/ development of web applications.",
      "experience": 6
    },
    {
      "skill": "Strong Experience with Java/J2EE, Spring MVC, Hibernate, EJB, Spring",
      "experience": 6
    },
    {
      "skill": "Design, code, test, and deploy J2EE based applications into industry-leading container/application server environments such as Websphere/Weblogic/JBos",
      "experience": 6
    },
    {
      "skill": "Knowledge of any Web technologies like AngularJs, Angular, React, NodeJs and Ionic Framework",
      "experience": 6
    },
    {
      "skill": "Designing and implementing web applications using J2EE, Spring, Spring MVC, Flex, Hibernate, EJB 3.0, Struts, Oracle 12g, ANT, Maven, workflow engines",
      "experience": 6
    },
    {
      "skill": "Experience developing mobile apps using cloud platforms",
      "experience": 6
    },
    {
      "skill": "Experience with API, SOAP/RESTful Web Services, GraphQL, usage in the Mobile Applications",
      "experience": 6
    },
    {
      "skill": "Deep technical knowledge of iOS and Android platforms, cloud message APIs and push notifications",
      "experience": 6
    },
    {
      "skill": "Experience with source code control, build, and release management",
      "experience": 6
    },
    {
      "skill": "Continuous learner, takes initiative, and understands what it takes to get outstanding customer satisfaction.",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, develop, modify, deploy, and support custom mobile applications for iOS and Android using the Ionic platform."
    },
    {
      "duty": "Work closely with architects, Sr. developers, managers, executives, and other groups throughout the development process."
    },
    {
      "duty": "Establish coding standards, code reviews, architecture of the Mobile Application Development."
    },
    {
      "duty": "Grow and support constituent facing mobile and web applications to streamline client experience."
    },
    {
      "duty": "Perform benchmark testing, as well as debugging and documentation of programs, code, and data flow."
    },
    {
      "duty": "Implement and support top programming practices and standards to deliver quality products predictably and consistently."
    },
    {
      "duty": "Execute and craft technical documentation of newly implemented features and bug fixes."
    },
    {
      "duty": "Ability to think through and articulate complex problems and solutions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in computer science/Engineering or a related area from an accredited college or university"
    }
  ]
}