{
  "meta": [
    {
      "job_title": "Director of Finance",
      "job_category": "Finance",
      "job_class": "Director",
      "sector": "Finance",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "GAAP Compliance",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Human Resources",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Tax Compliance",
      "experience": 5
    },
    {
      "skill": "Hospitality Accounting",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and be responsible for the accounting and finance procedures, practices, and policies for the hotel."
    },
    {
      "duty": "Develop and implement procedures and necessary training to promote the efficient, effective, and timely completion of accounting activities by property accountants and managers."
    },
    {
      "duty": "Provide financial analysis as required from Aparium key stakeholders; and readily collaborate with EVP of Finance, VP of Finance, GM on hotel financial goals through reports and advising."
    },
    {
      "duty": "Administer, maintain, and enforce legal and finance compliance initiatives, policies, and procedures (including SOX, PCI, and other legal financial reporting); and ensure adherence to Aparium policies and procedures and all applicable laws."
    },
    {
      "duty": "Oversee the hotel’s financial reporting and records management; coordinate and liaise with internal and external audits, prepare reports required by regulatory agencies."
    },
    {
      "duty": "Actively participate in the interviewing, hiring, training, scheduling, coaching, and motivating team members to create an environment that nurtures ideas and develops a future talent for succession planning."
    },
    {
      "duty": "Role model the company’s open-door policy and employee engagement practices, which makes the hotel a great place to work; demonstrate a positive work ethic and environment; consistently guide and monitor business ethics and good business practice, and perform other job-related duties as requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of five (5) years of progressive accounting and finance management experience; Bachelor’s degree in Accounting, Finance, or Hospitality is preferred though not required if you have years of proven experience; Background in hotel accounting would be great"
    }
  ]
}