{
  "meta": [
    {
      "job_title": "Associate Chemist (Entry)",
      "job_category": "Chemical R&D",
      "job_class": "Chemical R&D",
      "sector": "R&D",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Laboratory Work",
      "experience": 1
    },
    {
      "skill": "Formulation Development",
      "experience": 1
    },
    {
      "skill": "Analytical Method Development",
      "experience": 1
    },
    {
      "skill": "Quality Control",
      "experience": 1
    },
    {
      "skill": "Stability Testing",
      "experience": 1
    },
    {
      "skill": "Documentation",
      "experience": 1
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform extensive laboratory work to support pre-formulation development, formulation development, technology transfer activities, clinical trials, and evaluation of product performance and stability."
    },
    {
      "duty": "Help develop/validate/transfer analytical methods for product development; perform prototype/sample/stability testing for experimental or GMP purposes."
    },
    {
      "duty": "Develop efficient and accurate analytical procedures that meet all current regulatory requirements."
    },
    {
      "duty": "Develop efficient, accurate, and Quality Control laboratory friendly analytical procedures that can be used at QC laboratories located globally at different manufacturing sites."
    },
    {
      "duty": "Accurately interpret, document, and enter results into LIMS."
    },
    {
      "duty": "Precisely and thoroughly document the learnings and share the knowledge with the teams."
    },
    {
      "duty": "Perform analytical method development and validation, and transfer for multiple projects."
    },
    {
      "duty": "Help draft relevant testing protocols, reports, Specifications, and final methods."
    },
    {
      "duty": "Troubleshoot testing and/or analytical method related issues."
    },
    {
      "duty": "Follow written procedures and analytical laboratory practices to ensure the work quality and compliance."
    },
    {
      "duty": "Prioritizes workload by aligning with Analytical Development project leads to ensure that key objectives are met on time."
    },
    {
      "duty": "Ensures that documentations are up to date as per guidelines."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 60,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Chemistry or related field"
    }
  ]
}