{
  "meta": [
    {
      "job_title": "OSP Compliance Tech",
      "job_category": "Construction",
      "job_class": "Tech",
      "sector": "Construction",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Construction",
      "experience": 5
    },
    {
      "skill": "Network Inspection",
      "experience": 4
    },
    {
      "skill": "Grounding and Bonding",
      "experience": 4
    },
    {
      "skill": "Cable Repair",
      "experience": 4
    },
    {
      "skill": "Fiber Optic Splicing",
      "experience": 4
    },
    {
      "skill": "Project Coordination",
      "experience": 4
    },
    {
      "skill": "Oracle",
      "experience": 3
    },
    {
      "skill": "Fiber Transport Maintenance",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 3
    },
    {
      "skill": "Compliance Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Construct, build, repair, and inspect Hybrid Fiber Coax (HFC) networks for voice, video, and data services."
    },
    {
      "duty": "Coordinate with other utilities for permits, joint trench, pole applications, and service issues."
    },
    {
      "duty": "Conduct aerial hardware construction and installation including strand placement, tensioning, grounding, bonding, guy and anchor installation."
    },
    {
      "duty": "Lay conduit and install joint trenches for underground cable, coordinating with other utilities."
    },
    {
      "duty": "Respond to and determine proper course of action in emergency call-in situations to repair damaged cable lines."
    },
    {
      "duty": "Participate in the construction and/or repair of fiber, coax, and copper plant for networks."
    },
    {
      "duty": "Coordinate and inspect work done by contract labor and ensure work meets company and government regulations."
    },
    {
      "duty": "Use computerized tools and programs (Oracle) to coordinate bill of materials, purchase materials, maintain inventory levels, reconcile invoices, street release forms, zone changes, and computerized mapping systems."
    },
    {
      "duty": "Splice, repair, and activate fiber optic circuits, assist with the maintenance of fiber transport system, nodes, and reverse laser transmitters and receivers."
    },
    {
      "duty": "Ensure that work is performed in a timely and professional manner and meets all regulations, specifications, and standards set forth by the company and government agencies."
    },
    {
      "duty": "Obtain construction permits, utility permits, pole applications, including make-ready, right-of-way, railroad, road bore, and crossing permits. Create and file traffic plans for construction projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree in Telecommunications, Construction Management, or related field (Bachelor's preferred)"
    }
  ]
}