{
  "meta": [
    {
      "job_title": "HR Generalist",
      "job_category": "Human Resources",
      "job_class": "Generalist",
      "sector": "Human Resources",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Labor Relations",
      "experience": 2
    },
    {
      "skill": "Recruitment",
      "experience": 3
    },
    {
      "skill": "Employee Relations",
      "experience": 3
    },
    {
      "skill": "Human Resources Information Systems",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Adaptability",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage recruitment and hiring efforts including partnering with university co-op programs."
    },
    {
      "duty": "Create strategic business partnerships with front-line employees and supervisors to promote positive employee relations."
    },
    {
      "duty": "Create progressive discipline plans to monitor, review and make suggestions for corrective actions for attendance, punctuality, conduct and performance issues."
    },
    {
      "duty": "Implement human resource policies and procedures to ensure compliance with Federal and State regulatory requirements and reporting."
    },
    {
      "duty": "Coordinate recruitment efforts, establish interview and selection procedures, develop job announcements and interview materials, and conduct interviews for hourly employees."
    },
    {
      "duty": "Investigate questions and/or complaints to resolve employee relations issues."
    },
    {
      "duty": "Serve as first point of contact for labor relations to manage grievance procedures and administration of the collective bargaining agreement and labor union contract negotiations."
    },
    {
      "duty": "Coach and advise front-line employees and managers regarding employee relations policies, contractual labor agreements interpretation and proper operating procedures."
    },
    {
      "duty": "Partner with Talent Acquisitions to manage the workforce plan development and implementation, assisting with compensation and training initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Human Resources or a Business-related discipline."
    }
  ]
}