{
  "meta": [
    {
      "job_title": "Finance Controller",
      "job_category": "Finance",
      "job_class": "Controller",
      "sector": "Financial Services",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Technological Proficiency",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Management Accounting",
      "experience": 5
    },
    {
      "skill": "Financial Planning and Analysis",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Overall day-to-day management of the accounting and finance functions of multiple clients in a shared services environment playing the Controller role of your clients"
    },
    {
      "duty": "Participate in client design sessions to analyze requirements and redesign business processes in connection with FAO best practices in areas such as chart of account redesign, procure to pay, order to cash, month end close, record to report, etc."
    },
    {
      "duty": "Lead, manage and coach client services representatives, associates, senior associates and supervisors"
    },
    {
      "duty": "Review client’s monthly financial statements including month over month variance analysis and / or actual to budget analysis"
    },
    {
      "duty": "Analyze and interpret financial information for client management and provide actionable insight and decision support"
    },
    {
      "duty": "Continuously identify opportunities to enhance the clients monthly operations make suggestions for process improvements"
    },
    {
      "duty": "Understand our technology stack and identify additional add-on processes, systems, modules and integrations that can drive month end close efficiencies."
    },
    {
      "duty": "Define and document repeatable methodologies with appropriate tools and templates that can be leveraged for future projects."
    },
    {
      "duty": "Establish engagement budgets"
    },
    {
      "duty": "Direct initial assessments, implementations and onboarding of new FAO clients"
    },
    {
      "duty": "Write service agreements and statements of work"
    },
    {
      "duty": "Participate in meetings with new client prospects and in the proposal process"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting or Finance (Master's preferred)"
    },
    {
      "credential": "CPA Certification"
    }
  ]
}