{
  "meta": [
    {
      "job_title": "Senior Accountant",
      "job_category": "Accounting",
      "job_class": "Senior",
      "sector": "Finance",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Fixed Assets Accounting",
      "experience": 5
    },
    {
      "skill": "GAAP",
      "experience": 5
    },
    {
      "skill": "IFRS",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Internal Controls",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and oversee the day-to-day accounting operations, ensuring accuracy and adherence to established accounting principles."
    },
    {
      "duty": "Maintain and reconcile general ledger accounts, ensuring timely and accurate recording of financial transactions."
    },
    {
      "duty": "Collaborate with cross-functional teams to ensure proper recording and reporting of revenue recognition, expenses, and other financial activities."
    },
    {
      "duty": "Prepare and review financial statements, ensuring compliance with international accounting standards (IFRS or GAAP) and relevant regulatory requirements."
    },
    {
      "duty": "Lead the Fixed Assets Accounting process, including tracking, recording, and depreciating fixed assets in accordance with relevant accounting standards."
    },
    {
      "duty": "Participate in the month-end and year-end close processes, including journal entries, reconciliations, and variance analysis."
    },
    {
      "duty": "Contribute to the development and implementation of internal controls to safeguard company assets and ensure compliance with financial regulations."
    },
    {
      "duty": "Assist in the coordination of audits, acting as a liaison between external auditors and internal teams to provide necessary documentation and explanations."
    },
    {
      "duty": "Stay updated on changes in accounting regulations and standards, proactively identifying potential impacts on financial reporting and suggesting appropriate actions."
    },
    {
      "duty": "Mentor and provide guidance to junior team members, fostering their professional growth and development."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting, Finance, or a related field; CPA designation preferred."
    }
  ]
}