{
  "meta": [
    {
      "job_title": "Clinical Nurse (RN)",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Nursing Process",
      "experience": 5
    },
    {
      "skill": "Therapeutic Relationships",
      "experience": 5
    },
    {
      "skill": "Diagnostic and Monitoring",
      "experience": 5
    },
    {
      "skill": "Teaching and Coaching",
      "experience": 5
    },
    {
      "skill": "Quality Healthcare Practices",
      "experience": 5
    },
    {
      "skill": "Rapid Response",
      "experience": 5
    },
    {
      "skill": "Management and Delegation",
      "experience": 5
    },
    {
      "skill": "Education",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Professional Practice Evaluation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide hands-on care to patients in an evidence-based manner, within the Scope of Practice of the California Nursing Practice Act, regulatory requirements, and hospital policies."
    },
    {
      "duty": "Perform all steps of the nursing process, including assessing patients, interpreting data, planning, implementing, and evaluating care; coordinating care with other providers; and teaching the patient and family the knowledge and skills needed to manage their care and prevent complications."
    },
    {
      "duty": "Establish and maintain therapeutic relationships, mobilize the patient's strengths, and abilities towards participation in recovery and control over the plan of care."
    },
    {
      "duty": "Obtain accurate and relevant assessment data, interpret the data, determine nursing diagnosis, and monitor and evaluate data as frequently as needed based on stability."
    },
    {
      "duty": "Collaborate with the patient, family, and members of the health care team to develop an individualized plan of care; implement nursing and medical interventions safely; and evaluate the effectiveness of interventions."
    },
    {
      "duty": "Assess a patient's and family's learning needs and readiness to learn; teach needed information for self-care and illness prevention; and adjust information and expectations based on responses from the patient, developmental levels, physiological and psychological condition, and cultural variations."
    },
    {
      "duty": "Ability to rapidly grasp problem situations, respond quickly and appropriately, identify the need for and activate emergency protocols, and monitor and ensure quality healthcare practices."
    },
    {
      "duty": "Integrate multiple requests and work expectations by setting priorities, delegating tasks appropriately, seeking assistance as needed, and contributing to team building through participation in unit programs and meetings."
    },
    {
      "duty": "Learn and utilize the available technology for communication, documentation, and locating information regarding unusual clinical situations, diagnosis, and treatments; contribute to the knowledge and skill of other members of the nursing staff through formal or informal teaching, participation in professional groups, publications, and presentations."
    },
    {
      "duty": "Attain knowledge and competence that reflects current nursing practice, demonstrate commitment to lifelong learning, communicate effectively in a variety of formats in all areas of practice, and demonstrate leadership in the professional practice setting and the profession; evaluate own nursing practice in relation to professional practice standards and guidelines, relevant statutes, rules, and regulations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 75,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science in Nursing (BSN) from an accredited college or university preferred."
    },
    {
      "credential": "Current American Heart Association Certification for Basic Life Support for Healthcare Providers CA-RN (Registered Nurse)"
    }
  ]
}