{
  "meta": [
    {
      "job_title": "Licensing Coordinator",
      "job_category": "Insurance",
      "job_class": "Coordinator",
      "sector": "Insurance",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Insurance Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Research Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate and manage company licensing processes, including agent set up, license applications, renewals, and appointments in compliance with state laws and regulations."
    },
    {
      "duty": "Act as a liaison between the Home Office, Agents, and State Insurance Departments to facilitate the licensing and appointment process."
    },
    {
      "duty": "Maintain records, compile information, and submit necessary forms to keep current agents and internal claims adjusters licensed and appointed."
    },
    {
      "duty": "Create and provide updates on internal websites with insurance licensing changes and updates to insurance laws and regulations."
    },
    {
      "duty": "Process licensing expenses electronically through various systems and websites."
    },
    {
      "duty": "Maintain database of licensed employees and their continuing education requirements to ensure compliance with organization policies and government regulations."
    },
    {
      "duty": "Assist the Senior Licensing Specialist on projects relating to the Licensing Dept and perform other licensing duties as necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree or equivalent combination of education and experience required"
    }
  ]
}