{
  "meta": [
    {
      "job_title": "IT Support Specialist",
      "job_category": "Information Technology",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Hardware and Software Installation",
      "experience": 5
    },
    {
      "skill": "Network Support",
      "experience": 5
    },
    {
      "skill": "Technical Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "System Upgrades",
      "experience": 5
    },
    {
      "skill": "Hardware Maintenance",
      "experience": 5
    },
    {
      "skill": "Software Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Technical Documentation",
      "experience": 5
    },
    {
      "skill": "IT Support Training",
      "experience": 5
    },
    {
      "skill": "Knowledge of Networking Solutions",
      "experience": 5
    },
    {
      "skill": "RDP/RDS Management",
      "experience": 5
    },
    {
      "skill": "Technical Reporting",
      "experience": 5
    },
    {
      "skill": "User Training",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Proactive maintenance of computer environments by analyzing requirements, resolving problems, and installing hardware and software solutions."
    },
    {
      "duty": "Onsite and remote installation and support for workstations, servers, printers, networks, VoIP systems, and vendor-specific hardware and software."
    },
    {
      "duty": "First point of contact for inbound requests, leveraging strong commitment to customer service with an aptitude for problem-solving."
    },
    {
      "duty": "Performing scheduled software/hardware system checks & upgrades, and training others outside the department regarding troubleshooting techniques."
    },
    {
      "duty": "Providing technical support to employees and customers using phone, email, and the ticketing system; communicate to clients and assure compliance with all policies and procedures."
    },
    {
      "duty": "Developing expertise in in-house applications, maintaining and tracking of computers, telephones, and peripheral devices."
    },
    {
      "duty": "Conducting user training on hardware, software systems & peripheral devices and constantly improving client service, perception, and satisfaction."
    },
    {
      "duty": "Recording accurate and comprehensive information for requests, incidents, and resolutions, and documenting internal processes and procedures."
    },
    {
      "duty": "Facilitating a feedback loop between end-users, IT team, and other business functions, and conducting user training on hardware, software systems & peripheral devices."
    },
    {
      "duty": "Ability to work in a team and communicate effectively, learn quickly and adapt to changing requirements, and travel to assigned branches."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "A degree in Computer Technology or related discipline; or an equivalent combination of experience and education."
    },
    {
      "credential": "A minimum of at least 5 years PC, Networking troubleshooting/repair and cabling experience and have at least two current certifications."
    }
  ]
}