{
  "meta": [
    {
      "job_title": "Lateral Attorney",
      "job_category": "Legal",
      "job_class": "Attorney",
      "sector": "Law",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Business Litigation",
      "experience": 6
    },
    {
      "skill": "Estate Planning",
      "experience": 6
    },
    {
      "skill": "Probate Law",
      "experience": 6
    },
    {
      "skill": "Client Management",
      "experience": 6
    },
    {
      "skill": "Technology Utilization",
      "experience": 6
    },
    {
      "skill": "Community Engagement",
      "experience": 6
    },
    {
      "skill": "Legal Expertise",
      "experience": 6
    },
    {
      "skill": "Efficiency and Automation",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Demonstrate a deep understanding of one of our practice areas - business litigation, estate planning, and probate laws and practices."
    },
    {
      "duty": "Maintain and expand your book of business, bringing your clients and network to the firm."
    },
    {
      "duty": "Consistently explore opportunities to leverage technology, software, and automation tools to enhance the client experience, streamline processes, and stay ahead of the competition."
    },
    {
      "duty": "Participate actively in legal and non-legal community activities, contributing to our Engaged and Get Outside core values."
    },
    {
      "duty": "Continuously seek ways to automate and streamline internal processes, leading to improved efficiency in the delivery of legal services."
    },
    {
      "duty": "Embrace technology as a tool to enhance the client experience and drive efficiency. Stay ahead by leveraging software and automation solutions that outpace the competition."
    },
    {
      "duty": "Communicate with clarity, transparency, and directness. Engage in litigation without unnecessary games. Clients value straightforward advice and strategies."
    },
    {
      "duty": "Participate actively in the legal and broader community. Contribute your expertise and build connections that reflect our commitment to engagement."
    },
    {
      "duty": "Achieve a work-life balance that allows you to enjoy life beyond the office. We work hard and play hard."
    },
    {
      "duty": "Treat clients and colleagues like friends, demonstrating respect, patience, and a commitment to ensuring they comprehend complex legal matters."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Juris Doctor (JD) degree from an accredited law school."
    },
    {
      "credential": "Admitted to practice law in Ohio."
    },
    {
      "credential": "4-8 years of experience in business litigation, estate planning, and probate."
    },
    {
      "credential": "A book of business to bring to the firm."
    },
    {
      "credential": "Strong technological acumen and willingness to embrace innovation."
    },
    {
      "credential": "Proven ability to communicate clearly, concisely, and directly."
    },
    {
      "credential": "Active engagement in the legal and broader community."
    }
  ]
}