{
  "meta": [
    {
      "job_title": "Human Resources Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Recruitment and Selection",
      "experience": 5
    },
    {
      "skill": "Employee Engagement",
      "experience": 5
    },
    {
      "skill": "Labor Relations",
      "experience": 5
    },
    {
      "skill": "Legal Compliance",
      "experience": 5
    },
    {
      "skill": "Talent Assessment",
      "experience": 5
    },
    {
      "skill": "Employee Benefits",
      "experience": 5
    },
    {
      "skill": "Payroll Procedures",
      "experience": 5
    },
    {
      "skill": "Training Strategy",
      "experience": 5
    },
    {
      "skill": "Succession Planning",
      "experience": 5
    },
    {
      "skill": "Employment Law",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement human resources policies, programs and services including recruitment, selection, retention, legal compliance, negotiations with unions, employee relations, employee benefits, employment practices and procedures, and employee communications."
    },
    {
      "duty": "Serve as an internal consultant to facility management team, supervisors and employees on personnel issues that affect performance and business relationships while fostering a workplace environment consistent with the values and mission outlined by leadership of the company."
    },
    {
      "duty": "Works with operations manager and other members of management in recommending new approaches, policies, and procedures to effect continual improvements in efficiency of various departments and services performed."
    },
    {
      "duty": "Ensures uniform compliance with personnel policies by managing and reviewing all discipline, investigations, and worker’s compensation claims while reporting findings to operations manager and involving Vice President Field Human Resources when necessary."
    },
    {
      "duty": "Conducts recruitment effort for all personnel to fill various job openings. Reviews job applications and interviews applicants to match experience with specific job related requirements."
    },
    {
      "duty": "Responsible for compliance with federal and state legislation pertaining to all personnel and payroll matters and communicating those changes to appropriate staff."
    },
    {
      "duty": "Develops and administers various human resources procedures for the facility; monitoring to ensure proper implementation and interpretation."
    },
    {
      "duty": "Represents management in investigating, answering and settling grievances by arranging and scheduling grievance hearings between union personnel, supervisor, and the management team."
    },
    {
      "duty": "Oversees personnel record keeping related to new hire, employee review, promotions, transfers, employee benefits, separations, and exit interviews."
    },
    {
      "duty": "Responsible for assuring compliance with all HR policies, procedures, and regulatory criteria including food safety regulations."
    },
    {
      "duty": "Other duties as assigned; travel may be required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent experience."
    },
    {
      "credential": "Professional Human Resources (PHR) certification preferred."
    },
    {
      "credential": "Onsite HR experience at manager level strongly preferred."
    },
    {
      "credential": "Union avoidance experience highly desired."
    }
  ]
}