{
  "meta": [
    {
      "job_title": "Senior Electrical Project Manager/ Group Manager",
      "job_category": "Electrical Engineering",
      "job_class": "Senior Manager",
      "sector": "Engineering",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Electrical Engineering",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Resource Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage large electrical projects from initiation to closeout, ensuring adherence to project scope, budget, schedule, and quality standards."
    },
    {
      "duty": "Develop comprehensive project plans, including scope, schedule, budget, resources, and risk mitigation strategies."
    },
    {
      "duty": "Collaborate with project managers to address challenges, provide guidance, and facilitate effective decision-making."
    },
    {
      "duty": "Allocate and manage project resources, including personnel, materials, and equipment, to optimize project efficiency and performance."
    },
    {
      "duty": "Collaborate with cross-functional teams, including engineers, designers, contractors, and subcontractors, to ensure effective communication and alignment of project objectives."
    },
    {
      "duty": "Identify potential risks and challenges associated with electrical projects and develop mitigation strategies to minimize project disruptions."
    },
    {
      "duty": "Provide executive-level project updates and address complex issues or concerns."
    },
    {
      "duty": "Provide mentorship and performance feedback to the project management team, encouraging collaboration and high performance."
    },
    {
      "duty": "Assist project managers with monitoring the progress of projects in the division."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Electrical Engineering, Project Management or a related field; Master's degree is a plus."
    },
    {
      "credential": "Project management certification (PMP) preferred."
    }
  ]
}