{
  "meta": [
    {
      "job_title": "SAP Data Lead",
      "job_category": "Data Management",
      "job_class": "Lead",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Migration Life Cycle Implementation",
      "experience": 5
    },
    {
      "skill": "SAP Data Services + SAP Information Steward tools expertise",
      "experience": 5
    },
    {
      "skill": "DATA Quality + Governance Process",
      "experience": 5
    },
    {
      "skill": "Syniti Advance Data Management",
      "experience": 5
    },
    {
      "skill": "Data Intelligence HANA / HANA Data Services Project experience",
      "experience": 3
    },
    {
      "skill": "Lead customers engagements for full data lifecycle requirement",
      "experience": 5
    },
    {
      "skill": "Provide customers best practices for data conversion into SAP and data management",
      "experience": 5
    },
    {
      "skill": "Engage in leading engagements for business data inside and outside SAP solution",
      "experience": 5
    },
    {
      "skill": "Building, maintaining, and driving the schedule of Data Value stream activities",
      "experience": 5
    },
    {
      "skill": "Leadership and oversight of Data Value stream team",
      "experience": 5
    },
    {
      "skill": "Engagement with Project Team Leads for IT architecture to enable Data Quality reporting and business processes",
      "experience": 5
    },
    {
      "skill": "Cross-functional master, functional, and transactional data design related to Advanced Planning capabilities",
      "experience": 5
    },
    {
      "skill": "Tracking project deliverables and providing status reports",
      "experience": 5
    },
    {
      "skill": "Tracking risks, assumptions, issues, and dependencies to the project",
      "experience": 5
    },
    {
      "skill": "Ability to lead a team of data experts and work with Functional team and legacy experts",
      "experience": 5
    },
    {
      "skill": "Training and transferring knowledge to the team members",
      "experience": 5
    },
    {
      "skill": "Administering ERP in production environment",
      "experience": 5
    },
    {
      "skill": "Managing database optimization, back-up, and recovery",
      "experience": 5
    },
    {
      "skill": "Monitoring new software releases, support packs, and kernel upgrades",
      "experience": 5
    },
    {
      "skill": "Troubleshooting at the ERP and database level",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the implementation of data migration life cycle and SAP data services using expertise in DATA quality and governance processes."
    },
    {
      "duty": "Engage in customer interactions to understand data lifecycle requirements and provide best practices for data conversion into SAP."
    },
    {
      "duty": "Manage, maintain, and drive the schedule of Data Value stream activities, ensuring alignment with the overall project plan and timeline."
    },
    {
      "duty": "Provide leadership and oversight to the Data Value stream team, engaging with Project Team Leads in coordinating IT architecture for Data Quality reporting and business processes."
    },
    {
      "duty": "Design cross-functional master, functional, and transactional data related to Advanced Planning capabilities, ensuring data accuracy and consistency."
    },
    {
      "duty": "Track project deliverables, risks, assumptions, issues, and dependencies, and provide accurate status reports to project stakeholders."
    },
    {
      "duty": "Lead a team of data experts, work with the Functional team and legacy experts, and transfer knowledge to team members."
    },
    {
      "duty": "Administer ERP in a production environment, manage database optimization, back-up, recovery, and monitor the occurrence of new software releases and upgrades."
    },
    {
      "duty": "Perform troubleshooting at the ERP and database levels to ensure smooth operation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or related field (Master's preferred) with relevant certifications in SAP Data Management and related tools."
    }
  ]
}