{
  "meta": [
    {
      "job_title": "Senior Program Finance Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "ERP Systems Management",
      "experience": 10
    },
    {
      "skill": "SAP",
      "experience": 10
    },
    {
      "skill": "COBRA",
      "experience": 10
    },
    {
      "skill": "Excel",
      "experience": 10
    },
    {
      "skill": "Microsoft PowerPoint",
      "experience": 10
    },
    {
      "skill": "Earned Value Management",
      "experience": 10
    },
    {
      "skill": "Program Finance",
      "experience": 10
    },
    {
      "skill": "Financial Reporting",
      "experience": 10
    },
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Leadership Development",
      "experience": 10
    },
    {
      "skill": "Change Management",
      "experience": 10
    },
    {
      "skill": "Security Clearance",
      "experience": 10
    },
    {
      "skill": "Executive Presentations",
      "experience": 10
    },
    {
      "skill": "Fast-paced Environment Adaptability",
      "experience": 10
    },
    {
      "skill": "EVM Analysis",
      "experience": 10
    },
    {
      "skill": "Costpoint ERP System Optimization",
      "experience": 10
    },
    {
      "skill": "Financial Compliance",
      "experience": 10
    },
    {
      "skill": "Milestone Invoicing",
      "experience": 10
    },
    {
      "skill": "Program Cash Forecasting",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive program performance and employee engagement initiatives."
    },
    {
      "duty": "Partner with Program Managers, Technical Leads, and Division/Sector leadership to guide financial performance of contracts."
    },
    {
      "duty": "Oversight of program financials for Orders, Sales, EBIT, and Cash including preparation of financial reports and briefings to leadership."
    },
    {
      "duty": "Lead the improvement and streamlining of policies and procedures, including driving utilization of Cobra for Estimate-at-Completion (EAC) program variance analyses, and optimizing the Costpoint ERP system."
    },
    {
      "duty": "Responsible for influencing day-t day execution of all financial activity related to Programs, Proposals, Reviews, including the development of strategies necessary to achieve program financial goals."
    },
    {
      "duty": "Development/review of time-phased budgets following contract award; establishment of key performance metrics and milestones; ongoing reporting of Program(s) cost and schedule variances in accordance with company policy; ETC/EAC preparation and review, analysis and monitoring; maintenance and reporting of timely performance data to division management team as well as customer; investigation of financial irregularities; financial program compliance; prepare milestone invoices and analyze program cash forecast."
    },
    {
      "duty": "Ability to analyze earned value metrics and understand concepts; ability to identify issues based on results; work with Control Account Managers and Program Managers to help interpret the data into meaningful information; ability to train on EV concepts and coordinate inputs across multiple functional organizations, help analyze variance analysis inputs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in a relatable field (Graduate Degree preferred)"
    }
  ]
}