{
  "meta": [
    {
      "job_title": "Medical Safety Physician",
      "job_category": "Pharmaceuticals",
      "job_class": "Physician",
      "sector": "Healthcare",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medical Safety",
      "experience": 5
    },
    {
      "skill": "Pharmacovigilance",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Clinical Trial Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Medical Review",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Data Synthesis",
      "experience": 5
    },
    {
      "skill": "Pharmaceutical Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work in cross-functional expert teams across global regions to develop or support proactive risk management strategies for assigned compounds."
    },
    {
      "duty": "Support development of risk management strategies for investigational compounds."
    },
    {
      "duty": "Plan, manage/perform and monitor all pharmacovigilance activities for assigned drug responsibilities, including: Perform Clinical Safety tasks on individual clinical trial level (medical assessments of SAEs, AESIs, DLTs) Periodic Benefit Risk Evaluation Reports / PADERs Development Safety Update Reports Risk Management Plans Clinical Overview Statements Continuous monitoring and further development of the product safety profile Safety issue management Set-up of safety analyses in both post marketing and clinical trial databases Review and medical-scientific input to regulatory documents"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "US MD or DO degree or international equivalent from an accredited institution and more than 5 years of applicable experience, required.Minimum of 2 years of experience in the pharmaceutical industry or pharmacovigilance required.Leadership experience required. SystImmune is a stable, well-funded biotech company with a bright future."
    }
  ]
}