{
  "meta": [
    {
      "job_title": "Bank Teller",
      "job_category": "Banking",
      "job_class": "Teller",
      "sector": "Banking",
      "salary": 31000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Interacting with customers to complete transactions, resolve problems and cross-sell Nicolet products and services."
    },
    {
      "duty": "Maintaining a high level of customer service and referring customers to appropriate staff where necessary."
    },
    {
      "duty": "Organizing, balancing, and proofing cash daily to maintain accurate transactions processed."
    },
    {
      "duty": "Identifying payees, verifying signatures and endorsements."
    },
    {
      "duty": "Staying current on applicable banking regulations and security procedures and practices to prevent fraud or other bank losses."
    },
    {
      "duty": "Answering customer telephone inquiries and providing information in accordance with Nicolet policies."
    },
    {
      "duty": "Assisting with night depository duties, including logging bags, processing deposits, making change orders, issuing receipts, etc."
    },
    {
      "duty": "Promoting Nicolet products and services by identifying customer needs and suggesting appropriate products to increase customer account relationships."
    },
    {
      "duty": "Recommending corrective services to resolve customer complaints."
    },
    {
      "duty": "Maintaining appropriate controls to ensure full compliance with applicable laws and regulations, thereby fulfilling legal responsibilities and enhancing the quality of Nicolet."
    },
    {
      "duty": "Ability to understand the value of diversity within the workplace and to work successfully with others without regard to age, gender, race, sexual orientation, ethnicity, culture, religion, disability status, socioeconomic status or other non-job-related classification."
    },
    {
      "duty": "A commitment to Nicolet’s policies on equal employment opportunities and non-discrimination with a willingness to pursue efforts of inclusion and respect toward different perspectives."
    },
    {
      "duty": "Performing all other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Cash Handling",
      "experience": 3
    },
    {
      "skill": "Banking Regulations",
      "experience": 3
    },
    {
      "skill": "Sales Skills",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent."
    },
    {
      "credential": "1+ years of cash handling experience."
    }
  ]
}