{
  "meta": [
    {
      "job_title": "Deal Desk Analyst 2",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Sales",
      "salary": 72000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "FP and A",
      "experience": 5
    },
    {
      "skill": "Sales Finance",
      "experience": 5
    },
    {
      "skill": "Sales Operations",
      "experience": 5
    },
    {
      "skill": "Deal Desk",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Compliance",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage first line approvals for the deal approval process, including deal structuring and accelerating deal closures."
    },
    {
      "duty": "Help structure profitable and compliant transactions that address the needs of a diverse set of internal corporate customers, maximize revenue, and increase the effectiveness and productivity of the Sales force."
    },
    {
      "duty": "Meet with sales teams to identify Customers' critical business issues and assist in structuring transactions that meet both company's requirements and the Customer's needs."
    },
    {
      "duty": "Manage the day-to-day deal approval process, communicate via documented business case with cross-functional stakeholders to articulate deal value in a consistent manner."
    },
    {
      "duty": "Draft and certify customer contracts, responsible for adherence to and compliance with policies and procedures."
    },
    {
      "duty": "Interact with internal stakeholders such as Legal, Sales Operations, Sales Finance, Revenue Assurance, Business Units, Order Management, Credit, and other functions."
    },
    {
      "duty": "Regularly communicate with sales teams to ensure consistent application of process and policy. Ensure that transactions adhere to internal revenue recognition policies and operational guidelines."
    },
    {
      "duty": "Prepare in-quarter deal status and communication to management. Evaluate current processes and offer recommendations for areas of improvement."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelors in Finance or Accounting or equivalent experience"
    }
  ]
}