{
  "meta": [
    {
      "job_title": "Project Controls Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Transportation",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 9
    },
    {
      "skill": "Cost Control",
      "experience": 9
    },
    {
      "skill": "Scheduling",
      "experience": 9
    },
    {
      "skill": "Risk Management",
      "experience": 9
    },
    {
      "skill": "Budget Management",
      "experience": 9
    },
    {
      "skill": "Data Analysis",
      "experience": 9
    },
    {
      "skill": "Negotiation",
      "experience": 9
    },
    {
      "skill": "Reporting",
      "experience": 9
    },
    {
      "skill": "Supervision",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure compliance with project management standards and policy in project control functions."
    },
    {
      "duty": "Develop integrated master schedule, master risk register, and spend forecast using standard tools."
    },
    {
      "duty": "Support project management team in evaluation and impact assessment of project risks."
    },
    {
      "duty": "Collect ongoing progress and performance data from Engineering systems or project management team."
    },
    {
      "duty": "Integrate external cost and schedule data to enable accurate performance reporting."
    },
    {
      "duty": "Provide subject matter expertise to senior management on construction and/or engineering schedule management."
    },
    {
      "duty": "Manage project or portfolio controls data in approved systems and tools."
    },
    {
      "duty": "Train and mentor junior team members with schedule management and project controls responsibilities."
    },
    {
      "duty": "Support development of cost engineering policies, procedures, and performance metrics."
    },
    {
      "duty": "Prepare and deliver related reports, or presentations."
    },
    {
      "duty": "Manage consulting contracts or task orders and/or supervise consultant staff."
    },
    {
      "duty": "Perform review and analysis of contractor or third-party baseline and schedule updates."
    },
    {
      "duty": "Provide advice and analyses on project delay claims or disputes."
    },
    {
      "duty": "Assure quality and timeliness of recurring and ad-hoc team deliverables."
    },
    {
      "duty": "Ensure integration of scheduling and cost engineering practices and methods."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Construction Management, Engineering, Science, or a related field (Master's preferred)"
    },
    {
      "credential": "PMP or PMI-SP certification in good standing"
    }
  ]
}