{
  "meta": [
    {
      "job_title": "Senior Director, CMC",
      "job_category": "Logistics",
      "job_class": "Senior Director",
      "sector": "Supply Chain Logistics",
      "salary": 238500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Analytical Chemistry",
      "experience": 10
    },
    {
      "skill": "Biochemistry",
      "experience": 10
    },
    {
      "skill": "Pharmaceutical Chemistry",
      "experience": 10
    },
    {
      "skill": "Drug Development",
      "experience": 10
    },
    {
      "skill": "Biologics",
      "experience": 10
    },
    {
      "skill": "GMP Regulations",
      "experience": 10
    },
    {
      "skill": "Regulatory Affairs",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead efforts to develop and manufacture drug substance and drug product and to track clinical drug inventory."
    },
    {
      "duty": "Provide technical support and troubleshooting for production activities at CMOs."
    },
    {
      "duty": "Collaborate with other functions to develop and implement drug substance and drug product specifications."
    },
    {
      "duty": "Participate in ensuring drug supplies are available on-time for support of clinical studies."
    },
    {
      "duty": "Author and review batch records, change controls, and other technical documents."
    },
    {
      "duty": "Lead the development and validation of analytical methods according to ICH guidelines."
    },
    {
      "duty": "Oversee formulation development and stability studies for drug substance and drug product for multiple compounds."
    },
    {
      "duty": "Collaborate with QA, Regulatory Affairs, and other functions towards timely generation of regulatory documents."
    },
    {
      "duty": "Determine initial development pathway for molecules being considered as development candidates."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "BS/MS/PhD in Analytical Chemistry, Biochemistry, or Pharmaceutical Chemistry is required, with 10+ years of related industry experience in drug substance and/or drug product development, production and analysis."
    }
  ]
}