{
  "meta": [
    {
      "job_title": "Development Advisor",
      "job_category": "Business Development",
      "job_class": "Advisor",
      "sector": "Sales",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Process Management",
      "experience": 8
    },
    {
      "skill": "Business Development",
      "experience": 8
    },
    {
      "skill": "Networking",
      "experience": 8
    },
    {
      "skill": "Consultative Sales",
      "experience": 8
    },
    {
      "skill": "CRM Software",
      "experience": 8
    },
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Consistently meet revenue targets for new employer acquisition in the designated region."
    },
    {
      "duty": "Perform outreach and prospecting through varied channels to generate leads and nurture them through the sales process."
    },
    {
      "duty": "Be a product expert on the membership offering, maintain knowledge of fee-based services, and stay updated on new offerings."
    },
    {
      "duty": "Network and engage in sales activities to develop and nurture leads, including participation in events and external sources."
    },
    {
      "duty": "Conduct consultative sales calls and product demonstrations with key managers and senior-level executives, effectively positioning the value proposition of the membership."
    },
    {
      "duty": "Collaborate with Marketing to develop inbound membership inquiries, qualify, develop, and close, as well as to support all marketing initiatives."
    },
    {
      "duty": "Proactively document sales activities and manage the sales pipeline in the membership database."
    },
    {
      "duty": "Identify potential member organizations in the assigned region and develop and nurture those leads."
    },
    {
      "duty": "Engage in networking and sales activities, including participation in various events, to support Catapult's awareness-building efforts."
    },
    {
      "duty": "Proactively network monthly to develop referrals and relationships, and develop relationships with community resources to maximize opportunities."
    },
    {
      "duty": "Meet new member dues revenue goals and contribute to region member retention for 12 months."
    },
    {
      "duty": "May be assigned additional duties within Catapult to enhance member and non-member experiences."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in sales, marketing, human resources or other relevant field highly preferred."
    }
  ]
}