{
  "meta": [
    {
      "job_title": "Clinical Transition Specialist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Proactively maintains and grows relationships with referrals sources to increase sales and patient starts. Serves as key point of contact and representative of Option Care to provide education, assistance, and service to referral sources.Interacts with area service providers on a daily basis to sell Option Care services that could assist in the care for discharging patients. Conducts assessment of patients selected by the hospital to ensure patient is a viable candidate for alternative site care.Uses sales techniques to educate patients, their families and the facility staff about the services and products provided by Option Care.Provides hands on, in person education to patients and their caregivers with the goal of timely discharge and therapy independence.Effectively communicates with agency staff, medical team, patients and family throughout the discharge process to implement an effective treatment plan.Responsible for collecting, reviewing and completing pre-admission information and securing related signoff.Partners with Account Manager and Regional Sales Director to create and execute area business and growth plan.Communicates frequently with Account Manager to discuss opportunities, assess progress, and provide feedback related to promoting the services of Option CarePartners with Account Manager and marketing staff to deliver educational and promotional programs to patient/caregiver and referral sources.Reviews the patient’s medical record to obtain both pertinent medical history and primary/ secondary insurance payor information and communicates this to patient registration department.Proactively initiates care transition coordination with referral sources and internal partners to ensure seamless patient transitions to home or ATS. Participates with any data collection required for therapy start and patient tracking process. This may include facilitating the transfer of orders via phone, fax, and e-prescribingMaintains confidentiality of patient and proprietary information and observes legal guidelines for safeguarding the confidentiality of patient and proprietary Option Care information.Provides oversight and input to the providers regarding the patient and proper assessment and treatment process and transition to home care.Serves as a point of contact, coordination, and communication with other providers.Makes arrangements for any special medical supplies or appliances to be available."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Licensed Registered Nurse (RN) or licensed Pharmacist in the state of practice and at least 2 years of experience in the healthcare industry."
    }
  ]
}