{
  "meta": [
    {
      "job_title": "R&D Intern",
      "job_category": "Research & Development",
      "job_class": "Intern",
      "sector": "Software Engineering",
      "salary": 5000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Analytical Chemistry",
      "experience": 3
    },
    {
      "skill": "Polymeric Materials",
      "experience": 3
    },
    {
      "skill": "Chemical/Biological Characterization",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Lab Work",
      "experience": 3
    },
    {
      "skill": "Experimental Design",
      "experience": 3
    },
    {
      "skill": "Technical Writing",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct structure-property relationship studies of polymeric materials and advanced imaging technologies."
    },
    {
      "duty": "Perform chemical/biological characterization, solvent extraction, chromatographic separation, and spectral interpretation."
    },
    {
      "duty": "Independently develop new analytical methods, design and execute complex, non-standard laboratory studies."
    },
    {
      "duty": "Prepare high-quality technical documents and thoroughly document experiments."
    },
    {
      "duty": "Interact with lens designers, contact lens metrology leads, Clinical Project leads, and Vision/Data Scientists."
    },
    {
      "duty": "Conduct studies, prepare and modify formulations, and participate in lens fabrication and characterization."
    },
    {
      "duty": "Search literature, design and conduct experiments to test ideas, and discuss and write technical reports."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Enrollment in an accredited university or college pursuing at least a Bachelors level degree in Chemistry, Polymer Chemistry, Analytical Chemistry, Polymer Science, Organic Chemistry, Materials Science, Chemical Engineering, Biochemistry, Biology, Biotechnology, Process Engineering, Ocular Cell Biology or related major."
    }
  ]
}