{
  "meta": [
    {
      "job_title": "Executive Director",
      "job_category": "Education",
      "job_class": "Director",
      "sector": "Education",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Implement district's education and special programs through the supervision, support, and evaluation of Principals."
    },
    {
      "duty": "Promote high standards and expectations of all students and staff for academic performance."
    },
    {
      "duty": "Manage personnel, including hiring and retaining high-quality school leaders."
    },
    {
      "duty": "Supervise, coach, and evaluate Principals using performance standards and evaluation models."
    },
    {
      "duty": "Conduct visits to school sites and classrooms to observe, coach, and support Principals."
    },
    {
      "duty": "Plan and lead professional development of Principals focused on instructional leadership and effective implementation of the district’s curriculum and instruction."
    },
    {
      "duty": "Analyze school, district, and state assessment results to determine school progress and develop next steps to improve student achievement."
    },
    {
      "duty": "Coach and support school leaders in various areas, including school culture, monitoring teacher performance, data-driven instructional practices, and resource utilization."
    },
    {
      "duty": "Develop instructional leadership capacity among principals and leadership teams."
    },
    {
      "duty": "Assist in resolving problems/issues with Principals, Parents, and Staff."
    },
    {
      "duty": "Monitor categorical and special programs and grants for school programs."
    },
    {
      "duty": "Represent School District effectively in the community, state, and nation."
    },
    {
      "duty": "Attend work on a prompt and regular basis."
    },
    {
      "duty": "Maintain confidentiality and collaborative working relationships with the public, students, and other employees."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in Educational Leadership."
    },
    {
      "credential": "Doctorate degree in Education, desired."
    },
    {
      "credential": "Professional Educator License (PEL) with a Principal or General Administrative endorsement required."
    },
    {
      "credential": "Performance Evaluation Qualifications (Principal) required."
    }
  ]
}