{
  "meta": [
    {
      "job_title": "Vice President of Business Development",
      "job_category": "Business Development",
      "job_class": "Vice President",
      "sector": "Management",
      "salary": 170000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Develop and oversee the Business Development Team to drive business growth revenue growth in prioritized territories through interactions with existing guests and new prospects."
    },
    {
      "duty": "Supervise/management of the Business Development Managers to introduce and promote to new guests, as well as continue to build ongoing relationships, gain trust and earn repeat business with existing guests."
    },
    {
      "duty": "Lead and coach the Business Development team on best practice sales techniques for in-person meetings and telephone interactions."
    },
    {
      "duty": "Define the objectives and goals for each Business Development territory to achieve and/or exceed the overall business target."
    },
    {
      "duty": "Manage and develop the Business Development team to achieve the set goals."
    },
    {
      "duty": "Ensure there is a clear plan in place for each territory including a schedule of events and approach to database mining to deliver maximum exposure to guests and prospects with an agreed cycle of outreach for the upcoming year."
    },
    {
      "duty": "Work with the SVP Sales and Product to plan and budget hosted events; ensure compliance with the budget."
    },
    {
      "duty": "Ensure the Business Development team delivers appropriate levels of inquiries, meetings and events follow-up so that all information is correctly input into CRM system and handed over to the relevant Travel Consultant to ensure seamless prospect and guest experience."
    },
    {
      "duty": "Provide regular \\"
    },
    {
      "duty": "Collaborate with all departments across Scott Dunn – both in the US and internationally."
    },
    {
      "duty": "Act as an ambassador of Scott Dunn’s values, company culture and brand messaging."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration or related field (Master's preferred)"
    }
  ]
}