{
  "meta": [
    {
      "job_title": "Administrative Assistant II",
      "job_category": "Administration",
      "job_class": "Assistant",
      "sector": "Administration",
      "salary": 21000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure department supply needs are met including office and lab supply inventory and ordering."
    },
    {
      "duty": "Responsible for organization and maintenance of department filing systems including potentially confidential data."
    },
    {
      "duty": "Coordinate meetings and meals (including vendor visits with department), maintains calendars, assists in travel arrangements as necessary, etc."
    },
    {
      "duty": "May provide clerical support as necessary, including filing, faxing, copying, performing data entry, etc."
    },
    {
      "duty": "Manage incoming and outgoing mail and product samples including receiving and shipping samples domestically and internationally."
    },
    {
      "duty": "Coordinate building maintenance as needed."
    },
    {
      "duty": "Handle invoices and purchase order requests."
    },
    {
      "duty": "Order finished product from redress, warehouse and retail stores as requested by the team."
    },
    {
      "duty": "Organize and tidy common areas including break room, mail areas and conference rooms as needed."
    },
    {
      "duty": "Respond to various inquiries for information according to general guidelines."
    },
    {
      "duty": "Perform routine assignments under limited supervision."
    },
    {
      "duty": "Draft product evaluation protocols according to templates and instructions."
    },
    {
      "duty": "Assist the team in running product evaluations and building panels under limited supervision."
    },
    {
      "duty": "Proactive in engaging internal employees to participate in product evaluations."
    },
    {
      "duty": "Prepare grammatically correct correspondence, reports, tables, and analyses."
    },
    {
      "duty": "Enter and remove small stability samples from freezer or oven on a scheduled basis, training to be provided."
    },
    {
      "duty": "Provide general administrative support to one or more managers."
    },
    {
      "duty": "Exercise discretion in handling of confidential material and information."
    },
    {
      "duty": "Assist in special projects as assigned."
    },
    {
      "duty": "Recommends improvements on administrative procedures and implements changes."
    },
    {
      "duty": "Ensure department supplies needs are met."
    },
    {
      "duty": "Manage department communication for manager(s) including mail and email."
    },
    {
      "duty": "Coordinate meetings, maintains calendars, makes travel arrangements, etc."
    },
    {
      "duty": "May provide clerical support as necessary, including filing, faxing, copying, performing data entry, etc."
    },
    {
      "duty": "May provide guidance and training to less experienced administrative staff."
    },
    {
      "duty": "Complete other duties as requested."
    },
    {
      "duty": "Contacts are frequent with individuals representing other departments, and/or representing outside organizations."
    },
    {
      "duty": "Contacts involve obtaining or providing information or data on matters of moderate importance to the function of the department or which may be of sensitive nature."
    },
    {
      "duty": "Demonstrated ability in the application of requisite skills and applies additional skills and knowledge acquired through experience to perform the more complex tasks of the position."
    },
    {
      "duty": "Generally receive no instructions on routine assignments while under limited supervision."
    },
    {
      "duty": "Receive general instructions on new work, which is generally reviewed upon completion."
    }
  ]
}