{
  "meta": [
    {
      "job_title": "Electromagnetics Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Technology",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "MATLAB",
      "experience": 5
    },
    {
      "skill": "Radar/Satellite Communications",
      "experience": 5
    },
    {
      "skill": "Electromagnetics Modeling",
      "experience": 5
    },
    {
      "skill": "Code Development",
      "experience": 5
    },
    {
      "skill": "Algorithm Development",
      "experience": 5
    },
    {
      "skill": "Signal Processing",
      "experience": 5
    },
    {
      "skill": "Antenna Modeling",
      "experience": 5
    },
    {
      "skill": "RF Circuit Modeling",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Technical Writing",
      "experience": 5
    },
    {
      "skill": "Proposal Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and utilize MATLAB code for satellite communications (SATCOM), EW, and electromagnetics modeling."
    },
    {
      "duty": "Engage in personal career and technical growth as well as the growth of others through mentoring, training, and collaboration."
    },
    {
      "duty": "Perform code testing and validation, including unit test development and maintenance."
    },
    {
      "duty": "Develop technical solutions to complex technical challenges in the areas of electromagnetics and satellite communications."
    },
    {
      "duty": "Utilize commercial electromagnetic simulation software packages to model antennas, RF circuits, propagation, and scattering."
    },
    {
      "duty": "Foster and develop innovative, transformational solutions to sensing, SATCOM, and antenna related challenges and capability gaps."
    },
    {
      "duty": "Evaluate technologies, identify risks, and develop alternate solutions."
    },
    {
      "duty": "Conduct experiments and data collections."
    },
    {
      "duty": "Identify technology gaps and their solutions for insertion into both fielded and developmental systems."
    },
    {
      "duty": "Participate in MITRE Labs’ presence in peer-reviewed publications, patent submissions, and external conferences/workshops."
    },
    {
      "duty": "Support proposal development efforts to expand our work program into new areas."
    },
    {
      "duty": "Lead small teams in designing innovative electromagnetics solutions to complex challenges."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "BS with at least 5 years of related experience in communications, electromagnetics, radar, or EW."
    },
    {
      "credential": "MS or PhD in electrical engineering, math, or physics."
    },
    {
      "credential": "Capable of obtaining and maintaining a Top Secret security clearance."
    }
  ]
}