{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Software Engineering",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage Online Software Development project activities for multiple projects across all project phases, including initiation, planning, execution, monitoring, control and closure."
    },
    {
      "duty": "Work collaboratively with development team, lead architect and the management to determine technical direction and approach to system design and implementation, including both brand products and supporting systems."
    },
    {
      "duty": "Create, manage and track project vehicles, including, but not limited to Project schedule so Detailed project plan so Project scope statement so Cost estimate so Resource plan so Risk and issues log so Status reports for upper management, Tailor project management, development and support processes to meet the needs of individual (new and/or ongoing) projects."
    },
    {
      "duty": "Manage the day-to-day activities of projects and staff; communicate with project teams as necessary to ensure project deliverables are on schedule and within cost parameters."
    },
    {
      "duty": "Communicate and collaborate with internal and external customers as needed in regards to project deliverables including managing expectations, presenting and interfacing with sponsors."
    },
    {
      "duty": "Make decisions and communicate trade-offs and risks; drive key decisions across projects."
    },
    {
      "duty": "Make recommendations to management about schedules, prioritization and resource allocation with input from team members."
    },
    {
      "duty": "Provide ongoing project plan/status reporting for use by account managers, clients and management."
    },
    {
      "duty": "Provide input into strategic planning and asset creation processes."
    },
    {
      "duty": "Manage resource planning and organizational capacity planning."
    },
    {
      "duty": "Coach and train project team members on Software Development processes and best practices."
    },
    {
      "duty": "Contribute to the design and coding of products."
    },
    {
      "duty": "Contribute to program level activities including M&A activities."
    },
    {
      "duty": "Demonstrable experience of engagement with Engineering Teams - Configuration Management, Deployment tools, and Continuous Integration to execute infrastructure projects."
    },
    {
      "duty": "Flexibility to engage with team in non-regular hours."
    },
    {
      "duty": "Maturity to navigate and work with senior engineering folks and still get things done."
    },
    {
      "duty": "Be a role model servant-leader to bring value to the business with process and tools."
    },
    {
      "duty": "Manage multiple dependencies in project and program delivery"
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Software Development",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Resource Planning",
      "experience": 5
    },
    {
      "skill": "Cross-functional Team Leadership",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    },
    {
      "skill": "Continuous Integration",
      "experience": 5
    },
    {
      "skill": "M&A activities",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. or B.A. degree in Business Administration, Management, Project Management, Computer Science or related field"
    }
  ]
}