{
  "meta": [
    {
      "job_title": "Universal Branch Associate",
      "job_category": "Finance",
      "job_class": "Associate",
      "sector": "Finance",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide highest level member service through efficient, accurate transaction processing and applying a consultative needs-based sales approach."
    },
    {
      "duty": "Establish new member relationships, and deepening and retaining existing relationships, to cross sell products and services."
    },
    {
      "duty": "Educate members about the most convenient way to complete transaction processing in the branch and through other channels."
    },
    {
      "duty": "Resolve member complaints and concerns quickly and efficiently and involve other functional areas as needed."
    },
    {
      "duty": "Handle large volumes of cash and negotiable items."
    },
    {
      "duty": "Assist management with daily operational tasks including operator, ATM, TellerInfinity and branch proof."
    },
    {
      "duty": "Open new memberships, new accounts, new loans and process loan and account transactions."
    },
    {
      "duty": "Refer members to branch business partners for consultation on Financial Services, Insurance Services, Real Estate and Business products as appropriate to meet member needs."
    },
    {
      "duty": "Follow all applicable policies and procedures. Utilize required programs and systems to assist with cross selling products and services."
    },
    {
      "duty": "Acquire in-depth knowledge of credit union products and services through ongoing training and education."
    },
    {
      "duty": "Meet or exceed established individual and team goals through the consistent application of the Sales and Service model in all member interactions."
    },
    {
      "duty": "Support the successful implementation of marketing programs and promotions by creating member awareness."
    },
    {
      "duty": "Adhere to all Credit Union policies, procedures, and regulatory agency requirements."
    },
    {
      "duty": "Participate in all required and recommended training and development including, but not limited to, Bank Secrecy Act training (BSA) and demonstrate attained knowledge."
    },
    {
      "duty": "Participate on Credit Union teams, projects and strategic initiatives when the opportunity arises."
    },
    {
      "duty": "Perform additional duties and special projects as assigned."
    },
    {
      "duty": "Embrace and apply guiding principles to all activities and responsibilities."
    },
    {
      "duty": "Responsible for regular and predictable attendance including punctuality."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Sales Experience",
      "experience": 1
    },
    {
      "skill": "Cash Handling",
      "experience": 1
    },
    {
      "skill": "Membership Processing",
      "experience": 1
    },
    {
      "skill": "New Accounts Processing",
      "experience": 1
    },
    {
      "skill": "Loan Processing",
      "experience": 1
    },
    {
      "skill": "Consultation Skills",
      "experience": 1
    },
    {
      "skill": "Product Knowledge",
      "experience": 1
    },
    {
      "skill": "Policy and Procedure Adherence",
      "experience": 1
    },
    {
      "skill": "Teamwork",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, General Education Development (GED) certificate, or state authorized high school equivalent certificate; or a current high school senior in possession of a certificate of satisfactory academic standing, required NYS Notary Public license achieved within 12 months of obtaining position, required Minimum 1 Year Customer service and sales experience in a financial institution or retail environment experience, requiredPrevious Teller or cash handling experience in a financial institution or retail environment, preferred"
    }
  ]
}