{
  "meta": [
    {
      "job_title": "Clinical Supervisor",
      "job_category": "Healthcare",
      "job_class": "Supervisory",
      "sector": "Healthcare",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Supervision",
      "experience": 3
    },
    {
      "skill": "Case Management",
      "experience": 3
    },
    {
      "skill": "Healthcare Operations",
      "experience": 3
    },
    {
      "skill": "Patient Care Coordination",
      "experience": 3
    },
    {
      "skill": "Clinical Diagnosis",
      "experience": 3
    },
    {
      "skill": "Therapeutic Goal Setting",
      "experience": 3
    },
    {
      "skill": "Staff Training",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Receive and review case referrals, evaluate patient information, and assign appropriate clinicians to cases."
    },
    {
      "duty": "Review and evaluate each case, guide clinicians, and promote more effective performance for quality home care services."
    },
    {
      "duty": "Assist in establishing immediate and long-term therapeutic goals, setting priorities, and developing plans of care."
    },
    {
      "duty": "Attend case conference meetings, conduct quarterly record reviews, and communicate findings and recommendations to Clinical Director and organization personnel."
    },
    {
      "duty": "Assist in screening, interviewing, and orienting new organization personnel. Participate in planning and evaluating in-service and continuing education programs."
    },
    {
      "duty": "Promote customer service orientation to all organization personnel, comply with accepted professional standards and principles, and perform other delegated duties and activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Registered Nurse with current licensure to practice professional nursing in the state, graduate of National League for Nursing accredited school of nursing. BSN degree is preferred."
    }
  ]
}