{
  "meta": [
    {
      "job_title": "Associate Vice President, Compensation",
      "job_category": "Human Resources",
      "job_class": "Vice President",
      "sector": "Human Resources",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Compensation Management",
      "experience": 7
    },
    {
      "skill": "HRIS Systems",
      "experience": 7
    },
    {
      "skill": "Excel",
      "experience": 7
    },
    {
      "skill": "Strategic Leadership",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the strategic, university-wide Classification and Compensation Program to ensure a great compensation program, including salary and benefits."
    },
    {
      "duty": "Plan and direct classification projects university-wide, ensuring compliance with federal and state mandates."
    },
    {
      "duty": "Guide general policies for classification of eligible jobs within the university, including compensation market analysis process."
    },
    {
      "duty": "Implement complex program plans and enhancements within Workday."
    },
    {
      "duty": "Counsel senior leaders and managers on pay decisions, compensation practices, and policy and guidelines interpretation."
    },
    {
      "duty": "Monitor effectiveness of existing compensation policies, recommend plan revisions, and new plans consistent with compensation trends."
    },
    {
      "duty": "Oversee external survey selection, participation, and use."
    },
    {
      "duty": "Direct annual administration of compensation programs and systems, including merit, market, and equity analysis."
    },
    {
      "duty": "Provide guidance and direction, work with Finance during the budget process for added budgeted positions and Partner with Talent Acquisition on compensation offers."
    },
    {
      "duty": "Participate in compensation projects outside of classification and partner with external consultants."
    },
    {
      "duty": "Lead direct reports."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business, or a related field (Master's preferred)"
    }
  ]
}