{
  "meta": [
    {
      "job_title": "Cloud Network Engineer",
      "job_category": "Cloud Computing",
      "job_class": "Senior",
      "sector": "Technology",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cloud Network Engineering",
      "experience": 5
    },
    {
      "skill": "Architecture and Design",
      "experience": 5
    },
    {
      "skill": "Network Infrastructure",
      "experience": 5
    },
    {
      "skill": "Cloud Migration",
      "experience": 5
    },
    {
      "skill": "Server Virtualization",
      "experience": 5
    },
    {
      "skill": "Disaster Recovery",
      "experience": 5
    },
    {
      "skill": "Network Security",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Cisco Networks",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and drive high priority network initiatives and projects in both cloud and hybrid cloud models."
    },
    {
      "duty": "Evaluate network infrastructure and connectivity solutions, and make recommendations to migrate applications and data workloads to a Cloud based model."
    },
    {
      "duty": "Work in collaboration with leadership, enterprise business partners, vendors, and project teams."
    },
    {
      "duty": "Participate in the development of documentation and tools to enable support organizations to resolve technical issues, including complex Cloud architecture, design, and service related issues."
    },
    {
      "duty": "Provide technical expertise to project managers and stakeholders about migrating and transitioning applications to Cloud based services and operating and maintaining applications once migrated."
    },
    {
      "duty": "Develop and maintain network scripts to allow operations to deploy and configure environments after operational turnover."
    },
    {
      "duty": "Share deep technical network knowledge, guidance, and mentoring for high visibility Cloud solutions, implementations, and migration initiatives for the enterprise network."
    },
    {
      "duty": "Participate in potential refactoring, rebuild, or redesign required during Cloud migration."
    },
    {
      "duty": "Provide feedback to leadership and peers to risks identified during business impact assessment, site risk assessments, and disaster recovery planning."
    },
    {
      "duty": "Maintain technical knowledge and business acumen within our own discipline or function."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 140,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Computer Science, Information Systems, Computer Networking (Master's degree preferred)"
    },
    {
      "credential": "Cisco Certified Network Associate (CCNA) certification acceptable with other network credentials."
    },
    {
      "credential": "2-4 years' experience in network communications, network planning, cloud computing, disaster/recovery, or comparable professional job experience."
    },
    {
      "credential": "24/7 on-call rotational duties. Ability to travel domestically."
    },
    {
      "credential": "In lieu of degree, 5+ years of relevant experience"
    },
    {
      "credential": "Preferred Qualifications: Project Management Professional (PMP) certification, Security + certification"
    }
  ]
}