{
  "meta": [
    {
      "job_title": "ONE-CALL Service Division Coordinator",
      "job_category": "Administrative",
      "job_class": "Coordinator",
      "sector": "Service",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    },
    {
      "skill": "Team Management",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Spectrum Software",
      "experience": 2
    },
    {
      "skill": "Smartsheet Software",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and manage company-wide assignments, ONE-CALL administrative assignments, and provide ONE-CALL accounting support."
    },
    {
      "duty": "Serve as receptionist for all incoming calls to the Ranger Office and scheduler for unassigned equipment and employee vehicles."
    },
    {
      "duty": "Serve as the First Point of Service for customers with service calls, quote requests, billing questions, and more by offering courteous and helpful feedback."
    },
    {
      "duty": "Create service call work orders, notify Dispatch and Field Techs of new work orders and quote requests, and assist in closing completed work orders."
    },
    {
      "duty": "Process completed work orders, collaborate with AP/AR Specialist, and assure that all customer billing and contact information is maintained, correct, and current."
    },
    {
      "duty": "Strive to respond to teammates, leaders, and customers with an attitude of flexibility, humility, service, excellence, and professionalism."
    },
    {
      "duty": "Maintain an attitude that holds the job title and position on the team loosely and remain open to serving the needs of the customer, Service Team, and Ranger Construction when requested."
    },
    {
      "duty": "Remain open to input, personal development, and professional training when suggested."
    },
    {
      "duty": "Maintain a professional image in regard to appearance, vehicles, and dialogue when interacting with customers, driving a Ranger vehicle, and wearing a Ranger Uniform."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "At least 2 years’ experience in a similar service coordinator role. High school diploma or an equivalent combination of training and experience; associate degree or bachelor’s degree preferred."
    }
  ]
}