{
  "meta": [
    {
      "job_title": "Technical Project Manager",
      "job_category": "Technology",
      "job_class": "Project Manager",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive technology projects through their life cycle, ensuring technical solutions are sound and aligned to business goals."
    },
    {
      "duty": "Manage projects through all stages of the implementation process, collaborating with cross-functional leaders, end-users, and vendor teams."
    },
    {
      "duty": "Lead formal requirements gathering sessions, manage scope and deliverables, and oversee delivery of final product in the form of Technology Projects."
    },
    {
      "duty": "Conduct reviews and track progress of the project, report and present to project stakeholders."
    },
    {
      "duty": "Enhance established Project Management methodology, deliverables, standards, and procedures and utilization of project budget."
    },
    {
      "duty": "Assist the executive team with ongoing process improvements and initiatives."
    },
    {
      "duty": "Gather technical requirements such as functional specifications and Systems integration requirements."
    },
    {
      "duty": "Leverage project management tools like Jira / Confluence to diligently organize project tasks."
    },
    {
      "duty": "Develop comprehensive project plans complete with budgetary information and resource requirements, and manage them throughout the duration of the project."
    },
    {
      "duty": "Lead and facilitate meetings, conference calls, and presentations with internal and external teams."
    },
    {
      "duty": "Develop the project charter, capacity, effort and cost estimates, resource requirements, work breakdown structure, and schedule."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Technology Solutions Management",
      "experience": 5
    },
    {
      "skill": "Requirement Gathering",
      "experience": 5
    },
    {
      "skill": "Risk Assessment and Mitigation",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    },
    {
      "skill": "System Integration",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Jira / Confluence",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree, preferably in management information systems, software engineering, or computer science with 2+ years’ experience in website management, design development, and coding"
    }
  ]
}