{
  "meta": [
    {
      "job_title": "Sales & Service Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "remote": false,
      "salary": 45000
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Promote and sell Bank products and represent the Bank in a professional manner to clients by possessing strong knowledge of Bank products and services."
    },
    {
      "duty": "Recommend appropriate financial products and services to customers, and refers customers to investment and loan representatives regarding additional services provided by the Bank."
    },
    {
      "duty": "Keep up-to-date on Bank products and services to effectively provide financial solutions to customers."
    },
    {
      "duty": "Effectively profiles customers, opens accounts, and cross-sells appropriate Bank products and services."
    },
    {
      "duty": "Take responsibility in meeting monthly branch and/or individual scorecard goals on a consistent basis by monitoring self-performance and following action plans."
    },
    {
      "duty": "Ensure delivery of excellent customer service throughout the Bank by adhering to sales and @ your service standards and protocols."
    },
    {
      "duty": "Has knowledge and complies with Bank security and operating policies and procedures, as well as compliance regulations, including KYC, OFAC, CIP, and customer privacy policy."
    },
    {
      "duty": "Adheres to cash differences/controllable losses policy."
    },
    {
      "duty": "Maintain dual control on all vaults/safes containing cash/negotiables, if applicable."
    },
    {
      "duty": "May serve as approval on branch transactions."
    },
    {
      "duty": "As business needs arise, ability to perform in any capacity of the Branch to ensure Branch is properly staffed on a daily basis."
    },
    {
      "duty": "As business needs arise, ability to open and/or close the Branch and may require working hours outside normal scheduled hours."
    },
    {
      "duty": "Based on branch location within a market, will be required to promote/discuss consumer lending products with customers within compliance of the Safe Act guidelines and United procedures."
    },
    {
      "duty": "Based on branch location within a market, will be responsible for maintaining an active NMLS license by completing all training and annual renewal requirements as required."
    },
    {
      "duty": "Ability to travel as business necessity arises to other branch locations to ensure proper staffing on a daily basis."
    },
    {
      "duty": "Flexibility on work schedule as business needs arise."
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Financial Products",
      "experience": 1
    },
    {
      "skill": "Customer Profiling",
      "experience": 1
    },
    {
      "skill": "Cross-selling",
      "experience": 1
    },
    {
      "skill": "Goal Setting",
      "experience": 1
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 1
    },
    {
      "skill": "Security Compliance",
      "experience": 1
    },
    {
      "skill": "Cash Management",
      "experience": 1
    },
    {
      "skill": "Branch Operations",
      "experience": 1
    },
    {
      "skill": "Consumer Lending",
      "experience": 1
    },
    {
      "skill": "NMLS Compliance",
      "experience": 1
    },
    {
      "skill": "Travel Management",
      "experience": 1
    },
    {
      "skill": "Flexibility",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 40,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent required, bachelor’s degree preferred."
    }
  ]
}