{
  "meta": [
    {
      "job_title": "Sr. Manager of Investments & Incentives",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Market Analysis",
      "experience": 8
    },
    {
      "skill": "Financial Analysis",
      "experience": 8
    },
    {
      "skill": "Business Consulting",
      "experience": 8
    },
    {
      "skill": "Data Analysis",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Excel",
      "experience": 8
    },
    {
      "skill": "Tableau",
      "experience": 8
    },
    {
      "skill": "SAP",
      "experience": 8
    },
    {
      "skill": "Microsoft Office",
      "experience": 8
    },
    {
      "skill": "Vendor Management",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the investment valuation of new initiatives in market efficacy and support business with Capital Committee business justification."
    },
    {
      "duty": "Collaborate both internally and externally to review and evaluate new and complex investment opportunities and provide ROI recommendations."
    },
    {
      "duty": "Identify retail opportunities and issues regarding investments, incentives, and business performance."
    },
    {
      "duty": "Develop and align solutions to provide the Retail team with maximum MDF benefits."
    },
    {
      "duty": "Work closely with sales teams, leadership, and other internal stakeholders to oversee and administer effective incentives and investments aligned with business objectives to optimize financial and retail performance."
    },
    {
      "duty": "Serves as a key leader and subject matter expert (SME) in Investment, data, and analytics processes, frameworks, architecture, and delivery."
    },
    {
      "duty": "Manage the tracking, reporting, and setting of performance metrics (MBOs, A/R), proactively analyze and assess business opportunities to drive operational and financial performance."
    },
    {
      "duty": "Support financial reviews with vendors, contracts, and business planning needs across the organization."
    },
    {
      "duty": "Determine processes for gathering business requirements, developing roadmaps, prioritizing new and enhanced work and scope definition, and establish appropriate interim release scope."
    },
    {
      "duty": "Participate in establishing the development and implementation of data standards and methodologies."
    },
    {
      "duty": "Monitor metrics, develop key performance indicators, identify new trends, and flag potential issues to senior management."
    },
    {
      "duty": "Develop and maintain currency, knowledge, and skill base of industry information, technical knowledge, and best practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Analytics, Finance, Data Management or other relevant discipline and 8+ years of relevant experience. Master's preferred."
    }
  ]
}