{
  "meta": [
    {
      "job_title": "Estimating Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Expertise in HVAC systems",
      "experience": 5
    },
    {
      "skill": "Cost Estimation",
      "experience": 5
    },
    {
      "skill": "Collaboration with cross-functional teams",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Strong analytical skills",
      "experience": 5
    },
    {
      "skill": "Proficiency in estimation software",
      "experience": 5
    },
    {
      "skill": "Communication and Documentation",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Continuous Improvement",
      "experience": 5
    },
    {
      "skill": "Bachelor's degree in Mechanical Engineering, HVAC Engineering, or related field",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop accurate and detailed cost estimates for projects, considering factors such as labor, materials, equipment, and overhead."
    },
    {
      "duty": "Provide technical guidance and insights during the estimation process, offering recommendations on equipment selection, design considerations, and energy-efficient solutions."
    },
    {
      "duty": "Review project specifications, drawings, and technical documents to identify requirements for air moving equipment and HVAC components."
    },
    {
      "duty": "Collaborate closely with cross-functional teams to ensure alignment in estimation methodologies and project goals."
    },
    {
      "duty": "Work closely with suppliers and vendors to gather accurate pricing information for air moving equipment, HVAC components, and associated materials."
    },
    {
      "duty": "Identify opportunities for value engineering and cost optimization by suggesting alternative equipment or methods that maintain or improve project quality while reducing costs."
    },
    {
      "duty": "Maintain detailed records of estimation processes, assumptions, and data sources, ensuring transparency and accountability."
    },
    {
      "duty": "Stay up-to-date with industry trends, technological advancements, and market fluctuations related to air moving equipment and HVAC systems."
    },
    {
      "duty": "Identify potential risks and uncertainties that could impact project costs and timelines, and work with project teams to develop appropriate contingency plans."
    },
    {
      "duty": "Utilize specialized estimation software tools to streamline the estimation process and enhance accuracy."
    },
    {
      "duty": "Contribute to the continuous improvement of estimation processes and methodologies by providing insights and suggestions based on technical expertise."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Mechanical Engineering, HVAC Engineering, or a related field."
    }
  ]
}