{
  "meta": [
    {
      "job_title": "Desk Superintendent, Rail Control Center",
      "job_category": "Rail Control Center",
      "job_class": "Superintendent",
      "sector": "Rail Control",
      "salary": 139949,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "This position is responsible for directing various communications and daily operations of the DOS Rail Control Center (RCC), utilizing where applicable, ATS, CBTC and ITRAC technology to achieve safe on-time service delivery. Ensures continuity of operations throughout assigned division (IRT, IND, BMT) via dispatching, put-ins, lay-ups and loading of supplements. This position will be accountable for safe and timely implementation operations of all scheduled NYCT General Orders, Signal Bulletins and/or Special Operations within specified divisions; will also direct the safe removal and restoration of third rail power and Fan Plan operations, where applicable. Will direct management of all incidents through the proper use of protocols, policies, and procedures. Monitors, supervises, and evaluates performance of RCC employees. Acts on behalf of the General Superintendent, RCC as required."
    }
  ],
  "subjective_elements": [
    {
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "A baccalaureate degree from an accredited college in Transportation Management or Business Administration or a related field (Master's preferred)"
    }
  ],
  "skills": [
    {
      "skill": "Transportation Management",
      "experience": 8
    },
    {
      "skill": "Rail Operations",
      "experience": 8
    },
    {
      "skill": "ATS/CBTC",
      "experience": 8
    },
    {
      "skill": "Dispatching",
      "experience": 8
    },
    {
      "skill": "Emergency Response",
      "experience": 8
    },
    {
      "skill": "Management",
      "experience": 8
    },
    {
      "skill": "Supervision",
      "experience": 8
    },
    {
      "skill": "Communication",
      "experience": 8
    },
    {
      "skill": "Policy Implementation",
      "experience": 8
    }
  ]
}