{
  "meta": [
    {
      "job_title": "Procurement Manager",
      "job_category": "Procurement",
      "job_class": "Manager",
      "sector": "Operations",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Develops, plans, coordinates and implements national/regional contracting and procurement strategies and programs to increase operational efficiency and profitability."
    },
    {
      "duty": "Drives the RFP process, solution selection and negotiations to achieve the desired results."
    },
    {
      "duty": "Runs the supplier/contractor certification process including review of requisite experience, legal and interpersonal structure, financial viability, geographic coverage, insurance requirements and other capabilities."
    },
    {
      "duty": "Prepares and maintain contracts with national/regional service providers in accordance with company standards."
    },
    {
      "duty": "Mentors and educates the CBRE organization on contemporary outsourcing practices and the value of applying them with third party providers to support CBRE business interests."
    },
    {
      "duty": "Leads issues and expectations across a broad range of skills, locations and cultures both internally and with service providers."
    },
    {
      "duty": "Partners with Finance to outline potential value and ROI for proposed initiatives and tracking results."
    },
    {
      "duty": "Serves as key point of contact for utilization management and coordination with outside procurement/e-procurement solutions."
    },
    {
      "duty": "Participates on behalf of the company in approved or sponsored procurement organizations or related initiatives."
    },
    {
      "duty": "Conducts periodic visits to supplier work locations to evaluate vendor performance."
    },
    {
      "duty": "Develops company-wide policies and procedures, playbooks and other interpersonal materials with respect to national/regional sourcing."
    },
    {
      "duty": "Other duties may be assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Operations, Procurement, or a related field (Master's preferred)"
    }
  ]
}