{
  "meta": [
    {
      "job_title": "Quality Assurance Analyst",
      "job_category": "Customer Service",
      "job_class": "Analyst",
      "sector": "Customer Service",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Quality Monitoring",
      "experience": 3
    },
    {
      "skill": "Customer Interaction Analysis",
      "experience": 3
    },
    {
      "skill": "Training and Coaching",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 3
    },
    {
      "skill": "Jewelry Industry Knowledge",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitor and analyze interactions between contact center agents and customers to ensure performance standards are met."
    },
    {
      "duty": "Provide feedback to supervisors, managers, and agents regarding agent performance."
    },
    {
      "duty": "Identify training and coaching trends and work with training staff to address them."
    },
    {
      "duty": "Participate in design of customer interaction monitoring formats and quality standards."
    },
    {
      "duty": "Compile and track performance data at team and individual levels."
    },
    {
      "duty": "Conduct customer listening programs to identify needs and expectations."
    },
    {
      "duty": "Prepare and analyze quality reports for management review."
    },
    {
      "duty": "Coordinate call calibration sessions for contact center staff."
    },
    {
      "duty": "Communicate effectively with management in a level of indirect authority."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree from a four-year College or university preferred. A combination of a minimum of two years of insurance experience, contact center experience, and/or quality assurance experience is preferred. Property/Casualty Insurance Agents License from the state of Wisconsin OR ability to obtain within 30 days of employment."
    }
  ]
}