{
  "meta": [
    {
      "job_title": "Engineer - Distribution Planning",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Management",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Distribution Studies",
      "experience": 3
    },
    {
      "skill": "DER Distribution System Analysis",
      "experience": 3
    },
    {
      "skill": "Distribution Automation",
      "experience": 3
    },
    {
      "skill": "Engineering Tools (GIS, SAP)",
      "experience": 3
    },
    {
      "skill": "Regulatory Standards Knowledge",
      "experience": 3
    },
    {
      "skill": "Power System Studies",
      "experience": 3
    },
    {
      "skill": "Software Proficiency",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate on and perform distribution studies including voltage, thermal, N-1, and power factor assessments."
    },
    {
      "duty": "Analyze and assess complex DER distribution system interconnections and new customer load interconnections at numerous voltage levels."
    },
    {
      "duty": "Apply the established distribution criteria and uses sound utility engineering practices to identify deficiencies in the distribution system."
    },
    {
      "duty": "Recommends Distribution Automation devices to the system and develop designs and recommendations compliant with program objectives."
    },
    {
      "duty": "Develop thorough understanding and application of Distribution Planning tools used in day-to-day basis such as GIS (SMWeb, SmartMap), SAP, Load Data systems, etc."
    },
    {
      "duty": "Continually strive to innovate and integrate improvements to increase the precision and efficiency of distribution planning."
    },
    {
      "duty": "Strive to seek out and develop subject matter expert skills as necessary to mentor and support the team to aid in the advancement of business needs."
    },
    {
      "duty": "Collaborate and interact with internal teams and industry peers on regional and divisional activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "BSEE / Degree in EE required"
    }
  ]
}