{
  "meta": [
    {
      "job_title": "Senior Social Media Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Social Media Management",
      "experience": 6
    },
    {
      "skill": "Social Media Strategy",
      "experience": 6
    },
    {
      "skill": "Influencer Marketing",
      "experience": 4
    },
    {
      "skill": "Content Calendar Management",
      "experience": 6
    },
    {
      "skill": "Analytics Tools",
      "experience": 6
    },
    {
      "skill": "Visual Storytelling",
      "experience": 6
    },
    {
      "skill": "Communication Skills",
      "experience": 6
    },
    {
      "skill": "Organizational Skills",
      "experience": 6
    },
    {
      "skill": "Event Planning",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the social media strategy from inception to completion, aligning with overall business objectives and target audience."
    },
    {
      "duty": "Create and manage a content calendar for social media platforms, ensuring regular and engaging content that resonates with the target audience."
    },
    {
      "duty": "Identify and analyze social media trends, industry insights, and competition to develop effective strategies to enhance brand awareness and engagement."
    },
    {
      "duty": "Respond quickly to trends, ensuring the company stays current and seizes opportunities for engagement via all social media platforms."
    },
    {
      "duty": "Own all metrics related to social media, including gathering, analyzing, and reporting monthly and quarterly performance recaps to optimize future campaigns and strategies."
    },
    {
      "duty": "Special focus on Influencer Marketing, mainly in correspondence with Influencer agencies, in sourcing the right partners for the brand and recommending influencers when relevant."
    },
    {
      "duty": "Collaborate with the Growth Marketing team on shared opportunities on paid channels."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing or a related field"
    }
  ]
}