{
  "meta": [
    {
      "job_title": "Social Media Content Creator",
      "job_category": "Marketing",
      "job_class": "Content Creation",
      "sector": "Marketing",
      "salary": 48000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Social Media Management",
      "experience": 3
    },
    {
      "skill": "Content Creation",
      "experience": 3
    },
    {
      "skill": "Video Editing",
      "experience": 3
    },
    {
      "skill": "Creative Thinking",
      "experience": 3
    },
    {
      "skill": "Trend Analysis",
      "experience": 3
    },
    {
      "skill": "Visual storytelling",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Generate innovative content for social media platforms like Facebook, Instagram, Snapchat, and TikTok, focusing on performance-driven content that sells products effectively."
    },
    {
      "duty": "Keep up to date with current beauty and lifestyle trends on social media and incorporate them into content creation."
    },
    {
      "duty": "Produce a large volume of content at a rapid pace, focusing on creating content that resembles real TikTok videos and is visually engaging."
    },
    {
      "duty": "Create content on a wide variety of topics like food, makeup, clothing, skincare, and other relevant subjects, with the ability to produce clickbait content."
    },
    {
      "duty": "Collaborate with the team of editors to create high-quality, engaging content and be self-sufficient in content production whenever possible."
    },
    {
      "duty": "Demonstrate highly creative visual thinking, prolific generation of ideas, and a demonstrated ability to translate complex topics into visually engaging media."
    },
    {
      "duty": "Be open-minded and dynamic, focused on finding innovative ways to produce engaging content for social media platforms."
    },
    {
      "duty": "Complete an assessment by producing 1-3 video ads for brands the company works with."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Communications, or a related field"
    }
  ]
}