{
  "meta": [
    {
      "job_title": "Recruiter",
      "job_category": "Human Resources",
      "job_class": "Recruiter",
      "sector": "Talent Acquisition",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruitment Process Management",
      "experience": 4
    },
    {
      "skill": "Candidate Sourcing",
      "experience": 4
    },
    {
      "skill": "Stakeholder Management",
      "experience": 3
    },
    {
      "skill": "Interviewing",
      "experience": 4
    },
    {
      "skill": "Talent Acquisition Strategy",
      "experience": 4
    },
    {
      "skill": "Applicant Tracking System (ATS)",
      "experience": 3
    },
    {
      "skill": "High-volume Recruitment",
      "experience": 5
    },
    {
      "skill": "Leadership-level Recruiting",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 4
    },
    {
      "skill": "Written Communication",
      "experience": 4
    },
    {
      "skill": "Strategic Sourcing",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the end-to-end recruitment process, from initial sourcing through offer acceptance."
    },
    {
      "duty": "Engage with senior stakeholders to understand their unique talent needs and align recruiting strategies accordingly."
    },
    {
      "duty": "Utilize expert-level interviewing techniques to effectively filter candidates during the initial application stage."
    },
    {
      "duty": "Execute a high volume of quality screening calls to identify the highest quality candidates for hiring manager interviews."
    },
    {
      "duty": "Develop and execute strategic sourcing plans, creating innovative campaigns to attract high-quality candidates with a high response rate."
    },
    {
      "duty": "Demonstrate a deep understanding of business requirements for open roles and translate them into effective recruitment strategies."
    },
    {
      "duty": "Identify opportunities and unblock unnecessary recruitment challenges by analyzing pipeline and funnel metrics."
    },
    {
      "duty": "Act as a consultative partner to hiring managers throughout the recruitment process, building positive relationships and managing expectations."
    },
    {
      "duty": "Provide regular updates to candidates and stakeholders, ensuring transparent and open communication."
    },
    {
      "duty": "Optimize talent processes and leverage the current suite of recruiting tools to streamline and enhance recruitment efforts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business, or a related field (Master's preferred)"
    }
  ]
}