{
  "meta": [
    {
      "job_title": "Business Operations Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "HR Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Supervisory Responsibilities",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages and enhances organizational initiatives by positively influencing and supporting change management and/or departmental/enterprise initiatives within assigned area(s) of responsibility."
    },
    {
      "duty": "Identifies and recommends process improvements that significantly reduce workloads or improve quality across for assigned area(s) of responsibility."
    },
    {
      "duty": "Manages service levels, troubleshoots operational issues. Identifies commission and benefit problems. Implements local and national efforts to improve efficiency."
    },
    {
      "duty": "Manages compliance orientation training as required. Provides resolution of identified issues for OSJ, Branch and detached audits. Provides timely review of incoming client/prospect and outgoing client correspondence; resolve non-compliant correspondence issues; ensure review."
    },
    {
      "duty": "Conducts preliminary reviews of representative advertisements and sales literature. Provides maintenance and accuracy of compliance records, including SEC mandated books and disciplinary records and sales materials. Partners with HR Generalists as required to advise, support, and coach employees."
    },
    {
      "duty": "Conducts supervisory responsibilities in accordance with the organization's policies and applicable laws. Manages responsibilities include interviewing, hiring and training employees; planning, assigning and directing work, appraising performance; rewarding and disciplining employees; addressing complaints and resolving problems."
    },
    {
      "duty": "Carries out duties in compliance with all state and federal regulations and guidelines. Complies with all company and site policies and procedures. Makes a positive contribution as demonstrated by making suggestions for improvement and continuing to learn new skills, procedures, and processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "4 Year/Bachelor's degree or equivalent work experience (4 years of experience in lieu of Bachelor's)"
    }
  ]
}