{
  "meta": [
    {
      "job_title": "Human Capital Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Employee Relations",
      "experience": 7
    },
    {
      "skill": "Recruitment",
      "experience": 7
    },
    {
      "skill": "Wage and Hour Compliance",
      "experience": 7
    },
    {
      "skill": "Employment Law",
      "experience": 7
    },
    {
      "skill": "Human Capital Information System (HCIS)",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute Human Capital programs and tools to meet local business needs."
    },
    {
      "duty": "Operate as a strategic and operational Business Partner, supporting the full life cycle Human Capital support within the business."
    },
    {
      "duty": "Establish close working relationships to understand business objectives and requirements to assist in the timely delivery of people-related solutions."
    },
    {
      "duty": "Act as a liaison between the business unit and HC to ensure that HC services are aligned with internal client needs and business goals."
    },
    {
      "duty": "Contribute to the business strategy by helping business leaders to identify, prioritize, and build organizational capabilities, behaviors, structures, and processes."
    },
    {
      "duty": "Participate and contribute to a culture that builds rewarding relationships, facilitates feedback, provides exceptional customer service, and effective communication strategies."
    },
    {
      "duty": "Serve on Site Leadership Team and collaborate with Managers to proactively identify issues and determine optimal application of HC strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Human Resources or related field required. Equivalent combination of education and/or experience will be considered."
    }
  ]
}