{
  "meta": [
    {
      "job_title": "Content Specialist",
      "job_category": "Science",
      "job_class": "Specialist",
      "sector": "Assessment & Qualifications",
      "salary": 57500,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Project Lead – Responsible for the daily functions of one or more handscoring contracts, including scheduling, resource planning, and developing item-specific training. Managing a team of Scoring Directors, Supervisors, and Scorers and performing post-project work and data analysis."
    },
    {
      "duty": "Content Expertise – Thorough knowledge of science topics used for Elementary, Middle, and High School Science, and an ability to understand and apply state and national science standards. Apply science expertise throughout item development and scoring process."
    },
    {
      "duty": "Logistics and Communication – Clear communication to a variety of roles daily, including chat, email, phone, reports, and videoconference meetings. In-person and virtual interactions with customers and educators. Team environment work with project personnel and other Content Specialists."
    },
    {
      "duty": "Training and Coaching – Mentor and train Scoring Directors, Supervisors, and Scorers. Train Science and potentially Math items to a large and varied scorer population."
    }
  ],
  "skills": [
    {
      "skill": "Science Knowledge",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Training",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required; degree within Life Science or Physical Sciences is strongly preferred. Additional Math college courses are preferred."
    },
    {
      "credential": "Two (2) years assessment industry experience as a Scoring Director or other scoring team lead or equivalent experience."
    },
    {
      "credential": "Strong leadership abilities and organizational skills."
    },
    {
      "credential": "Strong technology skills, including common Microsoft Office applications and videoconferencing tools."
    },
    {
      "credential": "Remote work, flexible schedule, and occasional travel required."
    }
  ]
}