{
  "meta": [
    {
      "job_title": "Credit Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 180000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Understand all aspects of underwriting, approving and closing transactions including the ability to analyze risk and structure transactions."
    },
    {
      "duty": "Produce an independent, objective, high-quality assessment of the credit risk and mitigants involved in transactions including the preparation of high-quality credit reports."
    },
    {
      "duty": "Responsible for the market/business analysis, financial analysis (including sensitivity analysis projections) and structure analysis in the credit report."
    },
    {
      "duty": "Responsible for economic capital calculations."
    },
    {
      "duty": "Maintain strong skills in effectively transferring information orally and in writing (i.e. no surprises)."
    },
    {
      "duty": "Communicate all matters of importance to all internal and external constituents."
    },
    {
      "duty": "Work effectively and cooperatively with co-workers and other departments in achieving the Bank’s goals. Plan and organize own work, uses time effectively, sets appropriate priorities, anticipates business needs."
    },
    {
      "duty": "Maintain extensive industry knowledge."
    },
    {
      "duty": "Responsible for initiating timely review according to the review calendar."
    },
    {
      "duty": "Responsible for monthly/quarterly assessing the received company financial information / covenant checks."
    },
    {
      "duty": "Responsible for monitoring assigned portfolio of clients; in-depth client knowledge is essential for adequately identifying early warning signals with the aim of minimizing loan losses."
    },
    {
      "duty": "Initiating when necessary, extra measures in order to safeguard the credit portfolio."
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Credit Underwriting",
      "experience": 10
    },
    {
      "skill": "Risk Assessment",
      "experience": 10
    },
    {
      "skill": "Financial Modeling",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 8
    },
    {
      "skill": "Negotiation",
      "experience": 8
    },
    {
      "skill": "Documentation",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Finance or associated discipline."
    }
  ]
}