{
  "meta": [
    {
      "job_title": "RN Case Manager",
      "job_category": "Healthcare",
      "job_class": "Medical",
      "sector": "Healthcare",
      "salary": 34000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Medical Case Management",
      "experience": 5
    },
    {
      "skill": "Clinical Experience",
      "experience": 3
    },
    {
      "skill": "Discharge Planning",
      "experience": 2
    },
    {
      "skill": "Utilization Review/Management",
      "experience": 2
    },
    {
      "skill": "Behavioral Health",
      "experience": 2
    },
    {
      "skill": "Chronic Medical Conditions",
      "experience": 2
    },
    {
      "skill": "Oncology",
      "experience": 2
    },
    {
      "skill": "Case Management Protocols",
      "experience": 3
    },
    {
      "skill": "National Certification in Case Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate treatment pathways and set appropriate treatment plans for injured worker's health and return-to-work needs."
    },
    {
      "duty": "Implement criteria for identifying individuals for case management services and document case management plans."
    },
    {
      "duty": "Conduct assessment of injured worker/employee including health status, treatment plan, financial resources, and psychosocial status."
    },
    {
      "duty": "Manage disability duration and focus on return-to-work opportunities or other productive activity."
    },
    {
      "duty": "Collaborate and communicate with injured worker/employee, family members, providers, employer, and other involved parties."
    },
    {
      "duty": "Identify, evaluate, and recommend strategies for claims where vocational rehabilitation services may produce an eventual return-to-work."
    },
    {
      "duty": "Understand and implement criteria for discharge of injured worker/employee or termination of case management services."
    },
    {
      "duty": "Promote goodwill by assisting all involved parties on issues related to the injured worker/employee, provider relations, and coordination."
    },
    {
      "duty": "Proactively seek opportunities to increase knowledge, skills, and abilities in the field."
    },
    {
      "duty": "Perform other duties as needed to meet the needs of the business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors in Science Nursing or Associate in Nursing (ASN) or Nursing Diploma."
    },
    {
      "credential": "Active RN license in the state of residence. National certification in case management or related field preferred."
    },
    {
      "credential": "3+ years of clinical experience as a Registered Nurse."
    },
    {
      "credential": "2+ years experience in medical case management, discharge planning, utilization review/management, occupational health, or comparable field."
    },
    {
      "credential": "Experience in Behavioral Health, Chronic Medical Conditions, or Oncology preferred."
    },
    {
      "credential": "Understanding of nationally recognized standards of the case management process."
    },
    {
      "credential": "Experience with Federal Employee Compensation Act (FECA) and FECA related issues preferable."
    },
    {
      "credential": "Effective team member with ownership mindset and embracement of change."
    }
  ]
}