{
  "meta": [
    {
      "job_title": "Finance Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 147500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 7
    },
    {
      "skill": "Financial Planning and Analysis",
      "experience": 7
    },
    {
      "skill": "GAAP",
      "experience": 7
    },
    {
      "skill": "Tax Management",
      "experience": 7
    },
    {
      "skill": "Strategic Financial Planning",
      "experience": 7
    },
    {
      "skill": "Financial Reporting",
      "experience": 7
    },
    {
      "skill": "Banking Relationship Management",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Cost Accounting",
      "experience": 7
    },
    {
      "skill": "Inventory Management",
      "experience": 7
    },
    {
      "skill": "Compliance Management",
      "experience": 7
    },
    {
      "skill": "Team Management",
      "experience": 7
    },
    {
      "skill": "Problem Solving",
      "experience": 7
    },
    {
      "skill": "Confidentiality",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direction, management, and support of all Accounting, Finance, and Treasury activities."
    },
    {
      "duty": "Participate in and provide guidance to technical accounting matters; prepare a variety of complex accounting, statistical and narrative reports, and ensure the accuracy of all financial records."
    },
    {
      "duty": "Responsible for presenting monthly financial statements and reports to the Executive Team."
    },
    {
      "duty": "Assist and direct all day-to-day accounting, Tax, FP&A, and other financial related activities."
    },
    {
      "duty": "Play a key role in leading the group to maintain and improve the timeliness, accuracy, controls, and value-added analysis."
    },
    {
      "duty": "Accountable for assisting in strategic financial planning, modeling, and developing the company's short and long-term strategy."
    },
    {
      "duty": "Assist in managing banking relationships and analyzing opportunities for additional capital to grow the company including Merger & Acquisition opportunities and other strategic initiatives."
    },
    {
      "duty": "Direct the financial operations of the organization; develop and implement internal controls and policies and procedures; monitor, manage, and review accounting functions, maintaining fully reconciled books and records that provide a timely and accurate presentation of the financial position of each entity in accordance with GAAP."
    },
    {
      "duty": "Supervise and train staff as needed."
    },
    {
      "duty": "Review all month end activities, including closing journal entries and account reconciliations, supervise the closing of the general ledger, ensuring proper revenue cut off and recording of liabilities/contingencies for the period."
    },
    {
      "duty": "Ensure a timely preparation of all entities’ financial statements and supporting documentation, and subsequent monthly reporting package."
    },
    {
      "duty": "Prepare explanations and provide supporting documentation for material variances from prior periods and current budget(s)/forecast(s)."
    },
    {
      "duty": "Assist in the review of monthly State of California Excise Tax Report along with other Tax and Trade Bureau communications and regulatory reporting."
    },
    {
      "duty": "Assist in coordinating, organizing, and monitoring the year-end financial statement audit by the Independent Auditors."
    },
    {
      "duty": "Assist in coordinating, organizing, and monitoring tax related activities, bank audits and other audits as necessary."
    },
    {
      "duty": "Manage strategic projects related to customer and product profitability, vendor pricing and materials variances, and other key areas, improving efficiency and productivity."
    },
    {
      "duty": "Manage bank relationship and the compliance reporting; manage day-to-day liquidity to ensure business operations continue without disruption."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 110,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "BS/BA degree in Finance, Accounting, or equivalent is required. Masters/MBA is a plus. CPA or CMA & Audit is preferred."
    }
  ]
}