{
  "meta": [
    {
      "job_title": "Application Support Engineer",
      "job_category": "Software Engineering",
      "job_class": "Support Engineer",
      "sector": "Software Engineering",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Application Support",
      "experience": 2
    },
    {
      "skill": "Software Integration",
      "experience": 2
    },
    {
      "skill": "Technical Expertise",
      "experience": 2
    },
    {
      "skill": "Database Management",
      "experience": 2
    },
    {
      "skill": "API Development",
      "experience": 2
    },
    {
      "skill": "Troubleshooting",
      "experience": 2
    },
    {
      "skill": "Security Management",
      "experience": 2
    },
    {
      "skill": "System Performance Monitoring",
      "experience": 2
    },
    {
      "skill": "Vendor Management",
      "experience": 2
    },
    {
      "skill": "Application System Design",
      "experience": 2
    },
    {
      "skill": "Business Intelligence",
      "experience": 2
    },
    {
      "skill": "SQL",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Implement, maintain, integrate, and troubleshoot applications (in-house and third party) under general direction."
    },
    {
      "duty": "Recommend technology solutions considering budget, business need, internal capabilities, and strategic direction."
    },
    {
      "duty": "Participate and serve as a technical expert on projects needing new applications, modification to existing applications, application updates, and testing."
    },
    {
      "duty": "Design or review new and existing application systems, perform complex systems analysis."
    },
    {
      "duty": "Integrate multiple systems utilizing different communication protocols and gateways. Write interface programs when necessary."
    },
    {
      "duty": "Follow standards for coding, documentation, and change control."
    },
    {
      "duty": "Write, debug, document, and implement solutions to complex problems using the appropriate application systems access and database tools."
    },
    {
      "duty": "Work with vendors and staff to document and specify software functional requirements."
    },
    {
      "duty": "Maintain security and integrity controls of the application system; manage user access to applications and data."
    },
    {
      "duty": "Review contracts to ensure product licenses, service agreements and products are correct and appropriate for defined business operation."
    },
    {
      "duty": "Monitor systems performance and recommend methods for improving efficiency through system and application design."
    },
    {
      "duty": "Attend product demonstrations, seminars, user group meetings, and other professional opportunities to maintain the necessary level of expertise and may provide or participate in user training."
    },
    {
      "duty": "Perform other related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Computer Science, Management Information Systems, Computer Engineering or a related field and two years of experience in development, design, implementation, and application support."
    }
  ]
}