{
  "meta": [
    {
      "job_title": "Business Development Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Strategic Thinking",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify, develop, and nurture strategic relationships to expand our OEM Aftermarket, 2nd Life, and End-to-End service offerings."
    },
    {
      "duty": "Craft persuasive and captivating pitch presentations that effectively convey BlackTeal Energy's innovative solutions, market potential, and strategic roadmap to potential customers."
    },
    {
      "duty": "Nurture and cultivate strong relationships with customers, providing regular updates on our progress and breakthroughs."
    },
    {
      "duty": "Work closely with our product and service teams to ensure our offerings align with market demand and client needs."
    },
    {
      "duty": "Stay current with industry trends, market dynamics, and competitive landscapes to adjust strategies in alignment with emerging opportunities."
    },
    {
      "duty": "Use your existing network to generate leads and manage relationships with clients, ensuring high levels of satisfaction and repeat business."
    },
    {
      "duty": "Represent BlackTeal Energy at industry events, conferences, and networking functions to expand our customer network and establish impactful connections."
    },
    {
      "duty": "Work closely with legal teams to ensure all related agreements, contracts, and regulatory obligations are meticulously met."
    },
    {
      "duty": "Provide regular investor reports detailing financial performance, key milestones achieved, and any shifts in our business strategy."
    },
    {
      "duty": "Stay updated with the latest trends and shifts in the battery and energy market, ensuring that BlackTeal Energy remains ahead of the curve."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of 5 years of experience in business development, preferably within the battery or related sectors."
    },
    {
      "credential": "Established network within the battery or energy industry."
    },
    {
      "credential": "Strong strategic thinking, negotiation, and analytical skills."
    },
    {
      "credential": "Demonstrated ability to work independently, take initiative, and drive projects to completion."
    },
    {
      "credential": "Excellent interpersonal and communication skills."
    },
    {
      "credential": "Bachelor’s degree in Business, Marketing, or related field. MBA or equivalent is a plus."
    }
  ]
}