{
  "meta": [
    {
      "job_title": "Network Administrator",
      "job_category": "Information Technology",
      "job_class": "Administrator",
      "sector": "Information Technology",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitor and maintain the organization's local area network (LAN), wide area network (WAN), and internet connectivity to ensure optimal performance and uptime."
    },
    {
      "duty": "Implement and manage network security measures to protect against unauthorized access, data breaches, and cyber threats. This includes configuring firewalls, VPNs, and intrusion detection/prevention systems."
    },
    {
      "duty": "Diagnose and resolve network-related issues, such as connectivity problems, network outages, and performance bottlenecks."
    },
    {
      "duty": "Plan and execute network upgrades and expansions to accommodate the organization's growth and changing requirements."
    },
    {
      "duty": "Configure and manage network devices, including routers, switches, access points, and other networking equipment."
    },
    {
      "duty": "Perform regular maintenance tasks such as system updates, patches, and upgrades to keep the infrastructure up-to-date and secure."
    },
    {
      "duty": "Manage and configure servers, both physical and virtual, to ensure optimal performance and resource utilization."
    },
    {
      "duty": "Install, configure, and troubleshoot operating systems, such as Windows Server, Linux, or other specialized systems, depending on the organization's needs."
    },
    {
      "duty": "Create and manage user accounts and access permissions to various systems and applications."
    },
    {
      "duty": "Implement and maintain security measures to protect systems from unauthorized access, viruses, malware, and other security threats."
    },
    {
      "duty": "Set up and manage data backup and recovery solutions to ensure data integrity and availability in case of system failures or disasters."
    },
    {
      "duty": "Configure and maintain network services, including DNS, DHCP, VPN, and other services required for network functionality."
    },
    {
      "duty": "Diagnose and resolve hardware and software issues for both servers and end-user systems."
    },
    {
      "duty": "Use monitoring tools to proactively identify and resolve performance bottlenecks, system errors, and other issues."
    },
    {
      "duty": "Maintain comprehensive system documentation, including configurations, procedures, and troubleshooting guides."
    },
    {
      "duty": "Ensure compliance with IT policies, procedures, and industry standards, such as data privacy regulations (e.g., GDPR) and IT security best practices."
    },
    {
      "duty": "Respond to and address system-related incidents and outages promptly and effectively."
    },
    {
      "duty": "Work with other IT teams and departments to support various projects and integrate systems and services."
    },
    {
      "duty": "Special projects as requested."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in IT preferred. Equivalent combination of education and experience may be substituted in lieu of degree."
    },
    {
      "credential": "Has between 6-10 years of proven working experience as a System Administrator/Network Engineer."
    },
    {
      "credential": "Relevant certifications like Microsoft Certified System Administrator (MCSA), CompTIA Server+, or Red Hat Certified System Administrator (RHCSA) preferred."
    },
    {
      "credential": "Strong knowledge of operating systems, server hardware, and system administration tools."
    },
    {
      "credential": "Familiarity with networking concepts, protocols, and services."
    },
    {
      "credential": "Understanding of virtualization technologies and cloud computing."
    },
    {
      "credential": "Security-focused mindset and knowledge of IT security best practices."
    },
    {
      "credential": "Analytical and problem-solving skills to troubleshoot complex technical issues."
    },
    {
      "credential": "Effective communication and teamwork skills to collaborate with colleagues and end-users."
    },
    {
      "credential": "The specific responsibilities and requirements for a System Administrator may vary based on the organization's size, industry, and complexity of its IT infrastructure. In some cases, a System Administrator's role may overlap with other IT roles, such as Network Administrator or Database Administrator, depending on the organization's IT structure."
    }
  ]
}