{
  "meta": [
    {
      "job_title": "Senior Engineer - Water Infrastructure",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Engineering Designs",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Client Communication",
      "experience": 8
    },
    {
      "skill": "Technical Review",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "CAD and GIS",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform complex engineering tasks including engineering designs, preparing reports, construction drawings, specifications, and calculations for various projects."
    },
    {
      "duty": "Review product designs and drawings for compliance with engineering principles, firm standards, customer contract requirements, and related specifications."
    },
    {
      "duty": "Develop proposals and budgets for lower risk and smaller engineering efforts."
    },
    {
      "duty": "Meet with clients to determine recommended project scope, estimate staffing requirements, and fee for review and prepare for signature."
    },
    {
      "duty": "Develop and maintain client contact before, during, and after project completion."
    },
    {
      "duty": "Cultivate client relationships through organizational involvement and by direct contract."
    },
    {
      "duty": "Maintain three-month workload projections for all projects under personal management."
    },
    {
      "duty": "Work closely with other engineers and managers to balance workload demands amongst current staff."
    },
    {
      "duty": "Assist in mentoring and training Associate Engineers, Engineers and Engineering Interns."
    },
    {
      "duty": "Prepare and conduct technical review of staff, reports, correspondence, calculations and prepare technical recommendations."
    },
    {
      "duty": "Plan, organize and supervise work of professionals and technicians as needed."
    },
    {
      "duty": "Prepare specifications and contract documents."
    },
    {
      "duty": "Prepare opinions of probable cost and construction schedules/sequencing on current and new designs."
    },
    {
      "duty": "Act as project manager or team member on larger design and construction projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Civil/Environmental Engineering (Master’s degree preferred)"
    },
    {
      "credential": "PE Licensure"
    }
  ]
}