{
  "meta": [
    {
      "job_title": "Sr. Financial Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Business Profitability Enhancement",
      "experience": 5
    },
    {
      "skill": "Financial Modeling",
      "experience": 5
    },
    {
      "skill": "ERP Skills",
      "experience": 5
    },
    {
      "skill": "Cost Accounting",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Collaborative Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with all team members to ensure all costs for team projects and accounts are understood and used in the determination of selling prices and relationship strategies."
    },
    {
      "duty": "Understand the impact of changes made by customers after the project has been awarded and launched to ensure the additional costs are promptly margined and invoiced."
    },
    {
      "duty": "Evaluate all customer purchase orders to ensure that they match company quotes and capture all understandings established with the customer."
    },
    {
      "duty": "Prepare monthly management review packages and drive meetings with the team and management team in conjunction with financials and analysis of key metrics."
    },
    {
      "duty": "Undertake special projects as assigned by senior management."
    },
    {
      "duty": "Investigate variances to plan unusual financial transactions timely to explain profitability and support the financial close process."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Degree in Accounting or Finance or other relevant area, 5+ years of experience in Finance or Accounting, solid understanding of cost accounting in a manufacturing or distribution environment."
    }
  ]
}