{
  "meta": [
    {
      "job_title": "Nuclear Medicine Technologist",
      "job_category": "Healthcare",
      "job_class": "Technologist",
      "sector": "Medical",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Nuclear Medicine Technology",
      "experience": 1
    },
    {
      "skill": "Radiologic Technologists",
      "experience": 1
    },
    {
      "skill": "PACS Experience",
      "experience": 1
    },
    {
      "skill": "Computer Proficiency",
      "experience": 1
    },
    {
      "skill": "CPR Certification",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform complex and specialized tasks involved with the diagnostic imaging and treatment of patients and operation of nuclear medicine related equipment as directed by the physician."
    },
    {
      "duty": "Demonstrate continued competence in treating and caring for individuals based upon age-specific needs utilizing a developmental perspective."
    },
    {
      "duty": "Responsible for the achievement of patient outcomes through implementation of critical pathways and in accordance with the mission, vision, and values of the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of accredited coursework in nuclear medicine technology or graduate of an associate’s or bachelor’s degree program in nuclear medicine."
    },
    {
      "credential": "Current certification with the Nuclear Medicine Technology Certification Board (NMTCB) and/or American Registry of Radiologic Technologists, Nuclear Medicine Technologists (ARRT (N)) and state licensure required."
    },
    {
      "credential": "Computer proficiency and picture archiving and communication systems (PACS) experience."
    },
    {
      "credential": "CPR certification and driver’s licenses."
    },
    {
      "credential": "Basic Life Support (BLS) certification required or dually certified in both AHA Advanced Cardiac Life Support and AHA Pediatric Advanced Life Support."
    }
  ]
}