{
  "meta": [
    {
      "job_title": "Product Developer (Merchandise)",
      "job_category": "Product Development",
      "job_class": "Developer",
      "sector": "Merchandise",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Product Development",
      "experience": 2
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Supply Chain Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Technical Writing",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead all aspects of product development for select brands within the company, from line development through to conceptualization, development, and launch."
    },
    {
      "duty": "Work alongside internal and external partners to plan assortments and grow brands to hit projected revenue targets."
    },
    {
      "duty": "Create and regularly maintain all project management trackers; i.e. Asana and update project documentation and regularly communicate changes and updates to the team."
    },
    {
      "duty": "Communicate daily with related overseas Project Managers, Compliance, Vendors and Suppliers to ensure a smooth product development process."
    },
    {
      "duty": "Responsible for sending reference and development samples to overseas teams, licensors, and/or freelancers."
    },
    {
      "duty": "Develop a broad range of products that include but are not limited to apparel, toys, stationary, backpacks, drinkware, furniture, jewelry, and luggage with help from our overseas Product Development Team and outside contractors."
    },
    {
      "duty": "Liaise cross functionally to ensure that the product meets aesthetic specifications, functional specifications, licensor standards, and safety and reliability requirements."
    },
    {
      "duty": "Identify communication shortfalls and schedule regular conference calls with overseas counterparts, internal colleagues, and external partners to resolve issues in a timely fashion."
    },
    {
      "duty": "Responsible for initial item setup, and the ongoing maintenance of product data."
    },
    {
      "duty": "Collaborate with the Brand Team, overseas Project Managers, and design resources to expand the product assortment, spec new products, and create tech packs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree or higher, or equivalent additional experience"
    }
  ]
}