{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 35000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Understand and comply with regulatory requirements for financial transactions, most specifically Bank Secrecy Act (BSA) and Customer Identification Program (CIP) as it relates to specific job functions."
    },
    {
      "duty": "Provide superior customer service as an essential Austin Bank team member."
    },
    {
      "duty": "Participate in developing a teamwork atmosphere with co-workers as part of department/branch location."
    },
    {
      "duty": "Stay abreast of company communications by reading publications, announcements, and company e-mails."
    },
    {
      "duty": "Develop personal skills and capabilities through ongoing training."
    },
    {
      "duty": "Uphold and safeguard the organization's values relating to ethics, integrity, and confidentiality both internally and externally."
    },
    {
      "duty": "Greet customers and provide superior customer service."
    },
    {
      "duty": "Process loans and interview prospective customers for loans."
    },
    {
      "duty": "Attend loan closings and answer telephone calls, providing information to callers or routing calls to the appropriate person."
    },
    {
      "duty": "Greet visitors, ascertain the nature of business, and direct visitors to appropriate persons."
    },
    {
      "duty": "Schedule appointments, compose and type correspondence, read and route incoming mail, and perform other administrative and clerical duties."
    },
    {
      "duty": "Assist in coordinating departmental activities and initiate appropriate action required to expedite task completion."
    },
    {
      "duty": "File correspondence and other records, maintain files, resolve matters of a routine nature, maintain ticklers pertaining to loans, and maintain a loan exception list."
    },
    {
      "duty": "Obtain credit reports, handle confidential and sensitive information with proper discretion, explain, promote, and/or sell bank products or services."
    },
    {
      "duty": "Prepare required reports and files as necessary, notarize documents, verify port activity and file maintenance, and cross-train in other areas to provide assistance as needed."
    },
    {
      "duty": "Report to work regularly and promptly, maintain established department and bank policies, procedures, and objectives, and quality assurance."
    },
    {
      "duty": "Enhance professional growth and development through participation in in-service meetings and current literature."
    }
  ]
}