{
  "meta": [
    {
      "job_title": "International Tax Manager",
      "job_category": "Accounting",
      "job_class": "Manager",
      "sector": "Tax",
      "salary": 220000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Tax Information Reporting",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Business Development",
      "experience": 10
    },
    {
      "skill": "Revenue Generation",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Policy & Procedure Design",
      "experience": 10
    },
    {
      "skill": "Training & Development",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage Global Information Reporting related advisory and compliance projects."
    },
    {
      "duty": "Consult with and advise internal and external clients on U.S. back-up, nonresident alien, FATCA, and CRS reporting and withholding requirements."
    },
    {
      "duty": "Monitor legislative and regulatory developments impacting reporting and withholding requirements and draft thought leadership regarding the impact."
    },
    {
      "duty": "Review tax information returns prepared by staff including IRS Forms 1042, 1042-S, 1099, Foreign Bank Account Reports, FATCA and CRS reports."
    },
    {
      "duty": "Support RSM teams and member firms nationally on GIR related projects and issues and develop service offerings for dissemination to teams or business units."
    },
    {
      "duty": "Drive growth and profitability to the GIR practice by generating revenue and sales for existing clients, identifying leads and developing relationships for new clients and prospects, drafting responses to requests responding to RFPs, drafting proposals, and leading pursuits nationally."
    },
    {
      "duty": "Lead practice development activities and formulation of marketing and growth strategies and execution of firm plans and goals."
    },
    {
      "duty": "Manage and mentor staff and managers, execute annual performance reviews, and serve as a career advisor to members of the GIR team."
    },
    {
      "duty": "Establish steps, responsibilities, and timelines for GIR projects and compliance efforts."
    },
    {
      "duty": "Lead internal training sessions and client education workshops on FATCA, CRS, and other information reporting and withholding topics upon request."
    },
    {
      "duty": "Build relationships across lines of business to ensure excellent client service through an integrated service approach."
    },
    {
      "duty": "Travel as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Accounting, - CPA, EA, JD or MST preferred"
    }
  ]
}