{
  "meta": [
    {
      "job_title": "Implementation Analyst, Commercial Card Program",
      "job_category": "Business Analysis",
      "job_class": "Analyst",
      "sector": "Financial Services",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Client Facing",
      "experience": 1
    },
    {
      "skill": "Commercial Card Experience",
      "experience": 1
    },
    {
      "skill": "Data Analysis",
      "experience": 1
    },
    {
      "skill": "Project Management",
      "experience": 1
    },
    {
      "skill": "Microsoft Office",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Commercial Card Implementation",
      "experience": 1
    },
    {
      "skill": "TSYS Platform",
      "experience": 1
    },
    {
      "skill": "Project Management",
      "experience": 1
    },
    {
      "skill": "Self-Motivation",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Analyze customer data to determine implementation prioritization of commercial card conversion based on bank’s requirements"
    },
    {
      "duty": "Train with our client’s team to learn the various steps to implement cards products and technology platforms. Understand the differences of the old product and new product in order to communicate changes to customers as a result of the credit card migration"
    },
    {
      "duty": "Be trained on the previous and new platforms (card management, expense management, payables) and program management tool to on-board clients and recommend proposed program design within new platforms"
    },
    {
      "duty": "Engage with clients through kickoff, and ongoing meetings, to review and define program setup requirements and trouble shoot issues/questions."
    },
    {
      "duty": "Complete program setups within new platform"
    },
    {
      "duty": "Lead clients through walkthroughs of their individual program setups within new platform, and facilitate client training"
    },
    {
      "duty": "Support clients as they launch their program within new platform and provide post launch support through the clients first or second billing cycle, ensuring program setup meets the client requirements. Deliver client cycle end training"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Finance, or related field"
    }
  ]
}