{
  "meta": [
    {
      "job_title": "Civil/Construction/Structural Engineering Team Leader",
      "job_category": "Engineering",
      "job_class": "Team Leader",
      "sector": "Civil/Construction/Structural Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Structural Civil Engineering",
      "experience": 10
    },
    {
      "skill": "Railway Engineering",
      "experience": 10
    },
    {
      "skill": "Requirements and Interfaces management",
      "experience": 10
    },
    {
      "skill": "BIM (Building Information Modelling)",
      "experience": 5
    },
    {
      "skill": "Sub-Contractors selection",
      "experience": 5
    },
    {
      "skill": "Civil works design software",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage or perform engineering projects such as roads, airports, railroads, bridges, pipelines, tunnels, and water and sewage systems."
    },
    {
      "duty": "Supervise professional level employees and may also supervise some para-professional employees."
    },
    {
      "duty": "Set goals and objectives for team members for achievement of operational results."
    },
    {
      "duty": "Ensure identification and correct allocation of structural civil works system requirements."
    },
    {
      "duty": "Lead the identification and resolution of the technical Interfaces between Civil Works and technological Systems/subsystems and third parties."
    },
    {
      "duty": "Apply quality procedures for the emissions of the documents at every stage of the design."
    },
    {
      "duty": "Ensure there are no risks not assessed with respect to the safety of the works designed and compared to budgeted costs."
    },
    {
      "duty": "Verify the interfaces alignment and manage each step properly."
    },
    {
      "duty": "Identify and manage Civil Work Interface with civil contractors."
    },
    {
      "duty": "Use BIM for interfaces definition and management, as part of the project delivery strategy according to the Engineering Management Plan."
    },
    {
      "duty": "Prepare Purchase Technical Specification (PTS) according to contract needs."
    },
    {
      "duty": "Provide technical support for contract matters."
    },
    {
      "duty": "Define/consolidate and manage requirements and interfaces using Requirement Traceability Matrix and the Interface Registers tools, implemented in BIM (Building Information Modelling) context."
    },
    {
      "duty": "Manage contractors and sub-contractor activities: contract requirements and design processes-control."
    },
    {
      "duty": "Experience in construction and Test & Commissioning phases."
    },
    {
      "duty": "Basic experience in BIM context in accordance with ISO 19650."
    },
    {
      "duty": "Use common Structural software and civil works design software."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Structural Civil Engineering University Degree or Equivalent Technical Background"
    }
  ]
}