{
  "meta": [
    {
      "job_title": "Graphic Designer",
      "job_category": "Design",
      "job_class": "Designer",
      "sector": "Creative",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Adobe Creative Suite",
      "experience": 4
    },
    {
      "skill": "Print Design",
      "experience": 4
    },
    {
      "skill": "Typography",
      "experience": 4
    },
    {
      "skill": "Cloud-based Design",
      "experience": 3
    },
    {
      "skill": "Video Editing",
      "experience": 2
    },
    {
      "skill": "UX/UI Design",
      "experience": 2
    },
    {
      "skill": "HTML",
      "experience": 2
    },
    {
      "skill": "Graphic Asset Management",
      "experience": 4
    },
    {
      "skill": "Color Correction",
      "experience": 4
    },
    {
      "skill": "Photo Editing",
      "experience": 4
    },
    {
      "skill": "Illustration",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Communication",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for continuously maintaining the company’s brand aesthetics, internally and externally at the highest quality level."
    },
    {
      "duty": "Must be able to work independently, communicate design needs and manage all assigned jobs within deadline."
    },
    {
      "duty": "Understands and maintains the company’s visual representation in all aspects of design including typography, composition, and color."
    },
    {
      "duty": "Maintains a strong understanding of design standards and provides quality assurance on all deliverables."
    },
    {
      "duty": "Facilitates the marketing and communications team in delivering marketing tactics, providing multiple high quality creative assets across all brand channels."
    },
    {
      "duty": "Produces creative assets for various marketing materials including print advertisements, logos, certificates, brochures, flyers, sales sheets, interactive forms, trade show materials, etc."
    },
    {
      "duty": "Manages graphic assets and photo libraries, and be the go-to person for colleagues looking for corporate assets and photography."
    },
    {
      "duty": "Maintains up-to-date knowledge of design trends, apps, and software in order to heighten creativity and efficiency."
    },
    {
      "duty": "Works collaboratively with other designers to develop creative for various marketing campaigns."
    },
    {
      "duty": "Assists on marketing related photo shoots as needed or requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Degree or certificate in graphic design/communications or equivalent in trade school or work experience."
    },
    {
      "credential": "Minimum 4 years experience on Mac hardware"
    }
  ]
}