{
  "meta": [
    {
      "job_title": "Sr. Finance Systems Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Oracle ERP",
      "experience": 5
    },
    {
      "skill": "Finance Systems",
      "experience": 5
    },
    {
      "skill": "System Testing",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "OTBI",
      "experience": 5
    },
    {
      "skill": "FRWS",
      "experience": 5
    },
    {
      "skill": "Smart View",
      "experience": 5
    },
    {
      "skill": "BI Publisher",
      "experience": 5
    },
    {
      "skill": "Cloud ERP",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Setup, configure, support, and maintain newly implemented Oracle Cloud ERP system."
    },
    {
      "duty": "Serve as the subject matter expert for system enhancements and work with the finance team in developing project plans for deployment."
    },
    {
      "duty": "Participate in new technology testing, deployment, and support."
    },
    {
      "duty": "Provide ongoing maintenance and support, including upgrades to related software systems, developing reports, and incident resolution."
    },
    {
      "duty": "Test financial system applications during system changes including enhancements, upgrades, and maintenance."
    },
    {
      "duty": "Collaborate with finance teams to prioritize objectives and address issues."
    },
    {
      "duty": "Build and maintain internal resources for end users and provide ongoing training."
    },
    {
      "duty": "Assist in integrations, perform validations, and ensure data flows downstream as required."
    },
    {
      "duty": "Develop various reports (OTBI, FRWS, Smart View, BIP, Dashboards, ad hoc, etc.)"
    },
    {
      "duty": "Create policies and procedures that will improve the overall operation and effectiveness of the systems, department, and company."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree preferred (major in Computer Science, Information Science, Accounting, or similar field) or equivalent experience."
    },
    {
      "credential": "5+ years of a combination of experience in information systems management, or accounting systems management."
    },
    {
      "credential": "Advanced SQL skills"
    },
    {
      "credential": "Experience with OTBI, FRWS, Smart View, BIP is a plus."
    },
    {
      "credential": "Cloud ERP system experience (Oracle a plus)"
    },
    {
      "credential": "Project-related experience is preferred"
    },
    {
      "credential": "Some weekend and holiday availability required"
    }
  ]
}