{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure excellent customer service standards are met by responding quickly to customer phone and email inquiries, solving problems efficiently, and maintaining high customer satisfaction."
    },
    {
      "duty": "Adhere to organization protocols for maintaining customer database as a source of record for all customer data and communications."
    },
    {
      "duty": "Provide product information, process orders, and correct errors with empathy and kindness."
    },
    {
      "duty": "Assist customers with post-order issues such as returns, replacements, refunds, delivery status, back-order inquiries, and any other problems that may arise in the order fulfillment process."
    },
    {
      "duty": "Stay informed of new products, new product features, and changes to pricing plans."
    },
    {
      "duty": "Proactively coordinate with the appropriate departments and stakeholders to promptly resolve customer issues."
    },
    {
      "duty": "Gather and distribute customer feedback that could enhance future products, processes, or communications as appropriate."
    },
    {
      "duty": "Demonstrating conflict management skills while maintaining professional composure."
    },
    {
      "duty": "Maintain excellent working knowledge of company policies and procedures."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Conflict Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Salesforce",
      "experience": 3
    },
    {
      "skill": "EdTech Tools",
      "experience": 2
    },
    {
      "skill": "Bilingual (Spanish and English)",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent (Bachelor's degree preferred)"
    }
  ]
}