{
  "meta": [
    {
      "job_title": "Clinic Coordinator - Internal Medicine, Part Time",
      "job_category": "Administrative/Clerical",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Attention to Detail",
      "experience": 3
    },
    {
      "skill": "EPIC Management",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 3
    },
    {
      "skill": "Scheduling",
      "experience": 3
    },
    {
      "skill": "Health Information Privacy",
      "experience": 3
    },
    {
      "skill": "Medical Records Administration",
      "experience": 3
    },
    {
      "skill": "Flexibility",
      "experience": 3
    },
    {
      "skill": "Adaptability",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Greets and acknowledges patients at the front desk, checks patients in and out of the clinic, and performs practice designated activities to support new patients."
    },
    {
      "duty": "Collects time of service payments, posts payments in EPIC, and reconciles end-of-day receipts."
    },
    {
      "duty": "Coordinates information flow in and out of the clinic. Addresses patient calls efficiently and courteously. Takes accurate, clear and concise messages that provide sufficient information for the clinical staff and/or receiving party to effectively handle the issue/request."
    },
    {
      "duty": "Schedules, cancels and reschedules patient appointments, procedures, and surgeries. Places reminder calls and collects pertinent information from patients in advance of their appointment per office policy. Supports access by utilizing the wait list and filling appointment slots created by cancellations and no shows."
    },
    {
      "duty": "Obtains necessary pre-authorizations."
    },
    {
      "duty": "Appropriately transfers patients to pre-registration for insurance verification per RUMG policy."
    },
    {
      "duty": "Accesses EPIC to retrieve referrals, orders and other documentation and contacts various outside agencies to obtain referrals and other documentation."
    },
    {
      "duty": "Coordinates administrative office functions as assigned including completion of EPIC administrative in-box messages."
    },
    {
      "duty": "Maintains and retrieves medical records per HIM and office protocol."
    },
    {
      "duty": "Problem solves issues by seeking out the appropriate resources."
    },
    {
      "duty": "Works cooperatively in a team environment."
    },
    {
      "duty": "Demonstrates compliance with RUMG Customer Service and Performance Standards (attached)."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma required"
    }
  ]
}