{
  "meta": [
    {
      "job_title": "Associate Dean of Administration, School of Professional Studies",
      "job_category": "Administration",
      "job_class": "Associate Dean",
      "sector": "Education",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Program Evaluation",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Educational Program Development",
      "experience": 3
    },
    {
      "skill": "Fiscal Management",
      "experience": 3
    },
    {
      "skill": "Marketing Collaboration",
      "experience": 3
    },
    {
      "skill": "Distance Learning Policies",
      "experience": 3
    },
    {
      "skill": "Instructional Design",
      "experience": 3
    },
    {
      "skill": "Academic Leadership",
      "experience": 3
    },
    {
      "skill": "Curriculum Planning",
      "experience": 3
    },
    {
      "skill": "Student Support",
      "experience": 3
    },
    {
      "skill": "Continuing Education Programs",
      "experience": 3
    },
    {
      "skill": "Partnership Development",
      "experience": 3
    },
    {
      "skill": "Enrollment Data Analysis",
      "experience": 3
    },
    {
      "skill": "Training Program Development",
      "experience": 3
    },
    {
      "skill": "Financial Data Management",
      "experience": 3
    },
    {
      "skill": "Report Presentation",
      "experience": 3
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop program evaluation frameworks to assess the strengths of programs and to identify areas for improvement."
    },
    {
      "duty": "Support the Dean in facilitating the development of new courses and programs in collaboration with SPS faculty and all other UIW stakeholders."
    },
    {
      "duty": "Support the Dean in leading communication with internal and external stakeholders on the development, improvement and maintenance of degree and workforce development programs."
    },
    {
      "duty": "Assess and define fiscal/enrollment data needed for tracking the performance of each of SPS’ key functions and programs."
    },
    {
      "duty": "Collaborate with marketing to expand the reach of SPS programs and generate increasing enrollment numbers."
    },
    {
      "duty": "Develop distance learning policies and best practices."
    },
    {
      "duty": "Identify planning and operations needed to support the growth of SPS programs."
    },
    {
      "duty": "Collaborate with UIW Instructional Design and Center for Teaching Learning (and other units as needed) to develop training programs for faculty."
    },
    {
      "duty": "Identify and solve any issues associated with Canvas (UIW’s Learning Management System)."
    },
    {
      "duty": "Support the Dean in providing academic leadership in the areas of curriculum development and planning, course scheduling, and academic support to students."
    },
    {
      "duty": "Develop procedures and train staff to work directly with students to deal with student issues."
    },
    {
      "duty": "Handle student appeals that are related to student concerns."
    },
    {
      "duty": "Ensure academic policies, processes, and administrative practices are in alignment with UIW’s academic policies, practices and standards."
    },
    {
      "duty": "Handle academic petitions, grievances, and disciplinary issues."
    },
    {
      "duty": "Oversee the Professional and Continuing Education program of SPS dedicated to providing continuing professional and workforce development education for individuals, industry, government agencies, and non-profit organizations."
    },
    {
      "duty": "Develop comprehensive and enduring partnerships with industry, government, and non-profit organizations resulting in expanded training programs. Prepare and submit such training proposals to industry, government and nonprofit organizations."
    },
    {
      "duty": "Ensure that the flow of enrollment and financial data is timely and that it is presented in the most effective ways to inform managerial decisions throughout the unit."
    },
    {
      "duty": "Present reports to the leadership team that define project progress, problems and solutions."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Doctoral Degree from a regionally accredited U.S. university"
    }
  ]
}