{
  "meta": [
    {
      "job_title": "Senior Attorney",
      "job_category": "Legal",
      "job_class": "Attorney",
      "sector": "Law",
      "salary": 180000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Legal Research",
      "experience": 7
    },
    {
      "skill": "Client Relations",
      "experience": 7
    },
    {
      "skill": "Contract Negotiation",
      "experience": 7
    },
    {
      "skill": "Litigation",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Revenue Generation",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Represent clients in complex and high-profile legal matters, such as contracts, mergers and acquisitions, litigation, arbitration, mediation, intellectual property, real estate transactions, employment disputes, etc."
    },
    {
      "duty": "Develop and implement effective legal strategies that achieve the best possible outcomes for clients"
    },
    {
      "duty": "Draft, review, and negotiate various legal documents, such as pleadings, motions, contracts, agreements, leases, licenses, etc."
    },
    {
      "duty": "Conduct legal research and analysis on relevant laws, regulations, precedents, and trends"
    },
    {
      "duty": "Communicate clearly and professionally with clients, courts, opposing counsel, and other parties"
    },
    {
      "duty": "Supervise and mentor junior attorneys and paralegals, providing guidance and feedback"
    },
    {
      "duty": "Manage multiple projects and deadlines in a fast-paced environment"
    },
    {
      "duty": "Maintain high ethical standards and confidentiality"
    },
    {
      "duty": "Generate new business opportunities and maintain existing client relationships"
    },
    {
      "duty": "Contribute to the firm’s growth and reputation"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 35
    }
  ],
  "education_certification": [
    {
      "credential": "Juris Doctor degree from an accredited law school Admission to the state bar and in good standing At least 7 years of experience as a licensed attorney in a large or mid-sized law firm"
    }
  ]
}