{
  "meta": [
    {
      "job_title": "CLIENT SERVICE ASSOCIATE",
      "job_category": "Client Services",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides primary support to the Wealth Management Group and possesses excellent organizational skills and interpersonal capabilities to effectively interact with employees, clients, and vendors."
    },
    {
      "duty": "Responsible for all administrative duties and assists in all areas of client operations including opening new accounts and account maintenance."
    },
    {
      "duty": "Maintains confidential and time-sensitive material, client hard copy, and electronic files."
    },
    {
      "duty": "Supports Financial Advisor by preparing correspondence, commentary, client proposals, presentations, spreadsheets, and client presentations."
    },
    {
      "duty": "Performs various clerical duties, schedules client meetings, maintains the Financial Advisor’s calendar, and assists with seminars."
    },
    {
      "duty": "Assists with the formulation of policies and procedures in regard to opening accounts, maintenance of client files, and monthly preparation of information for client billing."
    },
    {
      "duty": "Performs various administrative functions, maintaining regular and reliable attendance."
    }
  ],
  "skills": [
    {
      "skill": "Organizational Skills",
      "experience": 3
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 3
    },
    {
      "skill": "Administrative Support",
      "experience": 3
    },
    {
      "skill": "Financial Services Experience",
      "experience": 3
    },
    {
      "skill": "Client Relationship Management",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree required. Current SIE & 7 license or the ability to obtain these licenses preferred, but not required."
    }
  ]
}