{
  "meta": [
    {
      "job_title": "Associate Director of Policy, Governance, Audit, and Compliance",
      "job_category": "Cybersecurity",
      "job_class": "Director",
      "sector": "Cybersecurity",
      "salary": 185000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cybersecurity Risk Management",
      "experience": 6
    },
    {
      "skill": "Compliance Management",
      "experience": 6
    },
    {
      "skill": "Governance Management",
      "experience": 6
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 6
    },
    {
      "skill": "Information Risk Management",
      "experience": 6
    },
    {
      "skill": "IT Compliance Technologies",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establishing an information management and protection framework for an effective enterprise-wide information governance program and directing day-to-day activities, including program objectives, policies, procedures, training, and communication."
    },
    {
      "duty": "Identifying information management and protection laws and regulations and implementing actions to ensure compliance."
    },
    {
      "duty": "Representing the organization's positions and advocating internal and external policy to shape the development of new laws and regulations consistent with company objectives."
    },
    {
      "duty": "Developing and implementing a compliance monitoring system."
    },
    {
      "duty": "Coordinating a company-wide assessment process to identify potential risks and control solutions."
    },
    {
      "duty": "Creating internal partnerships with key stakeholders to influence and align business-area actions that are needed to achieve program objectives."
    },
    {
      "duty": "Directing actions to ensure external stakeholders have policies and practices aligned with laws, regulations, and organizational programs."
    },
    {
      "duty": "Developing and overseeing formalized programs related to compliance by evaluating the current landscape of each and developing plans for improved management, including automation."
    },
    {
      "duty": "Providing insightful recommendations across the internal environment to improve internal control procedures, increase audit efficiencies, and drive process optimization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or four or more years of work experience."
    },
    {
      "credential": "Professional management certification, such as CISA, CRISC, CISM, CISSP, or other related credentials."
    },
    {
      "credential": "Sound knowledge of business management and a working knowledge of information risk management, cybersecurity and IT compliance technologies; knowledge and understanding of relevant legal and regulatory requirements."
    }
  ]
}