{
  "meta": [
    {
      "job_title": "National Business Development Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 140000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of sales professionals focused on prospecting, vetting, and qualifying new business opportunities with targeted industries and customers."
    },
    {
      "duty": "Maximize the value proposition and coordinate the follow-through needed to close new business and further profitable growth with existing customers."
    },
    {
      "duty": "Approach the sales process with a high degree of professionalism and effectiveness using customer centric selling skills and tools across the team."
    },
    {
      "duty": "Maintain first-hand knowledge of technology changes, material development, and marketplace conditions; make presentations at sales meetings."
    },
    {
      "duty": "Drive sales efficiencies through utilization of data and a digital technology stack. Create and maintain CRM data and sales statistics as required."
    },
    {
      "duty": "Establish and maintain strong relationships with BU partners in sales, customer service, planning, manufacturing, logistics, and other functions."
    },
    {
      "duty": "Interview and onboard new associates into the sales team. Onboarding duties to include systems training, sales skills training, key stakeholder introductions, and sales process training."
    }
  ],
  "skills": [
    {
      "skill": "Sales Leadership",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Customer Centric Selling",
      "experience": 5
    },
    {
      "skill": "CRM Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree required 10+ years’ experience in sales, with a strong preference for experience in consumer and/or healthcare markets, with a strong understanding of how to engage OEM level contacts and drive programs."
    },
    {
      "credential": "3+ years’ experience in sales leadership and leading and managing others"
    },
    {
      "credential": "Proven track record of large OEM business development, preferably within Healthcare or Consumer markets"
    }
  ]
}