{
  "meta": [
    {
      "job_title": "Director, Compliance - External Regulatory Audit Management",
      "job_category": "Compliance",
      "job_class": "Director",
      "sector": "Compliance",
      "salary": 142000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Audit Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Strategic Leadership",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Decision Making",
      "experience": 5
    },
    {
      "skill": "Microsoft Word",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Microsoft PowerPoint",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and oversee coordination of Federal, State and product specific audits conducted by regulators of Medicaid, Medicare, Marketplace programs."
    },
    {
      "duty": "Develop and maintain effective playbooks to support and coordinate external audits including but not limited to Medicaid EQRO, HSAG, State and Federal Market Conduct Exams, CMS Audits of Medicare and Marketplace plans, RADV, etc."
    },
    {
      "duty": "Coordinates and directs all responses and follow-up to audit findings and draft audit reports."
    },
    {
      "duty": "Minimizes risk to the company by responding to or supporting and assisting with the facilitation of Medicaid, Marketplace or Medicare audits conducted by the Market and Federal Compliance Officers in their execution of the audit."
    },
    {
      "duty": "Performs or coordinates specific audits to determine compliance, and if necessary, ensuring appropriate actions are taken to put the company in compliance."
    },
    {
      "duty": "Seeks opportunities to educate management and associates on the importance of risk mitigation, effective internal controls and compliance with applicable regulations."
    },
    {
      "duty": "Partner with the business and IT with the CMS universe creation, including supporting the business partners and vendors with their universe creation."
    },
    {
      "duty": "Support the education of audit protocols, both internally and with vendor partners."
    },
    {
      "duty": "Perform a risk assessment related to the issues tested during the audit to provide insight on any vulnerabilities related to the relevant audit."
    },
    {
      "duty": "Provide at least quarterly status reports for the Corporate Compliance Officer/Committee and Enterprise Executive Leadership regarding external audits and related issues."
    },
    {
      "duty": "Maintain positive and strategic relationships with internal and external stakeholders."
    },
    {
      "duty": "Perform any other job duties as requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business or related field or equivalent years of relevant work experience is required. Master's of Business Administration (MBA), JD or other advanced degree, is preferred. Minimum of five (5) years of healthcare operations, managed care, or DOI audit management experience is required. Minimum of three (3) years of Compliance Program leadership experience. CMS Program Audit experience is required. Minimum of three (3) years previous management experience is required, audit management experience within healthcare operations is preferred. Significant regulatory implementation experience is required."
    }
  ]
}