{
  "meta": [
    {
      "job_title": "Senior Demand Planner",
      "job_category": "Supply Chain",
      "job_class": "Planner",
      "sector": "Supply Chain",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Demand Forecasting",
      "experience": 5
    },
    {
      "skill": "Data Integrity",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Cross-Functional Collaboration",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Supply Chain Analytics",
      "experience": 5
    },
    {
      "skill": "S&OP Process",
      "experience": 5
    },
    {
      "skill": "Financial Forecasting",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and maintain brand level and aggregated overall business demand plans for a complex product mix."
    },
    {
      "duty": "Identify, investigate, and resolve key exceptions and anomalies across markets and categories to inform demand plans."
    },
    {
      "duty": "Develop and optimize new and existing data sources and use available customer data appropriately to understand key metrics within the customer."
    },
    {
      "duty": "Utilize analytical and statistical forecasting methods to drive an optimum forward demand."
    },
    {
      "duty": "Work cross-functionally with brands and account teams to understand the latest thinking for customer activity and incorporate it into demand plan."
    },
    {
      "duty": "Support new product forecasting with a cross-functional team to gain alignment across all parties and minimize inventory risk."
    },
    {
      "duty": "Play an active role in the S&OP process to drive alignment between demand plan and financial forecast."
    },
    {
      "duty": "Develop and maintain a set of in-market Demand Plan SOP’s and contribution through Global forums to the development of Global Demand processes and systems."
    },
    {
      "duty": "Own and drive improvements against the defined KPI’s."
    },
    {
      "duty": "Act as subject matter Expert for the Region."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Supply Chain, or a related field (Master's preferred)"
    }
  ]
}