{
  "meta": [
    {
      "job_title": "Assistant General Manager",
      "job_category": "Management",
      "job_class": "General Manager",
      "sector": "Management",
      "salary": 79500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Operational Management",
      "experience": 5
    },
    {
      "skill": "Safety and Sanitation",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Human Resource Management",
      "experience": 5
    },
    {
      "skill": "Hiring and Onboarding",
      "experience": 5
    },
    {
      "skill": "Food Production",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the General Manager in setting the standard of Dining excellence through planning, organization, management, and directing total day-to-day activities of MTC Dining."
    },
    {
      "duty": "Manage customer service, food production, safety, and training alongside the General Manager."
    },
    {
      "duty": "Make independent decisions about assigned work and operational aspects with budgetary impacts such as labor and inventory management controls."
    },
    {
      "duty": "Oversee high-level fundamentals of the student training program across MTC Dining and provide feedback and direction to full-time employees as needed."
    },
    {
      "duty": "Attend weekly MTC Dining full-time meetings and conduct monthly 1 on 1 with all FT staff (direct reports)."
    },
    {
      "duty": "Implement and monitor housekeeping, sanitary and safety rules, and regulations to ensure food safety and compliance with standards and regulations."
    },
    {
      "duty": "Oversee all areas of MTC Dining and assist in any areas as directed by the General Manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Management or Hospitality and 5 years of experience in restaurant operations or kitchen production and preparation, including at least 3 years of supervisory experience; or an equivalent combination of education and experience."
    }
  ]
}