{
  "meta": [
    {
      "job_title": "Communications Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive excellence in earned media coverage, maintain message consistency, and partner closely with internal and external partners including agencies."
    },
    {
      "duty": "Act like a journalist in their own right -- building relationships with internal clients, digging for stories and unique angles, identifying both internal and external news, building and managing a cadence of thought leadership stories focused on both technology and its impact on the customer, and managing key media relationships."
    },
    {
      "duty": "Build strong relationships with reporters, editors, and other thought leaders/influencers. Develop and effectively communicate compelling story angles for media pitches and for use in internal storytelling."
    },
    {
      "duty": "Identify technology trends, specifically those focused on mobility and fleet management software, to mine for media opportunities."
    },
    {
      "duty": "Communicate regularly with senior executive clients and agency partners."
    },
    {
      "duty": "Monitor and evaluate competitive media intelligence and suggest counter strategies. Prepare spokespeople with comprehensive background materials and staff media interviews."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or four or more years of work experience. Six years of relevant experience in corporate communications or public relations.\nEven better if you have one or more of the following:\nBachelor's degree in communications, journalism, public relations, or, advertising.\nCommunications in the technology or software space."
    }
  ]
}