{
  "meta": [
    {
      "job_title": "Network Engineer",
      "job_category": "Information Technology",
      "job_class": "Senior",
      "sector": "Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cloud Network Engineering",
      "experience": 5
    },
    {
      "skill": "Operations",
      "experience": 5
    },
    {
      "skill": "Architecture",
      "experience": 5
    },
    {
      "skill": "Network Infrastructure",
      "experience": 5
    },
    {
      "skill": "Connectivity Solutions",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Cisco Networks",
      "experience": 5
    },
    {
      "skill": "Security Protocols",
      "experience": 4
    },
    {
      "skill": "Disaster Recovery Planning",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and drive high priority network initiatives and projects in cloud and hybrid cloud models."
    },
    {
      "duty": "Evaluate network infrastructure and connectivity solutions and make recommendations for cloud-based migration of applications and data workloads."
    },
    {
      "duty": "Collaborate with leadership, business partners, vendors, and project teams for cloud network initiatives."
    },
    {
      "duty": "Provide technical expertise and mentoring for high-visibility cloud solutions, implementations, and migration initiatives."
    },
    {
      "duty": "Participate in network assessment, design, connectivity, and ongoing operation for connecting to various cloud vendors."
    },
    {
      "duty": "Assist with the migration of existing applications to new cloud hosting platforms."
    },
    {
      "duty": "Provide senior-level network engineering, design, and operation consultation with leadership, project teams, and end users."
    },
    {
      "duty": "Participate in potential refactoring, rebuild, or redesign during cloud migration."
    },
    {
      "duty": "Create documentation, requirements documents, logical and physical network diagrams, and implementation plans for cloud network integration."
    },
    {
      "duty": "Serve as a senior network resource in the hybrid cloud enterprise journey encompassing ongoing cloud architecture, design, planning, and configuration."
    },
    {
      "duty": "Responsible for engineering, implementing, and operating cloud network solutions at the component level, including troubleshooting and optimization."
    },
    {
      "duty": "Provide feedback to leadership and peers on risks identified during business impact analysis, site risk assessments, and disaster recovery planning."
    },
    {
      "duty": "Maintain technical knowledge and business acumen within the discipline or function."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Computer Science, Information Systems, Computer Networking (Master's preferred)"
    },
    {
      "credential": "Cisco Certified Network Associate (CCNA) certification acceptable with other network credentials"
    },
    {
      "credential": "Project Management Professional (PMP) certification"
    },
    {
      "credential": "Security + certification"
    }
  ]
}