{
  "meta": [
    {
      "job_title": "Executive Assistant - Global Programs",
      "job_category": "Administrative",
      "job_class": "Assistant",
      "sector": "Foundation",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Detail-Oriented",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Diversity, Equity, and Inclusion (DEI) Mindset",
      "experience": 6
    },
    {
      "skill": "Communication",
      "experience": 6
    },
    {
      "skill": "International Experience",
      "experience": 6
    },
    {
      "skill": "French Language",
      "experience": 5
    },
    {
      "skill": "Calendar Management",
      "experience": 6
    },
    {
      "skill": "Travel Planning",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and track the VP’s schedule, including complex calendar management, travel arrangements, meeting, and administrative support."
    },
    {
      "duty": "Anticipate the needs of the VP, ensure she is prepared and briefed on her day-to-day activities, meetings, and appointments."
    },
    {
      "duty": "Provide meeting support by taking notes and following up on action items, as needed."
    },
    {
      "duty": "Promptly respond to internal and external requests, composing and preparing correspondence that are sometimes confidential and applying high levels of professionalism and discretion on handling and triaging the VP’s communications."
    },
    {
      "duty": "Research, prioritize, and follow up on incoming issues and concerns addressed to the VP including those of a sensitive or confidential nature."
    },
    {
      "duty": "Ensure VP has materials, briefings, talking points, speeches, itineraries needed for day-to-day engagements, trips, and meetings, tracking tasks and deliverables, and following up on outstanding items."
    },
    {
      "duty": "Facilitate arrangements for travel, both domestic and international, and logistics for external and internal meetings, speaking engagements and conferences; anticipate travel needs and proactively plan with contingencies."
    },
    {
      "duty": "Active engagement in learning opportunities, including participation in team meetings, skill building, collaboration, and equity learning agenda."
    },
    {
      "duty": "Ability to travel 10% for project-based work – will vary depending on location."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100
    },
    {
      "student_teacher": 80
    },
    {
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience"
    }
  ]
}