{
  "meta": [
    {
      "job_title": "Physical Therapist",
      "job_category": "Clinical Professional",
      "job_class": "Therapist",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Physical Therapy",
      "experience": 0
    },
    {
      "skill": "Rehabilitation Therapy",
      "experience": 0
    },
    {
      "skill": "Patient Evaluation",
      "experience": 0
    },
    {
      "skill": "Treatment Planning",
      "experience": 0
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 0
    },
    {
      "skill": "Physical Disabilities",
      "experience": 0
    },
    {
      "skill": "FIMS",
      "experience": 0
    },
    {
      "skill": "ICU Experience",
      "experience": 0
    },
    {
      "skill": "Teaching",
      "experience": 0
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluate patients, plan treatment programs, and perform physical therapy procedures to restore function, prevent disability, reduce pain, and maximize potential and quality of life following disease, injury, or surgery."
    },
    {
      "duty": "Assess patient’s functional status, including range of motion, strength, reflexes, tone, posture, gait, orthotic or prosthetic fit, sensorimotor function, wheelchair seating, etc."
    },
    {
      "duty": "Develop realistic, functional goals mutually agreed upon with the patient/family and educate patients and their families in the knowledge and skills that promote functional restoration of mobility."
    },
    {
      "duty": "Perform treatment according to the established plan, utilizing all available modalities (i.e., heat/cold, hydrotherapy, electrical stimulation, massage, joint mobilization, exercise, etc.), equipment, and techniques within the scope of physical therapy."
    },
    {
      "duty": "Document assessment, plan, all care given, and the patient response in the patient record and collaborate with the interdisciplinary team in assessing, planning, implementing, and evaluating the patient’s care, rehabilitation programs, and related activities."
    },
    {
      "duty": "Participate in case conferences, care rounds, and family meetings to progress the patient toward rehab goals and discharge planning and re-evaluate patients, assess their progress, and make recommendations as to their discharge planning."
    },
    {
      "duty": "Maintain professional standards by participating in inservices and hospital/department requirements and delegate, direct, and supervise implementation of care to PTA, PCT, and physical therapy students."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an accredited school of Physical Therapy"
    }
  ]
}