{
  "meta": [
    {
      "job_title": "Director of eCommerce Website Product Management & Optimization",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "eCommerce",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "eCommerce Website Product Management",
      "experience": 7
    },
    {
      "skill": "Conversion Optimization",
      "experience": 7
    },
    {
      "skill": "SEO",
      "experience": 7
    },
    {
      "skill": "Team Management",
      "experience": 7
    },
    {
      "skill": "Quantitative Analysis",
      "experience": 7
    },
    {
      "skill": "Web Technology",
      "experience": 5
    },
    {
      "skill": "AI Applications",
      "experience": 5
    },
    {
      "skill": "Web Analytics Tools",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Collaboration Skills",
      "experience": 7
    },
    {
      "skill": "Lifelong Learning",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team responsible for user experience, conversion optimization, SEO, and eCommerce website product management."
    },
    {
      "duty": "Act as the product manager for the website, working closely with the development team to improve website functionality and drive growth, collaborating closely with sales, merchandising, and product development teams."
    },
    {
      "duty": "Manage relationships with 5-10 external vendor partners, ensuring they deliver results and are held accountable for their performance."
    },
    {
      "duty": "Work effectively with cross-functional teams, particularly sales, merchandising, and product development."
    },
    {
      "duty": "Use strong quantitative skills to analyze website performance, make data-driven decisions to improve user experience and conversion rates, and monitor, report and drive improvement in key performance metrics."
    },
    {
      "duty": "Leverage AI and machine learning technologies, such as recommendation engines, natural language processing, and automated A/B testing, to optimize website performance and user experience."
    },
    {
      "duty": "Ensure the team's technical competencies are up-to-date and aligned with industry best practices, such as proficiency in UX/UI design tools, web analytics tools, SEO tools, and technologies & processes to identify and prioritize customer requirements."
    },
    {
      "duty": "Monitor, report, and drive improvement in relevant website SEO performance metrics, such as organic search traffic, keyword rankings, and user engagement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in computer science, Information Technology, or a related field (Master's preferred)"
    }
  ]
}