{
  "meta": [
    {
      "job_title": "Onsite Medical Representative",
      "job_category": "Health & Safety",
      "job_class": "Representative",
      "sector": "Health & Safety",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "First Aid",
      "experience": 5
    },
    {
      "skill": "CPR",
      "experience": 5
    },
    {
      "skill": "Medical Triage",
      "experience": 5
    },
    {
      "skill": "Occupational Health",
      "experience": 3
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Ergonomics",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Digital Recordkeeping",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide first aid and medical triage for employees, and refer to outside medical providers when necessary."
    },
    {
      "duty": "Create and implement a first aid care plan for injured employees, including self-care instructions."
    },
    {
      "duty": "Facilitate the workers’ compensation and return-to-work process for employees with work-related injuries."
    },
    {
      "duty": "Maintain medical supply inventory and ensure a clean and orderly environment."
    },
    {
      "duty": "Participate in incident investigations and weekly case management review meetings."
    },
    {
      "duty": "Attend associate committee meetings, greeting new hires, and coaching on at-risk work habits."
    },
    {
      "duty": "Provide daily activity logs and end-of-shift reports."
    },
    {
      "duty": "Train and teach first aid, CPR, and AED certification classes to employees."
    },
    {
      "duty": "Participate in special projects and ad hoc tasks as assigned."
    },
    {
      "duty": "Work flexible shifts, including days, nights, and weekends."
    },
    {
      "duty": "Communicate effectively, display professional behavior, and maintain composure in emergencies."
    },
    {
      "duty": "Follow direction, policy, and procedures in an inclusive and diverse atmosphere."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 150,
      "introvert_extrovert": 75
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent, valid first aid, CPR, and AED certification, and emergency medical technician or paramedic certification, or relevant degree in health-related fields."
    }
  ]
}