{
  "meta": [
    {
      "job_title": "Business Development Specialist",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify prospects, qualify leads, and onboard new contacts to drive strategic account growth and spearhead new business initiatives."
    },
    {
      "duty": "Conduct independent research to gain comprehensive knowledge of client brand, services, target audience, and \"go-to-market\" initiatives."
    },
    {
      "duty": "Proactively reach out to clients, employing strategic outreach techniques and implementing lead generation and prospecting plans to boost sales."
    },
    {
      "duty": "Utilize existing relationships to secure \"warm\" introductions to additional departments or buyers within the same department."
    },
    {
      "duty": "Develop organizational charts for client companies, equipping yourself with tactical insights into potential buyers and formulating actionable engagement plans for each individual."
    },
    {
      "duty": "Compile and maintain a comprehensive events or project calendar for each buyer or department, ensuring a well-defined strategy for the next three months and beyond."
    },
    {
      "duty": "Efficiently utilize the CRM pipeline and reporting tools to document outreach activities, track contact and account development, and enhance overall productivity."
    },
    {
      "duty": "Create and implement supplementary systems and reports to monitor and measure account growth."
    },
    {
      "duty": "Leverage social media networks to represent Pinnacle Branding, showcase company achievements, and gain valuable insights into client organizations."
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Lead Generation",
      "experience": 5
    },
    {
      "skill": "CRM Management",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Strategic Outreach",
      "experience": 5
    },
    {
      "skill": "Account Growth",
      "experience": 5
    },
    {
      "skill": "Social Media Marketing",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Marketing, Sales, or a related field (Master's preferred)"
    }
  ]
}