{
  "meta": [
    {
      "job_title": "Human Resources Director",
      "job_category": "Human Resources",
      "job_class": "Director",
      "sector": "Management",
      "salary": 132500,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Human Resource Strategy",
      "experience": 5
    },
    {
      "skill": "Talent Acquisition",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Diversity, Equity and Inclusion",
      "experience": 5
    },
    {
      "skill": "Leadership and Mentoring",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Partner with the leadership team to understand and execute the organization’s human resource and talent strategy particularly as it relates to current and future talent needs, recruiting, retention, and succession planning."
    },
    {
      "duty": "Provide support and guidance to HR Business Partners, HR generalists, management, and other staff when complex, specialized, and sensitive questions and issues arise."
    },
    {
      "duty": "Implement policies, processes, training, initiatives, and surveys to support the organization’s human resource compliance and strategy needs."
    },
    {
      "duty": "Oversee the administration of human resource programs including, but not limited to, compensation, benefits, and leave; disciplinary matters; disputes and investigations; performance and talent management; productivity, recognition, and morale; occupational health and safety; and training and development."
    },
    {
      "duty": "Analyze trends in compensation and benefits; researches and proposes competitive base and incentive pay programs to ensure the organization attracts and retains top talent."
    },
    {
      "duty": "Create learning and development programs and initiatives that provide internal development opportunities for employees."
    },
    {
      "duty": "Conduct research and analysis of organizational trends including review of reports and metrics from the organization’s human resource information system."
    },
    {
      "duty": "Monitor and ensure the organization’s compliance with federal, state, and local country employment laws and regulations, and recommended best practices; review and modify policies and practices to maintain compliance."
    },
    {
      "duty": "Develop and implement HR elements for global business travels."
    },
    {
      "duty": "Maintain involvement with new foreign entities for an extended period to develop policies, processes and procedures."
    },
    {
      "duty": "Facilitates professional development, training, and certification activities for HR staff."
    },
    {
      "duty": "Performs other duties as assigned."
    },
    {
      "duty": "Develop and implement HR elements for global business travels."
    },
    {
      "duty": "Maintain involvement with new foreign entities for an extended period to develop policies, processes and procedures."
    },
    {
      "duty": "Facilitates professional development, training, and certification activities for HR staff."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business, human resources, or related experience. Graduate degree and/or SHRM, PHR or SPHR a plus."
    }
  ]
}