{
  "meta": [
    {
      "job_title": "HR Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Human Resources",
      "salary": 80000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the management and administration of people processes, programs, and policies including benefits, audit, payroll, compliance, HRIS, employee relations and more with internal and external partners."
    },
    {
      "duty": "Effectively administer employee benefits; LOA, new hire onboarding process including orientation and E-Verify."
    },
    {
      "duty": "Play a lead role in the planning and execution of company open enrollment program."
    },
    {
      "duty": "Act as a trusted partner during key employee lifecycle events such as onboarding, leave of absence and offboarding."
    },
    {
      "duty": "General HR Administrative Support such as employee communication preparation, Change of Status, Hiring & Turnover report, Organizational chart updates and maintenance - Recruitment Admin."
    },
    {
      "duty": "Generate and update job descriptions and/or new job postings as directed."
    },
    {
      "duty": "Assess competitors’ postings and make recommendations for updates in order to ensure the Company has a competitive hiring advantage."
    },
    {
      "duty": "Provide supplemental recruitment support for intermediate-level positions (i.e. candidate screening, interview scheduling, etc.) as needed."
    },
    {
      "duty": "Prepare candidate offer packages."
    },
    {
      "duty": "Monitor progress of third-party background checks for new hires."
    },
    {
      "duty": "Work closely with functional managers and HR management to prepare and streamline New Hire Orientation schedule."
    },
    {
      "duty": "Update and maintain organizational charts as directed."
    },
    {
      "duty": "Update employee handbook and/or policy documents as directed."
    },
    {
      "duty": "Maintain personnel files and confidential documentation."
    },
    {
      "duty": "Plan and schedule company meetings, events and appointments."
    },
    {
      "duty": "Prepare meeting invitations, location bookings, meeting setup and coordinate meals and beverages as needed as required by management."
    },
    {
      "duty": "Coordinate travel, hotel, car rental and other travel arrangements as required by management."
    },
    {
      "duty": "Maintain workspace cleanliness by adhering to the 5S method of organization."
    },
    {
      "duty": "Abide by safe work practices and adhere to general safety rules, performing all duties in a safe manner and never placing yourself or those around you in an unsafe condition. Report all unsafe conditions to your"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent in business discipline required."
    },
    {
      "credential": "Developing knowledge of applicable labor laws and regulations, market trends in compensation administration, and competitive pay practices."
    },
    {
      "credential": "Proficient in Microsoft Office Suite (Word, Excel, PowerPoint, Project, etc.)."
    },
    {
      "credential": "Ability to maintain a high degree of sensitivity and confidentiality."
    },
    {
      "credential": "Strong interpersonal skills. Must be able to express oral and written communication in a clear and concise manner and effectively present information and respond to questions from managers, customers and employees."
    },
    {
      "credential": "Effective organizational and time management skills with the ability to multi-task and prioritize assignments as needed."
    },
    {
      "credential": "Ability to perform routine work with no instructions, requires general instructions on new assignments."
    },
    {
      "credential": "Ability to work effectively under pressure in a rapidly changing environment"
    }
  ]
}