{
  "meta": [
    {
      "job_title": "SEO Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 100000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build an SEO strategy, focusing on growing Amazon Flex’s organic reach across our regions and showing how you will deploy content to acquire our target audiences within our unique delivery areas."
    },
    {
      "duty": "Write and deploy original content for the Amazon Flex website, tailored for the right audience."
    },
    {
      "duty": "Scope third-party applications to support with SEO tasks, provide training to worldwide marketing stakeholders."
    },
    {
      "duty": "Be the SME on Amazon Flex customer search behavior, needs and gaps and work with internal stakeholders to enhance the customer experience in other areas of the business."
    },
    {
      "duty": "Monitor Delivery Partner sentiment in specific regions and act as the expert on their needs, including communicating back to the larger Amazon Flex team."
    },
    {
      "duty": "Constantly check search results, ranking and analytics to monitor performance and make recommendations for improvements."
    },
    {
      "duty": "Keep up-to-date with ever-changing algorithm updates."
    },
    {
      "duty": "Work with internal teams to share and learn best-practices, and drive results between marketplaces."
    },
    {
      "duty": "Collaborate with technical partner teams to explain and prioritize technical issues."
    }
  ],
  "skills": [
    {
      "skill": "SEO Strategy",
      "experience": 5
    },
    {
      "skill": "Content Creation",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Online Marketing",
      "experience": 5
    },
    {
      "skill": "Technical SEO",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}