{
  "meta": [
    {
      "job_title": "Growth Product Designer",
      "job_category": "Product Design",
      "job_class": "Senior",
      "sector": "Technology",
      "salary": 180000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "User Research",
      "experience": 5
    },
    {
      "skill": "Data-Driven Design",
      "experience": 5
    },
    {
      "skill": "Wireframing",
      "experience": 5
    },
    {
      "skill": "Prototyping",
      "experience": 5
    },
    {
      "skill": "User-Centered Design",
      "experience": 5
    },
    {
      "skill": "A/B Testing",
      "experience": 5
    },
    {
      "skill": "Figma",
      "experience": 5
    },
    {
      "skill": "Adobe XD",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Strategic Thinking",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the design and optimization of growth-focused features and experiences that align with business goals and enhance user engagement."
    },
    {
      "duty": "Conduct user research and gather insights to understand user behaviors, pain points, and motivations, using this information to inform design decisions and help users achieve their health goals."
    },
    {
      "duty": "Collaborate with Product Managers and Data Analysts to define key performance indicators (KPIs) and success metrics for growth initiatives."
    },
    {
      "duty": "Create wireframes, prototypes, and high-fidelity designs that effectively communicate the user journey and interaction flow for growth experiments."
    },
    {
      "duty": "Collaborate with Engineering teams to ensure the successful implementation of designed solutions, maintaining design integrity throughout development."
    },
    {
      "duty": "Collaborate with Product Management partners to plan, execute, and analyze A/B tests and other experiments to evaluate the effectiveness of design changes and inform iterative improvements."
    },
    {
      "duty": "Stay current with industry trends, design best practices, and growth methodologies to continually enhance the growth design process."
    },
    {
      "duty": "Present design rationale, concepts, and results to cross-functional teams, advocating for user-centered design strategies that drive growth."
    },
    {
      "duty": "Engage with the broader Product Design Team to share learnings, seek inputs, and coordinate to collectively deliver a continuously improving user experience."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 75,
      "student_teacher": 100,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Design, HCI, Interaction Design, or a related field. Master's degree is a plus."
    }
  ]
}