{
  "meta": [
    {
      "job_title": "Graphic Designer",
      "job_category": "Design",
      "job_class": "Specialist",
      "sector": "Design",
      "salary": 46000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Graphic Design",
      "experience": 3
    },
    {
      "skill": "Proofreading",
      "experience": 3
    },
    {
      "skill": "Software Skills",
      "experience": 4
    },
    {
      "skill": "Quality Control",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create company native labels and perform proofreading/verification tasks on product labelling."
    },
    {
      "duty": "Collaborate with the team to resolve differences identified during the process."
    },
    {
      "duty": "Execute data and document management entries, configuration, and document processing in the electronic document management system."
    },
    {
      "duty": "Assist project leaders with various tasks to support the development, design, and implementation of product labelling."
    },
    {
      "duty": "Manage multiple tasks in a fast-paced deadline driven environment with minimal supervision."
    },
    {
      "duty": "Design from concept and create/execute designs, layouts and illustrations and publish artwork."
    },
    {
      "duty": "Ensure that labeling has been created/revised according to the requirements provided."
    },
    {
      "duty": "Ensure all typesetting of packaging components (including the text, graphics, chemical structures, bar codes etc.) are as per guidelines and standard."
    },
    {
      "duty": "Work with team to finalize artwork and proceed with submissions for agency approval."
    },
    {
      "duty": "Proofread product labelling to ensure conformance to all inputs (e.g., redlines) utilizing manual techniques and electronic comparator software (e.g., Global Vision)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors Degree or Advanced Diploma Art & Design; Graphical Design; ICT; IT; or in an equivalent topic or 3 to 5 years' work experience working in similar role.Completed artwork design certification program at technical school or satisfactory completion of proficiency examination."
    }
  ]
}