{
  "meta": [
    {
      "job_title": "Technical Writer",
      "job_category": "Writing",
      "job_class": "Technical Writer",
      "sector": "Software Engineering",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technical Writing",
      "experience": 3
    },
    {
      "skill": "Editing",
      "experience": 3
    },
    {
      "skill": "Desktop Publishing",
      "experience": 3
    },
    {
      "skill": "Content Adjusting",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Time Management",
      "experience": 4
    },
    {
      "skill": "Familiarity with Technical Communication Tools",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Translation Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create, develop, write, and edit operational and instructional documents to support the end-users of company products."
    },
    {
      "duty": "Collaborate cross-functionally to plan, research, develop, and prepare publication plans for each assigned project."
    },
    {
      "duty": "Assist in providing accurate cost and schedule estimates and manage the development and production of documents within budget and on schedule."
    },
    {
      "duty": "Conduct interviews with technical staff and other functional groups to gather information for projects and manage the creation, review, update, and release of technical communication deliverables."
    },
    {
      "duty": "Provide rough drafts, sketches, and other appropriate inputs required by department illustrators to create illustrations and artwork for final documents."
    },
    {
      "duty": "Revise existing documents to support product changes."
    },
    {
      "duty": "Work with appropriate Tech Comm team members to obtain translation and delivery schedule estimates and share them with project teams."
    },
    {
      "duty": "Manage multiple projects simultaneously, prioritize work appropriately to satisfy multiple project teams, and seek assistance from Tech Comm colleagues as needed to resolve conflicting project demands."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 120,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Technical Communication or related field of study desired"
    }
  ]
}