{
  "meta": [
    {
      "job_title": "Process Improvement Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Continuous Improvement",
      "experience": 3
    },
    {
      "skill": "Process Engineering",
      "experience": 3
    },
    {
      "skill": "Six Sigma",
      "experience": 3
    },
    {
      "skill": "Statistical Analysis",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Solidworks",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops, documents, and implements continual process improvements to enhance the safety, quality, efficiency, and effectiveness of the production lines, tooling department, extrusion process, or maintenance department."
    },
    {
      "duty": "Creates innovative ways to improve production, increase capabilities in maximized capacity through the purchase or development of new equipment, technology, and machines."
    },
    {
      "duty": "Works with suppliers to develop and qualify raw materials and equipment to improve productivity, reduce costs, or meet demands of new products."
    },
    {
      "duty": "Works closely with manufacturing and maintenance on safety concerns and supports the use of safety equipment and guards as well as enforcement of safety regulations."
    },
    {
      "duty": "Create, maintain, and evaluate a Process Validation procedure to address the IQ/OQ/PQ process."
    },
    {
      "duty": "Perform DOE for process improvements."
    },
    {
      "duty": "Perform statistical and repeatability analysis on various gauges and processes."
    },
    {
      "duty": "Participates, contributes, and sustains LEAN projects throughout the facility."
    },
    {
      "duty": "Coordinates process improvements with maintenance schedules and production schedules."
    },
    {
      "duty": "Performing other duties, assignments, and projects as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's in Engineering and three (3) years of experience, preferably in a manufacturing environment. Six Sigma experience preferred."
    }
  ]
}