{
  "meta": [
    {
      "job_title": "Sr Manager / Director / Senior Director, Software Engineering",
      "job_category": "Software Engineering",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 250000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive the execution and delivery of features by collaborating with many multi-functional teams, architects, product owners, and engineers."
    },
    {
      "duty": "Make critical decisions that attribute to the success of the product."
    },
    {
      "duty": "Proactive in foreseeing issues and resolving them before they happen."
    },
    {
      "duty": "Daily management of stand-ups as the Scrum Master for engineering teams."
    },
    {
      "duty": "Partner with PO to align with objectives, priorities, tradeoffs, and risk."
    },
    {
      "duty": "Ensuring teams have clear priorities and adequate resources."
    },
    {
      "duty": "Empowering the delivery team to self-coordinate."
    },
    {
      "duty": "Be a multiplier and have a passion for team and team members’ success."
    },
    {
      "duty": "Providing technical guidance, career development, and mentoring to team members."
    },
    {
      "duty": "Maintaining high morale and motivating the delivery team to go above and beyond."
    },
    {
      "duty": "Vocally advocating for technical excellence and helping the teams make good decisions."
    },
    {
      "duty": "Participating in architecture discussions and planning."
    },
    {
      "duty": "Participating in multi-functional coordination, planning, and reviews with leads from other engineering teams."
    },
    {
      "duty": "Maintaining and encouraging our culture by interviewing and hiring only the most qualified individuals."
    },
    {
      "duty": "Occasionally chipping in to development tasks such as coding and feature verifications to assist teams with release commitments, to gain an understanding of the deeply technical product as well as to keep your technical skill sharp."
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Collaboration",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Agile Development",
      "experience": 3
    },
    {
      "skill": "Technical Guidance",
      "experience": 3
    },
    {
      "skill": "Mentoring",
      "experience": 3
    },
    {
      "skill": "Team Motivation",
      "experience": 3
    },
    {
      "skill": "Decision Making",
      "experience": 3
    },
    {
      "skill": "Architecture Planning",
      "experience": 3
    },
    {
      "skill": "Interviewing",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "A related technical degree required. (Master's preferred)"
    }
  ]
}