{
  "meta": [
    {
      "job_title": "Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Visual Merchandising",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Coaching and Training",
      "experience": 5
    },
    {
      "skill": "Loss Prevention",
      "experience": 5
    },
    {
      "skill": "Recruitment and Hiring",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Effectively lead, develop, and support the Stylist sales team to meet and exceed sales plans and productivity targets."
    },
    {
      "duty": "Build customer traffic and deliver 5-star customer service while resolving customer issues and managing customer service strategies."
    },
    {
      "duty": "Maintain store-standards to support an exceptional customer shopping experience, manage inventory, and execute monthly Visual Merchandising Plans."
    },
    {
      "duty": "Lead and inspire Stylists to exceed sales productivity goals, bridal conversion, and add-ons goals by coaching, mentoring, and recognizing great performance."
    },
    {
      "duty": "Participate in weekly management meetings, recruiting efforts, and talent/new hire recommendations, as directed by the Store Manager."
    },
    {
      "duty": "Complete all action plans on a quarterly basis with the Store Manager and focus on development and learning for continuous improvement."
    },
    {
      "duty": "Manage expense budgets, loss prevention, security processes, and policies at all times while executing effective scheduling practices to maximize sales and customer service."
    },
    {
      "duty": "Participate in developing employees to their full potential through coaching, training, and addressing employee issues, as well as completing all training as assigned for on-going development."
    },
    {
      "duty": "Responsible to ensure that store payroll does not exceed monthly budget, and execute all the training for the Stylist, Dress Specialist, and Bridal Show Reps."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or degree. Two years prior retail experience, preferably in a supervisory role in an apparel or specialty store environment. Prior experience with computerized POS system."
    }
  ]
}