{
  "meta": [
    {
      "job_title": "Senior Vice President Programming + Program Director",
      "job_category": "Broadcasting",
      "job_class": "Senior Vice President",
      "sector": "Media",
      "salary": 160000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Radio Programming",
      "experience": 10
    },
    {
      "skill": "Music Curation",
      "experience": 10
    },
    {
      "skill": "Talent Recruitment",
      "experience": 10
    },
    {
      "skill": "Management",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Research and Analytics",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Event Hosting",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead all aspects of cluster/station on-air experience in a leadership and operations role, responsible for talent, content, programming and online presence."
    },
    {
      "duty": "Review and determine all commercial and paid programming content; decide music play lists; schedule programming that conforms with FCC rules and regulations, company policy and applicable laws; protect station license."
    },
    {
      "duty": "Plan and oversee tone, programming, production, sound and theme, website, online presence and social media."
    },
    {
      "duty": "Identify, recruit and coach on-air talent, producers, news directors and reporters and frequently listen to airchecks/sessions with on-air talent."
    },
    {
      "duty": "Partner with Market President, Regional Senior Vice President of Programming and Sales in support of local and corporate business goals to increase market share, listeners, ratings, adviser satisfaction and revenue while aligning programming fit with client, station and audience; creates talent and station marketing, promotion and image campaigns."
    },
    {
      "duty": "Schedule staff for on-air shifts, remotes and appearances; Ensure staff has taken, passed and maintained all company programs, plans and training (e.g. FCC and DMCA); Prepare and manage Programming Department budget on a yearly, quarterly and monthly basis."
    },
    {
      "duty": "Establish and maintain professional relationships with producers, artists’ managers, composers and other industry contacts; Handle all payables according to company policy; Host daily on-air show; Represent the station in the community at concerts, events and promotions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of 10 years prior high-level of experience in radio."
    }
  ]
}