{
  "meta": [
    {
      "job_title": "Grants & Contracts Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Grants Management",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Nonprofit Accounting",
      "experience": 5
    },
    {
      "skill": "Excel Skills",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Analysis",
      "experience": 5
    },
    {
      "skill": "GAAP Principles",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Detail-Oriented",
      "experience": 5
    },
    {
      "skill": "Prioritization",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate the Organization's financial management of grants and specific federal contracts in a dynamic, collaborative, and mission-based environment."
    },
    {
      "duty": "Develop and review budgets for grant proposals aligned with organizational priorities and available expense categories."
    },
    {
      "duty": "Support grant writer(s) in responding to and managing follow-up financial requests from funders."
    },
    {
      "duty": "Track adjustments and projections, and allocate expenses to specific funders according to budget and need."
    },
    {
      "duty": "Provide timely and accurate financial reports for donors to meet rolling deadlines across all funding relationships."
    },
    {
      "duty": "Review incoming grant agreements for their financial requirements and ensure compliance with funders' terms and conditions."
    },
    {
      "duty": "Maintain documentation of financial documents for funding agreements and strong internal processes which intersect with the Development Team."
    },
    {
      "duty": "Identify and prepare a periodic and annual restricted revenue release schedule, and assist in grant expenses decision-making."
    },
    {
      "duty": "Perform administrative tasks (information management, maintenance of financial aspects of grant files, document destruction, etc.) as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent, plus four years of related experience"
    }
  ]
}