{
  "meta": [
    {
      "job_title": "Program Director, RN",
      "job_category": "Healthcare",
      "job_class": "Director",
      "sector": "Behavioral Health",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsibility for the strategic planning, managing, directing, coordinating and controlling the overall operations of behavioral health program and services."
    },
    {
      "duty": "Provides leadership to ensure attainment of strategic objectives and the delivery of quality, economical health care services and other related lines of business."
    },
    {
      "duty": "Coordinates and enforces program-wide policies and procedures that support the accomplishment of the behavioral health services’ aims, objectives, and programs."
    },
    {
      "duty": "Directs the short-range and long-range planning functions that develop goals, objectives, and strategic plans to ensure quality services and a financially sound program."
    },
    {
      "duty": "Participates and manages the budget for the programs, allocates funds within the budget as directed by the VP, Finance Behavioral Health and ensures that the programs operate within the budget."
    },
    {
      "duty": "Provides supervision to the leaders and staff in the designated programs."
    },
    {
      "duty": "Ensures compliance with all regulatory agencies and governing health care delivery and the rules of accrediting bodies by continually monitoring behavioral program operations, programs and physical properties, and ensuring changes where required."
    },
    {
      "duty": "Reviews plans for the achievement of programs’ specific objectives and established goals, and periodically reviews, evaluates, and updates such plans."
    },
    {
      "duty": "Presents to the hospital board, and/or the committees, periodic reports reflecting the services and financial activities of the hospitals and such special reports as may be required by the boards."
    },
    {
      "duty": "Attends all meetings of the hospital board and committees."
    },
    {
      "duty": "Ensures maintenance of physical properties in good and safe state of repair and operation."
    },
    {
      "duty": "Consults with leaders on a regular basis; evaluates leadership competence and makes changes as necessary; keeps lines of communication open; works with hospital leadership to foster high employee morale and a positive work environment for employees."
    },
    {
      "duty": "Oversees and provides direction to leadership regarding behavioral health programs’ mission and objectives, expected productivity and efficiency, establishing policies and procedure and compliance with federal, state and local laws, regulations, and ordinances."
    },
    {
      "duty": "Consults with leaders on a regular basis; evaluates leadership competence and makes changes as necessary; keeps lines of communication open; works with hospital leadership to foster high employee morale and a positive work environment for employees."
    },
    {
      "duty": "Ensures that programs maintain accreditation, licensing and quality patient care through the establishment of performance improvement monitoring programs and standards."
    },
    {
      "duty": "Ensures that the leadership team acts as effective liaisons between the hospital and the medical staff; meets with and communicates with program and hospital medical staff as needed; represents the behavioral health programs and hospital at external functions."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree (MSN) in Nursing, minimum BSN preferred"
    }
  ]
}