{
  "meta": [
    {
      "job_title": "Pet Stylist",
      "job_category": "Grooming",
      "job_class": "Pet Stylist",
      "sector": "Care",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Pet Grooming",
      "experience": 5
    },
    {
      "skill": "Animal Behavior",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform grooming services including nail trims, ear cleaning, bathing, brushing, haircuts, and styling, adhering to breed standards and pet owners' preferences."
    },
    {
      "duty": "Safely and efficiently maintain & operate grooming tools and equipment such as clippers, shears, brushes, and dryers."
    },
    {
      "duty": "Learn and follow Petco's grooming policies, standards and guidelines to ensure quality and consistency in all areas of the grooming business."
    },
    {
      "duty": "Monitor pets for any signs of discomfort, illness, or injury, and promptly report any concerns to pet owners and store management."
    },
    {
      "duty": "Assess and address each pet's individual needs, taking into consideration their coat type, skin condition, and temperament."
    },
    {
      "duty": "Provide exceptional customer service by actively listening to pet owners' requests, offering grooming recommendations, and addressing any questions or concerns."
    },
    {
      "duty": "Educate pet owners on grooming maintenance and at-home care practices to promote the overall well-being of their pets."
    },
    {
      "duty": "Collaborate with fellow groomers and store team members to create a positive and supportive work environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Proven experience as a professional groomer with a strong portfolio of successful grooming work."
    },
    {
      "credential": "In-depth knowledge of various dog breeds, their grooming requirements, and common health issues & behaviors."
    },
    {
      "credential": "Proficiency in breed-specific cuts, styling techniques, and grooming standards."
    },
    {
      "credential": "Familiarity with grooming tools and equipment, and the ability to handle them safely and effectively."
    },
    {
      "credential": "Excellent communication skills, both verbal and written, to interact confidently and professionally with pet owners and team members."
    },
    {
      "credential": "Strong attention to detail, ensuring grooming services are executed accurately and to the highest standards."
    },
    {
      "credential": "Physical stamina to stand for extended periods, lift and handle pets of different sizes, and perform repetitive grooming tasks."
    },
    {
      "credential": "Compassion and patience when handling pets, ensuring their safety, comfort, and well-being throughout the grooming process."
    },
    {
      "credential": "Flexibility to work weekends, evenings, and holidays based on the grooming schedule and customer demand."
    },
    {
      "credential": "Exciting opportunity to utilize your grooming expertise and passion for animals."
    },
    {
      "credential": "Join our dedicated team of professionals, and together we will create a positive grooming experience for pets and their owners while upholding Petco's commitment to excellence in pet care."
    },
    {
      "credential": "Petco Animal Supplies, Inc. is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, protected veteran status, or any other protected classification."
    }
  ]
}