{
  "meta": [
    {
      "job_title": "Safety Professional",
      "job_category": "Safety",
      "job_class": "Professional",
      "sector": "Construction",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety Management",
      "experience": 8
    },
    {
      "skill": "Risk Assessment",
      "experience": 8
    },
    {
      "skill": "Safety Training",
      "experience": 8
    },
    {
      "skill": "Accident Investigation",
      "experience": 8
    },
    {
      "skill": "Safety Compliance",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Problem-Solving",
      "experience": 8
    },
    {
      "skill": "Construction Safety",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, implement, and manage site-specific safety programs for commercial GC projects, aligning with industry standards and best practices."
    },
    {
      "duty": "Conduct comprehensive risk assessments of construction sites, identifying potential hazards and recommending measures to mitigate risks."
    },
    {
      "duty": "Collaborate with project managers, subcontractors, and site personnel to establish a strong safety culture that prioritizes the well-being of all individuals on the construction site."
    },
    {
      "duty": "Lead safety training sessions and workshops to educate and empower team members to adhere to safety protocols and regulations."
    },
    {
      "duty": "Regularly inspect construction sites to identify safety violations, potential hazards, and areas requiring corrective actions."
    },
    {
      "duty": "Create and maintain site-specific safety plans, emergency response procedures, and hazard communication protocols."
    },
    {
      "duty": "Investigate accidents, incidents, and near-miss events, determining root causes and implementing corrective actions to prevent future occurrences."
    },
    {
      "duty": "Enforce the use of personal protective equipment (PPE) and ensure its availability and proper utilization by all individuals on site."
    },
    {
      "duty": "Monitor and ensure compliance with local, state, and federal safety regulations and industry-specific standards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Occupational Health and Safety, Construction Management, or a related field (preferred)."
    }
  ]
}