{
  "meta": [
    {
      "job_title": "Procurement Manager",
      "job_category": "Procurement",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage sourcing activities for hardware, software, telecom, data center, and professional services including network hardware (e.g., routing, switching, NICs, etc)"
    },
    {
      "duty": "Lead and coordinate all procurement efforts to identify, survey, audit, assess and qualify new suppliers."
    },
    {
      "duty": "Lead the business negotiation process with external suppliers. Own contract initiation and closure."
    },
    {
      "duty": "Develop a comprehensive procurement strategy focused on the network hardware ecosystem: hardware, service, licensing, support."
    },
    {
      "duty": "Own and lead the supplier interface for all RFI, RFP and RFQ services. Partner with appropriate internal teams."
    },
    {
      "duty": "Identify key benchmark suppliers in RFx efforts. Partner to identify evaluation criteria and provide relevant data back to internal team."
    },
    {
      "duty": "Continuously measure and improve supplier actual performance against mutually agreed SLA."
    },
    {
      "duty": "Ensure best in class pricing and terms are secured for equipment and services. Build should-cost models when appropriate."
    },
    {
      "duty": "Identify, qualify, and formalize which suppliers are on FTG's preferred supplier list. Ensure internal partner alignment."
    },
    {
      "duty": "Lead business review process to measure, analyze and identify points of strength and weakness with regards to supplier performance. Issue supplier corrective action requests and development plans, as needed."
    },
    {
      "duty": "Be the sourcing subject matter authority helping to identify and demonstrate best practices in the realms of procurement, supplier management and category management."
    }
  ],
  "skills": [
    {
      "skill": "Sourcing",
      "experience": 5
    },
    {
      "skill": "Contract Negotiations",
      "experience": 5
    },
    {
      "skill": "Supplier Management",
      "experience": 5
    },
    {
      "skill": "RFx Services",
      "experience": 5
    },
    {
      "skill": "Procurement Strategy",
      "experience": 5
    },
    {
      "skill": "Cost Modeling",
      "experience": 5
    },
    {
      "skill": "Preferred Suppliers Identification",
      "experience": 5
    },
    {
      "skill": "Supplier Development",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 3
    },
    {
      "skill": "Networking Hardware",
      "experience": 3
    },
    {
      "skill": "SaaS",
      "experience": 3
    },
    {
      "skill": "Contract Negotiation",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Supply Chain Management, or related field (Master's preferred)"
    }
  ]
}