{
  "meta": [
    {
      "job_title": "Commercial Coordinator",
      "job_category": "Business Operations",
      "job_class": "Coordinator",
      "sector": "Business Operations",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain pricing and create tool orders in SAP including initiation, update, tracking and issue resolution."
    },
    {
      "duty": "Work with Plant Finance and Sales to ensure timely collection of tooling and claim receivables."
    },
    {
      "duty": "Track and support commercial elements of engineering changes in Team Center."
    },
    {
      "duty": "Update cost calculations; support the commercial success of new and existing programs."
    },
    {
      "duty": "Maintain a comprehensive understanding of program bill of materials, piece price, invest, etc."
    },
    {
      "duty": "Support manufacturing and finance in all aspects of the commercial side of the business."
    },
    {
      "duty": "Support commercial program goals and tracking for EBIT, IRR and other financial targets."
    },
    {
      "duty": "Support the Commercial Manager and Troy Corporate Business Development team with quoting activities to secure profitable new business."
    },
    {
      "duty": "Maintain positive relationships with current customers utilizing and understanding specific customer’s systems and processes."
    },
    {
      "duty": "Support commercial claims with customer(s), support recovery strategy."
    },
    {
      "duty": "Maintain written records of all agreements and unresolved issues with customers."
    },
    {
      "duty": "Update project summaries and periodic commercial reports."
    },
    {
      "duty": "Prepare and present customer-specific documentation."
    },
    {
      "duty": "Support tracking and reporting relevant commercial KPI’s."
    },
    {
      "duty": "Attend customer-relevant meetings and maintain customer commercial LOPs as needed."
    },
    {
      "duty": "Maintain a working knowledge of all plant projects and production schedules."
    }
  ],
  "skills": [
    {
      "skill": "SAP",
      "experience": 3
    },
    {
      "skill": "Excel",
      "experience": 3
    },
    {
      "skill": "PowerPoint",
      "experience": 3
    },
    {
      "skill": "MS Office",
      "experience": 3
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 4
    },
    {
      "skill": "Automotive Manufacturing",
      "experience": 2
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Business Development",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree (BA) from four-year college or university preferred"
    }
  ]
}