{
  "meta": [
    {
      "job_title": "Brand Performance Support",
      "job_category": "Customer Support",
      "job_class": "Support",
      "sector": "Customer Service",
      "salary": 66000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Support",
      "experience": 4
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 1
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Team Collaboration",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Database Management",
      "experience": 1
    },
    {
      "skill": "Operational Analysis",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the primary point of contact for company and franchise operated restaurants, providing timely and accurate responses to inquiries and requests."
    },
    {
      "duty": "Respond to operations-related questions (e-mail/phone) from both company and franchise restaurant management; enter complete and detailed information regarding inquiry into the system database."
    },
    {
      "duty": "Provide exceptional service, follow-up with customers to assure advice/information provided was satisfactory, and act as the primary communication source during high scope events."
    },
    {
      "duty": "Consult with resources to obtain answers to customers' questions, make recommendations to adjust training materials, participate in new product teams, act as admin to third-party platforms, and manage operations meetings."
    },
    {
      "duty": "Support QDOBA's organization system and structure, proactively reach out to restaurant management and field leadership with performance updates and suggestions for improvement."
    },
    {
      "duty": "Perform other related duties, tasks, and responsibilities as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma, G.E.D. or equivalent required. Bachelor’s degree in business administration or related field preferred."
    }
  ]
}