{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Real Estate",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee all related contracted services including architectural, engineering, construction and relocation services (including furniture procurement and installation)."
    },
    {
      "duty": "Monitor all phases of a project and promptly address any changes to the original scope of services and the impact to the project schedule and budget."
    },
    {
      "duty": "Take corrective actions as warranted, and integrating related functions such as Facilities Management, IS, Multimedia, Mail Services, Copier Services, Amenities and Security and any required base building trades."
    },
    {
      "duty": "Providing and/or reviewing the accuracy of project materials."
    },
    {
      "duty": "Work with the management and client to determine project budgets."
    },
    {
      "duty": "Make determinations and provide recommendations addressing new project schedules and/or feasibility of pre-determined schedules."
    },
    {
      "duty": "Implement Newmark standards throughout all projects."
    },
    {
      "duty": "Provide accurate project documentation and record maintenance throughout the project. Maintain all historical data on projects for future projections and project budgeting."
    },
    {
      "duty": "Organize and lead all project meetings – inclusive of any necessary vendors and/or subcontractors."
    },
    {
      "duty": "Perform related work as required to ensure projects are completed as proposed to management and the client. May perform other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Architecture",
      "experience": 8
    },
    {
      "skill": "Construction Management",
      "experience": 8
    },
    {
      "skill": "Facilities Management",
      "experience": 8
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 8
    },
    {
      "skill": "Mechanical and Electrical Systems Knowledge",
      "experience": 8
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree – preferably in Architecture, Design, Facilities Management or Construction management."
    }
  ]
}