{
  "meta": [
    {
      "job_title": "Executive Assistant",
      "job_category": "Administration",
      "job_class": "Assistant",
      "sector": "Non-Profit",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Data Entry",
      "experience": 5
    },
    {
      "skill": "Quickbooks",
      "experience": 5
    },
    {
      "skill": "Salesforce",
      "experience": 5
    },
    {
      "skill": "Basecamp",
      "experience": 5
    },
    {
      "skill": "Second Language",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support CEO’s involvement in Board, Committee, and Advisory Meetings by coordinating governance functions such as managing the annual meeting, staffing the Executive Committee and Board Meetings, and tracking approved policies."
    },
    {
      "duty": "Update Board/Advisor contact lists, calendar invitations for meetings, organize meeting logistics and ensure meeting technology functions appropriately."
    },
    {
      "duty": "Keep current board of directors’ policies and documents updates, bylaws, and meeting presentations and recordings, and coordinate committee meeting calendars."
    },
    {
      "duty": "Act as sounding board for CEO."
    },
    {
      "duty": "Manage correspondence, draft and edit written communication and documents, and communicate on behalf of the CEO as requested."
    },
    {
      "duty": "Coordinate, prepare for, and ensure follow-up for CEO’s internal and external meetings."
    },
    {
      "duty": "Maintain accurate records for contacts."
    },
    {
      "duty": "Compile reports and other information requested by CEO."
    },
    {
      "duty": "Represent the agency at monthly clothing donation calls."
    },
    {
      "duty": "Support external HR team with new-employee recruitment, including initiating background checks."
    },
    {
      "duty": "Manage timekeeping system and submit payroll (ADP)."
    },
    {
      "duty": "Support benefits administration and renewals."
    },
    {
      "duty": "Support scheduling on-boarding meetings and trainings, ensuring new-hire document management, and setting up password/technology."
    },
    {
      "duty": "Support employee exit process including final paperwork, collection of agency property, deactivation of passwords, and de-enrollment of benefits."
    },
    {
      "duty": "Maintain confidential and accurate employment records."
    },
    {
      "duty": "Monitor and support the performance management process."
    },
    {
      "duty": "Maintain administrative HR functions such as updating phone & other staff lists, organizational chart, and employee status change paperwork."
    },
    {
      "duty": "Examine, sort, and route mail in both offices."
    },
    {
      "duty": "Work with CEO and accountant on reporting monthly financial information to National, and maintaining proper documentation and QuickBooks entries."
    },
    {
      "duty": "Keep current files of the agency’s insurances, tax information and other risk management, operational, vendor and program files, and adhere to records retention policies."
    },
    {
      "duty": "First point-of-contact for incoming callers and visitors, directs callers to the appropriate staff member."
    },
    {
      "duty": "Order office, kitchen and cleaning supplies and ensures office spaces are well-kept in Worcester and Framingham."
    },
    {
      "duty": "Act as a liaison between our technology company and staff."
    },
    {
      "duty": "Assist and facilitate training of new technology for current staff."
    },
    {
      "duty": "Ensure all technologies including printers and copiers are running smoothly for staff."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 30
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration or a related field (Master's preferred)"
    }
  ]
}