{
  "meta": [
    {
      "job_title": "Business Partnerships Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establishment, cultivation, and enhancement of the business partner network within the Americas."
    },
    {
      "duty": "Assessment and validation of potential sales and service partners, evaluating both their commercial and technical capabilities."
    },
    {
      "duty": "Execution of negotiations pertaining to overarching contractual agreements."
    },
    {
      "duty": "Oversight of partner relationships with the overarching aim of fostering enduring and mutually beneficial business associations, while concurrently fostering escalated sales achievements."
    },
    {
      "duty": "Proffering guidance to sub-regional dedicated sales units on sales strategies designed for service providers."
    },
    {
      "duty": "Seamless coordination with the sales factions responsible for Distribution and OEM sales."
    },
    {
      "duty": "Continuous monitoring of market trends and competitive dynamics."
    },
    {
      "duty": "Preside over customer gatherings and collaborative sessions with multifunctional teams to communicate progress updates."
    },
    {
      "duty": "Facilitation of training sessions for both sales teams and clientele, curating relevant materials as necessitated."
    },
    {
      "duty": "Generation of recommendations for novel product introductions and enhancements based on customer interactions and comprehensive awareness of rival offerings."
    },
    {
      "duty": "Steering and/or providing assistance in departmental initiatives, overseeing project schedules, and meticulously tracking project undertakings."
    },
    {
      "duty": "Potential travel commitments, possibly accounting for up to 40% of working time, contingent on business prerequisites."
    }
  ],
  "skills": [
    {
      "skill": "Business Partnerships",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent professional exposure."
    }
  ]
}