{
  "meta": [
    {
      "job_title": "Environmental Compliance Manager",
      "job_category": "Environmental Compliance",
      "job_class": "Manager",
      "sector": "Environmental Science",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate various aspects of regulatory compliance, weekly/monthly/quarterly/annual inspections, air and water permitting, regulatory recordkeeping and reporting, conduct management reviews in accordance with ISO 14001 certification requirements, waste management, and training."
    },
    {
      "duty": "Develop environmental objectives and targets, and report to management on progress in attaining them."
    },
    {
      "duty": "Keep abreast of relevant changes in environmental legislation and initiatives."
    },
    {
      "duty": "Serve as liaison with various stakeholders such as regulatory agencies, community, industry trade groups, customers, and suppliers."
    },
    {
      "duty": "Devise and maintain processes to monitor performance and to implement strategies."
    },
    {
      "duty": "Evaluate and communicate environmental performance data and reporting information to internal and external stakeholders, including regulatory bodies."
    },
    {
      "duty": "Participate in environmental education and training."
    },
    {
      "duty": "Serve as a technical subject matter expert on environmental legal requirements, policies, and standards to ensure regulatory applicability and compliance."
    },
    {
      "duty": "Collaborate with management, engineering, operators, maintenance, and internal and external subject matter experts in order to evaluate and address environmental issues and provide for continuous improvement."
    },
    {
      "duty": "Communicate environmental regulations, best practices, and company policies and standards to site personnel."
    },
    {
      "duty": "Assist in budget forecasts, implementation, and administration."
    },
    {
      "duty": "Coordinate and manage environmental programs and projects."
    },
    {
      "duty": "Generate and present environmental compliance training or orientation sessions."
    },
    {
      "duty": "Develop and implement environmental strategies and action plans to drive corporate sustainable development as required."
    },
    {
      "duty": "Develop and implement environmental management systems, policies, and processes to continually improve the site’s impact on the environment."
    },
    {
      "duty": "Develop and maintain plans, requirements, protocols, permits and standard operating procedures related to compliance and environmental protection."
    }
  ],
  "skills": [
    {
      "skill": "Environmental Compliance",
      "experience": 5
    },
    {
      "skill": "ISO 14001",
      "experience": 5
    },
    {
      "skill": "Regulatory Knowledge",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Environmental Reporting",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Policy Development",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Environmental Science, Environmental Engineering, or related field (Master's preferred)"
    }
  ]
}