{
  "meta": [
    {
      "job_title": "Regional Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Technical Support",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Territory Management",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Sales Performance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Cover assigned territory by traveling to existing and potential customer locations to conduct sales calls, meetings, surveys, equipment inspections, and demonstrations, while achieving sales volume and profit."
    },
    {
      "duty": "Assist customers with equipment recommendations, financial analysis, and problem-solving to achieve sales profit."
    },
    {
      "duty": "Develop and maintain knowledge on products, applications, industry, selling skills, and product support to enhance required sales performance."
    },
    {
      "duty": "Participate in sales meetings, attend company-represented product, and market training as scheduled."
    },
    {
      "duty": "Travel to dealer locations, farm shows, and events, and provide order support for the specific region during the selling season."
    },
    {
      "duty": "Accurately maintain and submit all required sales and other documentation."
    },
    {
      "duty": "Thorough understanding of practices, theories, and policies involved in business and finance."
    },
    {
      "duty": "Superior verbal and written communication and interpersonal skills."
    },
    {
      "duty": "Experience using Microsoft Office Suite or related software."
    },
    {
      "duty": "Attention to detail."
    },
    {
      "duty": "Undergrad degree in Sales, Business, or Agriculture fields."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Sales, Business, or Agriculture related fields"
    }
  ]
}