{
  "meta": [
    {
      "job_title": "Systems Analyst 2",
      "job_category": "IT",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Network Management",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "System Analysis",
      "experience": 5
    },
    {
      "skill": "Hardware and Software Upgrades",
      "experience": 5
    },
    {
      "skill": "Network Security",
      "experience": 5
    },
    {
      "skill": "Technical Documentation",
      "experience": 5
    },
    {
      "skill": "Web Development",
      "experience": 5
    },
    {
      "skill": "TCP/IP Protocols",
      "experience": 5
    },
    {
      "skill": "Microsoft Active Directory",
      "experience": 5
    },
    {
      "skill": "VMWare Virtual Environments",
      "experience": 5
    },
    {
      "skill": "Microsoft Dynamics Great Plains Software",
      "experience": 5
    },
    {
      "skill": "Network Programming",
      "experience": 5
    },
    {
      "skill": "Customer Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise wireless networks, fiber backbone, and justice center network, including software management."
    },
    {
      "duty": "Provide training and support for data processing, office automation, networking, and data communication processes."
    },
    {
      "duty": "Perform routine hardware and software upgrades, develop and maintain equipment and upgrade schedules, and assist with the evaluation, recommendation, and procurement of network hardware, and office automation equipment."
    },
    {
      "duty": "Provide technical and end-user support, perform or coordinate automation support services, troubleshoot and perform preventative maintenance, diagnose user issues, and provide support to users in designated PC software."
    },
    {
      "duty": "Handle network security responsibilities, including developing procedures for user and visitor access, backup routines, disaster recovery, and inventory control."
    },
    {
      "duty": "Delivery and installation of equipment, receiving and testing new software releases."
    },
    {
      "duty": "Maintain database accounts and passwords, monitor security protocol, analyze and correct system faults, restore and reconstruct damaged databases, and monitoring system-wide operations."
    },
    {
      "duty": "Develop and maintain technical documentation for all assigned systems operations, and instruction manuals for the end-users, assist in training programs, and take on help desk tickets as assigned."
    },
    {
      "duty": "Analyze, troubleshoot, and improve tribal electronic communication and collaboration systems."
    },
    {
      "duty": "Work effectively with diverse groups of technical and nontechnical users, perform complex technical tasks accurately within defined deadlines, maintain current knowledge of emerging information technology trends and developments."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or advanced degree in a computer-related field such as Information Systems or Computer Science (Industry certifications such as Net+, SEC+, CCNA, SANS certification are an additional plus)"
    }
  ]
}