{
  "meta": [
    {
      "job_title": "Hospitality Services Manager",
      "job_category": "Hospitality",
      "job_class": "Manager",
      "sector": "Hospitality",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Elevate Team Performance: Channel your leadership expertise to train, motivate, and supervise a team of dedicated professionals. Your guidance will empower them to excel and consistently exceed expectations."
    },
    {
      "duty": "Masterful Event Coordination: From seamless meeting setups to flawless event breakdowns, you will orchestrate every detail, ensuring that every gathering, big or small, is a resounding success."
    },
    {
      "duty": "Office Management Extraordinaire: Your attention to detail will shine as you manage all aspects of the office environment. From warmly welcoming guests to maintaining supplies and streamlining operations, you'll be the go-to person who keeps everything running smoothly."
    },
    {
      "duty": "Forge Lasting Client Partnerships: Collaborate closely with clients, fostering relationships built on trust and excellence. Your ability to understand their needs and exceed their expectations will set the stage for long-lasting partnerships."
    },
    {
      "duty": "Innovative Best Practices: Embrace your role as a trendsetter. Continuously evaluate, design, and introduce new service, staffing, and technological enhancements that set new industry benchmarks."
    },
    {
      "duty": "Goal-Oriented Collaboration: Work alongside cross-functional teams to establish both short and long-term goals that align with client expectations. Your strategic insights will drive the achievement of remarkable outcomes."
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Event Coordination",
      "experience": 5
    },
    {
      "skill": "Office Management",
      "experience": 5
    },
    {
      "skill": "Client Partnership",
      "experience": 5
    },
    {
      "skill": "Innovation Management",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Client Service",
      "experience": 5
    },
    {
      "skill": "Trendsetting",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Hospitality Management, Business, or a related field (Master's preferred)"
    }
  ]
}