{
  "meta": [
    {
      "job_title": "Quality Assurance Manager",
      "job_category": "Quality Assurance",
      "job_class": "Manager",
      "sector": "Manufacturing",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Quality Management System (QMS)",
      "experience": 8
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 8
    },
    {
      "skill": "Product Quality Assurance",
      "experience": 8
    },
    {
      "skill": "Risk Management",
      "experience": 8
    },
    {
      "skill": "Supplier Quality Management",
      "experience": 8
    },
    {
      "skill": "Internal and External Audits",
      "experience": 8
    },
    {
      "skill": "Continuous Improvement",
      "experience": 8
    },
    {
      "skill": "Document Control",
      "experience": 8
    },
    {
      "skill": "Training and Development",
      "experience": 8
    },
    {
      "skill": "Metrics and Reporting",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, implement, and maintain a robust and compliant quality management system in accordance with FDA regulations (21 CFR Part 820) and ISO 13485 standards."
    },
    {
      "duty": "Stay current with FDA regulations and international medical device regulations to ensure the company's practices align with industry requirements."
    },
    {
      "duty": "Ensure that manufactured medical devices meet or exceed quality standards, specifications, and performance requirements."
    },
    {
      "duty": "Lead risk management activities for the production, identifying potential risks associated with manufacturing processes and products."
    },
    {
      "duty": "Collaborate with the procurement team to assess and qualify suppliers based on quality and regulatory criteria."
    },
    {
      "duty": "Plan and coordinate internal audits to assess the effectiveness of the QMS and manufacturing processes."
    },
    {
      "duty": "Drive a culture of continuous improvement by identifying process inefficiencies and opportunities for optimization."
    },
    {
      "duty": "Oversee the creation, review, and revision of manufacturing and quality-related documents, ensuring accuracy and compliance."
    },
    {
      "duty": "Provide training and guidance to manufacturing personnel on quality procedures, regulations, and best practices."
    },
    {
      "duty": "Develop and present quality metrics and performance reports to senior management, highlighting key trends, achievements, and areas for improvement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in engineering, life sciences, or a related field; advanced degree preferred."
    }
  ]
}