{
  "meta": [
    {
      "job_title": "Director of Nursing Skills and Simulation Center",
      "job_category": "Healthcare",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Nursing Leadership",
      "experience": 5
    },
    {
      "skill": "Simulation and Skills Management",
      "experience": 5
    },
    {
      "skill": "Curriculum Development",
      "experience": 5
    },
    {
      "skill": "Program Evaluation",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Healthcare Simulation Education",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the day-to-day operations of nursing simulation and skills laboratories for student learning and practice."
    },
    {
      "duty": "Collaborate with nursing faculty to schedule and facilitate simulation and skills laboratory experiences."
    },
    {
      "duty": "Develop, coordinate, and evaluate simulation-based education and events."
    },
    {
      "duty": "Implement and maintain the latest educational technology and teaching scenarios to enhance nursing clinical experience."
    },
    {
      "duty": "Manage the budget and supply needs of the Experiential Learning Center for nursing programs."
    },
    {
      "duty": "Teach didactic and/or clinical sections according to the needs of the nursing programs."
    },
    {
      "duty": "Remain engaged in developments within the field of higher education and communicate best practices to colleagues."
    },
    {
      "duty": "Participate in program recruitment, marketing, and provide demonstrations to various parties."
    },
    {
      "duty": "Performs other necessary duties and functions as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in Nursing from a regionally accredited institution. Current unrestricted Illinois RN license. Certified Healthcare Simulation Educator (CHSE) or equivalent."
    }
  ]
}