{
  "meta": [
    {
      "job_title": "Talent Acquisition Director",
      "job_category": "Human Resources",
      "job_class": "Director",
      "sector": "Management",
      "salary": 165000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Talent Acquisition",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "Recruitment Strategy",
      "experience": 10
    },
    {
      "skill": "Market Insights",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Compliance",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide strategic direction and guidance for the healthcare talent acquisition team, aligning recruitment initiatives with the organization's goals and growth objectives."
    },
    {
      "duty": "Lead, mentor, and manage a team of recruiters, fostering a collaborative and high-performing culture while maintaining a focus on results and continuous improvement."
    },
    {
      "duty": "Develop and execute comprehensive recruitment strategies to attract and retain top healthcare talent across various specialties."
    },
    {
      "duty": "Collaborate closely with department heads, executives, and HR leadership to understand staffing needs, workforce planning, and talent requirements to drive effective hiring solutions."
    },
    {
      "duty": "Champion an exceptional candidate experience throughout the recruitment process, ensuring seamless communication, timely feedback, and a positive impression of the organization."
    },
    {
      "duty": "Establish key performance indicators (KPIs) to measure the success of recruitment efforts, regularly providing data-driven insights and recommendations to improve processes."
    },
    {
      "duty": "Stay abreast of industry trends, market conditions, and best practices in healthcare recruitment to proactively adapt strategies and remain competitive in talent acquisition."
    },
    {
      "duty": "Manage relationships with external recruitment agencies, job boards, and other relevant partners to optimize sourcing channels and extend the organization's reach."
    },
    {
      "duty": "Ensure adherence to relevant legal and regulatory requirements in healthcare recruitment, maintaining a strong commitment to diversity, equity, and inclusion."
    },
    {
      "duty": "Work within allocated budgets to maximize recruitment effectiveness and deliver cost-efficient solutions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150
    },
    {
      "student_teacher": 130
    },
    {
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business Administration, or a related field (Master's preferred)"
    }
  ]
}