{
  "meta": [
    {
      "job_title": "Corporate Legal Assistant",
      "job_category": "Legal",
      "job_class": "Assistant",
      "sector": "Legal",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Legal Document Preparation",
      "experience": 5
    },
    {
      "skill": "Corporate Law Knowledge",
      "experience": 5
    },
    {
      "skill": "Records Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Administrative Support",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepare, revise, and proofread various corporate documents including contracts, agreements, compliance, closing documents, etc."
    },
    {
      "duty": "Assist with assembly of pre-closing documents and sets of executed documents for various signatures, corporate formation and dissolution documents."
    },
    {
      "duty": "Maintain corporate record books for various entities and prepare shareholder and corporate minutes."
    },
    {
      "duty": "Administer the Shareholders Service Group (SSG) portal for investors and Firm management."
    },
    {
      "duty": "Create and maintain client and administrative files in accordance with firm procedures."
    },
    {
      "duty": "Schedule appointments, maintain attorney's calendar, and enter attorney's billable time."
    },
    {
      "duty": "Perform initial conflict checks, open/close client matters, and prepare engagement letters."
    },
    {
      "duty": "Coordinate travel arrangements and track travel expenses for timely reimbursement."
    },
    {
      "duty": "Communicate professionally and promptly with internal and external clients to deliver a high level of customer service."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of four years of corporate experience with good job stability."
    },
    {
      "credential": "Experience with board meeting minutes and other board-related matters is highly desirable."
    },
    {
      "credential": "Comprehensive knowledge in Microsoft Office (Excel, Outlook, PowerPoint, Word) and PDF software."
    },
    {
      "credential": "Experience with InTapp Time, Intapp Open, Chrome River Expense Reporting, Aderant, Interaction, iManage are pluses."
    },
    {
      "credential": "Must possess an excellent customer service attitude."
    }
  ]
}