{
  "meta": [
    {
      "job_title": "CXP Senior Developer - Full Stack",
      "job_category": "Software Development",
      "job_class": "Senior Developer",
      "sector": "Software Engineering",
      "salary": 125000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Java",
      "experience": 4
    },
    {
      "skill": "Python",
      "experience": 4
    },
    {
      "skill": "UiPath",
      "experience": 2
    },
    {
      "skill": "Spring Boot",
      "experience": 2
    },
    {
      "skill": "ReactiveJS",
      "experience": 2
    },
    {
      "skill": "GraphQL",
      "experience": 2
    },
    {
      "skill": "Cassandra",
      "experience": 2
    },
    {
      "skill": "AWS",
      "experience": 2
    },
    {
      "skill": "Kubernetes",
      "experience": 2
    },
    {
      "skill": "EKS",
      "experience": 2
    },
    {
      "skill": "ELK Stack",
      "experience": 2
    },
    {
      "skill": "DevSecOps",
      "experience": 4
    },
    {
      "skill": "Cloud Computing",
      "experience": 4
    },
    {
      "skill": "Monitoring Tools",
      "experience": 4
    },
    {
      "skill": "AI/ML",
      "experience": 4
    },
    {
      "skill": "System Analysis",
      "experience": 4
    },
    {
      "skill": "Troubleshooting",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Designing and developing the VCG CXP engineering application suite for Consumer and Business customers."
    },
    {
      "duty": "Working closely with stakeholders to streamline operations and monitor the health and performance of the application suite."
    },
    {
      "duty": "Developing and implementing process suggestions for maximizing operational efficiency, profitability, and key application throughput measures."
    },
    {
      "duty": "Creating dashboards, utility screens, order correction tools, health check automation tools, etc., to support field operations functions."
    },
    {
      "duty": "Developing key monitoring dashboards for Operations Management and ensuring ease of use."
    },
    {
      "duty": "Implementing best practices and procedures to enhance business growth and productivity."
    },
    {
      "duty": "Collaborating with functional units of an organization to develop and integrate new or existing services."
    },
    {
      "duty": "Managing Application engineering services to ensure they meet client/customer expectations and requirements."
    },
    {
      "duty": "Building and maintaining positive trust relationships with key stakeholders across IT and Frontline teams."
    },
    {
      "duty": "Ensuring IT Field operations comply with all local and federal labor laws and legislations."
    },
    {
      "duty": "Working on work shifts to ensure efficient operations."
    },
    {
      "duty": "Performing code analysis, static code tools usage, and additional tools to produce good quality code."
    },
    {
      "duty": "Implementing nonfunctional requirements such as performance, scalability, reliability, and extensibility."
    },
    {
      "duty": "Providing recommendations on servers, load balancing, high availability, disaster recovery, and storage architectures."
    },
    {
      "duty": "Analyzing architecture, relationships between systems, and system flows."
    },
    {
      "duty": "Assessing system usage trends and identifying potential performance and intersystem flaws."
    },
    {
      "duty": "Evaluating solutions alignment and end user experience."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 50,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Software Engineering, Computer Science, or a related field (Master's preferred)"
    }
  ]
}