{
  "meta": [
    {
      "job_title": "Product Manager",
      "job_category": "Product Management",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "SaaS Product Management",
      "experience": 4
    },
    {
      "skill": "Customer Engagement",
      "experience": 4
    },
    {
      "skill": "API Management",
      "experience": 4
    },
    {
      "skill": "Product Strategy",
      "experience": 4
    },
    {
      "skill": "Market Research",
      "experience": 4
    },
    {
      "skill": "Stakeholder Management",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the product strategy, roadmap, and execution of initiatives related to the Interactive Voice Response product."
    },
    {
      "duty": "Work with stakeholders, customers, and delivery teams to understand customer problems and business opportunities."
    },
    {
      "duty": "Meet with top customers to understand their specific problems, analyze potential future opportunities for growth, and evaluate partnership opportunities."
    },
    {
      "duty": "Collaborate with business stakeholders and the R&D team to build a complete product roadmap aligned with company goals and value creation."
    },
    {
      "duty": "Identify workflow improvement opportunities, prioritize them, and work with appropriate teams to make changes, including onboarding, optimizations, and other out-of-the-box thinking."
    },
    {
      "duty": "Gain a holistic understanding of the payments market to identify disruptive opportunities in the payments experience."
    },
    {
      "duty": "Define methods and metrics for identifying success and failure and ensure the team is clear on their objectives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Engineering, or quantitatively oriented fields (Advanced degree in business or relevant field preferred)"
    }
  ]
}