{
  "meta": [
    {
      "job_title": "Delivery Merchandiser Trainee",
      "job_category": "Logistics",
      "job_class": "Trainee",
      "sector": "Business",
      "salary": 37000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Route Delivery",
      "experience": 1
    },
    {
      "skill": "Merchandising",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Sales Ability",
      "experience": 1
    },
    {
      "skill": "Safety Management",
      "experience": 1
    },
    {
      "skill": "Data Analysis",
      "experience": 1
    },
    {
      "skill": "Continuous Improvement",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Physical Fitness",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Learn to drive a Class A CDL vehicle and obtain required licensing within 10 weeks of training start date."
    },
    {
      "duty": "Under supervision learn processes, and gain the skills necessary to service customers using all equipment utilized in the delivery process such as invoicing using a handheld device; begin and end of shift check-in, out accounting procedures for cash and paperwork accountability."
    },
    {
      "duty": "Properly secure company assets and inventory, and while safely and properly handling products upon delivery at customer locations."
    },
    {
      "duty": "Develop good rotation practices and the importance of point of sales such as racks and shippers; learn how to effectively build and maintain displays of our products, product facing, and brand order along with proper backroom management of our products."
    },
    {
      "duty": "Develop customer service skills by working with our customers to understand their needs and communicating back to the appropriate manager any customer service issues."
    },
    {
      "duty": "Responsible for appropriate behavior while executing job functions, promoting personal safety, and the safe use of needed equipment. Learn and adhere to company standards on safety, equipment safety, and proper usage and learns all Federal Motor Carrier Safety Administration rules regarding DOT and Hours of Service."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Valid driver’s license for your state of residency and excellent driving history reflected in the seven-year Motor Vehicle Report will be reviewed"
    },
    {
      "credential": "The ability to obtain a Commercial Driver’s License (Class A CDL), not required for hire"
    },
    {
      "credential": "Ability to pass and maintain D.O.T. physical requirements"
    }
  ]
}