{
  "meta": [
    {
      "job_title": "Security Administrator",
      "job_category": "Information Technology",
      "job_class": "Administrator",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for protecting the data and infrastructure utilized by CFS Brands and supported facilities."
    },
    {
      "duty": "Participate in project planning, designing, hands-on implementation, complex integration work, security assessment, hardening of configurations, troubleshooting, maintaining, upgrading, and defining policy/procedure as it relates to IT security."
    },
    {
      "duty": "Evaluate existing systems and provide technical direction to IT personnel."
    },
    {
      "duty": "Maintain and manage CFS Brands' security systems and procedures to improve utilization or propose revisions of infrastructure operations."
    },
    {
      "duty": "Establish processes for the configuration, testing, and maintaining operating systems, application software, and security management tools."
    },
    {
      "duty": "Communicate with personnel from a variety of departments, including staff, various vendors, and department leadership to exchange information concerning security."
    },
    {
      "duty": "Apply a security framework and ensure compliance from the business, vendors, and contractors."
    },
    {
      "duty": "Represent security needs during any Acquisition and Divestiture activity."
    },
    {
      "duty": "Recommend enhancements to the infrastructure operations."
    },
    {
      "duty": "Monitor compliance with applicable internal and external security and data protection policies."
    },
    {
      "duty": "Coordinate, maintain, and improve the cybersecurity training program."
    },
    {
      "duty": "Perform complex tasks on critical security projects and infrastructure enhancements."
    },
    {
      "duty": "Design, implement, and monitor network activities, devices, uptime, on all security platforms."
    },
    {
      "duty": "Travel to local and occasional remote sites in support of corporate initiatives."
    },
    {
      "duty": "Perform related duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Information Technology Security",
      "experience": 5
    },
    {
      "skill": "Network Security",
      "experience": 5
    },
    {
      "skill": "Cybersecurity",
      "experience": 5
    },
    {
      "skill": "Security Frameworks",
      "experience": 5
    },
    {
      "skill": "Security Policy Development",
      "experience": 5
    },
    {
      "skill": "IT Operations",
      "experience": 5
    },
    {
      "skill": "Vulnerability Management",
      "experience": 5
    },
    {
      "skill": "Project Planning",
      "experience": 5
    },
    {
      "skill": "Technical Leadership",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Computer Science, Information Assurance, or Business (Master's preferred)"
    }
  ]
}