{
  "meta": [
    {
      "job_title": "Lead",
      "job_category": "Retail",
      "job_class": "Sales",
      "sector": "Sales",
      "salary": 18,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Merchandising",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Store Operations",
      "experience": 3
    },
    {
      "skill": "Retail Sales",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support building and hiring a strong team by observing in-store interviews and department tours."
    },
    {
      "duty": "Plan, organize, and control 30-days out with the guidance of Assistant Store Manager; including building an effective approach and align on necessary workforce to execute daily assignments, game plans, projects, or store events."
    },
    {
      "duty": "Strategically leverage teammates to ensure brand standards are met, programs and processes are executed daily, and tasks are delegated based on their priority level."
    },
    {
      "duty": "Assist the store leadership team with general supervision in the store in accordance with Company policies and procedures, where applicable."
    },
    {
      "duty": "Assist with training teammates on company procedures and programs; this includes onboarding new teammates and cross-training current teammates."
    },
    {
      "duty": "Uphold company merchandising and presentation standards by following established floor sets, signage requirements, price changes, inventory presentation and replenishment standards, etc."
    },
    {
      "duty": "Creates an inclusive store environment where everyone (teammates & customers) feels welcome and safe and is treated with respect."
    },
    {
      "duty": "Adhere to established policies and procedures related to safety, loss prevention and standard operating procedures."
    },
    {
      "duty": "Takes an all-hands-on-deck approach to support the team across the store."
    },
    {
      "duty": "Performs other tasks as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": []
}