{
  "meta": [
    {
      "job_title": "Project Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Document Control",
      "experience": 5
    },
    {
      "skill": "Technical Support",
      "experience": 5
    },
    {
      "skill": "Software Packages",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and coordinate activities associated with design document review and approval processes to ensure project accuracy and quality."
    },
    {
      "duty": "Provide technical support for design and construction processes using several software packages."
    },
    {
      "duty": "Work with significant autonomy on several projects assigned, managing time effectively to meet project deadlines."
    },
    {
      "duty": "Engage in client-facing tasks, including weekly client calls and occasional travel by airplane to visit project sites."
    },
    {
      "duty": "Ensure excellent understanding of plan/design review and document control, managing daily objectives effectively."
    },
    {
      "duty": "Coordinate and track drawing reviews with multiple stakeholders, prepare initial set up of projects using multiple software packages, and track project scope and oversee the closeout process for multiple projects."
    },
    {
      "duty": "Prepare and facilitate client meetings and progress reports and perform other miscellaneous consulting tasks as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Four-year degree in Construction Management, Engineering, Architecture, or equivalent experience in a related field. Minimum 3 years of experience in project planning experience."
    },
    {
      "credential": "Specific knowledge or experience using Procore and/or BlueDAG software to manage projects."
    },
    {
      "credential": "Strong written communication skills and proficiency in Microsoft Suite applications (Word, Excel, Outlook)."
    },
    {
      "credential": "Ability to track multiple tasks on various timelines simultaneously while working largely autonomously to meet client needs."
    },
    {
      "credential": "Knowledge of ADA Standards and best practices, experience in consulting work of a similar nature (beneficial but not required)."
    }
  ]
}