{
  "meta": [
    {
      "job_title": "Inside Sales Representative (Event-Focused)",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Lead Generation",
      "experience": 4
    },
    {
      "skill": "Stakeholder Management",
      "experience": 4
    },
    {
      "skill": "Negotiation",
      "experience": 4
    },
    {
      "skill": "Customer Engagement",
      "experience": 4
    },
    {
      "skill": "Business Development",
      "experience": 3
    },
    {
      "skill": "Event Planning",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 4
    },
    {
      "skill": "Adaptability",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify qualified prospects and navigate company structures to identify decision-makers."
    },
    {
      "duty": "Learn, leverage, and help evolve the demand-generation process."
    },
    {
      "duty": "Generate appointments by means of proactive outbound prospecting."
    },
    {
      "duty": "Work closely with the Field Marketing team to identify various events, build a strategy on engagement and sessions, demonstrate Whatfix capabilities, and create qualified opportunities."
    },
    {
      "duty": "Manage the relationship with the CXOs and top executives at various events either in person, online, or through Hybrid."
    },
    {
      "duty": "Demonstrate the Whatfix demo to prospective customers at events and convey the value and ROI."
    },
    {
      "duty": "Tie up leads that will turn into business through persistence."
    },
    {
      "duty": "Demonstrate and teach strong selling and influencing skills."
    },
    {
      "duty": "Serve as a brand ambassador for Whatfix, showcasing our solutions and fostering valuable connections at physical and virtual events."
    },
    {
      "duty": "Engage event attendees in meaningful conversations, skillfully qualifying leads to identify promising opportunities."
    },
    {
      "duty": "Identify potential business prospects to expand the reach of our Digital Adoption Platform (DAP). Convert leads into qualified opportunities and pass them to the sales team."
    },
    {
      "duty": "Drive traffic and maximize booth presence through targeted pre-event and during-event outreach, including strategic promotional efforts."
    },
    {
      "duty": "Coordinate with our remote team in India to streamline lead management and ensure efficient coordination."
    },
    {
      "duty": "Track and analyze lead activity, providing valuable insights and recommendations to optimize lead generation strategies."
    },
    {
      "duty": "Willingness to travel to attend events as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Sales, or a related field (Masters preferred)"
    }
  ]
}