{
  "meta": [
    {
      "job_title": "Senior Manager, Nonclinical Operations",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Pharmaceutical",
      "salary": 135000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and monitor nonclinical studies and support operational aspects of non-clinical assay development for RNA and gene therapy programs."
    },
    {
      "duty": "Prioritize workflow in alignment with program and project timelines and budget; provide Sponsor oversight and ensure timelines are aligned and maintained with CROs and academic institutions."
    },
    {
      "duty": "Support management for study communication and activities to external and internal partners while maintaining documents from pre-study to study closure (finalization and archiving)."
    },
    {
      "duty": "Manage and communicate study timelines and milestones with input from nonclinical team."
    },
    {
      "duty": "Participate in nonclinical subteam and present study related information to the team as needed in an organized format."
    },
    {
      "duty": "Contribute to study design and regulatory submission documents as needed in partnership with Chief Development Officer, contract scientists, and CROs."
    },
    {
      "duty": "Ensure all reports from internal and external team members are received on an appropriate and planned timeline."
    },
    {
      "duty": "Support and maintain nonclinical budget and forecasting (actuals and projections), including change orders, study accruals, and financial scenario planning."
    },
    {
      "duty": "Support sample and data transfers as needed."
    },
    {
      "duty": "Prepare, review, and adjudicate nonclinical study and regulatory documents. Support writing and/or peer reviewing nonclinical study reports and manuscripts."
    },
    {
      "duty": "Participate in CRO evaluation, qualification, and outsourcing as requested."
    },
    {
      "duty": "Manage supplier costs, study level performance, and implement and maintain study operational efficiencies."
    },
    {
      "duty": "Communicate and manage study changes and issues, knowing when and how to escalate issues to management for resolution."
    },
    {
      "duty": "Maintain collaborative relationships and communications between external service providers. Ensure compliance with study protocols, GLP regulations, etc."
    },
    {
      "duty": "Support business initiatives that support overall growth and success of the organization as it related to nonclinical program activities."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Operational Oversight",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Team Collaboration",
      "experience": 10
    },
    {
      "skill": "Supplier Management",
      "experience": 10
    },
    {
      "skill": "CRO Evaluation",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Written and Verbal Communication",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s or master’s degree in biology or a related discipline required"
    }
  ]
}