{
  "meta": [
    {
      "job_title": "Event Manager",
      "job_category": "Hospitality",
      "job_class": "Manager",
      "sector": "Hospitality",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Communicate with clients to obtain necessary technical requirements for set up and other event related information."
    },
    {
      "duty": "Oversee facility departments to ensure that the equipment and personnel provided meet the requirements of the event and the client’s contractual agreement. Manage the preparation for upcoming events."
    },
    {
      "duty": "Ensure all pertinent information is obtained, compiled in event files and distributed to proper entities."
    },
    {
      "duty": "Establish and maintain effective working relationships with police, fire, EMS and other security personnel and."
    },
    {
      "duty": "Supervise employees in the parking, event services, public safety and medical services divisions."
    },
    {
      "duty": "Plan, organize, and direct various personnel and must possess a degree of skill in logistics to properly plan the details necessary to establish a safe and efficient environment."
    },
    {
      "duty": "Negotiate, compile, and execute proposals and sales contracts and agreements."
    },
    {
      "duty": "Promote the Convention Center to all potential clients; conduct facility tour; answer questions and provide information regarding facility services, technical capabilities, policies, and procedures; assist clients in finalizing booking arrangements."
    }
  ],
  "skills": [
    {
      "skill": "Hospitality Sales",
      "experience": 5
    },
    {
      "skill": "Event Management",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Sales and Marketing",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from an accredited college or university (or) Three (3) years of increasingly responsible experience in event management, planning, or equivalent professional experience."
    }
  ]
}