{
  "meta": [
    {
      "job_title": "Client Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "salary": 135000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Strategic Account Management",
      "experience": 4
    },
    {
      "skill": "Business Strategy",
      "experience": 4
    },
    {
      "skill": "Relationship Building",
      "experience": 4
    },
    {
      "skill": "Sales Planning",
      "experience": 4
    },
    {
      "skill": "Presentation Skills",
      "experience": 4
    },
    {
      "skill": "Key Performance Indicators",
      "experience": 4
    },
    {
      "skill": "Analytics",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the primary interface for TbV Tier 2 Master Agents and develop relationships with them, translating their feedback and concerns internally."
    },
    {
      "duty": "Identify opportunities and lead account strategy and planning discussions with Master Agents to drive distribution growth strategy for TbV Retail."
    },
    {
      "duty": "Work closely with channel leadership in the consumer experience, sales, and analytics organizations to drive and manage distribution growth of accounts."
    },
    {
      "duty": "Produce and present creative, compelling proposals, presentations, and business reviews that express Total by Verizon's key initiatives and expectations from a distribution and growth perspective."
    },
    {
      "duty": "Assess performance of each agent and retailer, and develop a tailored plan on a monthly basis to improve productivity and meet targets."
    },
    {
      "duty": "Measure and monitor Key Performance Indicators for respective Indirect Partners, developing and executing plans to exceed sales targets."
    },
    {
      "duty": "Make critical, business-impacting decisions, share best practices, and ensure results and KPIs are being met to drive and execute performance."
    },
    {
      "duty": "Proactively cultivate collaboration and ensure successful prioritization and management of multiple accounts, programs, and responsibilities."
    },
    {
      "duty": "Drive and influence Master Agent distribution growth strategy for TbV Retail."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 150,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or four or more years of work experience, with at least two years of Indirect channel experience. An MBA, or an M.S. in related fields, and exceptional PP/Google Slide creation for executive presentations is preferred. Project management experience is also desirable."
    }
  ]
}