{
  "meta": [
    {
      "job_title": "Operations Key Account Specialist",
      "job_category": "Logistics",
      "job_class": "Specialist",
      "sector": "Logistics",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as the main point of contact for the Customer after study award and throughout the entire study lifecycle."
    },
    {
      "duty": "Coordinate and participate in meetings of improvement projects as defined by the relevant process improvement management team."
    },
    {
      "duty": "Assist in the development of database design requirements for protocols and protocol amendments."
    },
    {
      "duty": "Manage the set-up process for a low complexity study, where applicable."
    },
    {
      "duty": "Monitor work orders daily to ensure priority shipments meet client deadlines."
    },
    {
      "duty": "Facilitate seamless study set-up including Protocol and Budget review, leading meetings, develop and implement project plans, milestone, risk, issue and action logs."
    },
    {
      "duty": "Partner with Study Setup team to ensure quality database set-up, oversee preparation of protocol specific documentation."
    },
    {
      "duty": "Monitor the Project Management Plan, timelines and deliverables, manage study documentation throughout the Project lifecycle."
    },
    {
      "duty": "Build and own the Customer relationship, facilitate communication, collaborate with all operational areas within the company."
    },
    {
      "duty": "Coordinates customer survey follow up and ongoing health checks to support Customer relationship building."
    },
    {
      "duty": "Represent the company at Investigator meetings and other internal / external face to face meetings."
    },
    {
      "duty": "Participate in audits and inspections as required."
    }
  ],
  "skills": [
    {
      "skill": "Customer Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Database Design",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Fluent in English and Spanish",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Logistics, Business, or a related field (Master's preferred)"
    }
  ]
}