{
  "meta": [
    {
      "job_title": "Project Advisory Assistant",
      "job_category": "Construction",
      "job_class": "Assistant",
      "sector": "Construction",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Assisting Project Manager on all tasks for assigned Projects."
    },
    {
      "duty": "Attending Board and Association membership meetings to discuss project with clients."
    },
    {
      "duty": "Preparing detailed presentations, including budget and schedule information as well as project design and specification options."
    },
    {
      "duty": "Preparing detailed meeting agendas and meeting minutes."
    },
    {
      "duty": "Producing monthly progress reports including scheduling and budget updates."
    },
    {
      "duty": "Using MS Project to prepare detailed construction project schedule."
    },
    {
      "duty": "Assisting with researching and vetting potential design professionals and contractors."
    },
    {
      "duty": "Preparing detailed Requests for Proposals, including multi-faceted bid sheets using MS Excel."
    },
    {
      "duty": "Meeting with contractors, designers, and service professionals to discuss construction projects in detail."
    },
    {
      "duty": "Reviewing and analyzing bids received, enter bid information into MS Excel spreadsheets, analyze and level bid information, present findings to clients."
    },
    {
      "duty": "Reviewing project plans, renderings, and specifications."
    },
    {
      "duty": "Preparing detailed project budgets for multi-million-dollar projects, including hard costs, soft costs, design fees, and contingency."
    },
    {
      "duty": "Tracking all project expenditures on monthly cash flow budget."
    },
    {
      "duty": "Tracking and adjusting project schedules."
    },
    {
      "duty": "Reviewing large-scale construction contracts."
    },
    {
      "duty": "Performing site inspections to ensure quality workmanship and compliance with contractual obligations."
    },
    {
      "duty": "Verifying quantities of work performed as well as quality."
    },
    {
      "duty": "Ensure compliance with contractual obligations and payment applications."
    },
    {
      "duty": "Assisting with procuring permits from government agencies."
    },
    {
      "duty": "Leading weekly Owner/Architect/Contractor meetings, address all pending items and provide problem-solving and cost savings solutions."
    },
    {
      "duty": "Preparing meeting agenda and minutes for weekly Owner/Architect/Contractor meetings."
    },
    {
      "duty": "Reviewing punch list and ensure completion."
    },
    {
      "duty": "Reviewing final project close-out documents, releases of lien and final payment applications."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "0-2 years of construction administration experience OR relevant academic coursework toward a degree."
    },
    {
      "credential": "Bachelor's degree in Construction Management, Architecture, Engineering, or a related field (Master's preferred)"
    }
  ]
}