{
  "meta": [
    {
      "job_title": "RPA Developer",
      "job_category": "Software Engineering",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Robotic Process Automation (RPA)",
      "experience": 3
    },
    {
      "skill": "UiPath",
      "experience": 3
    },
    {
      "skill": "Blue Prism",
      "experience": 3
    },
    {
      "skill": "C#",
      "experience": 3
    },
    {
      "skill": "Agile Methodologies",
      "experience": 3
    },
    {
      "skill": "APIs and Data Integration",
      "experience": 3
    },
    {
      "skill": "Software Development",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, develop, and implement RPA solutions using UiPath, Blue Prism, or similar tools."
    },
    {
      "duty": "Analyze business processes and identify areas for RPA application to improve efficiency."
    },
    {
      "duty": "Collaborate with stakeholders to identify opportunities for process improvement and innovation."
    },
    {
      "duty": "Create and maintain technical documentation to support automation processes."
    },
    {
      "duty": "Conduct unit and integration testing to ensure RPA solutions meet functional requirements."
    },
    {
      "duty": "Provide ongoing support for RPA solutions, including identifying and resolving technical issues."
    },
    {
      "duty": "Design and develop reporting based on automation requirements to track performance and quality metrics."
    },
    {
      "duty": "Communicate project progress and status to leadership and development team members."
    },
    {
      "duty": "Create business solutions using knowledge and application of multiple technologies and applications."
    },
    {
      "duty": "Review existing RPA code packages for quality improvements."
    },
    {
      "duty": "Perform regression testing on RPA packages after new deployments."
    },
    {
      "duty": "Keep up-to-date with the latest trends and developments in RPA technology."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 30,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Computer Science, Computer Engineering, Software Engineering, or related discipline, or 4+ years professional experience in one of these disciplines"
    }
  ]
}