{
  "meta": [
    {
      "job_title": "Engineer MSAT I/II",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Biopharmaceutical",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Biopharmaceutical Manufacturing",
      "experience": 5
    },
    {
      "skill": "cGMP and Quality Systems",
      "experience": 5
    },
    {
      "skill": "MS Word, Excel, PowerPoint",
      "experience": 5
    },
    {
      "skill": "Statistical Software (JMP)",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Apply sound engineering principles to the transfer, monitoring, validation, and troubleshooting activities of drug substance manufacturing processes."
    },
    {
      "duty": "Drive implementation of new technologies to improve manufacturing efficiency and ease of operations."
    },
    {
      "duty": "Lead and conduct process related troubleshooting, investigation, and optimization."
    },
    {
      "duty": "Assess impact to product quality, identify root cause and propose corrective and preventative actions."
    },
    {
      "duty": "Participates in the collection and statistical analysis of manufacturing in-process control and process parameter data to trend process performance, generate campaign summary report as needed."
    },
    {
      "duty": "Implement new equipment and process technologies in the manufacturing area and train manufacturing personnel on these technologies; serve as a technical resource on equipment capabilities and troubleshooting."
    },
    {
      "duty": "Initiate and recommend improvements in process and equipment operation, based on sound engineering and scientific knowledge, toward increasing process robustness, efficiency, and productivity."
    },
    {
      "duty": "Collaborates on SOPs and batch records for new process and new technology as needed."
    },
    {
      "duty": "Contribute to regulatory filings and inspections."
    },
    {
      "duty": "Collaborate in cross functional activities with development and manufacturing personnel, both internal and external, to support process scale-up, technology transfer, process characterization, and process validation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s or advanced degree in chemical/biochemical engineering, chemistry/biochemistry, biological sciences, or related disciplines. BS with 6 years of relevant experience, MS with 3 years of relevant experience in biopharmaceutical research and manufacturing settings."
    }
  ]
}