{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 46,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 2
    },
    {
      "skill": "Nursing Process",
      "experience": 2
    },
    {
      "skill": "Medication Administration",
      "experience": 3
    },
    {
      "skill": "Healthcare Teaching/Education",
      "experience": 3
    },
    {
      "skill": "Care Coordination",
      "experience": 3
    },
    {
      "skill": "Goal Setting",
      "experience": 2
    },
    {
      "skill": "Healthcare Protocols",
      "experience": 2
    },
    {
      "skill": "Discharge Planning",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Utilize the nursing process to plan, implement, and evaluate patient/client care and/or services provided to client(s) receiving contracted services, as required."
    },
    {
      "duty": "Initiate the plan of care when directed and request from prescriber any necessary revisions as patient status and needs change."
    },
    {
      "duty": "Incorporate therapeutic, preventive, and rehabilitative nursing actions based on patient diagnosis and established goals."
    },
    {
      "duty": "Intervene as applicable in response to changes in patient/client condition and report such changes to appropriate physician or supervisor."
    },
    {
      "duty": "Administer medications and treatments as prescribed, as well as, monitor and document effectiveness of intervention."
    },
    {
      "duty": "Review plan of care and program protocols and identify areas for healthcare teaching/education, care coordination, goal setting and discharge planning needs, as applicable."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Current Registered Nurse (RN) License for the state in which the nurse practices."
    },
    {
      "credential": "Current Health Certificate (per facility Registered Nurse (RN) contract or state regulation)."
    },
    {
      "credential": "Current PPD or Chest X-Ray."
    },
    {
      "credential": "Current BLS card."
    },
    {
      "credential": "One year prior Registered Nurse (RN) experience preferred."
    },
    {
      "credential": "Benefit eligibility is dependent on employment status."
    },
    {
      "credential": "CO & WA Specific Benefits: Medical/Prescription, Dental, Vision, Health Advocacy (company paid if enrolled in Medical), Health Advocate Employee Assistance Program, 401(k), Short Term Disability, Voluntary Group Life Insurance and Supplemental Accidental Insurance, Hospital Expense Protection Plan, Critical Illness Insurance, Home and Auto Insurance discounts, Pet Insurance, Legal Benefits, Employee Discount Program, Transportation Benefits, College Partnership Program, Paid Time Off."
    }
  ]
}