{
  "meta": [
    {
      "job_title": "Plant Human Resources Generalist",
      "job_category": "Human Resources",
      "job_class": "Generalist",
      "sector": "Manufacturing",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supports and advises employees, supervisors, and managers regarding employee relations issues, including coaching supervisors and managers in managing employee performance."
    },
    {
      "duty": "Supervises a team of Operations Support Specialists members."
    },
    {
      "duty": "Manages the processing of FMLA, WPFL, STD, and any other leave of absence."
    },
    {
      "duty": "Responsible for the administration of Employment Eligibility Verification, including Form i9 and employment authorization of each new hire."
    },
    {
      "duty": "Responsible for assisting in employee investigation matters."
    },
    {
      "duty": "Responsible for assisting in the administration of disability and Workers Compensation claims."
    },
    {
      "duty": "Manages the processing of new job requisitions and hiring activities for all Hourly personnel and may assist with Salary personnel."
    },
    {
      "duty": "Maintains AAP, including overseeing the disposition of candidates on all requisitions, maintain and verify applicant logs, establish hiring goals, and assist in communication of hiring goals to appropriate hiring managers."
    },
    {
      "duty": "Conducts an annual wage survey and evaluation."
    },
    {
      "duty": "Conducts periodic audits and ensures accurate recordkeeping for HR office."
    },
    {
      "duty": "Conducts New Hire Orientation HR presentations and helps organize training & development initiatives."
    },
    {
      "duty": "Tracks all personnel activities and is responsible for HR statistics: turnover, applicants, new hires, transfers, promotions, and terminations."
    },
    {
      "duty": "Maintain employee files and records in electronic and paper form."
    },
    {
      "duty": "Provides supervisory training during the orientation period for managers and supervisors."
    },
    {
      "duty": "Responsible for updating Hourly Employee Handbook and maintaining HR policies and procedures."
    },
    {
      "duty": "Responsible to communicate non-harassment and workplace violence training."
    },
    {
      "duty": "Assists in communicating and encouraging wellness program and activities."
    },
    {
      "duty": "Enhance job satisfaction by promoting the No Meeting Zone floor time and engaging in Leadership DS meetings."
    },
    {
      "duty": "Serves as an HR representative on assigned committees, projects, and community involvement activities."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Human Resources Management",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Supervision",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Recruitment and Hiring",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 5
    },
    {
      "skill": "Recordkeeping",
      "experience": 5
    },
    {
      "skill": "Employee Handbook Management",
      "experience": 5
    },
    {
      "skill": "Workplace Training",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferably with a major in Human Resources, Psychology, Sociology, Business, or a related field (Master's preferred)"
    }
  ]
}