{
  "meta": [
    {
      "job_title": "Administrative Assistant II",
      "job_category": "Administration",
      "job_class": "Assistant",
      "sector": "Administration",
      "salary": 20000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "General Administration",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    },
    {
      "skill": "MS Office Suite",
      "experience": 3
    },
    {
      "skill": "Travel Coordination",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Filing Systems Organization",
      "experience": 3
    },
    {
      "skill": "Mail Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support R&D and analytical teams with general administrative activities and other requested tasks."
    },
    {
      "duty": "Ensure supply needs are met, including office and lab supply inventory and ordering."
    },
    {
      "duty": "Organize and maintain department filing systems, including potentially confidential data."
    },
    {
      "duty": "Coordinate meetings, maintain calendars, assist in travel arrangements, and provide clerical support as necessary."
    },
    {
      "duty": "Manage incoming and outgoing mail, product samples, and coordinate building maintenance as needed."
    },
    {
      "duty": "Handle invoices, purchase order requests, and organize and tidy common areas."
    },
    {
      "duty": "Respond to inquiries for information according to general guidelines and perform routine assignments under limited supervision."
    },
    {
      "duty": "Draft product evaluation protocols, assist in running product evaluations, and engage internal employees to participate in evaluations."
    },
    {
      "duty": "Prepare grammatically correct correspondence, reports, tables, and analyses, and enter or remove small stability samples on a scheduled basis."
    },
    {
      "duty": "Assist in special projects as assigned and recommend improvements on administrative procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "HS diploma or higher; MS Office Outlook, Excel, Word Proficiency"
    }
  ]
}