{
  "meta": [
    {
      "job_title": "Senior Full Stack Java Software Engineer",
      "job_category": "Software Engineering",
      "job_class": "Senior",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead all aspects of solution design and development of both client-side and server-side web applications."
    },
    {
      "duty": "Develop an engaging and visually appealing front end for dentists around the United States to purchase goods for their businesses using a multitude of different devices."
    },
    {
      "duty": "Develop RESTful APIs used by sellers to ship orders and maintain product catalogs."
    },
    {
      "duty": "Develop a high-speed Java backend using Spring Boot."
    },
    {
      "duty": "Assist in modeling data for relational databases and writing fast and efficient queries."
    },
    {
      "duty": "Ensure the performance, scalability, and security of the web application."
    },
    {
      "duty": "Accomplished change management leader who is able to operate effectively in a fast-paced and ever-changing environment."
    },
    {
      "duty": "Provide technical guidance and oversight for the full software development life cycle, including requirements gathering, design, development, testing, and deployment."
    },
    {
      "duty": "Participate and/or lead Agile Scrum and/or Kanban methodologies and meetings to ensure project goals are met."
    },
    {
      "duty": "Work with stakeholders to ensure technology solutions efficiently meet business requirements and objectives."
    },
    {
      "duty": "Set realistic timelines with effective communication to technical/business stakeholders."
    },
    {
      "duty": "Mentoring and coaching junior full-stack engineers to improve their technical skills and help them grow professionally."
    },
    {
      "duty": "Participating in code reviews to ensure the quality of the codebase."
    },
    {
      "duty": "Identifying and resolving technical issues and making architectural decisions."
    }
  ],
  "skills": [
    {
      "skill": "Java",
      "experience": 5
    },
    {
      "skill": "Spring Boot",
      "experience": 5
    },
    {
      "skill": "RESTful API Development",
      "experience": 5
    },
    {
      "skill": "Frontend Development",
      "experience": 5
    },
    {
      "skill": "Backend Development",
      "experience": 5
    },
    {
      "skill": "Database Modeling",
      "experience": 5
    },
    {
      "skill": "Agile Software Development",
      "experience": 5
    },
    {
      "skill": "Technical Leadership",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    },
    {
      "skill": "Code Review",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science or related field (Master's preferred)"
    }
  ]
}