{
  "meta": [
    {
      "job_title": "Chief of Staff",
      "job_category": "Management",
      "job_class": "Chief",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide senior level management support to the President of the Civic Committee and Commercial Club of Chicago and other senior executives reporting to the President."
    },
    {
      "duty": "Operate as a project manager for key initiatives, meeting deadlines for strategic deliverables, and building effective communication plans for internal and external audiences."
    },
    {
      "duty": "Oversee strategic initiatives from development through successful execution, under the guidance of senior leadership."
    },
    {
      "duty": "Work on the planning and support the execution of key shared responsibilities, including fundraising, strategic planning, and board management."
    },
    {
      "duty": "Streamline initiatives and management functions, where possible, to have an impact on productivity."
    },
    {
      "duty": "Supervise administrative, intern, or other staff."
    },
    {
      "duty": "Drive, manage, and coordinate the implementation of strategic priorities across the Civic Committee."
    },
    {
      "duty": "Develop systems, processes, and reporting mechanisms within the Civic Committee to ensure cohesiveness, effective operations, and successful implementation plans and outcomes."
    },
    {
      "duty": "Provide political, strategic, and technical advice to the President and senior leadership when required."
    },
    {
      "duty": "Maintain a finger on the pulse of the organization, providing input to the President and senior leaders."
    },
    {
      "duty": "Serve as a liaison between staff and the President and other senior leaders regarding the organization's climate, culture, employee well-being, and initiatives."
    },
    {
      "duty": "Develop and build on relationships with all employees for increased efficiency and responsiveness of existing operations and help define new operational strategies by working with President and other senior leaders on special projects."
    },
    {
      "duty": "Serve as a catalyst for executive-level decision making."
    },
    {
      "duty": "Serve as the strategic lead on projects for which the President is directly responsible, such as innovation and urban policy/research."
    },
    {
      "duty": "Conduct detailed research for the President on requested topics to provide accurate information/analysis to support decision-making."
    },
    {
      "duty": "Build and sustain productive working relationships with affiliated organizations, partners, and members."
    },
    {
      "duty": "Support the President and Executive Vice President in facilitating the work with the organization's Leadership, Board of Directors, Membership, and with professional organizations, associations, and working groups."
    },
    {
      "duty": "Prepare briefing materials and presentations for the President, Executive Vice President, Leadership, Board of Directors, and other senior leaders of the organization."
    },
    {
      "duty": "Oversee, and collaborate with the V.P., Finance & Administration in the creation of and adherence to the Civic Committee's projects and initiatives overall and department-specific budgets; reallocate dollars as necessary to drive implementation of strategic initiatives."
    },
    {
      "duty": "Ensure continual improvement of the budgeting process through education of department leaders on budgetary issues impacting their budgets and ongoing departmental performance to the budget."
    },
    {
      "duty": "Support the development of the Civic Committee by providing timely and accurate analyses of budgets, project proposals, and improvement opportunities across the organization that assists the VP in leading the organization."
    },
    {
      "duty": "Respond to inquiries and communicate on behalf of the President, including board-related correspondence, emulating the President's voice for a large volume of communications, including meeting talking points and materials for various speaking engagements involving internal and external audiences."
    },
    {
      "duty": "Oversee, and collaborate with, the Civic Committee's other senior leaders in the effort to communicate the work of the Civic Committee both within the organization and to external stakeholders."
    },
    {
      "duty": "Coordinate drafts and finalize important communications related to the Civic Committee and the broader membership and policy efforts of the organization."
    },
    {
      "duty": "Collaborate with the EVP of Strategy and Planning in developing a strategic plan and other programmatic performance metrics and evaluations and assist with building a reporting dashboard for the organization."
    },
    {
      "duty": "Maintain appropriate discretion and confidentiality; communicate or act on behalf of the President on designated matters as directed; facilitate and strengthen communication with and among other members of the senior leadership team."
    },
    {
      "duty": "Represent the Civic Committee in public forums, speaking on behalf of the organization, fielding questions, connecting people and organizations with the right resources, and following up when appropriate."
    },
    {
      "duty": "Represent the President and other senior leaders in working effectively with the finance & administrative team and affiliated organizations to ensure transparency and ease in communication and collaboration to support the interdependent goals of the Civic Committee."
    },
    {
      "duty": "Serve as a subject-matter expert, handling inquiries, developing action plans, and assisting with preparation and dissemination of communications."
    },
    {
      "duty": "Oversee membership-related calendar and activities, including the Membership Working Group, in partnership with the President, Leadership, other senior leaders, and staff, and in coordination with committees, including logistics, reporting, correspondence, orientation, meetings, and records management."
    },
    {
      "duty": "Coordinate fundraising activities, ensuring objectives, deadlines, and follow-up are achieved, including creation of documents where needed."
    },
    {
      "duty": "Perform other job-related duties and special projects as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Executive Advising",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Public Speaking",
      "experience": 5
    },
    {
      "skill": "Policy Development",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Decision Making",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "College degree required. Graduate degree preferred."
    }
  ]
}