{
  "meta": [
    {
      "job_title": "Director IT Applications & System Operations(AWS)",
      "job_category": "IT",
      "job_class": "Director",
      "sector": "Technology",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "AWS Infrastructure Management",
      "experience": 10
    },
    {
      "skill": "Cyber Security",
      "experience": 10
    },
    {
      "skill": "Disaster Recovery Planning",
      "experience": 10
    },
    {
      "skill": "Endpoint Detection and Response",
      "experience": 10
    },
    {
      "skill": "Infrastructure Initiatives Leadership",
      "experience": 10
    },
    {
      "skill": "Security Risk Mitigation",
      "experience": 10
    },
    {
      "skill": "System Administration",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as a SME of global AWS infrastructure and security."
    },
    {
      "duty": "Manage, maintain and monitor Bi360 infrastructure and software ensuring financial reporting availability."
    },
    {
      "duty": "Manage and maintain Bitwarden password vault and globalize the strategy."
    },
    {
      "duty": "Collaborate with VP Digital to implement and maintain marketing tools (Maker, Algolia, other MarTec tools)."
    },
    {
      "duty": "Implement endpoint detection and response and threat response to continuously monitor end user devices to detect and respond to cyber threats like ransomware and malware."
    },
    {
      "duty": "Manage cyber security insurance checkpoints for all countries."
    },
    {
      "duty": "Create and maintain disaster recovery plans for Global IT."
    },
    {
      "duty": "Security risk mitigation / proactive security measures, manage security outsourced functions."
    },
    {
      "duty": "Right-hand person to build out a global infrastructure initiative, lead the detailed changes with global technical teams."
    },
    {
      "duty": "Establish and maintain google analytics (GA4) establish baselines for tracking improvements."
    },
    {
      "duty": "Manage all US PCI Compliance including testing, report submission, rectifying problems and being proactive with system adjustments."
    },
    {
      "duty": "Serve as the Systems administrator."
    }
  ]
}