{
  "meta": [
    {
      "job_title": "Damage Inspector",
      "job_category": "Engineering",
      "job_class": "Inspector",
      "sector": "Energy",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Audit the day-to-day activities of COC Locating Technicians Miss Utility tickets to ensure compliance with Federal and State safety regulations, marking standards, and technical specifications."
    },
    {
      "duty": "Coordinate and monitor damage investigations of all underground facilities on the Pepco System, in conjunction with applicable Miss Utility Laws and Damage Prevention Ordinances."
    },
    {
      "duty": "Conduct physical and virtual random checks on services provided by line locating contractors and recommend corrective actions."
    },
    {
      "duty": "Plan and oversee participation in training and educational events for owners and excavators, as well as perform locator recertification audit and training."
    },
    {
      "duty": "Monitor ticket management system to ensure tickets and mark outs are being completed within the appropriate legal response time and escalate any tickets with no response or late to the locate vendor and supervisor."
    },
    {
      "duty": "Conduct research and complete investigations involving damage to Pepco's underground and URD facilities as well as support Pepco claims to resolve disputes and testify in court as may be necessary."
    },
    {
      "duty": "Drive company vehicle, operate company radio and cellular phone."
    }
  ],
  "skills": [
    {
      "skill": "Fiber Optic Prints Interpretation",
      "experience": 3
    },
    {
      "skill": "Construction Drawing Interpretation",
      "experience": 3
    },
    {
      "skill": "Ability to use electronic line locating equipment",
      "experience": 3
    },
    {
      "skill": "Coordination and Planning",
      "experience": 3
    },
    {
      "skill": "Interpersonal and Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Valid Driver's License",
      "experience": 3
    },
    {
      "skill": "Basic Computer Skills (MS Word, Excel, Access, and e-mail)",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent combination of education, training, and/or experience. Must have the ability to interpret fiber optic prints, construction drawings, and gas/electric maps and records."
    }
  ]
}