{
  "meta": [
    {
      "job_title": "Licensing Administration Coordinator",
      "job_category": "Administration",
      "job_class": "Coordinator",
      "sector": "Design",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Facilitate communication between the Design Team and licensing partners worldwide."
    },
    {
      "duty": "Submit accurate data to the licensor and gain approval for concepts."
    },
    {
      "duty": "Provide production-ready imagery to the licensor and authorize the shipping of products."
    },
    {
      "duty": "Communicate any requirements to the factory based on licensor feedback."
    },
    {
      "duty": "Inform all relevant parties of the submission status once the licensor approves the product for shipping."
    },
    {
      "duty": "Streamline internal processes, minimize errors, and ensure full model-related approval for products and packaging to improve speed to market."
    },
    {
      "duty": "Establish a communication network with all functional departments, maintain relationships, and manage daily relations/communications with brand and agency clients."
    },
    {
      "duty": "Attend creative calls with the Design Team to present innovative concepts and understand feedback from the Licensor."
    },
    {
      "duty": "Monitor, document, and maintain the progress of all models as it relates to the approval process."
    },
    {
      "duty": "Responsible for collecting and submitting artwork to the Licensor and subsequently, any changes/resubmits requested."
    },
    {
      "duty": "Obtain all necessary approvals for Licensors for all product concepts and pre-production samples and resolve all issues efficiently."
    },
    {
      "duty": "Coordinate DTR licensed approvals with major retailers (Walmart, Target, etc.)."
    },
    {
      "duty": "Request artwork be released to the factories once the design is approved."
    },
    {
      "duty": "Submit pre-production and/or production samples to Licensor, and initiate communication with the appropriate parties once approved to ship."
    },
    {
      "duty": "Communicate to the factory any comments or revisions from the Licensor."
    },
    {
      "duty": "Maintain a record of all submission approvals."
    },
    {
      "duty": "Provide training and guidelines as needed to internal team members."
    },
    {
      "duty": "Follow through/update weekly to ensure all deliverables meet their deadline(s)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 60,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree in business, communications, or a related field required. May substitute for four years of work experience. Strong time management experience. Superior interpersonal, written communication, and data entry skills. Excellent decision-making and organizational skills. Knowledge of product development or working in a creative division within product development is strongly preferred."
    }
  ]
}