{
  "meta": [
    {
      "job_title": "Staff Manufacturing Engineer",
      "job_category": "Engineering",
      "job_class": "Staff",
      "sector": "Manufacturing",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Manufacturing Process Development",
      "experience": 5
    },
    {
      "skill": "Project Engineering",
      "experience": 5
    },
    {
      "skill": "Product Development",
      "experience": 5
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 5
    },
    {
      "skill": "DFM Analysis",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 5
    },
    {
      "skill": "Design Reviews",
      "experience": 5
    },
    {
      "skill": "Process Control",
      "experience": 5
    },
    {
      "skill": "Technical Analysis",
      "experience": 5
    },
    {
      "skill": "Supplier Qualification",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and characterization of prototype equipment and pilot processes in support of manufacturing scale-up and launch."
    },
    {
      "duty": "Manage internal and external resources in the development of manual and semi-automated processes for product assembly."
    },
    {
      "duty": "Oversee the development of production and process control documents, and prepare technical analysis and recommend manufacturing methods and processes."
    },
    {
      "duty": "Apply lean manufacturing methodologies to characterize, debug, and optimize manufacturing processes. Support Design for Manufacturing/Assembly (DFM/A) activities and process specification definition throughout product development lifecycle."
    },
    {
      "duty": "Support root cause investigations, manufacturing process improvements, and design reviews, FMEA’s, risk/hazard analysis & establishing technical requirements."
    },
    {
      "duty": "Support identification and qualification of suppliers for specialty materials, finished goods, and equipment. Support 3D modeling and tolerance analysis of complex electro-mechanical systems."
    },
    {
      "duty": "Work with globally located and cross-functional teams at the business unit and plant level to achieve project goals. Approximately 10 – 25% travel is expected."
    },
    {
      "duty": "Responsible for the coordination of the test method development as an R&D liaison for design transfer; deliver DFM analysis, develop manufacturing process specifications, and support first-of-type semi and fully automated manufacturing equipment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 75,
      "student_teacher": 45,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. degree in Mechanical, Biomedical, or related Engineering discipline is required. (Masters' degree or MBA preferred)"
    }
  ]
}