{
  "meta": [
    {
      "job_title": "Laboratory Supervisor",
      "job_category": "Healthcare",
      "job_class": "Supervisor",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepares staff schedule preparation and workflow assignments as required"
    },
    {
      "duty": "Manages quality assessment and technical oversight, problem solving, scheduling, interviewing applicants, provides input for staff performance, oversees training and competency evaluations"
    },
    {
      "duty": "Assess competencies according to Clinical Laboratory Improvement Amendments (CLIA) regulations"
    },
    {
      "duty": "Reads, examines, and interprets complex test results. Serves as a resource and addresses complex tests/procedures"
    },
    {
      "duty": "Leads quality control and quality assurance testing"
    },
    {
      "duty": "Assists with data collection and special projects, as assigned"
    },
    {
      "duty": "Performs assigned pre-analytical activities related to laboratory testing"
    },
    {
      "duty": "Performs post-analytical activities related to laboratory testing, reporting results (including highly abnormal results) in accordance with established procedures"
    },
    {
      "duty": "Provides orientation and training to new employees and medical technology students as needed, under the direction of the lab leadership"
    },
    {
      "duty": "Provides guidance to technical and support staff, resolution to customer service issues within guidelines, and support education to clinical staff as appropriate or requested"
    },
    {
      "duty": "Follows appropriate safety policies including the appropriate use of PPE, handwashing, and hazardous chemical handling. Demonstrates understanding and adheres to Chemical Hygiene plan and Infection Control policies. "
    },
    {
      "duty": "Responsibility for local LIS management, including, but not limited to, requests for new test builds and edits and maintenance of instrument interfaces and LIS regulatory validations"
    },
    {
      "duty": "Performs various support activities to facilitate operation of assigned department or work area"
    }
  ],
  "skills": [
    {
      "skill": "Technical skills in laboratory testing",
      "experience": 3
    },
    {
      "skill": "Quality assessment activities",
      "experience": 3
    },
    {
      "skill": "Employee training and orientation",
      "experience": 3
    },
    {
      "skill": "Leadership and guidance to staff",
      "experience": 3
    },
    {
      "skill": "Laboratory Information System (LIS) management",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors and 3+ years’ experience in a chemical, biological or clinical laboratory science or medical technology field"
    },
    {
      "credential": "ASCP Certification Required"
    },
    {
      "credential": "Florida State Supervisor License required"
    }
  ]
}