{
  "meta": [
    {
      "job_title": "Enterprise Information Security Architect",
      "job_category": "Information Technology",
      "job_class": "Architect",
      "sector": "Information Technology",
      "salary": 48000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Information Security",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Enterprise Architecture",
      "experience": 5
    },
    {
      "skill": "Compliance",
      "experience": 5
    },
    {
      "skill": "Network Design",
      "experience": 5
    },
    {
      "skill": "Security Event Investigation",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Analytical Thinking",
      "experience": 5
    },
    {
      "skill": "Cloud Services",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Policy Creation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Set strategic direction for information security initiatives, processes, and standards."
    },
    {
      "duty": "Establish enterprise architecture standards, processes, and procedures based on industry standards."
    },
    {
      "duty": "Research, evaluate, and drive next-generation security technologies to keep supported enterprise security architecture ahead of the curve."
    },
    {
      "duty": "Build relationships and collaborate with other Enterprise Architects and functional areas across the organization."
    },
    {
      "duty": "Coordinate the creation and annual review for unit-level disaster recovery and business continuity plans."
    },
    {
      "duty": "Create, refine, deliver, and evangelize information security standards throughout the enterprise."
    },
    {
      "duty": "Autonomously prepare reports and audit findings remediation plans in response to Internal audits, penetration tests, or vulnerability scans."
    },
    {
      "duty": "Participate in security event investigations producing Incident Response Documentation and ensure corrective actions are implemented."
    },
    {
      "duty": "Monitor changes in the legislative, regulatory, and contractual landscape to ensure that the information security program is always at least one step ahead."
    },
    {
      "duty": "Maintain confidentiality at all times."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Information Technology, Computer Science, Informatics, Computer Programming, Information Assurance and Compliance, or a related field of IT-related work experience in large, complex technical environments."
    },
    {
      "credential": "Demonstrable experience designing or managing an Enterprise IT security and compliance program."
    },
    {
      "credential": "Industry certifications, such as Certified Information Systems Security Professional (CISSP), Certified Information Systems Auditor (CISA), GIAC Security Essentials (GSEC), Certified Information Security Manager (CISM), etc."
    },
    {
      "credential": "Demonstrable experience in policy and standard creation and acceptance."
    }
  ]
}