{
  "meta": [
    {
      "job_title": "Process Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Gas and Oil Engineering",
      "experience": 5
    },
    {
      "skill": "Facility Upgrades",
      "experience": 5
    },
    {
      "skill": "Process Modeling",
      "experience": 5
    },
    {
      "skill": "Design Specifications",
      "experience": 5
    },
    {
      "skill": "Relief Systems",
      "experience": 5
    },
    {
      "skill": "Gas Codes and Regulations",
      "experience": 5
    },
    {
      "skill": "CAD",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Process Modeling Software",
      "experience": 5
    },
    {
      "skill": "Field Investigation",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performing detailed engineering of pipeline facilities, regulation and meter runs, pig launchers, interconnects, relief systems, measurement systems, compressor station, gas conditioning facilities, gas processing, upstream production facilities, etc."
    },
    {
      "duty": "Sizing calculations for relief valves, control valves, separators, compressors, and other equipment required for projects."
    },
    {
      "duty": "Support the development of equipment specifications such as compressors, pumps, separators, process skids, etc."
    },
    {
      "duty": "Developing process models for facility projects and managing P&ID sets."
    },
    {
      "duty": "Participating in field/site walks and coordinating field investigation work for engineering and construction."
    },
    {
      "duty": "Preparing project funding documents, including cost estimates, equipment bid summaries, and authorization requests."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. in Chemical, Mechanical, or Petroleum Engineering with coursework related to the job responsibilities."
    },
    {
      "credential": "Minimum of 3 years of experience in the oil, gas, and utility sectors including project engineering and design or operating company experience."
    },
    {
      "credential": "Engineering Intern (EI) certification or the ability to obtain within 1 year of hire."
    },
    {
      "credential": "Familiarity with gas codes and regulations, CAD, Microsoft Office, and Process Modeling Software."
    },
    {
      "credential": "Legal authorization to work in the United States without the need for sponsorship."
    },
    {
      "credential": "Preferred: 4 - 8 years of relevant work experience, consulting engineering, plant-based environment."
    },
    {
      "credential": "Preferred: Strong client relationships and the ability to develop and foster ongoing relationships."
    }
  ]
}