{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Customer Service",
      "salary": 20,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Receives, responds, and returns inbound phone calls."
    },
    {
      "duty": "Screens incoming telephone calls to determine customer needs and direct clinical situation to appropriate clinical staff/program in a professional and timely manner."
    },
    {
      "duty": "Makes outbound calls to members for problem resolution and in structured telephone outreach programs."
    },
    {
      "duty": "Obtains demographic and other relevant data and enters it in a computerized customer care database."
    },
    {
      "duty": "Responds to and resolves non-clinical problems, complaints, and issues in an accurate, effective, and timely manner."
    },
    {
      "duty": "Establishes effective working relationships and communications with customers, physicians, hospitals, and internal contacts to ensure problem resolution."
    },
    {
      "duty": "Fulfills requests for information/literature as needed and relays requests to departments or programs."
    },
    {
      "duty": "Makes periodic follow up calls to ensure receipt of information/literature, answer additional questions and/or concerns, and assist in the decision-making process."
    },
    {
      "duty": "Researches and responds to inquiries or problems and obtains answers in a timely manner and follows up with the customer or client to ensure satisfaction of service within the prescribed time in adherence to the departmental prescribed period of time."
    },
    {
      "duty": "Maintains correspondence (e.g., mail, written correspondence, faxes, etc.) and coordinates mailings to clients and providers, as needed."
    },
    {
      "duty": "Acts as Customer Care Center liaison to VNS Health staff, departments, and programs to troubleshoot problems and ensure that on-call information is accurate and updated."
    },
    {
      "duty": "Participates in telephone outreach programs that promote member retention, improved quality, and updates records on activities for Agency’s management for review."
    },
    {
      "duty": "Assists with planning and implementation of customer service and telephone responsiveness activities and projects."
    },
    {
      "duty": "Analyzes, organizes, and maintains records of customer service logs, performance reports, and other data, as needed by management for review."
    },
    {
      "duty": "Participates in special projects and performs other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Problem Resolution",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Teamwork",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or the equivalent required Bachelor's Degree in Communications, English, Public Relations (equivalent work experience) or related field, or the equivalent preferred"
    }
  ]
}