{
  "meta": [
    {
      "job_title": "Summer Intern",
      "job_category": "Internship",
      "job_class": "Intern",
      "sector": "R&D",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Chemistry",
      "experience": 2
    },
    {
      "skill": "Polymer Chemistry",
      "experience": 2
    },
    {
      "skill": "Analytical Chemistry",
      "experience": 2
    },
    {
      "skill": "Laboratory Studies",
      "experience": 2
    },
    {
      "skill": "Data Organization",
      "experience": 2
    },
    {
      "skill": "Formulations",
      "experience": 2
    },
    {
      "skill": "Lens Fabrication",
      "experience": 2
    },
    {
      "skill": "Vision Science",
      "experience": 2
    },
    {
      "skill": "Experimental Design",
      "experience": 2
    },
    {
      "skill": "Report Writing",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct hands-on experience with structure-property relationship studies of materials, advanced imaging technologies, chemical/biological characterization, solvent extraction, chromatographic separation, spectral interpretation, and structural elucidation."
    },
    {
      "duty": "Independently develop new analytical methods, designs, and executes complex, non-standard laboratory studies to solve technical challenges and provide scientific solutions."
    },
    {
      "duty": "Thoroughly and clearly document experiments and prepare high-quality Technical Documents."
    },
    {
      "duty": "Interact with lens designers, contact lens metrology leads, Clinical Project leads, and Vision/Data Scientists. Conduct lab work, data organization, and studies. Prepare and modify formulations, lens fabrication, and characterization."
    },
    {
      "duty": "Search literature, design & conduct experiments to test ideas. Discuss and write technical reports, present results."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Enrolled in an accredited university or college for at least one semester prior to the internship, pursuing at least a Bachelors level degree in Chemistry, Polymer Chemistry, Analytical Chemistry, Organic Chemistry, Materials Science, Chemical Engineering, Biochemistry, Biology, Biotechnology, Process Engineering, Ocular Cell Biology, or related major."
    }
  ]
}