{
  "meta": [
    {
      "job_title": "Chief Financial Officer",
      "job_category": "Finance",
      "job_class": "Executive",
      "sector": "Finance",
      "salary": 250000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Financial Forecasting",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Financial Reporting",
      "experience": 10
    },
    {
      "skill": "Relationship Building",
      "experience": 10
    },
    {
      "skill": "Compliance Management",
      "experience": 10
    },
    {
      "skill": "Negotiation",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Strategic planning and implementation of finance activities including business planning, budgeting, forecasting, risk and governance, negotiations, and overseeing HR, IT, Tax & Treasury, and Legal."
    },
    {
      "duty": "Interacting with senior stakeholders and providing leadership, direction, and management of the finance and accounting team, providing strategic recommendations to the COO, CEO/President, and members of the executive management team."
    },
    {
      "duty": "Managing the processes for financial forecasting and budgets, and overseeing the preparation of all financial reporting including parent reporting, advising on long-term business and financial planning."
    },
    {
      "duty": "Providing commercial insight and leadership across the business in order to exceed business plan targets, ensuring the risk and compliance management framework is embedded and operational for the Group."
    },
    {
      "duty": "Establishing and developing relations with senior management and external partners and stakeholders, reviewing all formal Finance, HR, IT, and Legal related procedures including MSAs, RFPs, NDAs, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Accounting, Finance, or Economics. An MBA and/or CPA is highly desirable."
    },
    {
      "credential": "15+ years' experience in accounting/finance with 5+ years in senior/executive leadership roles. Public Accounting background (Big 4 / Top 10 CPA firm) coupled with Manufacturing or related industry highly preferred to required."
    },
    {
      "credential": "Strong knowledge of US GAAP, IFRS, and JSOX, Financial Reporting a plus."
    },
    {
      "credential": "Proven leadership and management experience are essential – with examples of when you have demonstrated excellence in a fast-paced and tenured environment."
    },
    {
      "credential": "Excellent interpersonal and communication skills with the executive presence to work with senior management, parent, and external stakeholders. Ability to lead and engage with staff at all levels of the organization and exercise sound judgement."
    }
  ]
}