{
  "meta": [
    {
      "job_title": "Real Estate Investment Analyst",
      "job_category": "Real Estate",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 92500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Real Estate Investment Analysis",
      "experience": 2
    },
    {
      "skill": "Financial Modeling",
      "experience": 3
    },
    {
      "skill": "Market Analysis",
      "experience": 3
    },
    {
      "skill": "Valuation",
      "experience": 3
    },
    {
      "skill": "Microsoft Excel",
      "experience": 3
    },
    {
      "skill": "Argus",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support two Transaction Officers on sourcing, underwriting and closing commercial real estate investments across the East Coast."
    },
    {
      "duty": "Provide underwriting support for the Transaction officers by reviewing real estate financial statements, rent rolls, and other reports and preparing valuation models using Microsoft Excel and Argus to identify new transaction opportunities."
    },
    {
      "duty": "Coordinate all aspects of transaction execution and deal closing process, engaging with all key business lines at the firm including Portfolio Management, Asset Management, Risk Management, Research & Strategy and Client Relations, as well as a team of external consultants and service providers."
    },
    {
      "duty": "Prepare Investment Committee presentations and other critical documents such as Confidentiality Agreements, Letter of Interest, Development Term Sheets and others."
    },
    {
      "duty": "Lead various data analytics projects used by the Acquisitions team."
    },
    {
      "duty": "Create and maintain market contacts and relationships across the real estate industry to help source new acquisition opportunities with brokers, owners, consultants, partners and developers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 140,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors degree. Graduate degrees or Real Estate related Graduate level coursework a plus"
    }
  ]
}