{
  "meta": [
    {
      "job_title": "Assurance Manager",
      "job_category": "Assurance",
      "job_class": "Manager",
      "sector": "Insurance",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "External Audit",
      "experience": 5
    },
    {
      "skill": "Corporate Governance",
      "experience": 5
    },
    {
      "skill": "Accounting Principles",
      "experience": 5
    },
    {
      "skill": "Auditing Standards",
      "experience": 5
    },
    {
      "skill": "Financial Reporting Standards",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Global Acumen",
      "experience": 5
    },
    {
      "skill": "Business Acumen",
      "experience": 5
    },
    {
      "skill": "Technical Capabilities",
      "experience": 5
    },
    {
      "skill": "Automation & Digitization",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide a range of Assurance services and business advice to clients from small, fast growing clients to large entities."
    },
    {
      "duty": "Use the latest technology to reduce manual testing and focus on valuable areas of client service and enhancing corporate governance and reliability of clients’ information."
    },
    {
      "duty": "Work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution."
    },
    {
      "duty": "Coach others, recognize their strengths, and encourage them to take ownership of their personal development."
    },
    {
      "duty": "Develop a point of view on key global trends, and how they impact clients."
    },
    {
      "duty": "Use data and insights to inform conclusions and support decision-making."
    },
    {
      "duty": "Maintain a fresh perspective on global and cross-cultural issues, and sow cultural dexterity by modifying behavior to the environment."
    },
    {
      "duty": "Innovate through new and existing technologies, experiment with digitization solutions, work with large, complex data sets to build models and leverage data visualization tools to provide insights to clients."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor Degree in Accounting (CPA License required); International hires are required to hold the equivalent accounting certification in the selected individual's home country."
    },
    {
      "credential": "CPA license in work office state (preferred)"
    }
  ]
}