{
  "meta": [
    {
      "job_title": "Head of Core Platforms",
      "job_category": "Technology",
      "job_class": "Executive",
      "sector": "Management",
      "salary": 229550,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "DevOps",
      "experience": 10
    },
    {
      "skill": "Site Reliability Engineering",
      "experience": 10
    },
    {
      "skill": "Release Management",
      "experience": 10
    },
    {
      "skill": "Payment and Banking Systems",
      "experience": 10
    },
    {
      "skill": "IT Infrastructure Management",
      "experience": 10
    },
    {
      "skill": "Change Management",
      "experience": 10
    },
    {
      "skill": "Disaster Recovery/Business Continuity Planning",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and execute a comprehensive strategy for core platforms, card issuing, payment systems, and cloud operations aligned with company objectives and market trends."
    },
    {
      "duty": "Provide strategic direction and guidance to Core Platforms teams, ensuring alignment with business goals and customer needs."
    },
    {
      "duty": "Enhance the operating model to maintain production environment to quality standards."
    },
    {
      "duty": "Foster a culture of innovation, collaboration, and continuous improvement within the team."
    },
    {
      "duty": "Manage risk and mitigate issues that could affect release reliability and stability."
    },
    {
      "duty": "Oversee release readiness reviews and go/no-go meetings as required."
    },
    {
      "duty": "Investigate, escalate, and drive solutions for emergent or complex technical issues."
    },
    {
      "duty": "Ensure adherence to pertinent regulatory requirements, security, and departmental policies and practices."
    },
    {
      "duty": "Build and foster effective relationships between the business, Technology, and external service providers."
    },
    {
      "duty": "People management responsibilities including coaching and mentoring, professional development, problem-solving, evaluation, performance management, budgeting, and reporting."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or a related field (Master's degree preferred)"
    }
  ]
}