{
  "meta": [
    {
      "job_title": "Electrical Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Energy",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Electrical Systems Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Engineering Theory",
      "experience": 5
    },
    {
      "skill": "Field Test Equipment",
      "experience": 5
    },
    {
      "skill": "Regulations and Codes",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop studies, plans, criteria, specifications, calculations, evaluations, design documents, performance assessments, integrated systems analysis, cost estimates, budgets, associated with the planning, design, licensing, construction, commissioning, operation, and maintenance of Exelon's electric generation, transmission, distribution, gas, and telecommunication facilities/systems."
    },
    {
      "duty": "Review financial data from budget and actual costs of projects."
    },
    {
      "duty": "Perform engineering tasks associated with critical engineering projects or a number of small projects with many complex features."
    },
    {
      "duty": "Serve as an expert for organization in a specific area or responsibility that may include the delivery of classroom training and/or OJT/OJE."
    },
    {
      "duty": "Influence project decisions having a moderate impact on the company that may include leading employees or contractors in the commissioning of electrical systems and equipment to be placed On System."
    },
    {
      "duty": "Apply technical knowledge to help promote a safe work environment and to enhance customer satisfaction."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science degree in Engineering or Licensed Professional Engineer. Master's degree in Engineering is preferred."
    }
  ]
}