{
  "meta": [
    {
      "job_title": "HR Business Partner II",
      "job_category": "Human Resources",
      "job_class": "Business Partner",
      "sector": "Human Resources",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and develop a team of HR professionals in a high growth, rapidly changing environment"
    },
    {
      "duty": "Strong drive to create a positive work environment"
    },
    {
      "duty": "Work in an environment which demands strong deliverables along with the ability to identify problems and drive appropriate solutions"
    },
    {
      "duty": "Maintain effective internal and external customer service focus"
    },
    {
      "duty": "Understand business goals and recommend new approaches, policies and procedures to effect continual improvements in business objectives, productivity and development of HR within the company"
    },
    {
      "duty": "Understand the entire talent system and each stage of the employee life-cycle and applies that understanding to craft integrated solutions that are thoughtful and reinforced by upstream and downstream talent programs"
    },
    {
      "duty": "Interface at all levels of the organization"
    },
    {
      "duty": "Operate with autonomy and discretion"
    },
    {
      "duty": "Successfully monitor the \"pulse\" of the employees to ensure a high level of employee engagement"
    },
    {
      "duty": "Support a 24/7 environment that has multiple shifts and a significant staffing ramp during our seasonal peak in the fourth quarter. Must be willing to work a flexible schedule that includes nights, weekends and holidays"
    },
    {
      "duty": "Success in this role will require influential partnership with middle and senior management within the organization to execute the HR strategies that foster organizational and people effectiveness. The individual in this role must understand business priorities and translate them into an HR agenda that supports the business as it grows."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree from accredited university 3+ years of human resources generalist experience"
    }
  ]
}