{
  "meta": [
    {
      "job_title": "Merchandiser",
      "job_category": "Sales",
      "job_class": "Entry Level",
      "sector": "Sales",
      "salary": 25000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Present products in a way that attracts the attention of consumers at customer retail locations."
    },
    {
      "duty": "Service and maintain multiple bulk accounts by merchandising approved products and packages using safe handling techniques and following all quality guidelines."
    },
    {
      "duty": "Ability to follow plan sets, planograms, and communicate to store management and cross-functional personnel."
    },
    {
      "duty": "Fills, merchandises, and rotates products on display and the shelf according to procedures and special programs."
    },
    {
      "duty": "Physically moves the product from the backroom and places it on display."
    },
    {
      "duty": "Creates and distributes point of sale materials on display and shelve where permitted."
    },
    {
      "duty": "Organizes and maintains back room by stacking and arranging product by package and flavor, arranging the return of empty pallets and shells, damaged and out of date product to the branch."
    },
    {
      "duty": "Fosters business relationship with store personnel through routine follow-up on requests, proactive pricing, special programs, new opportunities, and upcoming activities discussions."
    }
  ],
  "skills": [
    {
      "skill": "Effective Communication Skills",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 1
    },
    {
      "skill": "Physical Endurance (lifting 50 lbs. repetitively)",
      "experience": 1
    },
    {
      "skill": "Critical Thinking",
      "experience": 1
    },
    {
      "skill": "Organization and Maintenance",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Valid in-state driver’s license"
    },
    {
      "credential": "Proof of insurance policy to verify current coverage of liability and property damage at no less than $50,000 per person/ $100,000 accident insurance per occurrence/ $50,000 property damage and $500 or less deductible effective from the first day of employment."
    }
  ]
}