{
  "meta": [
    {
      "job_title": "Search E-Commerce Business Lead",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 280000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "NLP",
      "experience": 7
    },
    {
      "skill": "Ranking",
      "experience": 7
    },
    {
      "skill": "Ads",
      "experience": 7
    },
    {
      "skill": "Search Engine",
      "experience": 7
    },
    {
      "skill": "Recommendation Systems",
      "experience": 7
    },
    {
      "skill": "Data Structure and Algorithms",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the whole TikTok Search E-commerce business in the US, or one or more of the following core directions: • Improve the basic search quality and user experience: Optimize query analysis and text relevance matching. Understand e-commerce video content and implement multi-modal matching. Improve users' perception of product authority, and deeply participate in the design and implementation of core search products. Comprehensively improve the end-to-end shopping experience from browsing to after-sales.• Design and implement the end-to-end ranking system (recall, pre-rank, rank and mixed rank): Use massive behavioral data to deeply model users' personalized shopping interests. Improve the shopping conversion efficiency for merchandise, video and live stream to promote GMV growth.• Promote the healthy development of the ecosystem: From the perspective of the industry and merchant/seller, solve challenging problems such as supply and demand matching, business cold start, and sustainable business growth, etc. Think, analyze and adjust the evolution of the system to achieve long-term and sustainable growth of GMV."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}