{
  "meta": [
    {
      "job_title": "Window & Door Installation Field Specialist",
      "job_category": "Construction & Installation",
      "job_class": "Specialist",
      "sector": "Construction",
      "salary": 32000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Installation Services",
      "experience": 3
    },
    {
      "skill": "Quality Control",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Attention to Detail",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform services not provided by a subcontractor and ensure installations are completed per Pella Manufacturing Installation Instructions."
    },
    {
      "duty": "Assess quality of sub-contracted installations and give feedback to management as needed."
    },
    {
      "duty": "Assist with initial sub-contractor sourcing and assimilation of subcontractors."
    },
    {
      "duty": "Communicate effectively with customers and serve as a reputable Pella representative on all jobsites."
    },
    {
      "duty": "Responsible for the timely execution of the Order Verification process and setting realistic expectations with homeowners."
    },
    {
      "duty": "Perform job site inspection to assess home for water intrusion, rot, mold, and other issues."
    },
    {
      "duty": "Ensure seamless order fulfillment and cost containment working with both the sales team and installers."
    },
    {
      "duty": "Deliver missing items needed for installations to job sites to increase first-time completion rate as needed."
    },
    {
      "duty": "Provide training as needed to Retail Sales Consultants."
    },
    {
      "duty": "Perform installation recovery work following installations."
    },
    {
      "duty": "Maintain assigned vehicle and use, maintain, and store company-provided tools appropriately."
    },
    {
      "duty": "Meet company safety requirements and report any safety issues to the manager."
    },
    {
      "duty": "Product installation of non-cost-effective jobs not accepted by 3rd party subcontractors are assigned based on install skill set."
    }
  ],
  "subjective_elements": [
    {}
  ],
  "education_certification": []
}