{
  "meta": [
    {
      "job_title": "Senior Systems Analyst",
      "job_category": "Information Technology",
      "job_class": "Analyst",
      "sector": "Information Technology",
      "salary": 98000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "System Analysis",
      "experience": 5
    },
    {
      "skill": "Technology Solutions",
      "experience": 5
    },
    {
      "skill": "Information Security",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Software Integration",
      "experience": 5
    },
    {
      "skill": "Application Design",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Systems Performance",
      "experience": 5
    },
    {
      "skill": "User Training",
      "experience": 5
    },
    {
      "skill": ".NET Framework",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Devise strategic and tactical solutions to meet overall business objectives in conjunction with Information Technology Managers."
    },
    {
      "duty": "Recommend technology solutions considering budget, business need, internal capabilities, and strategic direction."
    },
    {
      "duty": "Participate in projects needing new application, modification to existing applications, application updates, testing, and software integration."
    },
    {
      "duty": "Design or review new and existing application systems, perform complex systems analysis, and make recommendations for integration or modifications as required."
    },
    {
      "duty": "Integrate computer systems with different operating systems and file formats, write interface programs when necessary."
    },
    {
      "duty": "Ensure coding standards are consistent among internally developed applications and define application program interfaces to the database."
    },
    {
      "duty": "Write, debug, document, and implement solutions to complex problems using the appropriate application systems access and database tools."
    },
    {
      "duty": "Work with vendors and staff to document and specify software functional requirements, establish policies and procedures for loading application systems, and maintain security and integrity controls."
    },
    {
      "duty": "Review contracts, monitor systems performance, and recommend methods for improving efficiency through system and application design."
    },
    {
      "duty": "Attend professional opportunities to maintain expertise and provide or participate in user training."
    },
    {
      "duty": "Perform other related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Computer Science, Management Information Systems, Computer Engineering, or a related field"
    }
  ]
}