{
  "meta": [
    {
      "job_title": "Global Talent Manager",
      "job_category": "HR",
      "job_class": "Manager",
      "sector": "HR",
      "salary": 96000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide day-to-day global support of the LMS to manage learning activities conducted or maintained in the system."
    },
    {
      "duty": "Maintains and supports our Global Compliance Training program by acting as a liaison with our Corporate Legal Department and ensures that all content is maintained, assigned and reporting is monitored on a regular basis"
    },
    {
      "duty": "Provides ESG reporting data as needed for annual report and audit purposes."
    },
    {
      "duty": "Ensures that our Global Employee Development goals are met on an annual basis through communication, training, reporting and follow up as needed to ensure 100% compliance."
    },
    {
      "duty": "Acts as business liaison between HRIS and Talent Management to stay abreast of new functionality in the system and provide recommendations for adopting new functionality to streamline and improve results/impact."
    },
    {
      "duty": "Utilizing data from our LMS, analyze and provide meaningful reporting metrics."
    },
    {
      "duty": "Creates training products and delivers the training to end users of the SAP SuccessFactors System including Employee Profile/Data, Talent Acquisition, Onboarding, Performance Evaluation, Learning Management System (LMS), Offboarding, and Reporting."
    },
    {
      "duty": "Understands the HR Data Landscape and the source and data flows to and from our various HR Systems."
    },
    {
      "duty": "Responds to LMS-related questions on a regular basis."
    },
    {
      "duty": "Research, design, develop, and edit instruction manuals and facilitator guide support materials such as: quick reference guides, job aids, simulations, and assessments."
    },
    {
      "duty": "Active member of multiple conference/event planning committees. (Values Recognition, HR Conference)"
    },
    {
      "duty": "Create onboarding orientation from design to implementation for Salaried Employees"
    },
    {
      "duty": "Research, design and develop improvements in our Hiring Process to promote diversity in our candidate pool."
    },
    {
      "duty": "Routinely provide support for other process improvement ideas for Talent Development."
    },
    {
      "duty": "Stay abreast of new functionality in the system and provide recommendations for adopting new functionality to streamline and improve results/impact."
    },
    {
      "duty": "Work collaboratively with the field to drive an effective talent strategy. Interpret strategy results and create proactive action plans."
    },
    {
      "duty": "Provide support for vendor/training product sourcing, evaluation, and selection."
    },
    {
      "duty": "Assist in the identification and implementation of new talent management solutions for a global audience."
    },
    {
      "duty": "Provides data analytics to Talent Management including: Global Course Status Reports, Global Training Metrics, Hourly standardized training status by location, Global Development Plan Status updates, Bi-annual Talent Acquisition KPI metrics"
    }
  ],
  "skills": [
    {
      "skill": "Talent Management",
      "experience": 5
    },
    {
      "skill": "Learning Management System (LMS)",
      "experience": 5
    },
    {
      "skill": "SAP SuccessFactors",
      "experience": 3
    },
    {
      "skill": "HR Data Analysis",
      "experience": 5
    },
    {
      "skill": "Instructional Design",
      "experience": 5
    },
    {
      "skill": "Onboarding",
      "experience": 5
    },
    {
      "skill": "Training Delivery",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 3
    },
    {
      "skill": "Diversity and Inclusion",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Talent Strategy",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in HR, Org Development, Business or another related discipline is required (Master's preferred)"
    },
    {
      "credential": "PHR/SPHR certification is preferred"
    }
  ]
}