{
  "meta": [
    {
      "job_title": "Senior Accountant",
      "job_category": "Accounting",
      "job_class": "Accountant",
      "sector": "Accounting",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "CPA",
      "experience": 3
    },
    {
      "skill": "Public Accounting",
      "experience": 3
    },
    {
      "skill": "Internal Controls",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Facilitates and completes monthly closing procedures, including journal entries and general ledger reviews."
    },
    {
      "duty": "Performs a variety of general to complex accounting and financial analysis functions in support of departmental duties."
    },
    {
      "duty": "Coach and mentor less experienced accounting staff and help them resolve problems."
    },
    {
      "duty": "Assist in developing streamlined internal control processes and serve as a liaison with teams outside of accounting to promote teamwork and collaboration across the organization."
    },
    {
      "duty": "Coordinating deliverables and acting as a primary contact for the annual external audit."
    },
    {
      "duty": "Compile information and assist in preparation for federal income tax returns, state income tax returns and related schedules."
    },
    {
      "duty": "Research and provide accounting guidance and support functional or operational areas of the company."
    },
    {
      "duty": "Drive process and reporting improvements and standardization efforts while maintaining a high level of accuracy."
    },
    {
      "duty": "Handle special projects, taking full responsibility for their successful and timely completion."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting required. 3+ years of progressive responsibility. Licensed CPA or successfully working toward obtaining CPA license. Public accounting experience a plus."
    }
  ]
}