{
  "meta": [
    {
      "job_title": "Planner, Strategy and Digital Investment",
      "job_category": "Media Planning",
      "job_class": "Planner",
      "sector": "Advertising",
      "salary": 62000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Media Planning",
      "experience": 3
    },
    {
      "skill": "Digital RFPs",
      "experience": 2
    },
    {
      "skill": "Microsoft Suite",
      "experience": 3
    },
    {
      "skill": "Prisma",
      "experience": 2
    },
    {
      "skill": "Competitive Analysis",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Client Communication",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute strategic approach and tactical plans across multiple brands within a CPG client."
    },
    {
      "duty": "Assist in development of digital RFPs and brief vendors."
    },
    {
      "duty": "Create and review plans based on a brief and ensure planned metrics are accurate."
    },
    {
      "duty": "Present media plans and provide plan maintenance including objectives/strategies and updates."
    },
    {
      "duty": "Maintain stewardship of competitive analysis using Strategy software to assess media schedules of competitors, interpret data and draw conclusions."
    },
    {
      "duty": "Prepare and update flowcharts and budget trackers."
    },
    {
      "duty": "Prepare and issue buying specs and guidelines to buyers including delivery goals and budgets for use in negotiations."
    },
    {
      "duty": "Review and verify media buys to ensure proper execution."
    },
    {
      "duty": "Contribute to billing reconciliation process and negotiate invoice discrepancies with partners."
    },
    {
      "duty": "Lead and guide marketing specialists in the development, execution, and stewardship of media plans for client’s business."
    },
    {
      "duty": "Measure and report on the performance of media campaigns, using data-driven insights to continuously improve strategies."
    },
    {
      "duty": "Present to clients, maintain client correspondence and internal documentation."
    },
    {
      "duty": "Manage projects, resources, stakeholders, and participants."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 65,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "B.A. or B.S., preferably in Marketing, Advertising, or related field"
    }
  ]
}