{
  "meta": [
    {
      "job_title": "Commercial Banking Portfolio Manager",
      "job_category": "Banking",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for performing Asset Based Lines of Credit Monitoring to include verification of Borrowing Base Certificates, setting line availability, preparing periodic Variance Reports and review of Accounts Receivable & Inventory Reports."
    },
    {
      "duty": "May accompany Loan Officers on visit with clients to establish rapport and understand clients business and commercial relationship with the bank."
    },
    {
      "duty": "Manage sales activities of assigned portfolio including facilitating new loan requests."
    },
    {
      "duty": "Assist the relationship officers in building effective relationships and trust with clients and/or potential clients by listening to their needs and using that information to understand possible changing situations, needs and desired benefits and educating them about the bank products and services that are most appropriate for their situation."
    },
    {
      "duty": "Prepare Annual Financial Reviews (AFU's) for assigned portfolio on a regular basis."
    },
    {
      "duty": "Review and process documentation for loan agreements, borrowing arrangements, renewals and restructures as approved by management."
    },
    {
      "duty": "Ensure customer's compliance with financial reporting and covenant requirements."
    },
    {
      "duty": "Order any revision loan documents, appraisal, and environmental documents as determined to complete the documentation."
    },
    {
      "duty": "Act as a liaison with various units responsible for providing service to the commercial customer including but not limited to financial analysis, statements, etc. and ensure respective databases are accurate and up to date with customer information."
    },
    {
      "duty": "Compile and analyze data and generate management reports with recommendations as needed."
    },
    {
      "duty": "Arrange closings of renewals and restructures."
    },
    {
      "duty": "Coordinate with management and internal legal counsel to ensure that legal counsel is assigned to cases where representation is necessary."
    },
    {
      "duty": "May research, investigate and resolve customer discrepancies, complaints and payments."
    },
    {
      "duty": "Perform regular visits to customers to ensure Cash Management Services and needs are met. May perform cross-selling of Cash Management products to customer based on analysis of financial statements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required. Minimum of 2.5 to 3 years related banking experience."
    },
    {
      "credential": "Complete knowledge of bank products/services as they relate to loan administration."
    },
    {
      "credential": "Excellent written communication and demonstrated attention to detail with a strong aptitude for performing complex analysis on large amounts of data from multiple sources."
    },
    {
      "credential": "Strong computer experience in Microsoft Word and Excel."
    },
    {
      "credential": "Some travel required (20-25%)."
    }
  ]
}