{
  "meta": [
    {
      "job_title": "Cost Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Mining & Metals",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cost Engineering",
      "experience": 5
    },
    {
      "skill": "Schedule Management",
      "experience": 5
    },
    {
      "skill": "Technical Understanding",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Project Controls",
      "experience": 5
    },
    {
      "skill": "Microsoft Suite",
      "experience": 5
    },
    {
      "skill": "Estimating",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops cost/schedule data for proposals or contract negotiations, as directed."
    },
    {
      "duty": "Collects or receives drawings and other scope definition documentation that applies to a discipline or other specialty. Identifies areas of incomplete design definition and develops scope assumptions for approval."
    },
    {
      "duty": "Assists in developing specific codes of accounts, as directed."
    },
    {
      "duty": "Performs quantity takeoffs or quantity estimates using parameters for all commodities within a discipline or other specialty from engineering and construction drawings."
    },
    {
      "duty": "Assembles and compiles estimate data and prepares specific budget categories in accordance with prescribed standards and procedures."
    },
    {
      "duty": "Assists in investigating requirements for estimating and/or cost control data."
    },
    {
      "duty": "Identifies scope associated with schedule activities, as directed."
    },
    {
      "duty": "Determines work sequences for a specific discipline or specialty. Identifies critical activities within a discipline or specialty relative to interfacing with other disciplines or supporting overall project schedules."
    },
    {
      "duty": "Identifies activities that have a critical or potential impact on schedule."
    },
    {
      "duty": "Works with discipline of specialty groups to develop cost related study support data."
    },
    {
      "duty": "Reports schedule deviations for an assigned discipline or specialty and recommends corrective action/work around solutions for project considerations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering, Construction Management, or a related field (Master's preferred)"
    }
  ]
}