{
  "meta": [
    {
      "job_title": "Client Operations Associate",
      "job_category": "Client Operations",
      "job_class": "Associate",
      "sector": "Financial Management",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Client Operations",
      "experience": 5
    },
    {
      "skill": "Client Service",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Verbal/Written Communication",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "CRM",
      "experience": 5
    },
    {
      "skill": "Investment Knowledge",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide administrative support to Client Advisory Team through preparation of custodian paperwork ranging from: opening client accounts, facilitating IRA distributions, setting up power of attorney, wiring money etc."
    },
    {
      "duty": "Draft letters of instruction, complete account applications, manage agreements and fund subscription documents, organize supporting documentation, and follow the process through in tandem with the firm’s Capital Markets Group."
    },
    {
      "duty": "Act as information provider to accountants, banks, investment managers and other professionals also supporting clients."
    },
    {
      "duty": "Serve as additional support in the quarterly reporting process, specifically in reconciling and otherwise reviewing client reports."
    },
    {
      "duty": "Act as the back-up for the Front Desk Associate performing various tasks."
    },
    {
      "duty": "Handle all incoming and outgoing mail documents packages and faxes, including scanning all client mail for electronic distribution, inputting into Datafaction, and coding AP mail in AgilLink, ensuring timely and accurate internal distribution."
    },
    {
      "duty": "Ensure that the office break room is clean and neat with adequate supplies and assist the accounting department with concierge support and preparing tax returns."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Financial Management, Business, or a related field"
    }
  ]
}