{
  "meta": [
    {
      "job_title": "Senior Research Scientist",
      "job_category": "Science",
      "job_class": "Scientist",
      "sector": "Research and Development",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Semiconductor Device Research",
      "experience": 5
    },
    {
      "skill": "Grant Proposal Writing",
      "experience": 3
    },
    {
      "skill": "Experimental Design",
      "experience": 5
    },
    {
      "skill": "Technical Project Management",
      "experience": 5
    },
    {
      "skill": "Materials Science",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Entrepreneurial Mindset",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build and organize process and material development team which is tasked with demonstrating our aligned CNT method."
    },
    {
      "duty": "Oversee fabrication of samples for internal and collaboration/customer testing."
    },
    {
      "duty": "Establish and oversee interactions with outside entities as we work to validate our product."
    },
    {
      "duty": "Prepare grant proposals for funding on key initiatives."
    },
    {
      "duty": "Understand, interpret, and act on analytical testing of samples."
    },
    {
      "duty": "Prepare summary reports on lab samples and results demonstrating a full understanding of semiconducting device fabrication and testing."
    },
    {
      "duty": "Oversee test equipment operation with the ability to interpret and validate results."
    },
    {
      "duty": "Draw concise, logical, written conclusions from experiments based on data analysis and develop a research plan to address remaining challenges and needs."
    },
    {
      "duty": "Compile, tabulate, and curate materials parameters and key data using company data management system once implemented."
    },
    {
      "duty": "Interact with the technical team daily to ensure statement of work tasks are completed within the agreed-upon timeframe."
    },
    {
      "duty": "Represent the company to external stakeholders and the board of directors in assigned technical matters of high significance."
    },
    {
      "duty": "Develop, implement and adhere to SixLine’s EHS policies and procedures, participate in EHS programs and conduct work activities in a safe and environmentally sound manner."
    },
    {
      "duty": "Research and develop concepts in the field of semiconductors and material science."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 60,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "PhD in Engineering or Chemistry required; engineering major in Chemical, Materials, Mechanical, or Electrical Engineering preferred."
    }
  ]
}