{
  "meta": [
    {
      "job_title": "Senior Pipe Stress Engineer",
      "job_category": "Engineering",
      "job_class": "Senior Engineer",
      "sector": "Engineering",
      "salary": 125000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Pipe Stress Engineering",
      "experience": 15
    },
    {
      "skill": "ASME Codes",
      "experience": 15
    },
    {
      "skill": "CAESAR II",
      "experience": 15
    },
    {
      "skill": "FEA Evaluation",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 15
    },
    {
      "skill": "Offshore Piping Design",
      "experience": 15
    },
    {
      "skill": "Navis Works",
      "experience": 10
    },
    {
      "skill": "AutoCAD",
      "experience": 10
    },
    {
      "skill": "Bluebeam",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct pipe stress engineering of piping systems as per ASME Codes using Caesar II software program."
    },
    {
      "duty": "Coordinate the design of exclusive pipe supports as needed."
    },
    {
      "duty": "Perform static analysis using CAESAR II for various load cases and vibration analysis."
    },
    {
      "duty": "Develop plans for sharing resources among competing projects, including management of subcontractors."
    },
    {
      "duty": "Review vendor drawing submittals and conduct technical bid evaluation."
    },
    {
      "duty": "Participate in reviews of PFDs, P&IDs, Piping ISOs, & Structural Drawings."
    },
    {
      "duty": "Ensure engineering quality and timeliness in a cross-functional engineering environment."
    },
    {
      "duty": "Develop piping schematics and layouts based on customer requirements and specifications."
    },
    {
      "duty": "Provide technical follow-up and support on piping matters, from proposal stage to operation."
    },
    {
      "duty": "Demonstrate knowledge in Piping and layout engineering, procurement, and cost-effectiveness."
    },
    {
      "duty": "Possess a basic knowledge of offshore production process requirements and the capability of developing P&IDs from customer specifications."
    },
    {
      "duty": "Familiarity with risk assessment concepts and methods."
    },
    {
      "duty": "Possess advanced computer skills and time management skills."
    },
    {
      "duty": "Be a self-starter able to work with minimal supervision, analyze problems, and provide focused solutions."
    },
    {
      "duty": "Have strong interpersonal and communication skills and be able to work well with people at all levels in the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 90,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Mechanical Engineering. 15-20 years of experience in Oil & Gas FPSO, Offshore platforms, Petrochemical, or Refinery Industries. A minimum of eight years of experience as Piping Stress Engineer/Lead Stress Engineer for FPSO/offshore Platform based Projects."
    }
  ]
}