{
  "meta": [
    {
      "job_title": "Customer Relations Specialist",
      "job_category": "Customer Service",
      "job_class": "Specialist",
      "sector": "Customer Relations",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide a central point of communication for customers requiring assistance with machinery, parts, service, or training."
    },
    {
      "duty": "Follow up on sales leads and provide timely and concise answers based on technical knowledge."
    },
    {
      "duty": "Upsell remote and onsite services for customers to expand their view of us as the complete solutions provider."
    },
    {
      "duty": "Request and track information, samples, budgets, project timing, etc., from customers to enable the creation of quotes."
    },
    {
      "duty": "Coordinate offsite customer installation activities and Site Acceptance Tests (SAT) to ensure quality and timeliness."
    },
    {
      "duty": "Create comprehensive documentation post installation and support trade shows via planning, machine delivery logistics, booth coverage, and administrative tasks."
    },
    {
      "duty": "Assist sales and marketing teams with routine emails, scheduling, and administrative activities."
    },
    {
      "duty": "Perform CRM administrative work such as data management, list uploading, list cleansing, dashboard creation, and reports."
    },
    {
      "duty": "Assist with the preparation of sales and marketing presentations and track spare parts orders."
    },
    {
      "duty": "Handle specific projects as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Sales Follow-up",
      "experience": 2
    },
    {
      "skill": "Technical Knowledge",
      "experience": 3
    },
    {
      "skill": "Upselling",
      "experience": 3
    },
    {
      "skill": "Data Tracking",
      "experience": 2
    },
    {
      "skill": "Documentation",
      "experience": 2
    },
    {
      "skill": "Event Planning",
      "experience": 2
    },
    {
      "skill": "Administrative Work",
      "experience": 2
    },
    {
      "skill": "CRM Management",
      "experience": 2
    },
    {
      "skill": "Project Management",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum two years’ experience in a technology company administrative role."
    },
    {
      "credential": "Experience with HubSpot or other CRM software programs preferred."
    },
    {
      "credential": "Ability to read and comprehend component and assembly technical drawings is a plus."
    },
    {
      "credential": "Proficient in using Microsoft Excel, Word, and PowerPoint."
    },
    {
      "credential": "Bachelor's degree in a related field (preferred)"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ]
}