{
  "meta": [
    {
      "job_title": "Product Analyst",
      "job_category": "Product Management",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the primary liaison between the Product Owners, Business Partners, and Scrum Teams to analyze business requirements and produce documentation to support the build of the new One Chase Service desktop."
    },
    {
      "duty": "Analyze user stories to understand the business needs and to determine how systems and applications can best functionally fulfill those needs."
    },
    {
      "duty": "Serve as the primary liaison between the Business, Architecture, Development and Testing teams throughout the project life cycle."
    },
    {
      "duty": "Serves as the primary liaison between the Business, Architecture, Development and Testing teams throughout the project life cycle."
    },
    {
      "duty": "Works closely with the Test teams to ensure all identified scenarios are properly tested and defects are resolved and a quality end user product is delivered."
    },
    {
      "duty": "Owns the vision and the roadmap of the product."
    },
    {
      "duty": "Maximize the value of the product and work of the development team."
    },
    {
      "duty": "Based on commitment build high level project timelines."
    },
    {
      "duty": "Re-evaluate priority of backlog."
    },
    {
      "duty": "Epic creation and refinement."
    },
    {
      "duty": "Re-evaluate priority of backlog."
    },
    {
      "duty": "Manage JIRA health (fields populated according to standards, fields realigned when projects move releases)."
    },
    {
      "duty": "Track team's progress versus velocity and re-plan future sprints accordingly."
    },
    {
      "duty": "Identify any work that needs to move release."
    }
  ],
  "skills": [
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Requirement Gathering",
      "experience": 5
    },
    {
      "skill": "Agile Methodology",
      "experience": 5
    },
    {
      "skill": "Data and Gap Analysis",
      "experience": 5
    },
    {
      "skill": "Process Flow Development",
      "experience": 5
    },
    {
      "skill": "Use Case Development",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "CSPO Certification",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 110,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree with 5+ years of Business Analyst work experience, CSM / PMI-ACP / CSPO Training would be an added advantage."
    }
  ]
}