{
  "meta": [
    {
      "job_title": "School Social Worker",
      "job_category": "Social Work",
      "job_class": "Social Worker",
      "sector": "Education",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Counseling",
      "experience": 5
    },
    {
      "skill": "Case Management",
      "experience": 5
    },
    {
      "skill": "IEP Development",
      "experience": 5
    },
    {
      "skill": "Parent Collaboration",
      "experience": 5
    },
    {
      "skill": "Crisis Intervention",
      "experience": 5
    },
    {
      "skill": "Social Skill Teaching",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide individual and group counseling sessions to address interpersonal or family issues that interfere with school performance, including crisis intervention consultation and/or family therapy as needed."
    },
    {
      "duty": "Maintain all required paperwork including but not limited to communication logs and meticulous notes regarding all services provided to students."
    },
    {
      "duty": "Conduct interviews with students, family members, and school personnel to gather information required to assess student social, emotional, and behavioral adjustment to school and the community."
    },
    {
      "duty": "Maintain regular contact with students’ parents/guardians to inform them of student’s progress, areas of difficulties, and any changes or situations in home life that may affect school performance."
    },
    {
      "duty": "Develop and update Individualized Education Plans (IEP) and Behavior Intervention Plans (BIP) as needed in adherence to the company, school, state, and federal regulations and procedure."
    },
    {
      "duty": "Attend and participate in IEP team meetings, facilitating at the discretion of the school districts."
    },
    {
      "duty": "Collaborate with education and social services professionals (for example wrap-around, probation officers, court systems) to develop appropriate agency services for students and their families."
    },
    {
      "duty": "Provide case management functions for students, including coordination of parent meetings, emergency transportation requests, and coordination with therapists outside the school setting."
    },
    {
      "duty": "Collaborate and consult with teachers, parents/guardians, district personnel, and service providers to find effective solutions to learning and behavior problems and maintain effective public relations."
    },
    {
      "duty": "Ensure the use of positive social skill teaching methods by conducting monthly direct observation of classroom staff’s implementation of IEP goals and/or Behavior Intervention Plans/Treatment Plans."
    },
    {
      "duty": "Provide guidance, consultation, and assistance to teachers in the development of classroom schedules, maintenance of student data systems, and facilitation of student transition plans."
    },
    {
      "duty": "Assess student progress through consistent review of classroom data collection and recording systems and provide applicable training and guidance to classroom staff accordingly in addressing student behavioral needs."
    },
    {
      "duty": "Conduct crisis assessments and contact the appropriate authorities if needed to ensure that emergency intervention is provided to students."
    },
    {
      "duty": "Keep up to date with research-based practices and developments in the subject area."
    },
    {
      "duty": "Respond constructively to formal and informal feedback."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or higher in social work or related field. Master's degree in social work preferred. Licensed clinical social worker credentials. Prior social work experience in an education program setting."
    }
  ]
}