{
  "meta": [
    {
      "job_title": "Sr Director, Web & Search Engine Optimization (SEO)",
      "job_category": "Marketing",
      "job_class": "Director",
      "sector": "Marketing",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Market Analysis",
      "experience": 8
    },
    {
      "skill": "Online Presence Management",
      "experience": 8
    },
    {
      "skill": "Event Planning",
      "experience": 8
    },
    {
      "skill": "Data Analysis",
      "experience": 8
    },
    {
      "skill": "Digital Marketing",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Organizational Skills",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a comprehensive digital development strategy to enhance the company's online presence, drive user engagement, and increase conversions."
    },
    {
      "duty": "Lead and mentor a cross-functional team to implement innovative technologies, platforms, and tools to optimize and improve the overall user experience."
    },
    {
      "duty": "Oversee the creation and curation of high-quality, compelling content that aligns with the brand voice and resonates with the target audience."
    },
    {
      "duty": "Drive technical SEO initiatives, including on-page optimization, keyword research, metadata optimization, site speed optimization, and mobile optimization."
    },
    {
      "duty": "Monitor website performance, conduct regular audits, and implement strategies to improve organic search visibility and rankings to drive targeted traffic to the website."
    },
    {
      "duty": "Ensure consistent branding and messaging across all digital platforms, driving brand awareness and reinforcing the unique value proposition."
    },
    {
      "duty": "Lead the design and implementation of user-friendly website templates and interfaces that deliver an exceptional user experience."
    },
    {
      "duty": "Utilize web analytics tools, such as Google Analytics, to track and measure the effectiveness of digital marketing campaigns, website performance, and user behavior."
    },
    {
      "duty": "Provide strategic guidance and mentorship to the team, fostering a culture of innovation, collaboration, and continuous learning."
    },
    {
      "duty": "Collaborate cross-functionally with stakeholders, including marketers, developers, designers, and content creators, to align digital initiatives with business objectives."
    },
    {
      "duty": "Lead personalization efforts by leveraging data insights to tailor content and user experiences, driving higher engagement and conversion rates."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS or MA/MS in Marketing, Digital Media, or a related field"
    }
  ]
}