{
  "meta": [
    {
      "job_title": "Technician Lead Tech Svcs",
      "job_category": "Engineering",
      "job_class": "Technician",
      "sector": "Engineering",
      "salary": 49000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Refrigeration Repair",
      "experience": 3
    },
    {
      "skill": "Electrical Repair",
      "experience": 2
    },
    {
      "skill": "Vehicle Operation",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Diagnose and repair fountains, vendors, coolers, and other beverage dispensing equipment to the customers’ satisfaction; properly manage tools and parts; maintain records and reports, safely and efficiently per Company standards."
    },
    {
      "duty": "Assist Territory Manager by transferring and receiving parts and assets, assisting with parts inventories, filling in as needed for the Fountain Installer or Delivery Installer, and visiting customers."
    },
    {
      "duty": "Drive safely following all motor vehicle laws without distraction and maintain a safe working environment by completing all assigned safety training activities and adhering to all safety policies and procedures."
    },
    {
      "duty": "Operate handheld devices to maintain accurate delivery, removal, and movement records, including parts inventory accountability."
    },
    {
      "duty": "Provide great customer service and communication to internal and external customers with the ability to sell revenue-generating service through the proposition."
    },
    {
      "duty": "Lead special projects as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED with 1-3 years of work experience.Valid driver’s license, with a minimum of Commercial Driver’s License (CDL) Class B or ability to obtain required license within 6 months."
    }
  ]
}