{
  "meta": [
    {
      "job_title": "Vice President",
      "job_category": "Leadership",
      "job_class": "Executive",
      "sector": "Finance",
      "salary": 150000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and execute all initiatives across lending and financial products for SME clients, from early pilots to scaling in the marketplace."
    },
    {
      "duty": "Create long-term product plans, focusing on customers, competition, profitability, product life cycle, and service considerations."
    },
    {
      "duty": "Create and optimize lending product portfolio by analyzing SME needs and partnering with direct lenders."
    },
    {
      "duty": "Own the overall lending and financial product standardization efforts, requiring coordination with technology, legal, sales, and marketing."
    },
    {
      "duty": "Apply analytical and creative thinking to design solutions to operational inefficiencies, risks, and opportunities, and manage the implementation of the solutions."
    },
    {
      "duty": "Lead requirement gathering sessions; design, ideate, wireframe, prototype features, and experiences."
    },
    {
      "duty": "Assist technology implementations wherever additional guidance or resourcing is needed, such as requirements documentation, solution design, UAT, and user support."
    },
    {
      "duty": "Ensure effective communication and escalation on overall program status, implementation plans, management issues, priorities, and risks."
    },
    {
      "duty": "Analyze the current end-to-end processes and key performance indicators across lending and financial products; identify opportunities to leverage best practices."
    },
    {
      "duty": "Continuously seek out new technologies to improve inefficiencies, customer experience, and scalability."
    },
    {
      "duty": "Understand the customer journey and develop recommendations for products and product enhancements based on a thorough understanding of user personas and use case scenarios."
    },
    {
      "duty": "Pull from market and competitive insights, customer needs, and internal business priorities to create the product vision (target customer segments, markets, channels, go-to-market approach, and value propositions)."
    },
    {
      "duty": "Collaborate with internal teams to ensure successful launch and ongoing management of products."
    },
    {
      "duty": "Partner with sales to create a uniform understanding across the company of the product design and value propositions; ensure staff are equipped with the necessary product knowledge and sales tools."
    },
    {
      "duty": "Collaborate with partner management and marketing to develop and execute tailored strategies to drive growth and engagement across the product suite."
    },
    {
      "duty": "Develop, implement & monitor performance metrics to ensure the quality and efficiency in implementing the initiatives."
    },
    {
      "duty": "Conduct regular competitive analysis to identify trends and opportunities for product improvement and/or additions."
    }
  ],
  "skills": [
    {
      "skill": "Commercial Lending",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Operational Change Management",
      "experience": 5
    },
    {
      "skill": "Product Design",
      "experience": 5
    },
    {
      "skill": "Technology Implementation",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Financial Product Standardization",
      "experience": 5
    },
    {
      "skill": "Customer Journey Analysis",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Performance Measurement",
      "experience": 5
    },
    {
      "skill": "Sales Partnership",
      "experience": 5
    },
    {
      "skill": "Marketing Strategy Development",
      "experience": 5
    },
    {
      "skill": "Product Management",
      "experience": 5
    },
    {
      "skill": "Technology Adoption",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, or a related field (Master's preferred)"
    }
  ]
}