{
  "meta": [
    {
      "job_title": "Principal Scientist",
      "job_category": "Science",
      "job_class": "Scientist",
      "sector": "Science",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Research",
      "experience": 5
    },
    {
      "skill": "Scientific Writing",
      "experience": 5
    },
    {
      "skill": "Regulatory Submissions",
      "experience": 5
    },
    {
      "skill": "Medical Literature Analysis",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "MS Word, Excel, Teams",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide scientific support to justify trial design and ongoing scientific analysis during protocol development, including generation of pre-protocol documentation of scientific information."
    },
    {
      "duty": "Lead the generation of study-related documents and/or contribute content and oversight of such documents including clinical study protocols, reports of priors, investigational brochures, and case report forms."
    },
    {
      "duty": "Responsible for updating medical affairs procedural documents and submitting change requests when needed."
    },
    {
      "duty": "Generate documents to support regulatory submissions and/or respond to questions from regulatory authorities about existing submissions."
    },
    {
      "duty": "Review and critically analyze clinical data and statistical analysis plans."
    },
    {
      "duty": "Participation in scientific report writing. Presentation of methods, results, and conclusions to a publishable standard. Lead study level publication planning."
    },
    {
      "duty": "Support the generation of white and position papers by evaluating scientific literature, analyzing scientific data and staying abreast of current clinical practice."
    },
    {
      "duty": "Lead publications for clinical study data through coordination with investigator authors and project management of reviews and revisions for abstracts and manuscripts."
    },
    {
      "duty": "Contribute to the optimization of internal processes and workflows."
    },
    {
      "duty": "Assist the medical director with direct customer interactions as needed."
    },
    {
      "duty": "Comply with applicable Laws and Regulations, adhere to Quality Management System processes and requirements as well as demonstrate Ethics and Integrity in all matters and at all levels throughout the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in a relevant science with a minimum of five (5) years of relevant clinical research scientist experience or Doctorate degree with at least three (3) years of relevant clinical research scientist experience."
    },
    {
      "credential": "A Ph.D. in a relevant science, medicine, or similar discipline is highly preferred."
    }
  ]
}