{
  "meta": [
    {
      "job_title": "Spiritual Support Coordinator",
      "job_category": "Spiritual Support",
      "job_class": "Coordinator",
      "sector": "Religious",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Pastoral Counseling",
      "experience": 5
    },
    {
      "skill": "Spiritual Ministry",
      "experience": 5
    },
    {
      "skill": "Group Facilitation",
      "experience": 5
    },
    {
      "skill": "Chaplaincy",
      "experience": 5
    },
    {
      "skill": "Clinical Pastoral Education",
      "experience": 5
    },
    {
      "skill": "Catholic Faith Knowledge",
      "experience": 5
    },
    {
      "skill": "Gerontology",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinates spiritual, emotional and psychological support for sisters and staff members at St. Bernardine Home."
    },
    {
      "duty": "Develops relationships with each sister and connects on a regular basis to assess and offer individual spiritual, psychological and emotional needs."
    },
    {
      "duty": "Provides outreach to staff members and facilitates Sisters’ relationship with, by conversation, support, cards, referral to outside agencies, etc."
    },
    {
      "duty": "Creates effective ways to communicate information to the sister community."
    },
    {
      "duty": "Visits sisters in hospitals and stays with them during times of surgery as indicated."
    },
    {
      "duty": "Plans for an annual retreat."
    },
    {
      "duty": "Develops and/or assists with support groups for experiences of loss and grief, adjustment to life in a retirement convent setting, etc."
    },
    {
      "duty": "Accompanies sisters at the end of life, ensures sisters’ wishes are addressed, and supports others effected by sisters’ death."
    },
    {
      "duty": "Works with the administrator to create an annual retirement convent budget and assists with sisters’ personal budgets;"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Certification in NACC (National Association of Catholic Chaplains) or ACPE (Accredited Clinical Pastoral Education) or equivalent."
    },
    {
      "credential": "Certification, degree or classes in the fields of spirituality, gerontology, counseling, and group facilitation preferred."
    },
    {
      "credential": "Comparable experience may be substituted for certification/degree/classes."
    },
    {
      "credential": "Thorough understanding and knowledge of the Catholic Faith; its beliefs, practices, liturgy, structure, and protocol."
    },
    {
      "credential": "Minimum of three years’ experience in chaplaincy or related field. Training and experience in spiritual ministry, pastoral counseling (both individually and communally) preferred."
    }
  ]
}