{
  "meta": [
    {
      "job_title": "Laboratory Technician",
      "job_category": "Science",
      "job_class": "Technician",
      "sector": "Laboratory",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Complete routine analytical and laboratory testing in support of the food safety quality and operational teams."
    },
    {
      "duty": "Sample and process collecting samples and performing analysis (protein, moisture)."
    },
    {
      "duty": "Document results into databases and/or communication test results."
    },
    {
      "duty": "Help develop food/feed safety, quality and regulatory culture collaborating cross-functionally to build, maintain and improve an effective food safety, quality and regulatory culture."
    },
    {
      "duty": "Run calibration checks, preventive maintenance tasks, and simple repair to analytical instrumentation, maintaining customer specifications books up-to-date."
    },
    {
      "duty": "Interpret and document results of tests into active databases and communicate results to internal customers as required."
    },
    {
      "duty": "Ensure compliance programs for all individual testing, which includes monitoring adherence to regulations and other procedural food safety compliance."
    },
    {
      "duty": "Conduct routine quantitative and qualitative inspections and laboratory tests on raw materials, in-process and final products independently, supporting more complex trials and experiments under intermediate supervision."
    },
    {
      "duty": "Handle clerical, administrative, technical or customer support issues under general supervision, while escalating more complex issues to appropriate staff."
    },
    {
      "duty": "Ability to read and interpret documents (safety rules, operating and maintenance instructions, and procedure manuals)."
    },
    {
      "duty": "Write routine reports and correspondence."
    }
  ],
  "skills": [
    {
      "skill": "Laboratory Testing",
      "experience": 1
    },
    {
      "skill": "Document Management",
      "experience": 1
    },
    {
      "skill": "Quality Control",
      "experience": 1
    },
    {
      "skill": "Compliance Monitoring",
      "experience": 1
    },
    {
      "skill": "Data Interpretation",
      "experience": 1
    },
    {
      "skill": "Customer Support",
      "experience": 1
    }
  ],
  "education_certification": [
    {
      "credential": "1+ years Lab/quality testing experience or recent college graduate in Science or related field. Bachelor's degree preferred for recent college graduate."
    }
  ]
}