{
  "meta": [
    {
      "job_title": "Commercial Broker and Property Manager",
      "job_class": "Manager",
      "job_category": "Real Estate",
      "sector": "Real Estate",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Commercial Property Management",
      "experience": 5
    },
    {
      "skill": "Client Representation",
      "experience": 5
    },
    {
      "skill": "Leasing and Sales Negotiation",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Budgeting and Financial Reporting",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage day to day physical and financial operation of the assigned portfolio, including serving as the primary liaison with owners, vendors, and tenants."
    },
    {
      "duty": "Administer tenant leases and maintain good tenant relations; review, understand and enforce lease terms. Communicate with tenants to address their needs and resolve any issues."
    },
    {
      "duty": "Work closely with tenants to ensure prompt rental payment."
    },
    {
      "duty": "Prepare annual budgets and review monthly financial reports for individual portfolio properties and provide to owners monthly and quarterly."
    },
    {
      "duty": "Perform periodic inspections of the properties. Maintain the assigned portfolio at a high level of appearance and performance. Resolve emergency maintenance issues."
    },
    {
      "duty": "Obtain and supervise third-party vendors; evaluate service contract requirements and establish performance specifications and documents; manage the competitive bid process."
    },
    {
      "duty": "Represent our clients buying, selling, and leasing investment real estate. Procure new property management accounts, sale, and leasing listings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Washington State Broker's License, or ability to obtain within 3 months of hire"
    },
    {
      "credential": "Commercial property management experience"
    },
    {
      "credential": "Experience with AppFolio or other property management software"
    },
    {
      "credential": "Excellent organization and attention to detail"
    }
  ]
}