{
  "meta": [
    {
      "job_title": "Controller",
      "job_category": "Finance",
      "job_class": "Executive",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and direct all accounting operational functions, handling the accumulation and consolidation of financial data for internal and external financial statements."
    },
    {
      "duty": "Evaluate accounting and internal control systems."
    },
    {
      "duty": "Lead departmental staff, offering remarkable client services, managing self and others with a sense of urgency, practicality, and accountability."
    },
    {
      "duty": "Make key decisions and be able to challenge, negotiate, and influence the team."
    },
    {
      "duty": "Encourage innovative ideas that are sound and progressive, challenge the status quo, and support creativity in the finance department."
    },
    {
      "duty": "Research, prepare, and execute Finance Department initiatives such as software and systems implementation and other departmental or firm-wide improvements, as required."
    },
    {
      "duty": "Oversee daily cash management and produce cash-flow reports, calculating cash needs at weekly and monthly intervals."
    },
    {
      "duty": "Assure client expectations are met by reviewing deliverables of self and team."
    },
    {
      "duty": "Work closely with executive team and partners to facilitate efficient and effective firm-wide operation."
    },
    {
      "duty": "Comfortable handling responsibilities beyond formal job duties."
    },
    {
      "duty": "Assess, execute, and improve policies, procedures, controls, and most methodologies."
    },
    {
      "duty": "Ensure timely cash collection by driving the timing for monthly billing and other cash management techniques."
    },
    {
      "duty": "Handle monthly and annual close of income statement and balance sheet, account reconciliations and G/L analysis."
    },
    {
      "duty": "Present monthly financial reports to executive committee and partners."
    },
    {
      "duty": "Manage the creation of and monthly monitoring of the annual budget and forecasts."
    }
  ],
  "skills": [
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Accounting",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Cash Management",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Client Services",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Decision Making",
      "experience": 5
    },
    {
      "skill": "Internal Control Evaluation",
      "experience": 5
    },
    {
      "skill": "Software Implementation",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Finance, Accounting, or related field"
    }
  ]
}