{
  "meta": [
    {
      "job_title": "Senior Analyst, Demand Planning & Analysis",
      "job_category": "Data & Analytics",
      "job_class": "Senior Analyst",
      "sector": "Data & Analytics",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Demand Forecasting",
      "experience": 5
    },
    {
      "skill": "Economic Trend Analysis",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "Tableau",
      "experience": 5
    },
    {
      "skill": "Power BI",
      "experience": 5
    },
    {
      "skill": "Business Intelligence",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Analyze enterprise-wide data to improve business planning decisions such as demand projections, staff and fulfillment planning."
    },
    {
      "duty": "Develop accurate demand forecasts leveraging historical customer purchase data, current consumer trends, promotional activity, economic trends, and seasonality."
    },
    {
      "duty": "Analyze data to detect patterns, trends, anomalies, and correlations to identify areas of opportunity and/or are a catalyst to strategy development."
    },
    {
      "duty": "Build dashboards that visualize critical business KPIs and automate the BI process once reports are approved by stakeholders."
    },
    {
      "duty": "Improve demand planning processes, enhance forecasting accuracy, and optimize inventory management."
    },
    {
      "duty": "Provide data storytelling, utilize analytical findings to influence senior leadership, take analytical findings and infuse them into short / long term business strategies."
    },
    {
      "duty": "Audit data and analysis deliverables to ensure stakeholders have the right metrics and business insights."
    },
    {
      "duty": "Perform client-facing, motivated, strategic, and highly analytical tasks with exceptional critical thinking skills focused on data-driven insights."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s or Master’s degree in a related field."
    }
  ]
}