{
  "meta": [
    {
      "job_title": "Cloud Software Engineer I",
      "job_category": "Software Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work with team leads and members on the design, implementation, and integration of cloud software products."
    },
    {
      "duty": "Collaborate with other software developers, business analysts, and software architects to plan, design, develop, test, and maintain web- and desktop-based business applications."
    },
    {
      "duty": "Assist in the collection and documentation of user's requirements, development of user stories, estimates and work plans."
    },
    {
      "duty": "Prepare reports, manuals, and other documentation on the status, operation, and maintenance of software."
    },
    {
      "duty": "Design, develop, and unit test applications in accordance with established standards."
    },
    {
      "duty": "Participate in peer-reviews of solution designs and related code."
    },
    {
      "duty": "Develop, refine, and tune integrations between applications."
    },
    {
      "duty": "Analyze and resolve technical and application problems."
    },
    {
      "duty": "Assess opportunities for application and process improvement and prepare documentation of rationale to share with team members and other affected parties."
    },
    {
      "duty": "Adhere to high-quality development principles while delivering solutions on time."
    },
    {
      "duty": "Design, develop, tests, debugs and implements operating systems components, software tools, and utilities."
    },
    {
      "duty": "Work with the test developers to ensure quality and coverage."
    },
    {
      "duty": "Write scalable, secure, maintainable code that powers our products."
    }
  ],
  "skills": [
    {
      "skill": "Cloud Software Development",
      "experience": 3
    },
    {
      "skill": "Web Application Development",
      "experience": 3
    },
    {
      "skill": "Software Integration",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Documentation",
      "experience": 3
    },
    {
      "skill": "Quality Assurance",
      "experience": 3
    },
    {
      "skill": "Operating Systems Development",
      "experience": 3
    },
    {
      "skill": "Technical Writing",
      "experience": 3
    },
    {
      "skill": "Code Optimization",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Testing and Debugging",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Software Engineering, or related field (Master's preferred)"
    }
  ],
  "sector": "Software Engineering",
  "salary": 115000
}