{
  "meta": [
    {
      "job_title": "Financial Service Representative",
      "job_category": "Finance",
      "job_class": "Representative",
      "sector": "Finance",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Banking Operations",
      "experience": 3
    },
    {
      "skill": "Financial Services",
      "experience": 3
    },
    {
      "skill": "Customer Relations",
      "experience": 3
    },
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 3
    },
    {
      "skill": "Cash Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Financial Education",
      "experience": 3
    },
    {
      "skill": "Transaction Processing",
      "experience": 3
    },
    {
      "skill": "Online Banking",
      "experience": 3
    },
    {
      "skill": "Security Protocols",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Interact and interview customers to determine financial needs and recommend the most appropriate products."
    },
    {
      "duty": "Cross-sell products and services to customer base."
    },
    {
      "duty": "Obtain and assemble all required account documentation and book new accounts."
    },
    {
      "duty": "Provide a high level of customer service in person, by phone and email, and assist with resolving issues, banking and financial education, and transactional research."
    },
    {
      "duty": "Continually verify and maintain customer CIP information to ensure continuous accuracy."
    },
    {
      "duty": "Recognize and report customer and working environment issues observed."
    },
    {
      "duty": "Conduct interaction with customers and staff in a courteous and professional manner providing prompt, efficient, and accurate service."
    },
    {
      "duty": "Monitor, troubleshoot, and maintain a thorough understanding of Online eBanking, Mobile App, Debit Card, and ATM products, and provide training and education to customers on these products."
    },
    {
      "duty": "Receive and process account and monetary transactions and maintain a cash drawer at a teller station, adhering to all line processes and procedures."
    },
    {
      "duty": "Authenticate override transactions for other teller staff."
    },
    {
      "duty": "Maintain a high level of facility security by monitoring through observation of alarms, cameras, and other security protocols."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent work experience in bank/branch operations or related field."
    }
  ]
}