{
  "meta": [
    {
      "job_title": "Specialist, HR Employment and Selection I",
      "job_category": "HR",
      "job_class": "Specialist",
      "sector": "HR",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Selection Process",
      "experience": 5
    },
    {
      "skill": "Employment Policies",
      "experience": 5
    },
    {
      "skill": "Consultation",
      "experience": 5
    },
    {
      "skill": "Compliance Standards",
      "experience": 5
    },
    {
      "skill": "Talent Acquisition",
      "experience": 5
    },
    {
      "skill": "Employee Referral Program",
      "experience": 5
    },
    {
      "skill": "Interviewing",
      "experience": 5
    },
    {
      "skill": "HR Practices",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support and lead hiring managers through the position requisition process and provide consultation on hiring profiles, selection, and employment policies and procedures."
    },
    {
      "duty": "Assist hiring managers in developing job descriptions, screening applications, and selecting qualified candidates."
    },
    {
      "duty": "Monitor job postings and make necessary adjustments, guide hiring managers through the recruiting and selection process, oversee selection criteria, preparation of interview questions, and interview process."
    },
    {
      "duty": "Implement selection and employment processes and procedures in accordance with industry best practices and compliance standards, support the recruitment, screening, and referral of applicants, and research appropriate recruiting sources."
    },
    {
      "duty": "Coordinate placement of paid advertisements, conduct one-on-one consultations to develop hiring manager selection and recruitment competencies, and champion the Employee Referral Bonus program."
    },
    {
      "duty": "Support the mission of the university, serve as an ambassador of the Q2 culture of service excellence, and guide hiring managers on asking appropriate and compliant interview questions maintaining interview integrity."
    },
    {
      "duty": "Stay informed about industry trends and compliance regulations, provide coaching and guidance to hiring managers and committees, and collaborate with HR team to ensure a smooth transition for all new hires from recruiting through onboarding."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in HR, Business Administration, or a related field (Master's preferred)"
    }
  ]
}