{
  "meta": [
    {
      "job_title": "Journeyman Equipment Specialist",
      "job_category": "Engineering",
      "job_class": "Specialist",
      "sector": "Engineering",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide Equipment Specialist support, apply logistics best commercial practices, and execute Performance-Based Logistics (PBL) and supply chain management."
    },
    {
      "duty": "Perform configuration management tasks and apply the principles, criteria, and procedures of CM in support of systems and equipment acquired or sustained."
    },
    {
      "duty": "Review and recommend changes to program-unique specifications for hardware and software, maintain drawing packages, and provide technical support and analysis on field, depot, and modification program issues."
    },
    {
      "duty": "Assist in the preparation and conduct of CCB and related subordinate boards; Attend and support FCAs, PCAs, and Compliance Audits, monitoring and processing parts lists utilized under contractor logistics support for provisioning and configuration management planning and documentation."
    },
    {
      "duty": "Develop methods, plans, feedback requirements for Technical Order (TO) management, support the development of drawing packages, and provide integrated logistics support including maintenance data collection and evaluation of quality deficiency reports."
    },
    {
      "duty": "Evaluate Air Force directives, conduct Logistics Supportability Analysis, and maintain system Baselines to current field configurations."
    },
    {
      "duty": "Utilize Government provided computer software programs to identify errors, equipment, non-mission capable time, and to recommend a course of action to improve readiness."
    }
  ],
  "skills": [
    {
      "skill": "Logistics Management",
      "experience": 7
    },
    {
      "skill": "Configuration Management",
      "experience": 7
    },
    {
      "skill": "Technical Support",
      "experience": 7
    },
    {
      "skill": "Supply Chain Management",
      "experience": 7
    },
    {
      "skill": "Documentation Management",
      "experience": 7
    },
    {
      "skill": "Quality Control",
      "experience": 7
    },
    {
      "skill": "Systems Analysis",
      "experience": 7
    },
    {
      "skill": "Compliance Audit",
      "experience": 7
    },
    {
      "skill": "Contractor Logistics Support",
      "experience": 7
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma (Bachelor's or Master's Degree preferred)"
    }
  ]
}