{
  "meta": [
    {
      "job_title": "Plant Financial Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cost Accounting",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "ERP Systems",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Strategic Partnership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead cost accounting and financial oversight for Plant Operations."
    },
    {
      "duty": "Take the lead in the annual budget process for the plant, shaping realistic financial projections."
    },
    {
      "duty": "Supervise and mentor both indirect and direct reports, fostering a culture of collaboration, growth, and high performance within the finance team."
    },
    {
      "duty": "Prepare and dissect monthly Key Performance Indicators (KPIs) and other critical financial metrics for the plant."
    },
    {
      "duty": "Manage crucial month-end closing tasks, including inventory and other operation-related accounts. Present monthly financial statements and operational reports."
    },
    {
      "duty": "Oversee the maintenance of the operation’s bill of materials and routing processes. Analyze production variances, driving continuous improvement."
    },
    {
      "duty": "Regularly provide analytical information and schedules to plant management and other functional department heads. Serve as a valued financial partner in driving informed decision-making."
    },
    {
      "duty": "Develop cost/projection analyses for new and existing business opportunities, contributing to effective pricing strategies and maintaining profitability."
    },
    {
      "duty": "Manage Fixed Assets and Capital Expense Request processes, ensuring prudent financial management and alignment with corporate goals."
    },
    {
      "duty": "Maintain adherence to federal, state, and local regulations, safeguarding the integrity of financial operations."
    },
    {
      "duty": "Empower business unit leaders with comprehensive financial insights. Assist in interpreting financial performance, cost drivers, and forecasts to guide strategic initiatives."
    },
    {
      "duty": "Champion special projects that bolster Operational Excellence, controlling expenses, boosting profits, optimizing cash flow, and enhancing plant efficiencies."
    },
    {
      "duty": "Lead annual physical inventory counts and supervise the plant’s cycle counting program, fostering accuracy in financial reporting."
    },
    {
      "duty": "Tackle additional duties as assigned with a proactive and adaptable approach."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Accounting or Finance, coupled with a minimum of 5 years of relevant experience."
    },
    {
      "credential": "Proficiency in Microsoft Suite, particularly Excel (pivot tables, lookups, conditional formatting, etc.), Power BI, Teams, Outlook, PowerPoint, and Word."
    },
    {
      "credential": "Adept at account analysis and reconciliation preparation, including the utilization of online tools such as Blackline."
    }
  ]
}