{
  "meta": [
    {
      "job_title": "Visual Merchandiser",
      "job_category": "Retail",
      "job_class": "Specialist",
      "sector": "Retail",
      "salary": 15,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Visual Merchandising",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Store Promotions",
      "experience": 3
    },
    {
      "skill": "Event Execution",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support Store leadership in Visual Merchandising planning and execution."
    },
    {
      "duty": "Implement all aspects of merchandise visual presentation consistently according to Corporate standards and resources."
    },
    {
      "duty": "Drive brick & mortar sales by creating inspiring moments through visual storytelling and mannequin presentation."
    },
    {
      "duty": "Elevate store visual presentations in all areas of the store."
    },
    {
      "duty": "Take proper care of all visual components, graphics, tools, and supplies."
    },
    {
      "duty": "Conduct weekly store walks with the Store Manager focused on visual priorities for the week."
    },
    {
      "duty": "Communicate regularly with Store associates and executives to align to company priorities."
    },
    {
      "duty": "Effectively use company resources to plan, communicate, and share information with Store associates and executives."
    },
    {
      "duty": "Acknowledge and assist customers in all areas of the store."
    },
    {
      "duty": "Build trust with the customer to solve their shopping needs."
    },
    {
      "duty": "Be a savings consultant to help customers save with a Kohl’s Card."
    },
    {
      "duty": "Limited travel to support new store openings."
    },
    {
      "duty": "Maintain prompt and regular attendance as set by the company."
    },
    {
      "duty": "Comply with dress code requirements."
    },
    {
      "duty": "Learn and comply with all company policies, procedures, standards, and guidelines."
    },
    {
      "duty": "Receive, understand, and proactively respond to direction from supervisors/managers and other company personnel."
    },
    {
      "duty": "Operate and communicate on multiple frequency devices, handheld scanners, and other technology equipment as directed."
    },
    {
      "duty": "Perform work in accordance with the physical requirements section."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma/GED (Associate's degree preferred)"
    }
  ]
}