{
  "meta": [
    {
      "job_title": "Transition Specialist",
      "job_category": "Financial",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist and lead transitioning financial advisors from one financial firm to another."
    },
    {
      "duty": "Morning meetings with the new recruit team to review day's tasks and objectives."
    },
    {
      "duty": "Opening new client accounts and moving assets from contra firm to new firm."
    },
    {
      "duty": "Assisting the financial advisor's clients with new documents and questions in regards to moving their accounts."
    },
    {
      "duty": "Working with vendors to ensure correct and compliant completion of all tasks necessary to move over the advisors' book of business."
    },
    {
      "duty": "Ability to travel frequently for extended periods of time."
    },
    {
      "duty": "Able to work weekends and over 40 hours per week."
    },
    {
      "duty": "Aptitude for assisting and working cohesively with financial advisors and their assistants."
    },
    {
      "duty": "Leadership skills and ability to direct the firm and advisors with our transition system."
    },
    {
      "duty": "Communication skills, and capacity to maintain relationships with the new recruit team and supporting branch."
    },
    {
      "duty": "Management skills - hosting in-person/Zoom meetings with new recruit team and supporting branch."
    },
    {
      "duty": "Assisting with training new associates and clients on their new systems."
    }
  ],
  "skills": [
    {
      "skill": "Financial Background",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Management",
      "experience": 4
    },
    {
      "skill": "Training",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, or a related field (Master's preferred)"
    }
  ]
}