{
  "meta": [
    {
      "job_title": "Senior Design Engineer",
      "job_category": "Engineering",
      "job_class": "Senior Engineer",
      "sector": "Engineering",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Development",
      "experience": 10
    },
    {
      "skill": "Technical Writing",
      "experience": 10
    },
    {
      "skill": "Energy Conservation",
      "experience": 10
    },
    {
      "skill": "AutoCad",
      "experience": 7
    },
    {
      "skill": "Revit",
      "experience": 7
    },
    {
      "skill": "HVAC Systems",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Energy Management",
      "experience": 10
    },
    {
      "skill": "Problem Solving",
      "experience": 10
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead technical discussions of scope, savings, and design methods with the team and client."
    },
    {
      "duty": "Develop and execute project design approaches, schedules, and budgets with the design team to establish accountability of deliverables."
    },
    {
      "duty": "Write and approve scopes of work for energy conservation measures (ECM) for internal Design Engineers and Construction Managers."
    },
    {
      "duty": "Review drawings and provide feedback as the expert resource for the team."
    },
    {
      "duty": "Participate in ESPC project development including energy audit review, site investigations, and ECM scope development for large commercial and institutional facilities."
    },
    {
      "duty": "Coordinate, schedule, and perform site visits with clients and Iconergy team to perform site inspections."
    },
    {
      "duty": "Support development of energy-efficient equipment driving efficient, dependable, and maintainable solutions."
    },
    {
      "duty": "Review and analyze utility data, HVAC trend data, and production data to support project development."
    },
    {
      "duty": "Collaborate with the team, think critically, openly discuss concerns, and propose solutions."
    },
    {
      "duty": "Be an engineering resource for the team to brainstorm, answer questions, guide, coach, and develop talent."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 200,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or greater in Mechanical or Electrical Engineering (Master's preferred)"
    },
    {
      "credential": "Active Professional Engineering (PE) License and ability to acquire PE licenses in other states as required and ability to stamp drawings."
    }
  ]
}