{
  "meta": [
    {
      "job_title": "High Voltage Design & Release Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Automotive",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "High Voltage Devices Design",
      "experience": 3
    },
    {
      "skill": "Power Electronics",
      "experience": 3
    },
    {
      "skill": "Component Design",
      "experience": 3
    },
    {
      "skill": "Electrical Engineering System Development",
      "experience": 3
    },
    {
      "skill": "Automotive Integration",
      "experience": 3
    },
    {
      "skill": "Computer-Aided Design",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead component requirements, design/selection, and validation plan for various high-voltage devices including On-Board Chargers, Power Distribution Units, and Low-Power Accessory Devices."
    },
    {
      "duty": "Assist in vehicle-level thermal and electrical modeling and simulation."
    },
    {
      "duty": "Work with the Battery, Thermal, Harnessing/EDS, Controls, and Chassis teams to define the integration strategy, requirements, and validation plan of the above devices in the respective systems."
    },
    {
      "duty": "Create necessary supporting documentation relating to and including DFMEA, PFMEA, and DVP."
    },
    {
      "duty": "Work with suppliers to ensure that component specifications and timing expectations are met."
    },
    {
      "duty": "Support hands-on integration, testing, and troubleshooting of the above devices on test benches and prototype vehicles."
    },
    {
      "duty": "Identify and execute design and process improvements based on previous build and test data."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BS in Engineering (BSME, BSEE, BSIE…) or Equivalent Experience.3+ years of OEM or Tier 1 experience on HEV, PHEV, or BEV platforms.Previous Automotive/OEM experience preferred.Experience with high-voltage, power electronics, power converters, and component design and specificationKnowledge of all aspects of High Voltage devices including the relationship between HV wiring components and electrical wire types, sizing, etc.Familiarity with High Voltage EE system development and vehicle integration.Experience with drafting, design practices & related engineering practices.Experience in reviewing rough sketches, drawing specifications, & creating conceptual drawings in computer-aided design software."
    }
  ]
}