{
  "meta": [
    {
      "job_title": "IT Support Specialist",
      "job_category": "IT",
      "job_class": "Specialist",
      "sector": "Information Technology",
      "salary": 30,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "PC Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Hardware Installation",
      "experience": 5
    },
    {
      "skill": "Software Solutions",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Technical Documentation",
      "experience": 5
    },
    {
      "skill": "Active Directory",
      "experience": 5
    },
    {
      "skill": "Network Security",
      "experience": 5
    },
    {
      "skill": "Technical Training",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Accurately respond to questions and assist customers with product features, installation, set-up, and troubleshooting of software via phone or in person."
    },
    {
      "duty": "Diagnose, analyze, and correct customer reported hardware issues including PC, laptop, phone (VoIP), email, and network connectivity."
    },
    {
      "duty": "Ensure compliance with all Bank policies and procedures, as well as all applicable state and federal banking rules and/or regulations."
    },
    {
      "duty": "Performing scheduled software/hardware system checks & upgrades and train others outside the department regarding troubleshooting techniques."
    },
    {
      "duty": "Provide technical support to employees and customers using phone, email, and ticketing system; communicate with clients and maintain and constantly improve client service, perception, and satisfaction."
    },
    {
      "duty": "Develop expertise in in-house applications and perform issue identification, verification, diagnosis, and troubleshooting."
    },
    {
      "duty": "Facilitate feedback loop between end-users, IT team, and other business functions; Installation, configuration, maintenance, and tracking of computers, telephones, and peripheral devices."
    },
    {
      "duty": "Conduct user training on hardware, software systems & peripheral devices; develop in-depth knowledge of the service offerings and how it relates to client's needs."
    },
    {
      "duty": "Document internal processes and procedures related to duties and responsibilities; Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "A degree in Computer Technology or related discipline; or an equivalent combination of experience and education."
    }
  ]
}