{
  "meta": [
    {
      "job_title": "Business Development Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Opportunity Analysis",
      "experience": 5
    },
    {
      "skill": "Proposal Development",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Government Procurement",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identifying, qualifying, and developing new business opportunities and associated call plans."
    },
    {
      "duty": "Conducting opportunity analysis with specific strategies to increase company win probability."
    },
    {
      "duty": "Organizing, composing, and briefing capture strategies/plans to corporate leadership, including win strategies, teaming, competitive assessments, and pricing strategies."
    },
    {
      "duty": "Preparing responses to Requests for Information (RFI) and Sources Sought (SS)."
    },
    {
      "duty": "Coordinating with technical teams, business unit leaders, and functional experts to identify key discriminators, price to win strategies, and develop win themes."
    },
    {
      "duty": "Assisting in proposal development and preparation, writing key portions of the technical and management sections."
    },
    {
      "duty": "Capture contracts and follow-on opportunities post award."
    },
    {
      "duty": "Preparing and presenting corporate capabilities presentations at appropriate venues. Preparing and delivering presentations to customers, partners and others to help position the company for and shape the acquisition strategy of potential opportunities."
    },
    {
      "duty": "Supporting the company’s IDIQ/GWAC contract vehicles by monitoring opportunities that can develop into actionable proposals."
    },
    {
      "duty": "Representing the company at networking events and in professional associations."
    },
    {
      "duty": "Analyzing current trends and emerging technologies. Knowledge of MD, VA and other states’ procurement and business development cycle. Knowledge of various Government contracting vehicles and contract types."
    },
    {
      "duty": "Specific knowledge of the MD government technical landscape required."
    },
    {
      "duty": "Demonstrated knowledge of capture management, competitive intelligence, and/or research methodologies and information sources."
    },
    {
      "duty": "Ability to accomplish insightful vetting of strategic opportunities (i.e., $5M+ in size)."
    },
    {
      "duty": "Knowledge of information technology, training, industry experience, and knowledge of state and local professional services industry."
    },
    {
      "duty": "The ability to communicate concisely and appropriately."
    },
    {
      "duty": "A natural aptitude for strategic planning, financial analysis, creative capture management and teaming."
    },
    {
      "duty": "Assisting in the company's expansion in the public sector market."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree required"
    }
  ]
}