{
  "meta": [
    {
      "job_title": "Director of Senior Services",
      "job_category": "Medical",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Senior Program Development",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Business Development",
      "experience": 7
    },
    {
      "skill": "Market Research",
      "experience": 7
    },
    {
      "skill": "Philanthropy",
      "experience": 7
    },
    {
      "skill": "Healthcare Management",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Clinical Knowledge",
      "experience": 7
    },
    {
      "skill": "Human Resources",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops programs and services to establish the organization as a leader in older adult care."
    },
    {
      "duty": "Implements a strategic business plan in collaboration with other members of the senior services team."
    },
    {
      "duty": "Works with clinical leaders and entities to better serve older adults by incorporating principles of geriatric care."
    },
    {
      "duty": "Encourages and supports research activity in geriatric care and develops methods to share new knowledge."
    },
    {
      "duty": "Initiates and directs marketing, public relations, and publicity relative to the Senior Service Line in collaboration with Marketing and Business Development."
    },
    {
      "duty": "Performs ongoing analysis of the marketplace in collaboration with market research."
    },
    {
      "duty": "Analyzes and works directly with physician groups relative to older adult services to promote strength areas, address weaknesses, and develop programs."
    },
    {
      "duty": "Develops and recommends operating and capital budgets and controls expenditures within approved budget objectives."
    },
    {
      "duty": "Performs human resources responsibilities for staff, including interviewing, selection, staff development, and performance evaluations."
    },
    {
      "duty": "Maintains expertise in clinical knowledge and keeps current in clinical issues related to geriatrics/gerontology."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Master's Degree in Health Care Administration or related field"
    }
  ]
}