{
  "meta": [
    {
      "job_title": "Assistant Community Manager",
      "job_category": "Real Estate",
      "job_class": "Manager",
      "sector": "Property Management",
      "salary": 52000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Property Management",
      "experience": 2
    },
    {
      "skill": "Leasing Operations",
      "experience": 2
    },
    {
      "skill": "Budgeting",
      "experience": 2
    },
    {
      "skill": "Negotiation",
      "experience": 2
    },
    {
      "skill": "Conflict Resolution",
      "experience": 2
    },
    {
      "skill": "Microsoft Office",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Staff Management",
      "experience": 2
    },
    {
      "skill": "High School Diploma or equivalent",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Community Manager in the successful site management of the apartment community, providing leadership, guidance, and motivation to ensure a positive working environment and quality community living."
    },
    {
      "duty": "Administer the day-to-day leasing office operations and oversee all computer input of the apartment community."
    },
    {
      "duty": "Direct the leasing staff and work with the Community Manager to recommend marketing and leasing strategies to meet the goals of Shea Properties."
    },
    {
      "duty": "Review and approve move-out statements, ensuring compliance with state law and company policies."
    },
    {
      "duty": "Coordinate with Leasing and Maintenance staff to schedule move-ins and ensure all apartments are inspected prior to move-in."
    },
    {
      "duty": "Manage resident and vendor files, ensuring completeness and accuracy of all paperwork and documentation."
    },
    {
      "duty": "Prepare and deliver all legal and formal notices in accordance with state law and company policy."
    },
    {
      "duty": "Maintain all account records and transactions, preparing reports in an accurate and timely manner."
    },
    {
      "duty": "Direct the functions of the leasing office, supervise the leasing staff’s daily activities, and prepare all leasing paperwork and documents."
    },
    {
      "duty": "Participate in the staff selection process, recruit, hire, and train leasing staff under the approval and direction of the Community Manager."
    },
    {
      "duty": "Prepare annual reviews for all direct reports, set goals and objectives, and implement Professional Development Plans for all associates."
    },
    {
      "duty": "Oversee and/or conduct weekly sales “leasing fundamentals” meetings and support industry networking."
    },
    {
      "duty": "Perform other duties as assigned, including handling on-call duties as directed by supervisor."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent (Some college level courses preferred)"
    }
  ]
}