{
  "meta": [
    {
      "job_title": "Tax Manager",
      "job_category": "Tax",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee tax compliance and reporting functions for California-based operations, including federal, state, and local tax filings."
    },
    {
      "duty": "Collaborate with international teams and headquarters in China to ensure alignment with global tax strategies and local tax laws."
    },
    {
      "duty": "Develop and implement tax planning strategies and optimization initiatives for cross-border transactions and transfer pricing."
    },
    {
      "duty": "Manage the timely submission of all tax returns and informational reporting, while monitoring changes in tax laws and regulations."
    },
    {
      "duty": "Lead efforts to resolve tax-related issues, audit, and review, ensuring effective communication with all relevant stakeholders."
    },
    {
      "duty": "Support and administer finance-related matters, banking liaison, and credit card management for the US company."
    }
  ],
  "skills": [
    {
      "skill": "Tax Compliance",
      "experience": 5
    },
    {
      "skill": "Tax Planning",
      "experience": 5
    },
    {
      "skill": "International Taxation",
      "experience": 5
    },
    {
      "skill": "Transfer Pricing",
      "experience": 5
    },
    {
      "skill": "Finance Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Accounting, Finance, or a related field."
    },
    {
      "credential": "US CPA or tax equivalent qualification."
    },
    {
      "credential": "Prior working experience at reputable Big 4 accounting firms is preferred."
    },
    {
      "credential": "Fluent Mandarin is preferred but not mandatory."
    },
    {
      "credential": "Familiarity with international taxation and cross-border transactions is an asset."
    },
    {
      "credential": "Excellent communication skills to effectively collaborate with colleagues at various locations."
    }
  ]
}