{
  "meta": [
    {
      "job_title": "Director of Table Games",
      "job_category": "Gaming",
      "job_class": "Director",
      "sector": "Casino",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Nevada Gaming Regulations",
      "experience": 5
    },
    {
      "skill": "Table Games Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Employee Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Alcohol Beverage Control Regulations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the daily operations of the Table Games department to ensure compliance with gaming regulations and company policies."
    },
    {
      "duty": "Coordinate, direct, and assist table games shift managers in evaluating casino games personnel and setting policies for the integrity of table games activity."
    },
    {
      "duty": "Create and understand financial reports and present them to the executive team, while also being responsible for monitoring monthly profit and loss statements."
    },
    {
      "duty": "Responsible for table inventory, ordering equipment and supplies, and determining new table games to introduce to the casino floor."
    },
    {
      "duty": "Supervise staff relationships with customers and fellow team members, monitor customer play for unusual activity, and ensure safety and security of employees and customers."
    },
    {
      "duty": "Carry out managerial responsibilities including interviewing, hiring, training employees, addressing complaints, and performing currency transaction reporting."
    },
    {
      "duty": "Attend operational/strategy meetings with senior management when scheduled and ensure compliance with Nevada Gaming Regulations and company policies."
    },
    {
      "duty": "Maintain knowledge of applicable company and departmental policies and procedures, and comply with all regulations and standards."
    },
    {
      "duty": "Maintain open communication with management, maintain a positive and professional demeanor during all interactions with guests, employees, and vendors, and accept performance feedback in a professional manner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or Equivalent Work Experience, Two+ years as a Table Game Department Manager or five+ years as a Table Game Shift Manager and two years as a department manager."
    }
  ]
}