{
  "meta": [
    {
      "job_title": "Senior Manager, Cybersecurity",
      "job_category": "Information Technology",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 190000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, implement, maintain, and evolve security solutions in a fast-paced high-growth startup environment."
    },
    {
      "duty": "Ensure the security and integrity of systems against an ever-evolving and changing security landscape."
    },
    {
      "duty": "Identify the short and long-term security needs of the organization to develop the company’s information security strategy."
    },
    {
      "duty": "Collaborate with teams to develop, implement, and govern security processes and best practices."
    },
    {
      "duty": "Participate in incident responses, containing, investigating, and preventing future information security incidents."
    },
    {
      "duty": "Analyze business projects and roadmaps, identifying security dependencies and risks, and assist in designing solutions to remediate those risks."
    },
    {
      "duty": "Stay informed about current and emerging security threats, providing insights on designing security capabilities to mitigate risks."
    },
    {
      "duty": "Test and audit information security controls in enterprise, cloud, and product environments."
    },
    {
      "duty": "Lead or participate in projects relating to risk management, compliance, business policies, vulnerability management, security Project Management, and Knowledge Management."
    },
    {
      "duty": "Collaborate in providing responses to customer security questionnaires and internal/external auditors regarding technology."
    },
    {
      "duty": "Work with product teams, leaders, and specialists to implement and drive a security strategic plan and vision for the business and products."
    },
    {
      "duty": "Collaborate with the sourcing and execution of external penetration tests and drive the remediation process of findings."
    },
    {
      "duty": "Solution frameworks and strategies that grow with the needs of the business, products, and customers/users, further strengthening and maturing the security posture."
    },
    {
      "duty": "Lead efforts to help keep the team secure with internal audits, learning sessions, and leading informative sessions with various teams."
    },
    {
      "duty": "Automate security tooling and plan for growth and expansion."
    }
  ],
  "skills": [
    {
      "skill": "Cybersecurity",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "System Security",
      "experience": 5
    },
    {
      "skill": "Cloud Security",
      "experience": 5
    },
    {
      "skill": "SaaS Industry",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Incident Response",
      "experience": 5
    },
    {
      "skill": "Information Security Testing",
      "experience": 5
    },
    {
      "skill": "Security Automation",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Staff level experience in cybersecurity or related fields. CISM, CCSK, and CISSP certifications are a plus but not required. Bachelor's degree in Cybersecurity, Computer Science, or a related field (Master's preferred)"
    }
  ]
}