{
  "meta": [
    {
      "job_title": "Sales Enablement and Development Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 225000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Enablement",
      "experience": 5
    },
    {
      "skill": "Sales Operations",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Sales Enablement Tools",
      "experience": 5
    },
    {
      "skill": "Sales Processes",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a comprehensive sales enablement strategy aligned with the company's goals and objectives."
    },
    {
      "duty": "Conduct regular assessments of sales team needs, market trends, and competitive intelligence to adapt and refine sales enablement initiatives."
    },
    {
      "duty": "Design and deliver training programs, materials, and sessions to enhance the skills and knowledge of the sales team."
    },
    {
      "duty": "Collaborate with marketing, product management, and sales teams to create, manage, and evaluate compelling sales collateral, presentations, and tools."
    },
    {
      "duty": "Define and track KPIs; analyze sales data and performance metrics to identify trends, areas of improvement, and opportunities for enhanced sales effectiveness."
    },
    {
      "duty": "Provide regular reporting and insights to sales leadership and other stakeholders on the impact of sales enablement initiatives on sales performance."
    },
    {
      "duty": "Lead and develop the sales development team, including training, coaching, and performance management. Serve as a subject matter expert on sales processes, methodologies, and tools."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 90,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in business, marketing, or a related field (MBA preferred)"
    }
  ]
}