{
  "meta": [
    {
      "job_title": "Program Manager Non Tech",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Non-Tech",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "SAP Experience",
      "experience": 1
    },
    {
      "skill": "Excel Experience",
      "experience": 5
    },
    {
      "skill": "Order Management",
      "experience": 3
    },
    {
      "skill": "Retail Planning",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Supplier/Vendor Management",
      "experience": 5
    },
    {
      "skill": "Exceptional Excel Skills",
      "experience": 5
    },
    {
      "skill": "Experience with SAP",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Analytical Acumen",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage all operational facets of relationships with CSO Direct Channel (MS Stores), including Supply Chain Execution, Processes, Inventory Management, Reporting, Process Optimization, and Global Shipping Strategy."
    },
    {
      "duty": "Manage all SAP order management processes for CSO Direct Channel, including executing multi-channel PO and item level transactions, facilitating order creation, modification, and cancellation requests."
    },
    {
      "duty": "Gather feedback from planning, CSS, supply chain, and the CSO Direct Channel business group to resolve open order issues in a timely fashion, and create and maintain ad hoc performance and financial reports."
    },
    {
      "duty": "Administer SAP testing associated with new or updated CSO Direct Channel Order Management functionality, and maintain dashboards and process documentation for CSO Direct Channel management."
    },
    {
      "duty": "Conduct re-occurring weekly meetings with MSCIS BPO Order Management team to ensure all Order management processes are up to date, and manage and maintain all PO, shipment, and AP related issues."
    },
    {
      "duty": "Represent Supply Chain for the AOC commercial channel with Sales, manage all internal order requests and route appropriately, and manage communications with distribution, transportation, merchandising, and sales teams."
    },
    {
      "duty": "Serve as Test Lead for MS Store Online Geo Expansion sites within Americas, create/review all test cases scenarios, schedule tests, manage test execution team, track test cases and results, and drive bug resolution with IT teams."
    },
    {
      "duty": "Balance strategic concepts/goals with tactical tasks, and deal well with ambiguity."
    },
    {
      "duty": "Create and execute comprehensive marketing strategies to enhance brand visibility and promote freight and logistics services, lead a team of marketing specialists, analyze market trends and customer behavior to identify growth opportunities, manage the company's online presence, and oversee participation in industry events, conferences, and trade shows."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Management, Business, or a related field (Master's preferred)"
    }
  ]
}