{
  "meta": [
    {
      "job_title": "Leadership Development Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Leadership Development",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Business Intelligence",
      "experience": 5
    },
    {
      "skill": "Coaching and Mentoring",
      "experience": 5
    },
    {
      "skill": "Budget Preparation",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the global KPI performance of all portfolios of properties specific to market or leadership division."
    },
    {
      "duty": "Analyze Business Intelligence data to identify performance deficiencies based on KPIs and dispatch Performance Associates to develop corrective actions immediately by setting comprehensive goals and tasks."
    },
    {
      "duty": "Partner with Leadership Development team to develop and lead deployment of regional leadership onboarding cohorts, designed to decrease ramp time, and increase performance."
    },
    {
      "duty": "Serve as a change management consultant, advocating gaps and feedback identified in the field, helping prioritize development and communicating strategy on implementation to the field operators."
    },
    {
      "duty": "Develop and deploy regional leadership coaching based on business needs to drive market health, financial management, and leadership development to improve market performance & employee satisfaction."
    },
    {
      "duty": "Curate supporting tools and resources to reinforce enablement strategy, increasing efficiency and effectiveness."
    },
    {
      "duty": "Influence regional management strategy through training and reinforcement on comprehension of property performance, leveraging KPIs to make data-driven decisions."
    },
    {
      "duty": "Manage a team of Performance Associates that complete boots on the ground coaching sessions."
    },
    {
      "duty": "Ensure alignment of field training activities with key internal events, such as strategic initiatives, platform rollouts, and campaigns, providing SME support."
    },
    {
      "duty": "Oversee professional development and mentorship of said team."
    },
    {
      "duty": "Remain up to date on the most current processes and best practices of each program."
    },
    {
      "duty": "Conduct ad hoc coaching sessions with Regional Manager Associates and above."
    },
    {
      "duty": "Work collaboratively with Training and Experience Teams as well as Portfolio Analytics team to determine the course of action as it relates to training, coaching, and mentoring."
    },
    {
      "duty": "Facilitate high levels of communication with Operations to effectively measure the outcomes of property performance."
    },
    {
      "duty": "Work in conjunction with all company departments to understand the full picture of a property’s challenges and collaborate with adjoining departments to execute a performance strategy."
    },
    {
      "duty": "Maintain a relationship with vendors for support including but not limited to Customer Management Systems, Video shops, Property Management Systems, Learning Experience Platforms, and Business Intelligence."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree from a four-year college or university, or one to two years related experience and/or training, or equivalent combination of education and experience."
    }
  ]
}