{
  "meta": [
    {
      "job_title": "Board and Legal Support Specialist",
      "job_category": "Legal",
      "job_class": "Specialist",
      "sector": "Legal",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Legal Compliance",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Sustainability Programs",
      "experience": 7
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organization Skills",
      "experience": 5
    },
    {
      "skill": "MS Office Suite",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, manage, and support all aspects of public company Board and Committee meetings."
    },
    {
      "duty": "Provide comprehensive support to the Board of Directors and communicate directly with Directors, Executives, and their assistants on Board and Committee related matters."
    },
    {
      "duty": "Prepare Board and Committee meeting schedules, agendas, minutes, and resolutions."
    },
    {
      "duty": "Manage posting, publishing, and updating of Board and Committee materials via online platform (Diligent) and oversee logistics for in-person meetings."
    },
    {
      "duty": "Develop and manage Board and Committee calendars, track against regulatory and other requirements, and execute on corporate governance activities."
    },
    {
      "duty": "Oversee and track expense reporting for Board-related expenses and reconciliation for Directors."
    },
    {
      "duty": "Work closely with the Legal, Risk & Sustainability (LRS) department on projects, tasks, and initiatives as needed, including legal, compliance, and litigation notifications; risk and insurance program needs; sustainability program needs; and vendor management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience, Master's preferred."
    }
  ]
}