{
  "meta": [
    {
      "job_title": "Specialist, Investment Analytics of Commercial Mortgage Loans",
      "job_category": "Investment Analytics",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Reporting",
      "experience": 3
    },
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Data Governance",
      "experience": 2
    },
    {
      "skill": "Business Process Enhancement",
      "experience": 3
    },
    {
      "skill": "Business Analysis",
      "experience": 3
    },
    {
      "skill": "PowerPoint",
      "experience": 3
    },
    {
      "skill": "Excel",
      "experience": 3
    },
    {
      "skill": "Tableau",
      "experience": 2
    },
    {
      "skill": "PowerBI",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the development of a commercial mortgage loan (CML) portfolio surveillance and credit risk management framework."
    },
    {
      "duty": "Assist in the creation, review, development, design, and maintenance of presentations, dashboards, reporting, and other written materials for senior leadership, department, and platform updates."
    },
    {
      "duty": "Support reporting, presentations, dashboards, and other written materials related to CMLs for various internal and external committees and constituencies."
    },
    {
      "duty": "Collaborate with the Financial Reporting department on the monthly pricing of the entire mortgage loan portfolio."
    },
    {
      "duty": "Maintain knowledge of internal and external initiatives that influence the data governance and technology strategies of the CML team."
    },
    {
      "duty": "Lead efforts to document and enhance current business processes and lead special projects impacting CML business."
    },
    {
      "duty": "Serve as the lead Business Analyst for CML technology initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree or equivalent work experience in business, finance, technology, and/or real estate. Bachelor's degree recommended."
    }
  ]
}