{
  "meta": [
    {
      "job_title": "Safety Manager",
      "job_category": "Safety",
      "job_class": "Manager",
      "sector": "Safety",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Supervisory Experience",
      "experience": 7
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 7
    },
    {
      "skill": "Occupational Health",
      "experience": 7
    },
    {
      "skill": "Safety Management Systems",
      "experience": 7
    },
    {
      "skill": "Emergency Preparedness",
      "experience": 7
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, direct, organize, and manage professional and technical staff administering and implementing safety programs and plans related to workplace safety and loss prevention."
    },
    {
      "duty": "Oversee the implementation and coordination of various safety management programs including training, environmental compliance, emergency preparedness, and business recovery programs."
    },
    {
      "duty": "Develop and direct the administration and continuous maintenance of a diverse range of policies, procedures, and workforce safety programs and plans."
    },
    {
      "duty": "Contribute to the development and maintenance of the District's Emergency Preparedness Program and Emergency Operations and Business Recovery Plans."
    },
    {
      "duty": "Oversee and lead staff in conducting audits and analysis of hazards, workplace injuries, accident investigations, trend analysis, and development of corrective action plans (CAPs)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Risk Management, Occupational Health, or closely related field (Master's preferred)"
    },
    {
      "credential": "Certification as a Certified Safety Professional (CSP), Certified Emergency Manager (CEM) or certificate of completion in the Transit Safety and Security Program (TSSP)"
    },
    {
      "credential": "Valid Class C California Driver License and meet the District's driving standards"
    }
  ]
}