{
  "meta": [
    {
      "job_title": "Graphic Designer",
      "job_category": "Design",
      "job_class": "Designer",
      "sector": "Creative",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Graphic Design",
      "experience": 5
    },
    {
      "skill": "Adobe Suite",
      "experience": 5
    },
    {
      "skill": "Photo Retouching",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 3
    },
    {
      "skill": "Creative Content Creation",
      "experience": 3
    },
    {
      "skill": "Website Design",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create compelling and effective designs across all visual touch points, including email design, lookbook design, website design updates, photo retouching, and Instagram templates."
    },
    {
      "duty": "Collaborate with Art Director to explore, develop, and execute the vision for all brand assets across multiple mediums."
    },
    {
      "duty": "Design and manage all cross-channel paid ad asset creation and pass-off, working with Art Director."
    },
    {
      "duty": "Manage website design and collateral needs, including updating assets for the website and passing off deliverables in correct dimensions and formats to the ecomm team."
    },
    {
      "duty": "Retouch and re-color all images, including lifestyle campaign imagery and product images."
    },
    {
      "duty": "Create and update various design, sales, and marketing materials such as Style Guide, gifting packets for influencers, brand guidelines, and internal decks."
    },
    {
      "duty": "Maintain brand guidelines within the scope of your role, as laid out by the Art Director."
    },
    {
      "duty": "Attend and actively participate in all weekly content and marketing meetings, as led by CMO and Art Director."
    },
    {
      "duty": "Always be aware of the content we have and how we’re using it cross-channel."
    },
    {
      "duty": "Understand the world and vision of all four brands, and be able to source photos and utilize brand imagery assets to tell their said story in an artistic and creatively innovative way."
    },
    {
      "duty": "Ownership of design-related organization in Box–files accessible to everyone and clearly organized."
    },
    {
      "duty": "Research and present new trends. Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Graphic Design or related field"
    }
  ]
}