{
  "meta": [
    {
      "job_title": "Litigation Paralegal",
      "job_category": "Legal",
      "job_class": "Paralegal",
      "sector": "Legal",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serves as a contact in Central Office for the Litigation Team, answering phones, scheduling attorney meetings and other logistical arrangements and handling any litigation-related mail in Central Office."
    },
    {
      "duty": "Serves as a resource and screener for legal/litigation issues and questions arising in all the Districts and Central Office, and when necessary, directs legal issues to the appropriate resources within the Legal Division."
    },
    {
      "duty": "Serves as a principal Litigation Team contact with outside counsel for matters in litigation or pre-litigation."
    },
    {
      "duty": "Responsible for creation and maintenance of Litigation Team files in case management system, including directing intake of new matters, opening files in case management system, tracking down additional information needed by attorneys to process requests for legal assistance, maintenance of any paper working files as needed and uploading/organizing pleadings/notices/discovery /correspondence/etc. in each matter in the case management system."
    },
    {
      "duty": "Responsible for paralegal functions including drafting, editing and finalizing simple pleadings, correspondence, and other various legal documents requested by the attorneys."
    },
    {
      "duty": "Locating and gathering information and documents responsive to discovery requests for review by attorneys, INDOT and outside counsel."
    },
    {
      "duty": "Managing, responding to and tracking tort claim notices for the Litigation Team, including coordinating notices with the Office of the Attorney General."
    },
    {
      "duty": "Assist attorneys in follow-up and tracking status of litigation, discovery, non-party requests for production and other matters for all Districts and Central Office, including assisting with gathering signatures and reviewing documents to be disclosed depending on responsiveness and confidentiality."
    },
    {
      "duty": "File and document organization and retention in accordance with Legal Division guidance for Central Office."
    },
    {
      "duty": "Reviewing online court dockets for all litigation of the Team."
    },
    {
      "duty": "Evaluate all new online court docket entries, uploading and distributing to our Team recent pleadings and court orders."
    },
    {
      "duty": "Calendar all new critical dates for all litigation of the Team, providing notice to our Team attorneys."
    },
    {
      "duty": "File/serve documents and pleadings."
    },
    {
      "duty": "Update the Team’s case management system with information/deadlines."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 70,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Law or Paralegal Studies"
    }
  ]
}