{
  "meta": [
    {
      "job_title": "Litigation Associate Attorney",
      "job_category": "Legal",
      "job_class": "Associate",
      "sector": "Law",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Litigation",
      "experience": 5
    },
    {
      "skill": "Legal Research",
      "experience": 5
    },
    {
      "skill": "Legal Writing",
      "experience": 5
    },
    {
      "skill": "Discovery Process",
      "experience": 5
    },
    {
      "skill": "Legal Analysis",
      "experience": 5
    },
    {
      "skill": "Case Management",
      "experience": 5
    },
    {
      "skill": "Courtroom Litigation",
      "experience": 5
    },
    {
      "skill": "Dispute Resolution",
      "experience": 5
    },
    {
      "skill": "Client Counseling",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review and analysis of the initial pleading, overseeing calendaring of critical deadlines, filing of an answer, including identification of appropriate affirmative defenses."
    },
    {
      "duty": "Developing and implementing an appropriate discovery plan, including oversight and preparation of discovery responses for review by partner and then client."
    },
    {
      "duty": "Review and understand litigation documents including claim files, medical records and other documents typically gathered in litigated matters."
    },
    {
      "duty": "Preparation of initial report and budget for ultimate review and approval by supervising partner."
    },
    {
      "duty": "Recommendations for and drafting of discovery motions and handling argument of same."
    },
    {
      "duty": "Identification of critical legal issues to move case to a conclusion in consultation with supervising partner."
    },
    {
      "duty": "Attend and conduct fact witness and some expert witness depositions, which may include travel."
    },
    {
      "duty": "Preparation of dispositive motions for review and approval by partner as requested by supervising partner."
    },
    {
      "duty": "Legal research and preparation of legal memoranda as requested by the client and directed by the supervising partner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Juris Doctor (J.D.) degree from an American Bar Association accredited law school"
    }
  ]
}