{
  "meta": [
    {
      "job_title": "Scrum Product Owner",
      "job_category": "Software Development",
      "job_class": "Owner",
      "sector": "Software Engineering",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Scrum Product Owner",
      "experience": 10
    },
    {
      "skill": "Scrum Master",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 10
    },
    {
      "skill": "Written Communication",
      "experience": 10
    },
    {
      "skill": "Problem Solving",
      "experience": 10
    },
    {
      "skill": "Product Development",
      "experience": 10
    },
    {
      "skill": "Process Improvement",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Financial Services",
      "experience": 5
    },
    {
      "skill": "Digital Platforms",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Take lead in many aspects of product development including helping the team during the sprint, presenting the product vision to stakeholders, and prioritizing and grooming a backlog for the scrum team."
    },
    {
      "duty": "Communicate goals and vision to internal customers, other product/scrum teams, and the development team, provide a product road map to the team—a high-level, strategic visual summary of the vision and goals."
    },
    {
      "duty": "Build and prioritize epics, user stories, issues, and tasks according to business objectives and overall strategy, factoring in project dependencies that will affect the sequence of development."
    },
    {
      "duty": "Oversee the development of the product through all its stages, including the planning, refinement, review, and sprint for each event. Meet with the team to refine the process, answer questions, and define areas for improvement."
    },
    {
      "duty": "Act as the primary communicator between stakeholders and development teams; getting buy-in from the former group on all major decisions and giving clear instructions and priorities to the developers."
    },
    {
      "duty": "Understand client requirements and anticipate what they want, thus better manage the development process, anticipate problems, and find good solutions."
    },
    {
      "duty": "Take a leading role in evaluating the product progress through each iteration and making decisions on the next steps in the development process."
    },
    {
      "duty": "Run the scrum and manage the scrum board and other scrum ceremonies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, Information Systems, or a related field (or foreign equivalent degree) or equivalent work experience and/or certifications"
    },
    {
      "credential": "Certified Scrum Product Owner (CSPO) or other relevant certifications"
    }
  ]
}