{
  "meta": [
    {
      "job_title": "Senior Homeownership Analyst",
      "job_category": "Banking",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Real Estate Lending",
      "experience": 5
    },
    {
      "skill": "Underwriting",
      "experience": 5
    },
    {
      "skill": "Property Management",
      "experience": 5
    },
    {
      "skill": "Affordable Housing Programs",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Office Software",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in the administration of the Federal Home Loan Bank of Des Moines' Affordable Housing Program (AHP)."
    },
    {
      "duty": "Review and analyze AHP homeownership project applications, income statements, cost breakdowns, and legal documents."
    },
    {
      "duty": "Promote FHLB Des Moines Affordable Housing Products through direct calling, presentations, and feasibility review."
    },
    {
      "duty": "Independently analyze and recommend modifications and repayment options for non-compliant projects."
    },
    {
      "duty": "Collaborate with Information Technology partners, Member Institutions, nonprofit and for-profit developers, and local, state & federal governments during the funding and monitoring of AHP projects."
    },
    {
      "duty": "Provide technical assistance to Sponsor Organizations, Member Institutions, and support to Homeownership Analyst(s) in completion of AHP projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Finance, Accounting, Business, Economics, Real Estate or related field or equivalent experience required; progress towards MBA, graduate school of banking degree or equivalent preferred. Professional certification in an accredited housing and economic development educational program, such as the National Development Council Economic Development Finance Professional Certification is helpful"
    }
  ]
}