{
  "meta": [
    {
      "job_title": "Financial Analyst - Staffing and Resource Planning",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Financial",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Workforce Planning",
      "experience": 5
    },
    {
      "skill": "Excel",
      "experience": 5
    },
    {
      "skill": "Financial Modeling",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with department managers and HR to develop staffing plans and resource allocation strategies that align with the organization's goals and financial parameters."
    },
    {
      "duty": "Monitor and analyze staffing budgets, ensuring accurate allocation of resources and adherence to financial guidelines."
    },
    {
      "duty": "Conduct financial forecasting and scenario modeling to assist in the planning of staffing needs across various departments and projects."
    },
    {
      "duty": "Prepare and present comprehensive staffing and resource planning reports to senior management, highlighting financial implications and recommendations."
    },
    {
      "duty": "Assist in the development of business cases for new hires, promotions, and workforce adjustments, including cost analysis and ROI projections."
    },
    {
      "duty": "Identify cost-saving opportunities and process improvements related to staffing and resource allocation."
    },
    {
      "duty": "Provide financial insights for workforce planning initiatives, helping to optimize staffing strategies based on financial impact."
    },
    {
      "duty": "Assist in the development and maintenance of staffing-related financial models and tools."
    },
    {
      "duty": "Support the annual budgeting process by providing staffing-related financial data and insights."
    },
    {
      "duty": "Stay informed about industry trends, labor market conditions, and regulatory changes that impact staffing and resource planning."
    },
    {
      "duty": "Work closely with HR and finance teams to ensure accurate tracking and reporting of staffing-related expenses."
    },
    {
      "duty": "Participate in cross-functional projects aimed at enhancing staffing efficiency and financial management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 20,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business Administration, Human Resources, or a related field. Master's degree or relevant certifications (e.g., CFA, SHRM-CP) are a plus."
    }
  ]
}