{
  "meta": [
    {
      "job_title": "Executive Director",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "The overall responsibility for the complete operation of the Chamber including programs, planning and operations, working under policy guidelines of the Board of Directors and Executive Committee."
    },
    {
      "duty": "Responsible for the full range of activities: coordination of the program of work; organizational structure and procedures; motivation of volunteers; income and expenditures; maintenance of membership; employment, training and supervision of staff; interpretation of policy; maintenance of quarters; and long-range planning."
    },
    {
      "duty": "Oversees development and implementation of programs that will channel resources of the organization toward specific objectives defined by the organizations Strategic Plan."
    },
    {
      "duty": "Provides leadership in the organization, planning and implementing strong business advocacy on those social and economic issues affecting the business community."
    },
    {
      "duty": "Demonstrates leadership in the community through involvement and participation. Constantly strives to develop a better public understanding of the purpose and functions of the organization."
    },
    {
      "duty": "Oversees and manages the fiscal resources of the organization. Prepares the annual operating budget with line-item identification of expenses and income for all activities of the Chamber and its related organizations or projects."
    },
    {
      "duty": "Develops an appropriate staff, assign functions, defines lines of authority and responsibility, and sets up an efficient system of operation."
    },
    {
      "duty": "Oversees membership programs to ensure necessary growth in income and services for the operation of the program."
    },
    {
      "duty": "Directs all communications to the membership and general public. Ensures that organizational and business concerns are communicated regularly and effectively to all parties concerned and that organizational brochures, newsletters, and electronic communication are accurate, timely, and reflective of the organizational views."
    },
    {
      "duty": "Works with Board to establish and implement the corporate mission and vision. Provides leadership, training, and input to the Board."
    },
    {
      "duty": "Assures the organization's compliance with applicable laws and regulations. Assures adequate records of all transactions and correspondence are maintained for review by auditors, the Board, or other officials or agencies."
    },
    {
      "duty": "Serves as the official administrative representative and spokesperson of the Chamber in all instances and situations when such representation is appropriate."
    },
    {
      "duty": "Participates in Chamber activities to promote and enhance the image and relationship of the Chamber with all groups and parties in the community."
    },
    {
      "duty": "Sits as a non-voting member of the Board of Directors, Executive Committee and all committees. Serves as corporate secretary."
    },
    {
      "duty": "Coordinates work of all Committees and Departments."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Organizational Development",
      "experience": 5
    },
    {
      "skill": "Advocacy",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Public Relations",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration or a related field (Master's preferred)"
    },
    {
      "credential": "Previous experience in a leadership role or executive management position"
    }
  ]
}