{
  "meta": [
    {
      "job_title": "Management Consultant",
      "job_category": "Consulting",
      "job_class": "Consultant",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Operations Management Consulting",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Lean Principles",
      "experience": 5
    },
    {
      "skill": "Continuous Improvement",
      "experience": 5
    },
    {
      "skill": "Client Management",
      "experience": 5
    },
    {
      "skill": "Industrial Engineering",
      "experience": 5
    },
    {
      "skill": "Toyota Production System",
      "experience": 5
    },
    {
      "skill": "Danaher Business System",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Financial Acumen",
      "experience": 5
    },
    {
      "skill": "Flexibility",
      "experience": 5
    },
    {
      "skill": "Motivation",
      "experience": 5
    },
    {
      "skill": "Creativity",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assess and analyze current situation within operations excellence projects, collect data, and implement solutions to eliminate waste and achieve tangible results."
    },
    {
      "duty": "Provide support to senior management consultants and client personnel using analytical skills and operational excellence methods to achieve continuous improvements on the shop floor and in the office."
    },
    {
      "duty": "Break down and outline the client's key strategic production/operations issues, and develop standard work, assist in A3 introduction, establish SQDC boards and daily tiered meeting process."
    },
    {
      "duty": "Review and update plans, consult with clients remotely, plan future engagements, provide developmental training, and develop new training materials when necessary."
    },
    {
      "duty": "Develop presentation and other deliverable structures, and participate in the presentation of diagnostics reports."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree OR equivalent experience in manufacturing. Previous experience could include: production supervisor/manager, continuous improvement coordinator, industrial engineer, etc. Basic understanding of the fundamental technical principles and the methodologies of the Toyota Production System, the Danaher Business System or other similar management operating systems. Personal characteristics that include: flexibility, highly motivated, creative, an entrepreneurial spirit with financial acumen. Ability to influence and lead others through change."
    }
  ]
}