{
  "meta": [
    {
      "job_title": "Readiness Coordinator",
      "job_category": "Logistics",
      "job_class": "Coordinator",
      "sector": "Operations",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Planning and Scheduling",
      "experience": 4
    },
    {
      "skill": "Safety Management",
      "experience": 4
    },
    {
      "skill": "Operations Supervision",
      "experience": 4
    },
    {
      "skill": "Resource Utilization",
      "experience": 4
    },
    {
      "skill": "Customer Interaction",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 4
    },
    {
      "skill": "SAP",
      "experience": 4
    },
    {
      "skill": "GIS",
      "experience": 4
    },
    {
      "skill": "CLICK",
      "experience": 4
    },
    {
      "skill": "PowerOn",
      "experience": 4
    },
    {
      "skill": "CAD/AutoCAD",
      "experience": 4
    },
    {
      "skill": "Energy Delivery Outage Application",
      "experience": 4
    },
    {
      "skill": "Database Query Tools",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct short-range planning and scheduling of operational processes to ensure overall job readiness and minimize safety exposures."
    },
    {
      "duty": "Assist in providing reliable support to operations supervision by planning and scheduling activities, managing the work queue, staffing, equipment, materials, tools, permits, and work package instructions."
    },
    {
      "duty": "Develop a firm two-week plan of assigned operations center activities and a one-month projection of anticipated future activities."
    },
    {
      "duty": "Coordinate work request activities and perform pre-construction work request assessments to facilitate optimal resource utilization."
    },
    {
      "duty": "Ensure UG Utility locates, switching/hold offs, and manage time and priorities while providing support to supervision in establishing work commitment dates."
    },
    {
      "duty": "Reflect lines employees crewing and vehicle assignments, utilizing CLICK, and participating in interactions with internal/external customers on inquiries concerning construction and maintenance activities."
    },
    {
      "duty": "Physically visit jobs to determine job readiness state, utilize the job readiness checklist, identify and apply safe work practices, and adhere to motor vehicle safety regulations."
    },
    {
      "duty": "Assist during emergencies and storm-related activities and travel to off-site locations, training facilities, and customer sites when required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering Technology or related discipline (or equivalent work experience)"
    }
  ]
}