{
  "meta": [
    {
      "job_title": "Operations Manager - Hauling",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Environmental Services",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Manage a staff, including hiring, training, coaching, performance management; develop supervisory goals and objectives; and effective resolution of safety issues and claims."
    },
    {
      "duty": "Implement and execute plans to complement the business unit’s strategic and operating plan; champion the execution of tactical initiatives within the Business Unit to maximize the customer experience, growth and durability, while optimizing profitability."
    },
    {
      "duty": "Ensure maximum productivity and route management systems for commercial, roll-off and residential routes and establish productivity goals where needed; ensure adherence to operating standards; and manage labor hours and disposal expenses."
    },
    {
      "duty": "Interact with customers and local, state and federal government employees to resolve customer service concerns; ensure regulatory compliance standards are met."
    },
    {
      "duty": "Oversee effective safety and accident prevention programs to ensure all reasonable action are taken to prevent accidents and injuries; ensure a safe and productive work environment for all employees; implement and maintain and effective loss control and safety program."
    },
    {
      "duty": "Lead operations to ensure compliance with all standards including environmental, operating, regulatory, safety, accounting and ethics."
    },
    {
      "duty": "Approve expenses and manage budget for the operations department including approval of purchase orders and vendor pricing."
    },
    {
      "duty": "Develop a best-in-class team and workplace culture and effectively manage performance and talent development; drive best-practice sharing."
    },
    {
      "duty": "Build and maintain strong and effective relations with relevant government, community and environmental groups."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED. Minimum of 2 years of supervisory or management experience or participation in Republic Services’ management trainee program."
    }
  ]
}