{
  "meta": [
    {
      "job_title": "Beauty Specialist - Mens Fragrance",
      "job_category": "Beauty",
      "job_class": "Specialist",
      "sector": "Retail",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Interact with clients and provide an elevated client experience."
    },
    {
      "duty": "Use Saks Fifth Avenue services and tools to obtain and grow business."
    },
    {
      "duty": "Utilize knowledge to offer personalized assistance and enhance the shopping experience."
    },
    {
      "duty": "Actively collaborate and contribute to a positive and inclusive team dynamic."
    },
    {
      "duty": "Constantly look for opportunities to improve the way things are done."
    },
    {
      "duty": "Demonstrate comfort in flexing all communication styles and establish positive interpersonal relationships."
    },
    {
      "duty": "Learn and utilize online clienteling tools and software, and use social media and technology."
    },
    {
      "duty": "Previously demonstrated successful sales experience."
    },
    {
      "duty": "Focus on achieving and exceeding individual cosmetic sales goals, event sales goals, and department daily & monthly sales goals."
    },
    {
      "duty": "Provide a dynamic service presence to each location."
    },
    {
      "duty": "Use appropriate questions to identify a client’s needs in order to provide guidance or directions."
    },
    {
      "duty": "Actively participate on social media to grow personal brand and business."
    },
    {
      "duty": "Demonstrate professional make-up and treatment consultation and application."
    },
    {
      "duty": "Maintain a consistent high level of service by creating and developing excellent client relationships."
    },
    {
      "duty": "Cross sell beyond one line to drive results and build client loyalty."
    },
    {
      "duty": "Be thoroughly knowledgeable on all in-store services and offer the appropriate service to further personalize and enhance the shopping experience."
    },
    {
      "duty": "Maintain counter standards by ensuring a clean, tidy, and welcoming space."
    }
  ]
}