{
  "meta": [
    {
      "job_title": "Content Specialist",
      "job_category": "Content",
      "job_class": "Specialist",
      "sector": "Assessment & Qualifications",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage one or more handscoring contracts, including scheduling, resource planning, training, coordinating with program and project managers, and post-project work."
    },
    {
      "duty": "Utilize thorough knowledge of science topics for Elementary, Middle, and High School Science, apply state and national science standards, and provide expertise and management in Math assessments."
    },
    {
      "duty": "Communicate with various roles via chat, email, phone, posted reports, video conference meetings, and in-person or virtual interactions."
    },
    {
      "duty": "Mentor and train Scoring Directors, Supervisors, and Scorers, and provide live or pre-recorded training on Science and potentially Math items."
    },
    {
      "duty": "Make sound business decisions under tight deadlines, maintain a confidential work environment, and use common Microsoft Office applications and video conferencing tools."
    }
  ],
  "skills": [
    {
      "skill": "Science Knowledge",
      "experience": 5
    },
    {
      "skill": "Mathematics Knowledge",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Education Background",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Technology Skills",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required, preferably in Life Science or Physical Sciences, with additional Math college courses preferred (Master's preferred). Two (2) years assessment industry experience as a Scoring Director or equivalent"
    }
  ]
}