{
  "meta": [
    {
      "job_title": "Supervisor Patient Access",
      "job_category": "Administrative",
      "job_class": "Supervisor",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    },
    {
      "skill": "Performance Management",
      "experience": 3
    },
    {
      "skill": "Compliance",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Facilitate the daily operations of the registration/admitting/pre-visit area to ensure efficient patient registration."
    },
    {
      "duty": "Assign work duties for efficient registration of patients and maintain employee schedules."
    },
    {
      "duty": "Respond to internal and external customer inquiries and concerns in accordance with Rush policies and procedures."
    },
    {
      "duty": "Direct and coordinate the daily activities of the Patient Access Coordinators for efficient workload management."
    },
    {
      "duty": "Effectively collaborate with subordinates, supervisors, internal, and external customers to achieve departmental and medical center goals."
    },
    {
      "duty": "Recognize process problems, identify opportunities for process improvements, and assist in developing collaborative approaches to resolve the issues."
    },
    {
      "duty": "Acknowledge employee efforts and reward/acknowledge their achievements, provide effective instruction, and administer timely, thoughtful, constructive disciplinary actions when needed."
    },
    {
      "duty": "Complete daily/weekly monitoring in an accurate, constructive, timely manner and compile the data for use in annual performance assessments."
    },
    {
      "duty": "Conduct periodic staff meetings as a way of communicating updates to the staff and instruction on new policies and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or GED."
    },
    {
      "credential": "Three years supervisory experience in a healthcare-related field, i.e. hospital, physician practice, or clinic."
    },
    {
      "credential": "Comprehensive understanding of the functions of Patient Access within the healthcare field."
    },
    {
      "credential": "Ability to effectively communicate both verbally and in writing to subordinates, superiors, and customers in a variety of ways."
    },
    {
      "credential": "Ability to identify components within a process that require improvements, facilitate the improvement process, and achieve the desired goal of improving the services provided by Patient Access."
    }
  ]
}