{
  "meta": [
    {
      "job_title": "Senior Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 162500,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Enterprise Sales",
      "experience": 15
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Revenue Growth",
      "experience": 5
    },
    {
      "skill": "New Business Development",
      "experience": 5
    },
    {
      "skill": "CRM Experience",
      "experience": 5
    },
    {
      "skill": "C-Level Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Sales Strategy Development",
      "experience": 5
    },
    {
      "skill": "Cross-Selling",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead all aspects of the Sales Function of the Built Environment team."
    },
    {
      "duty": "Guide change initiatives and new business models."
    },
    {
      "duty": "Champion an engaged, inclusive work environment for employees with a winning culture."
    },
    {
      "duty": "Develop, communicate, and manage the successful performance of regional revenue goals and manages budgets."
    },
    {
      "duty": "Understand and effectively leverage customer, industry, and internal sales information to drive performance and sustain a competitive edge."
    },
    {
      "duty": "Direct the development and execution of customer relationship plans that detail business goals and strategies which deliver customer solutions."
    },
    {
      "duty": "Manage and improve sales strategies and processes and ensures their execution within the team of direct reports."
    },
    {
      "duty": "Develop and motivate sales professionals by coaching and transferring the knowledge of sales techniques, service offerings, and industry knowledge to drive results."
    },
    {
      "duty": "Manage the performance of direct reports by developing accountabilities, establishing performance objectives, and providing career counseling, feedback, and guidance."
    },
    {
      "duty": "Collaborate closely with leadership to promote cross-selling."
    },
    {
      "duty": "Lead client engagement by developing and managing relationships with key decision-makers for large and medium customers."
    },
    {
      "duty": "Provide strategic insights on building regulations, codes, and requirements to ensure proactive insights on safe, secure, and sustainable buildings, risk management solutions, and tenant wellness and safety validations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree is required (Master's preferred)."
    }
  ]
}