{
  "meta": [
    {
      "job_title": "Data Analytics Specialist",
      "job_category": "Data Analytics",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "SQL",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Data Structures",
      "experience": 3
    },
    {
      "skill": "Data Modeling",
      "experience": 3
    },
    {
      "skill": "Big Data Systems",
      "experience": 3
    },
    {
      "skill": "Data Governance",
      "experience": 3
    },
    {
      "skill": "Workflow Management",
      "experience": 3
    },
    {
      "skill": "Python",
      "experience": 1
    },
    {
      "skill": "Soft Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Understand and advocate for user needs, contributing to the overall product vision and aligning stakeholders."
    },
    {
      "duty": "Prioritize product features and functions, making decisions that contribute to the product's success."
    },
    {
      "duty": "Translate complex technical requirements into practical, data-driven solutions."
    },
    {
      "duty": "Learn about capital markets intricacies and engage in various product management tasks."
    },
    {
      "duty": "Collaborate with Data Engineering, Data Science and Business teams to document requirements and connect them to real-world applications."
    },
    {
      "duty": "Participate in design-thinking workshops to generate innovative ideas and create design plans."
    },
    {
      "duty": "Help define testing requirements, assist with user acceptance testing, and ensure smooth operations."
    },
    {
      "duty": "Assist with data analysis using tools like SQL or Python to identify opportunities and gaps."
    },
    {
      "duty": "Contribute to data integrity efforts and learn about data governance principles."
    },
    {
      "duty": "Support troubleshooting, identify issues, and maintain clear communication across teams."
    },
    {
      "duty": "Contribute to project management activities and engage with stakeholders effectively."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Data Analytics, Business, or a related field (Master's preferred)"
    }
  ]
}