{
  "meta": [
    {
      "job_title": "Clinical Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinates and oversees all direct care patient services provided by clinical personnel."
    },
    {
      "duty": "Develops, plans, implements, and organizes clinical operations for a specific location managed."
    },
    {
      "duty": "Conducts/delegates the assessment and reassessment of patients, including updating of care plans and interpreting patient needs, while adhering to Company, physician, and/or health facility procedures/policies."
    },
    {
      "duty": "Manages the assignment of caregivers and oversees the delivery of care to all patients served by the location."
    },
    {
      "duty": "Reviews available patient information related to the case to determine home health or hospice needs and makes the decision to admit patients to service."
    },
    {
      "duty": "Instructs and guides clinicians to promote more effective performance and delivery of quality home care services."
    },
    {
      "duty": "Assists clinicians in establishing immediate and long-term therapeutic goals, setting priorities, and developing patient Plans of Care."
    },
    {
      "duty": "Monitors cases to ensure documentation is in compliance with regulatory agencies and requirements of third-party payers."
    },
    {
      "duty": "Coordinates communication between team members/attending physicians/caregivers to ensure the appropriateness of care and outcome planning."
    },
    {
      "duty": "Works in conjunction with the Branch Director and Company Finance Department to establish location’s revenue and budget goals."
    },
    {
      "duty": "Participates in sales and marketing initiatives."
    },
    {
      "duty": "Supervises all clinical employees assigned to a specific location, handles employee corrective action and discipline issues, and participates in the interviewing, hiring, training, and development of direct care clinicians."
    },
    {
      "duty": "Analyzes situations, evaluates alternative courses of action, and reviews appropriate clinical staff documentation for appropriateness."
    },
    {
      "duty": "Responsible for QA/PI activities, data tracking for performance review, and outcomes of care analysis."
    },
    {
      "duty": "Provides interpretation of knowledge and direction to staff, maintains relationships with referral/community sources, and participates in professional organizations and conducts care-related programs."
    },
    {
      "duty": "Performs other related duties as assigned or requested."
    },
    {
      "duty": "Provides direct patient care on an infrequent basis and only in times of emergency."
    },
    {
      "duty": "Acts as Branch Director in his/her absence and ensures compliance with external regulatory authorities."
    },
    {
      "duty": "Participates in performance improvement activities and maintains ongoing clinical knowledge through internal and external training programs."
    }
  ],
  "skills": [
    {
      "skill": "Clinical Operations Management",
      "experience": 5
    },
    {
      "skill": "Patient Care Planning",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Staff Supervision",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Sales and Marketing",
      "experience": 5
    },
    {
      "skill": "Performance Improvement",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Case Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an accredited School of Nursing."
    },
    {
      "credential": "Current state license as a Registered Nurse."
    },
    {
      "credential": "Proof of current CPR."
    },
    {
      "credential": "Valid driver’s license, auto insurance, and reliable transportation."
    },
    {
      "credential": "Two years as a Registered Nurse with at least one-year of management experience in a home care, hospice, or equivalent environment."
    }
  ]
}