{
  "meta": [
    {
      "job_title": "Hospitality Manager",
      "job_category": "Hospitality",
      "job_class": "Manager",
      "sector": "Hospitality",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Hospitality Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Event Management",
      "experience": 5
    },
    {
      "skill": "Sales and Marketing",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Wine Knowledge",
      "experience": 5
    },
    {
      "skill": "POS System",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Customer Feedback Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure every guest at Eden Rift Vineyards receives a memorable and premium wine and hospitality experience, fostering a lasting relationship and encouraging repeat visits."
    },
    {
      "duty": "Lead, train, and motivate the hospitality team to provide top-tier customer service and uphold the brand standards of Eden Rift Vineyards."
    },
    {
      "duty": "Coordinate and oversee onsite events, including private tastings, tours, and special events, ensuring seamless execution and positive guest experiences."
    },
    {
      "duty": "Oversee all reservation and booking processes for the vineyard's tasting experiences, tours, and events."
    },
    {
      "duty": "Collaborate with sales and marketing teams to establish and meet monthly and annual sales targets, leveraging on-site experiences to boost wine club memberships and bottle sales."
    },
    {
      "duty": "Manage daily operations of the tasting room and guest areas, including inventory, staff scheduling, and financial reporting."
    },
    {
      "duty": "Represent Eden Rift Vineyards at external events and within the broader wine and hospitality community, cultivating relationships and expanding the brand's reputation."
    },
    {
      "duty": "Address guest feedback promptly, using it as an opportunity to continuously improve the guest experience."
    },
    {
      "duty": "Stay updated about Eden Rift’s wine portfolio and industry trends to provide an educational and immersive experience to guests."
    },
    {
      "duty": "Ensure all activities are compliant with local and state laws, particularly relating to alcohol consumption and service."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Hospitality or related field (Master's preferred)"
    }
  ]
}