{
  "meta": [
    {
      "job_title": "HR Manager",
      "job_category": "HR",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the HRBP function of the company by working with a team of HRBP of varied different Units, reporting into you."
    },
    {
      "duty": "Responsible for providing strategic direction, guiding and facilitating a robust support system of HRBP to business."
    },
    {
      "duty": "Build relationship of trust and respect across the business teams to facilitate effective coaching and guidance through HRBPs."
    },
    {
      "duty": "Manage and collaborate with cross function departments, COE, and Shared Services to support multiple business units."
    },
    {
      "duty": "Participate with business in leadership meetings, facilitate development and strategic discussion with leadership team."
    },
    {
      "duty": "Analyze trends and metrics in partnership with the HR groups to develop solutions, programs and policies specific to business unit needs."
    },
    {
      "duty": "Improve work relationships, build morale, and increase productivity and retention by working closely with management and employees."
    },
    {
      "duty": "Collaborate with leaders on all talent processes and programs utilizing talent insights and organization data to drive business outcomes."
    },
    {
      "duty": "Closely work with functional HRBPs on delivery, operating model improvements and ways of working."
    }
  ],
  "skills": [
    {
      "skill": "HR Business Partner",
      "experience": 10
    },
    {
      "skill": "Team Management and Development",
      "experience": 8
    },
    {
      "skill": "Change Management",
      "experience": 8
    },
    {
      "skill": "Data Analysis",
      "experience": 8
    },
    {
      "skill": "Consulting",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 8
    },
    {
      "skill": "Travel Management",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in HR or Business (Master’s preferred)"
    }
  ]
}