{
  "meta": [
    {
      "job_title": "Principal Permitting and Compliance Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Environmental Resource Management",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and provide technical expertise on capital delivery permitting projects for a variety of clients with complex technical/regulatory issues."
    },
    {
      "duty": "Prepare permit applications where required by federal, state, or local environmental regulatory authorities for energy development expansion, and maintenance projects."
    },
    {
      "duty": "Be familiar with United States Army Corps of Engineers (USACE) Norfolk District, Virginia Department of Environmental Quality (VDEQ), Virginia Marine Resource Commission (VMRC) permitting requirements."
    },
    {
      "duty": "Develop plans and schedules and develop project management reports, such as monthly progress reports."
    },
    {
      "duty": "Participate in agency consultations, project meetings, and client communications."
    },
    {
      "duty": "Collaborate with other ERM practitioners to execute natural resources impact assessment and capital project permitting (ERM services broadly include environmental impact assessment, routing studies, land use planning, facility siting & permitting, and risk assessment and water resources management)."
    },
    {
      "duty": "Travel up to 20% of the time for agency meetings, project team meetings, or to conduct site visits."
    },
    {
      "duty": "Build strong collaborative relationships with clients and other ERM employees."
    },
    {
      "duty": "Capitalize on existing ERM client relationships to expand ERM’s profile and market share in Capital Project Delivery through a combination of excellence in technical delivery and business development."
    },
    {
      "duty": "Work with other ERM resources to deepen relationships with ERM key clients and establish new client relationships that result in significant net revenue growth."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors or Master’s Degree in Environmental Science, Natural Resources or related discipline."
    }
  ]
}