{
  "meta": [
    {
      "job_title": "Tax Engagement Support Services (TESS) Specialist",
      "job_category": "Finance",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 52000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Tax Software",
      "experience": 3
    },
    {
      "skill": "Technical Skills",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Attention to Detail",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Tax Accounting",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Utilize firm software tools and Route Sheet instructions to print and assemble tax returns and ensure all required client deliverables are included in documents saved to the document management system and for delivery to external clients."
    },
    {
      "duty": "Take ownership of the e-file process, monitor and release external client tax returns to the taxing authorities, and track for acceptance, transmission errors, and rejections, resolving as appropriate."
    },
    {
      "duty": "New client setup, tax organizers, scanning of client workpapers, tax return delivery, workflow reporting, and due date tracking to meet expectations for timeliness, responsiveness, accuracy, and service quality."
    },
    {
      "duty": "Prepare tax client documents such as engagement letters, statements of work, and other requested deliverables using a deep understanding of the overall tax return process."
    },
    {
      "duty": "Provide tax support in various areas and execute and maintain standardized tax processing practices within the TESS Center of Excellence (COE)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED, specialized training for both tools and process (if required)"
    }
  ]
}