{
  "meta": [
    {
      "job_title": "Junior Pet Stylist",
      "job_category": "Pet Care",
      "job_class": "Stylist",
      "sector": "Pet Care",
      "salary": 24000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Animal Handling",
      "experience": 1
    },
    {
      "skill": "Pet Grooming",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Physical Stamina",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform grooming services, including brushing, nail trimming, ear cleaning, anal gland cleaning, bathing and drying."
    },
    {
      "duty": "Assist Groomers in providing grooming services, including bathing, brushing, nail trimming, and ear cleaning."
    },
    {
      "duty": "Interact with pet parents in a friendly and professional manner, providing excellent customer service and addressing their grooming-related inquiries."
    },
    {
      "duty": "Schedule grooming appointments, manage paperwork, and maintain accurate grooming records."
    },
    {
      "duty": "Learn and follow Petco's grooming policies, standards, and guidelines to ensure quality and consistency in all areas of the grooming business."
    },
    {
      "duty": "Maintain a clean and organized grooming area, including disinfecting & sanitizing grooming tools and equipment, along with daily cleaning of the salon."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Previous experience working with animals, such as volunteering at a shelter, pet sitting, or assisting in grooming salon is preferred."
    },
    {
      "credential": "Passion for animals and genuine interest in pursuing a career in pet grooming."
    },
    {
      "credential": "Basic knowledge of dog breeds, behavior, and common grooming practices."
    },
    {
      "credential": "Ability to handle and restrain pets of various sizes and temperaments with care and compassion."
    },
    {
      "credential": "Strong communication skills both verbal and written, with the ability to interact effectively with pet parents and team members."
    },
    {
      "credential": "Physical stamina to stand for extended periods, lift heavy pets and perform repetitive tasks. Position requires bending, kneeling, lifting (up to 30 pounds, as necessary) and standing for long periods of time."
    },
    {
      "credential": "Flexibility to work weekends, evenings and holidays as required by the store’s grooming schedule."
    },
    {
      "credential": "Entry-level position designed for individuals to develop their skills and knowledge in pet grooming. This position provides an excellent foundation for further career advancement within Petco’s grooming department."
    }
  ]
}