{
  "meta": [
    {
      "job_title": "Sr Engr Cslt - Data Engineer",
      "job_category": "Data Engineering",
      "job_class": "Senior Engineer",
      "sector": "Technology",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Engineering",
      "experience": 4
    },
    {
      "skill": "Artificial Intelligence",
      "experience": 4
    },
    {
      "skill": "Data Science",
      "experience": 4
    },
    {
      "skill": "Python",
      "experience": 4
    },
    {
      "skill": "Big Data",
      "experience": 4
    },
    {
      "skill": "SQL",
      "experience": 4
    },
    {
      "skill": "Hadoop",
      "experience": 4
    },
    {
      "skill": "Google Cloud",
      "experience": 2
    },
    {
      "skill": "Tableau",
      "experience": 3
    },
    {
      "skill": "Looker",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage various activities including artificial intelligence, data engineering, operations automation, security remediation, and industry-leading Omni channel technology to improve efficiency, customer experience, and profitability."
    },
    {
      "duty": "Analyze marketing, customer experience, and digital operations environments to build data pipelines, transform data into actionable intelligence, and turn raw data into usable data pipelines and products for automation and easy data accessibility."
    },
    {
      "duty": "Support maintenance, bug fixes, and performance analysis along the data pipeline. Design, build, document, test, and implement new data pipelines and analytics."
    },
    {
      "duty": "Collaborate in cross-functional teams to source new data, develop schema requirements, and maintain metadata. Identify ways to improve data reliability, efficiency, and quality."
    },
    {
      "duty": "Use large data sets to address business issues and discover tasks that can be automated. Design and implement fact tables, reports, and dashboards using Tableau, Looker, and other tools."
    },
    {
      "duty": "Analyze existing Teradata/ SQL queries for performance improvement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or four or more years of work experience. Master's degree in Computer Science, Information Systems, and / or related technical discipline preferred."
    }
  ]
}