{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Construction Documentation Interpretation",
      "experience": 10
    },
    {
      "skill": "Construction Administration",
      "experience": 10
    },
    {
      "skill": "Building Codes Knowledge",
      "experience": 10
    },
    {
      "skill": "Permit Application Management",
      "experience": 10
    },
    {
      "skill": "AutoCAD and Revit",
      "experience": 10
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage multiple design and construction projects of various sizes and types from conceptual development to construction, close-out, and occupancy."
    },
    {
      "duty": "Coordinate the work of cross-disciplinary internal teams and external contractors."
    },
    {
      "duty": "Create scopes of work, action plans, schedules, and budgets to support project success."
    },
    {
      "duty": "Ensure compliance with building codes, regulations, and sustainability standards."
    },
    {
      "duty": "Develop permit applications and manage the application process."
    },
    {
      "duty": "Review and evaluate project proposals, bids, and pay applications of external parties."
    },
    {
      "duty": "Identify challenges related to schedule, budget, progress, and safety, and propose solutions."
    },
    {
      "duty": "Communicate with staff and stakeholders to align on project goals and progress."
    },
    {
      "duty": "Maintain appropriate documentation and records to support project activities and complete close-out activities."
    },
    {
      "duty": "Recommend new or updated standards and guidelines for products, systems, and processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Architecture, Engineering (Civil, Electrical, Mechanical, Structural), Interior Design, or Construction Management or related field (Master's preferred)"
    }
  ]
}