{
  "meta": [
    {
      "job_title": "Credit Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Financial Services",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides direct support to Relationship Manager(s) to develop and analyze all relevant credit information pertaining to a wide variety of commercial real estate loans."
    },
    {
      "duty": "Prepares, or assists in the preparation of Credit Authorizations in accordance with the Bank’s policies and procedures for presentation to senior credit personnel and/or credit committees."
    },
    {
      "duty": "Prepares detailed collateral analysis and coordinates appraisal and third party analysis."
    },
    {
      "duty": "Spreads and analyzes financial statement information to determine financial capacity of borrowers."
    },
    {
      "duty": " Prepares thorough analysis of business and/or personal financial statements, and presents facts and is expected to provide personal analytical opinions, as appropriate, concerning creditworthiness of existing borrowers and prospects."
    },
    {
      "duty": "Interacts directly with relationship managers, loan officers and customers/prospects regarding a wide range of loans."
    },
    {
      "duty": "Maintains an assigned/delegate loan portfolio as the primary relationship officer."
    },
    {
      "duty": " Prepares accurate financial statement spreadsheets and debt service analysis derived from business and personal accurate Credit Authorizations in conjunction with loan officers, and presents a complete and thorough analysis financial statements and tax returns."
    },
    {
      "duty": " Prepares of existing and potential borrowers."
    },
    {
      "duty": "Recognize and act on customer prospects; cross sell opportunities with existing customers."
    },
    {
      "duty": "Make proper referral of loan opportunities to lending personnel."
    },
    {
      "duty": " Interacts independently and without direction with customers/prospects to request financial information to complete spreading presentations and other financial analysis."
    },
    {
      "duty": "Reviews loan agreement covenants for verification of the borrower’s compliance thereto."
    },
    {
      "duty": "Accurately prepares financial projections as required."
    },
    {
      "duty": "Maintains an accurate, up-to-date tracking log of all activity and credit arrangements in process."
    },
    {
      "duty": "Collects industry information relevant to existing and proposed borrowers using internal & external sources."
    },
    {
      "duty": "Consults with relationship manager(s), loan officer(s), the Chief Lending Officer, and other Credit Administration officers on credit structure, pricing, collateral and other credit consideration issues."
    },
    {
      "duty": "Works with clients in regards to past due payments/loan maturities."
    },
    {
      "duty": "Conducts trade and reference checks on customers/prospects."
    },
    {
      "duty": "Reviews documentation to ensure compliance with Bank policy and procedures."
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Credit Risk Assessment",
      "experience": 3
    },
    {
      "skill": "Collateral Management",
      "experience": 3
    },
    {
      "skill": "Loan Portfolio Management",
      "experience": 3
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 3
    },
    {
      "skill": "Analytical Thinking",
      "experience": 3
    },
    {
      "skill": "Financial Spreadsheets",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 30,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from a four-year college or university; or one to two years related experience and/or training; or equivalent combination of education and experience."
    },
    {
      "credential": "Strong, intermediate knowledge of accounting principles, tax return analysis and analytical interpretation of balance sheet and income statement analysis and cash flow."
    },
    {
      "credential": "Intermediate working knowledge of loan documentation."
    },
    {
      "credential": "Must be able to handle a strong volume of work flow from various sources."
    },
    {
      "credential": "Ability to maintain confidentiality of all bank and client information."
    }
  ]
}