{
  "meta": [
    {
      "job_title": "Technical Team Lead",
      "job_category": "Information Technology",
      "job_class": "Team Lead",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Devise procedures to solve complex problems considering business strategy, system capacity and limitations, operating time, desired results and staff capabilities in the assigned platform/system."
    },
    {
      "duty": "Evaluate products and associated vendors and facilitate the successful implementation of new technologies."
    },
    {
      "duty": "Responsible for designing application modifications or new applications by performing business process and applications analysis, preparing technical specifications which includes business process flows, functional diagrams, database schema, use cases, program specifications and pseudo code to illustrate application features and functions."
    },
    {
      "duty": "Participate in the development, alignment and implementation of the IT platform roadmap."
    },
    {
      "duty": "Performs hands-on development or configuration where technical expertise is needed and business priorities dictate."
    },
    {
      "duty": "Performs independent system research to troubleshoot issues and analyze current application or system features/functions."
    },
    {
      "duty": "Collaborate with stakeholders to Identify project parameters, operational flow and output requirements."
    },
    {
      "duty": "Prepare detailed specs for writing programs and ensures compliant design, coding, testing, debugging and documentation."
    },
    {
      "duty": "Recommend acquisition of development tools and computer systems designed to increase efficiency and effectiveness of department operations."
    },
    {
      "duty": "Monitor and coordinate work of assigned staff or consultants engaged in designing, developing and maintaining systems."
    },
    {
      "duty": "Provide training to clients on business system operations and work with consultants on software conversions, modification and resource applications."
    }
  ],
  "skills": [
    {
      "skill": "Blue Yonder",
      "experience": 5
    }
  ]
}