{
  "meta": [
    {
      "job_title": "Financial Analyst-Logistics",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 4
    },
    {
      "skill": "Quantitative Analysis",
      "experience": 4
    },
    {
      "skill": "Data Transformation",
      "experience": 4
    },
    {
      "skill": "Financial Reporting",
      "experience": 4
    },
    {
      "skill": "Financial Modeling",
      "experience": 4
    },
    {
      "skill": "Microsoft Excel",
      "experience": 4
    },
    {
      "skill": "Financial Planning",
      "experience": 4
    },
    {
      "skill": "Problem-solving",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide quantitative analysis for Wholesale and Retail Distribution Centers to support growth and cost reductions."
    },
    {
      "duty": "Transform data into actionable items and provide clarity into the data."
    },
    {
      "duty": "Ensure connectivity of financial information back to P&L."
    },
    {
      "duty": "Produce daily, weekly, monthly reports including key metrics, financial results, and variance reporting for Warehousing and Distribution Centers in the US."
    },
    {
      "duty": "Track KPIs, scorecards, and drive cost reduction initiatives."
    },
    {
      "duty": "Assist in budgeting, planning, and forecasting processes, working cross-functionally to influence stakeholders."
    },
    {
      "duty": "Prepare monthly operating reviews for senior management communicating operational and financial performance."
    },
    {
      "duty": "Track business KPIs and prepare recurring financial reports in partnership with accounting and business stakeholders."
    },
    {
      "duty": "Identify opportunities for automation within the FP&A organization."
    },
    {
      "duty": "Work in collaboration with other analysts in the team and make recommendations to reporting needs."
    },
    {
      "duty": "Ability to adjust within a fast-paced work environment."
    },
    {
      "duty": "Work in collaboration with accounting and corporate FP&A team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Finance, Accounting, or related field (Master's preferred)"
    }
  ]
}