{
  "meta": [
    {
      "job_title": "Adobe AEM Architect",
      "job_category": "Software Engineering",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Adobe AEM",
      "experience": 6
    },
    {
      "skill": "Java",
      "experience": 10
    },
    {
      "skill": "Servlets",
      "experience": 7
    },
    {
      "skill": "Sling",
      "experience": 6
    },
    {
      "skill": "OSGI",
      "experience": 6
    },
    {
      "skill": "JCR",
      "experience": 6
    },
    {
      "skill": "Technical Solutioning and Designing Experience",
      "experience": 10
    },
    {
      "skill": "Adobe Experience Cloud",
      "experience": 10
    },
    {
      "skill": "Integration with Adobe Experience cloud services",
      "experience": 10
    },
    {
      "skill": "AEM best Practices",
      "experience": 10
    },
    {
      "skill": "Certified Adobe AEM Architect",
      "experience": 10
    },
    {
      "skill": "Implementation experience and new development",
      "experience": 10
    },
    {
      "skill": "Handson on the lastest version 6.5 and readiness to lead and guide team besides taking up tasks for self",
      "experience": 10
    },
    {
      "skill": "Technically own the AEM onsite and offshore team",
      "experience": 10
    },
    {
      "skill": "Be the Technical SPOC for customer",
      "experience": 10
    },
    {
      "skill": "Understand the business requirements and creating a high level design documents and architecture solutions",
      "experience": 10
    },
    {
      "skill": "Java Content Repository (API) suite, Sling web framework, and Apache Felix OSGi framework",
      "experience": 10
    },
    {
      "skill": "Experience in architecting and designing solutions",
      "experience": 10
    },
    {
      "skill": "Good experience is required on Java, JSP, Servlets, Ajax, XML, Jquery, and JSON web technologies",
      "experience": 10
    },
    {
      "skill": "Agile/Scrum Project Implementation",
      "experience": 10
    },
    {
      "skill": "Good communication, status reporting, team lead, project planning, code review and customer interaction skills",
      "experience": 10
    },
    {
      "skill": "MSM and DevOps architecture",
      "experience": 10
    },
    {
      "skill": "Dispatcher configuration, Workflows, Headless and latest features",
      "experience": 10
    },
    {
      "skill": "Worked with AEM Cloud service environments",
      "experience": 10
    },
    {
      "skill": "Onsite and Offshore team coordination with client",
      "experience": 10
    },
    {
      "skill": "Integration experience with Adobe's broader suite of digital experience management (DXM) technologies, such as Adobe Marketing Cloud and Adobe Analytics",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Architect, design and oversee the implementation of AEM solutions that ensure the platform's reliability, scalability, and efficiency."
    },
    {
      "duty": "Lead and guide a team of AEM developers, providing technical expertise and mentorship to drive successful project delivery."
    },
    {
      "duty": "Serve as the primary point of contact for technical stakeholders, understanding requirements, and translating them into high-level design documents and architecture solutions."
    },
    {
      "duty": "Utilize Java, JSP, Servlets, Ajax, XML, Jquery, and JSON web technologies to implement new developments and ensure adherence to AEM best practices."
    },
    {
      "duty": "Collaborate with onsite and offshore teams to technically own the AEM solution and ensure seamless integration with Adobe Experience Cloud services."
    },
    {
      "duty": "Provide technical support to customers, acting as the Subject Matter Expert (SME) for AEM and offering solutions that meet their business needs."
    },
    {
      "duty": "Configure and optimize the AEM platform, including Dispatcher configuration, Workflows, Headless, and latest features, while ensuring DevOps best practices."
    },
    {
      "duty": "Facilitate collaboration and integration with Adobe's broader suite of digital experience management (DXM) technologies, including Adobe Marketing Cloud and Adobe Analytics."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Engineering, or a related field (Master's preferred)"
    }
  ]
}