{
  "meta": [
    {
      "job_title": "Customer Support Engineer",
      "job_category": "Customer Support",
      "job_class": "Engineer",
      "sector": "Technology",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Support",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "IP Network Switching",
      "experience": 5
    },
    {
      "skill": "Routing Protocols",
      "experience": 5
    },
    {
      "skill": "Linux Networking",
      "experience": 5
    },
    {
      "skill": "Network Configuration Analysis",
      "experience": 5
    },
    {
      "skill": "Technical Documentation",
      "experience": 5
    },
    {
      "skill": "Broadcast and Broadband Video Delivery",
      "experience": 5
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Technical Documentation Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Take ownership of case escalations from the level 2 Product Support team and deliver outage mitigation via workarounds."
    },
    {
      "duty": "Produce case resolution paths by pulling on extensive product and solution knowledge, replicating customer setups, and working closely with Product and Development teams."
    },
    {
      "duty": "Provide key inputs into Product roadmap planning and new product integration."
    },
    {
      "duty": "Perform remote troubleshooting of customer EPON and HFC deployments for service restoration and issue resolution."
    },
    {
      "duty": "Conduct in-depth product and network configuration analysis, making recommendations for improved performance."
    },
    {
      "duty": "Initiate and review network captures, isolating and identifying routing and switching issues."
    },
    {
      "duty": "Replicate and document potential product defects in the lab using customer configurations, working closely with Product and Development to produce fixes."
    },
    {
      "duty": "Perform remote and onsite product configuration, upgrade, and validation services."
    },
    {
      "duty": "Provide regular and effective progress updates and work closely with management on case escalations."
    },
    {
      "duty": "Collaborate closely with customers to replicate and resolve production issues impacting their subscribers."
    },
    {
      "duty": "Communicate clearly and effectively at all times including status updates, issues and resolutions, and explanations of highly technical subject matter."
    },
    {
      "duty": "Write and review technical documentation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Professional level Network Routing and Switching certification (CCNP, NCIP, NRSII)"
    }
  ]
}