{
  "meta": [
    {
      "job_title": "Business Analyst",
      "job_category": "Information Technology",
      "job_class": "Senior Analyst",
      "sector": "Information Technology",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "System Configuration",
      "experience": 5
    },
    {
      "skill": "API Integration",
      "experience": 5
    },
    {
      "skill": "Data Management",
      "experience": 5
    },
    {
      "skill": "Reporting and Analytics",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "System Administration",
      "experience": 5
    },
    {
      "skill": "Technical Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Business Intelligence Tools",
      "experience": 5
    },
    {
      "skill": "IT User Training",
      "experience": 5
    },
    {
      "skill": "System Maintenance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Customize and configure the Planview Adaptivework platform to align with the organization's IT requirements, including user account setup, permissions management, custom field creation, and other system settings."
    },
    {
      "duty": "Collaborate with IT and other stakeholders to implement integrations between Planview Adaptivework and other IT systems, such as ERP (SAP), CRM (Salesforce), and project management tools, using APIs, scripting, or other tools to streamline workflows and data exchange."
    },
    {
      "duty": "Perform day-to-day administration tasks, such as user support, data validation, cleanup, and maintenance activities, to ensure data integrity and system performance within IT guidelines."
    },
    {
      "duty": "Continuously evaluate work management processes and workflows within Planview Adaptivework to identify opportunities for automation, optimization, and standardization, and implement improvements to increase efficiency and productivity in alignment with IT policies."
    },
    {
      "duty": "Create and maintain reports, dashboards, and analytics within Planview Adaptivework to provide insights on project and resource performance, financials, and other key performance indicators, and support data-driven decision-making for IT stakeholders."
    },
    {
      "duty": "Develop and deliver training programs and documentation to educate IT users on Planview Adaptivework functionality, features, and best practices related to configuration, integration, and system administration."
    },
    {
      "duty": "Coordinate and execute system upgrades, patches, and maintenance activities in collaboration with IT and Planview support to ensure the smooth functioning of the Planview Adaptivework platform and comply with IT policies."
    },
    {
      "duty": "Other duties assigned by leadership"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in information technology or a related field"
    }
  ]
}