{
  "meta": [
    {
      "job_title": "Associate Director of Advanced Analytics",
      "job_category": "Data Science",
      "job_class": "Director",
      "sector": "Software Engineering",
      "salary": 170000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Strategy",
      "experience": 5
    },
    {
      "skill": "Data Governance",
      "experience": 5
    },
    {
      "skill": "Advanced Analytics",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Data Science",
      "experience": 5
    },
    {
      "skill": "Data Visualization (Qlik, PowerBI, Tableau)",
      "experience": 5
    },
    {
      "skill": "R Programming",
      "experience": 5
    },
    {
      "skill": "Python Programming",
      "experience": 5
    },
    {
      "skill": "SAS Programming",
      "experience": 5
    },
    {
      "skill": "Pharma Data (Veeva, IQVIA, TriNetX, Flatiron, Optum, Komodo)",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communications",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead execution of long-term OBU advanced analytics strategy that integrates broader strategic goals and organizational initiatives to aid data-driven decision making and growth."
    },
    {
      "duty": "Understand key business questions in the context of the OBU vision/objectives, then develop hypothesis, design and execute key analytics to address the business questions."
    },
    {
      "duty": "Conduct above-market analytics to enable launch excellence and improve in-market performance."
    },
    {
      "duty": "Develop standardized analytics frameworks to guide regions and share best practices among insights and analytics community."
    },
    {
      "duty": "Build relationships with business users of advanced analytics insights to support their requirements through effective communication, data governance, and documentation."
    },
    {
      "duty": "Execute innovative use of data assets and decision sciences methods to assist other OBU teams in answering challenging questions."
    },
    {
      "duty": "Translate strategy into action; excellent analytical skills and an ability to communicate complex issues in a simple way and to orchestrate plans to resolve issues & mitigate risks."
    },
    {
      "duty": "Experience working with all levels of management and consulting with key business stakeholders."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Computer Sciences, Statistics, Business, or related field preferred"
    }
  ]
}