{
  "meta": [
    {
      "job_title": "Client Service Associate",
      "job_category": "Finance",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the general servicing and support of the Financial Advisors."
    },
    {
      "duty": "Assist Financial Advisors in servicing clients including preparing financial plans, conducting investment research and completing client trades and transactions."
    },
    {
      "duty": "Receive and place orders as directed from Financial Advisor and assigned clients."
    },
    {
      "duty": "Process corporate actions where a license is warranted, such as tender offers, optional dividends and the exercise of warrants and rights."
    },
    {
      "duty": "Schedule and confirm client appointments, enter data in SalesForce, create meeting agendas and summaries, prepare/coordinate marking events and perform general administrative functions."
    },
    {
      "duty": "Maximize sales opportunities by contacting potential investment clients based on internal and bank leads."
    },
    {
      "duty": "Provide operational guidance to Financial Advisors ranging from systems navigation to document fulfillment."
    },
    {
      "duty": "Ensure new business paperwork is accurately successfully submitted."
    },
    {
      "duty": "Mitigate risk through appropriate authentication standards."
    },
    {
      "duty": "Maintain a professional environment and create a positive impression."
    },
    {
      "duty": "Submit and process certain operational requests as instructed by the Financial Advisor and/or client."
    },
    {
      "duty": "Work in coordination with the Financial Advisor to ensure certain reports are reviewed and addressed."
    },
    {
      "duty": "May assist with physical branch location needs, such as opening, closing, general requests for maintenance or service."
    }
  ],
  "skills": [
    {
      "skill": "Financial Services",
      "experience": 2
    },
    {
      "skill": "Client Servicing",
      "experience": 3
    },
    {
      "skill": "Investment Research",
      "experience": 2
    },
    {
      "skill": "SalesForce",
      "experience": 2
    },
    {
      "skill": "Administrative Functions",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent experience and related training."
    },
    {
      "credential": "FINRA SIE, Financial Industry Regulatory Authority (FINRA) Series 7 and Series 66 licenses."
    }
  ]
}