{
  "meta": [
    {
      "job_title": "RN - Outpatient Chemotherapy Infusion",
      "job_category": "Healthcare",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 87609,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Greets patients and escorts them to a treatment chair or bed"
    },
    {
      "duty": "Assists physician in preparing for minor procedures"
    },
    {
      "duty": "Provides general nursing care to patients; administers and controls narcotics, prescribed medications, in accordance with nursing standards."
    },
    {
      "duty": "Observes, records and reports patient’s condition and reaction to drugs and treatments to physician and records in EMR; administers prescribed medications as directed"
    },
    {
      "duty": "Updates patient chart utilizing EMR"
    },
    {
      "duty": "Oversees infusion appointment bookings and ensures emergency situations are scheduled appropriately; maintains timely flow of patients."
    },
    {
      "duty": "Responds to and refers incoming telephone calls."
    },
    {
      "duty": "Instructs patient and family regarding treatment medications, side effects and gives instruction on how to alleviate systems"
    },
    {
      "duty": "Telephone prescription requests to pharmacy or utilizes electronic transmission of prescriptions in EMR"
    },
    {
      "duty": "Disposes of contaminated items according to OSHA, CLIA and COLA regulations"
    },
    {
      "duty": "Follows all OSHA guidelines to minimize exposure to blood borne pathogens"
    },
    {
      "duty": "Communicates physician referral requests to staff via EMR for necessary processing"
    },
    {
      "duty": "Ensures proper insurance authorization prior to treatment"
    },
    {
      "duty": "Performs patient education when appropriate"
    },
    {
      "duty": "Replenishes supplies, stocks and cleans radiation rooms and manages pharmaceutical supplies"
    },
    {
      "duty": "Oversees infusion room and medical assistant’s preparation of infusion room, including re-stocking of treatment areas."
    },
    {
      "duty": "Participates in professional development activities and maintain professional affiliations."
    },
    {
      "duty": "Follows established policies, procedures, objectives, performance improvement, attendance, safety, environmental and infection control guidelines."
    },
    {
      "duty": "Practices a high level of integrity and honesty in maintaining patient confidentiality"
    },
    {
      "duty": "Arranges for all biohazardous waste pick-up"
    },
    {
      "duty": "Attends annual CPR, OSHA, CLIA and COLA training programs"
    },
    {
      "duty": "Attends all regular staff meetings"
    },
    {
      "duty": "Adheres to all documentation guidelines as instructed by Practice Administrator and Clinical Director and provides accurate documentation in the patient’s electronic medical record."
    },
    {
      "duty": "Performs all other tasks and projects assigned by the Clinical Director, Practice Administrator or the physician"
    },
    {
      "duty": "Utilizes leadership skills in overseeing and assisting other members of the health care team to prioritize and resolve issues"
    },
    {
      "duty": "Demonstrates a level of professional practice that supports the delivery of appropriated care and positive working relationships."
    },
    {
      "duty": "Follows established City of Hope and department policies, procedures, objectives, performance improvement, attendance, safety, environmental, and infection control guidelines, including adherence to the workplace Code of Conduct and Compliance Plan. Practices a high level of integrity and honesty in maintaining confidentiality."
    },
    {
      "duty": "Performs other related duties as assigned or requested."
    }
  ],
  "skills": [
    {
      "skill": "Nursing Care",
      "experience": 5
    },
    {
      "skill": "EMR Charting",
      "experience": 5
    },
    {
      "skill": "Patient Education",
      "experience": 3
    },
    {
      "skill": "Procedure Assistance",
      "experience": 5
    },
    {
      "skill": "Medication Administration",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Professional Development",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 125,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree in nursing"
    },
    {
      "credential": "Current and valid California Registered Nurse Licensure"
    },
    {
      "credential": "Current BLS certification from the American Heart Association"
    }
  ]
}