{
  "meta": [
    {
      "job_title": "Family Practice Physician",
      "job_category": "Healthcare",
      "job_class": "Physician",
      "sector": "Healthcare",
      "salary": 200000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Reviews patient file/record, including allergies, problems, medications, and immunization status."
    },
    {
      "duty": "Elicits and records information about patient’s medical history."
    },
    {
      "duty": "Examines patients for symptoms or physical information."
    },
    {
      "duty": "Orders or executes various tests, analyses, and diagnostic images to provide information on patient’s condition."
    },
    {
      "duty": "Analyzes reports and findings of tests and examination and diagnoses condition of patient."
    },
    {
      "duty": "Administers or prescribes treatments."
    },
    {
      "duty": "Determines and prescribes medication, dosage, and schedule, given the patient’s condition and allergies."
    },
    {
      "duty": "Discusses any possible side effects to medication or immunization with patient."
    },
    {
      "duty": "Prescribes and administers vaccinations to immunize patient from communicable diseases."
    },
    {
      "duty": "Promotes health by advising patients about diet, hygiene, and methods for prevention of disease."
    },
    {
      "duty": "Provides prenatal care to pregnant women, delivers babies, and provides postnatal care to mothers and infants."
    },
    {
      "duty": "Performs surgical procedures commensurate with surgical competency."
    },
    {
      "duty": "Refers patients to medical specialist for consultant services when necessary for patient’s wellbeing."
    },
    {
      "duty": "Documents the patient’s visit including medical history, physical exam, diagnosis, and plan of action."
    },
    {
      "duty": "Follows up with patient regarding progress in high risk or emergency cases."
    },
    {
      "duty": "Conducts physical examinations to provide information needed for admission to school, consideration for employment, or eligibility for insurance coverage."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Must be a graduate of an accredited school of medicine and licensed to practice medicine in the state of California by the Medical Board of California."
    }
  ]
}