{
  "meta": [
    {
      "job_title": "Senior Account Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Solution Sales",
      "experience": 5
    },
    {
      "skill": "HVAC Systems",
      "experience": 5
    },
    {
      "skill": "Technical Sales",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Service Agreements",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Driving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute an account specific business plan to identify the long term, mutual support requirements required to facilitate a strong, profitable and successful partnership."
    },
    {
      "duty": "Convert leads into opportunities by assigning the appropriate sales process, identifying the required project team members, making assignments, and communicating the next steps in the process."
    },
    {
      "duty": "Gather and validate preliminary information and perform facility walkthrough, construction plan review or other requirements."
    },
    {
      "duty": "Responsible for project take-off, selection, proposal pricing and selling strategy, and integration of equipment, controls, and services."
    },
    {
      "duty": "Assist customers in answering technical questions on HVAC systems, Trane products, and system application alternative, controls, installation, operation, maintenance, and problem resolution."
    },
    {
      "duty": "Travel to customer job sites is required, which may include outdoor work and/or work in mechanical/equipment rooms."
    },
    {
      "duty": "During the site visits, the employee may be exposed to variable weather conditions; moving mechanical parts; heights, and other variable environmental conditions based on location."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in engineering, engineering technology, business or equivalent from a four-year college or university preferred; completion of the Trane graduate training course, or equivalent combination of education and experience."
    }
  ]
}