{
  "meta": [
    {
      "job_title": "Account Executive II",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Insurance",
      "salary": 71000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Insurance Sales",
      "experience": 5
    },
    {
      "skill": "Underwriting",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Insurance Policy Review",
      "experience": 5
    },
    {
      "skill": "Insurance Renewals",
      "experience": 5
    },
    {
      "skill": "Service Standards",
      "experience": 5
    },
    {
      "skill": "Insurance Compliance",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Mentorship",
      "experience": 5
    },
    {
      "skill": "Professional Communication",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Grow a book of business by selling professional and/or commercial lines products to prospects and providing best-in-class service to existing clients to achieve high retention."
    },
    {
      "duty": "Assess client needs and coverage recommendations, negotiate with insurance company underwriters, review coverage options, and deliver coverage options."
    },
    {
      "duty": "Meet established service standards in response to client needs, questions or change requests, and provide assistance with policy coverage questions."
    },
    {
      "duty": "Evaluate changes to client operation, inform client of necessary coverage changes, and assist in amending coverage accordingly."
    },
    {
      "duty": "Maintain strong working knowledge of the healthcare delivery system and the exposures related to it, including medical specialties, practice modes, medical facilities, and systems."
    },
    {
      "duty": "Participate in training and educational seminars for professional development, meet E&S and state-specific regulations to ensure compliance, and perform market research."
    },
    {
      "duty": "Mentor and train account managers as needed, meet E&S and state-specific regulations to ensure compliance, and assist in meeting agency initiatives and goals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business, insurance, or related field is required. Or 8 years of professional level insurance industry experience may be substituted if bachelor’s degree is not achieved. Minimum of 5 years of insurance sales and services, underwriting or consulting experience required; experience in professional or commercial liability preferred. P&C insurance license required or ability to obtain in first 60 days in position."
    }
  ]
}