{
  "meta": [
    {
      "job_title": "Associate Director, Clinical Operations",
      "job_category": "Pharmaceutical",
      "job_class": "Director",
      "sector": "Management",
      "salary": 200000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Trial Management",
      "experience": 6
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Clinical Research",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Clinical Development",
      "experience": 10
    },
    {
      "skill": "GCP and ICH Guidelines",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide leadership and strategic direction for the planning, execution, and management of clinical trials across various phases, ensuring adherence to timelines, budgets, and quality standards."
    },
    {
      "duty": "Collaborate cross-functionally with internal teams including Research & Development, Regulatory Affairs, Medical Affairs, and Commercial to drive alignment and achieve project goals."
    },
    {
      "duty": "Oversee the selection and management of Contract Research Organizations (CROs) and other external partners involved in clinical trial conduct."
    },
    {
      "duty": "Lead the development of clinical trial protocols, informed consent forms, case report forms, and other essential study documents."
    },
    {
      "duty": "Monitor and analyze clinical trial data, identify trends, and provide insights to guide decision-making and optimize trial designs."
    },
    {
      "duty": "Ensure compliance with all relevant regulatory guidelines, ethical considerations, and industry best practices throughout the clinical development process."
    },
    {
      "duty": "Contribute to the development of clinical sections of regulatory submissions, including INDs, NDAs, and other relevant documents."
    },
    {
      "duty": "Manage and mentor a team of clinical professionals, fostering their growth and development."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Advanced degree in a relevant scientific field (PhD, MD, PharmD, or equivalent)."
    }
  ]
}