{
  "meta": [
    {
      "job_title": "Senior Data Scientist",
      "job_category": "Data Science",
      "job_class": "Senior",
      "sector": "Analytics & Intelligence",
      "salary": 228000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Machine Learning",
      "experience": 7
    },
    {
      "skill": "Natural Language Processing",
      "experience": 5
    },
    {
      "skill": "Data Science",
      "experience": 7
    },
    {
      "skill": "Analytics",
      "experience": 7
    },
    {
      "skill": "Big Data",
      "experience": 5
    },
    {
      "skill": "Python",
      "experience": 7
    },
    {
      "skill": "AI/ML Algorithms",
      "experience": 7
    },
    {
      "skill": "Data Visualization",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and guide data science and data engineering elements of AI/ML projects."
    },
    {
      "duty": "Drive the development, deployment and industrialization of enterprise applications using advanced NLP techniques."
    },
    {
      "duty": "Develop a deep understanding of customers and market dynamics, and apply technical skills to advance that knowledge and guide the organization."
    },
    {
      "duty": "Apply ML and applied statistics approaches to answer a variety of complex business questions using multiple data sources and technical tools."
    },
    {
      "duty": "Act as a subject matter expert for applicable data science and other advanced analytical methodologies, programs, particularly in NLP."
    },
    {
      "duty": "Collaborate within cross-functional teams to develop efficient machine learning-based applications, gain alignment, and deliver impactful business insights."
    },
    {
      "duty": "Openly share perspective and insights to elevate team thinking and drive a balanced, holistic point of view."
    },
    {
      "duty": "Take an enterprise mindset, linking individual responsibilities with the broader organization; focus on outcomes that provide the most business value."
    },
    {
      "duty": "Demonstrate a bias for execution, self-accountability, and results ownership."
    },
    {
      "duty": "Look for opportunities for continuous improvement; engage managers and peer groups regularly for coaching, assistance, and advocacy."
    },
    {
      "duty": "Act as a thought partner and advisor to all relevant teams and stakeholders; look for and establish opportunities for peer mentorship."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 140,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in relevant discipline: Data Science; Computer Science; Applied Mathematics, Statistics, Economics, Engineering or related field, with a focus on Artificial Intelligence (AI) or Machine Learning (ML)"
    }
  ]
}