{
  "meta": [
    {
      "job_title": "Advanced Manufacturing Process Engineer",
      "job_category": "Engineering",
      "job_class": "Process Engineer",
      "sector": "Engineering",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Process Management",
      "experience": 10
    },
    {
      "skill": "Manufacturing Systems",
      "experience": 10
    },
    {
      "skill": "Metal Fabrication",
      "experience": 10
    },
    {
      "skill": "Value Stream Mapping",
      "experience": 10
    },
    {
      "skill": "CAD Design",
      "experience": 10
    },
    {
      "skill": "GD&T",
      "experience": 10
    },
    {
      "skill": "Process Optimization",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Continuous Improvement",
      "experience": 10
    },
    {
      "skill": "Software Technology",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the overall plant layout design and activities for the Americas region."
    },
    {
      "duty": "Collaborate with other regions and the Global team to create a vision for future factory specifications."
    },
    {
      "duty": "Develop and implement plans to ensure that factory capacity and capability meet the throughput needs of business plans and growth strategies."
    },
    {
      "duty": "Responsible for assimilating core Process & Technologies into the Americas manufacturing plants' operating goals through positive impact to key performance measures."
    },
    {
      "duty": "Ensure the overall optimization of manufacturing processes results in maximum theoretical value."
    },
    {
      "duty": "Develop detailed plans and road maps working with Manufacturing and Design teams, including recommendations and solutions for the optimal development and deployment of process changes into annual operating plans for action."
    },
    {
      "duty": "Participate in the Americas manufacturing design guidance (DFMA) and process reviews (PFMEA) for new processes and technologies."
    },
    {
      "duty": "Partner with other Global and Regional manufacturing engineering functions to drive harmonization and standardization."
    },
    {
      "duty": "Provide subject matter expertise support for large growth programs and projects."
    },
    {
      "duty": "Ensure KPIs are aligned with business goals and support the setting of aggressive targets."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in industrial, Manufacturing or Mechanical Engineering, Business Administration, or a relevant field required."
    }
  ]
}