{
  "meta": [
    {
      "job_title": "Sr. Director of Cybersecurity",
      "job_class": "Director",
      "job_category": "Information Technology",
      "sector": "Management",
      "salary": 180000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cybersecurity Strategy",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Security Risk Assessment",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Incident Response Management",
      "experience": 10
    },
    {
      "skill": "Network Security",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Crisis Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement a comprehensive cybersecurity strategy, in alignment with the organization's overall business objectives, to safeguard our systems, networks, and data."
    },
    {
      "duty": "Lead and manage a team of cybersecurity professionals, providing mentorship, guidance, and support to ensure the effective execution of security initiatives and projects."
    },
    {
      "duty": "Stay updated with the latest cybersecurity threats, vulnerabilities, and industry trends, and proactively assess their potential impact on the organization's security posture."
    },
    {
      "duty": "Collaborate with cross-functional teams, including IT, legal, compliance, and risk management, to establish and maintain effective cybersecurity controls and practices."
    },
    {
      "duty": "Conduct regular security assessments, vulnerability assessments, and penetration testing to identify and address potential weaknesses in the organization's infrastructure."
    },
    {
      "duty": "Develop and maintain an incident response plan, ensuring a rapid and effective response to any cybersecurity incidents or breaches."
    },
    {
      "duty": "Monitor security logs and alerts, investigate suspicious activities, and lead incident investigations to identify the root cause and implement appropriate remediation actions."
    },
    {
      "duty": "Coordinate with external vendors, consultants, and law enforcement agencies, as necessary, to enhance the organization's cybersecurity capabilities."
    },
    {
      "duty": "Oversee the implementation and management of security technologies, including firewalls, intrusion detection systems, antivirus software, and encryption tools."
    },
    {
      "duty": "Collaborate with senior management and executive teams to provide regular reports and updates on the organization's cybersecurity posture, highlighting key risks and recommended mitigation strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 180,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Computer Science, Information Security, or a related field. Relevant industry certifications (e.g., CISSP, CISM, CRISC) are highly desirable."
    }
  ]
}