{
  "meta": [
    {
      "job_title": "Onsite Medical Representative",
      "job_category": "Healthcare",
      "job_class": "Representative",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "First Aid",
      "experience": 5
    },
    {
      "skill": "Occupational Health",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Emergency Response",
      "experience": 5
    },
    {
      "skill": "Workers Compensation",
      "experience": 5
    },
    {
      "skill": "Digital Recordkeeping",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide on-site medical care such as triage, first aid, and referral to outside medical providers for Amazon Associates."
    },
    {
      "duty": "Minimize the risk of injury for Amazon Associates through awareness, education, and proactive engagement."
    },
    {
      "duty": "Maintain records of care provided to Amazon Associates and develop first aid care plans for those recovering from injuries."
    },
    {
      "duty": "Facilitate and maintain workers’ compensation and return-to-work processes for associates with work-related injuries."
    },
    {
      "duty": "Maintain a clean and orderly medical environment, monitor medical supply inventory, and provide daily activity logs and reports."
    },
    {
      "duty": "Coach and engage with Amazon Associates and managers to address at-risk work habits and ensure a safe work environment."
    },
    {
      "duty": "Participate in incident investigations, case management review meetings, and special projects as assigned."
    },
    {
      "duty": "Be willing to be trained to teach first aid, CPR, and AED certification classes."
    },
    {
      "duty": "Work flexible shifts and communicate effectively in emergencies and as a professional member of the team."
    },
    {
      "duty": "Embrace an inclusive and diverse atmosphere and follow company policies and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school or equivalent diploma with valid certification in first aid, CPR, and AED course"
    }
  ]
}