{
  "meta": [
    {
      "job_title": "Sales Supervisor",
      "job_category": "Sales",
      "job_class": "Supervisor",
      "sector": "Sales",
      "salary": 38000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direction and supervise associates to support a sales driving culture while creating a consistent customer experience."
    },
    {
      "duty": "Engage and connect with customers, providing excellent customer service through a hospitality-oriented approach."
    },
    {
      "duty": "Offer information on merchandise assortment, store promotions, and events, and execute operational processes effectively and efficiently."
    },
    {
      "duty": "Support sales, hospitality, operations, people, and conversion through the Shop C3 Program."
    },
    {
      "duty": "Lead key holder responsibilities, including opening and closing store processes, leading hospitality host, and providing direction to associates."
    },
    {
      "duty": "Drive sales by creating an inspiring environment that motivates customers to make purchases."
    },
    {
      "duty": "Deliver a consistent sales floor experience and build customer connections with a greeting and authentic hospitality experience."
    },
    {
      "duty": "Support sales floor, fitting room, point of sale, and operational processes, as required."
    },
    {
      "duty": "Ensure all customers feel respected, appreciated, and rewarded, and build trust to solve their shopping needs."
    },
    {
      "duty": "Leverage omni-channel offerings to deliver a frictionless customer experience and accurately deliver on operational processes."
    },
    {
      "duty": "Build rapport and make a genuine connection with the customer, acknowledging and assisting them through company programs."
    },
    {
      "duty": "Onboard, train, and develop associates, ensuring they are able to perform key accountabilities."
    },
    {
      "duty": "Complete transactions accurately and efficiently while engaging customers and promoting savings with a Kohl’s Card."
    },
    {
      "duty": "Conduct open and activating Kohl’s Card applications, and be courteous and responsive to requests and questions."
    },
    {
      "duty": "Maintain prompt and regular attendance, comply with dress code requirements, company policies, and receive, understand, and proactively respond to direction from managers and other company personnel."
    },
    {
      "duty": "Work as part of a team, interact effectively with others, and perform tasks in a fast-paced environment."
    },
    {
      "duty": "Satisfactorily complete company training programs, demonstrate basic math and reading skills, and operate and communicate on multiple frequency devices and technology equipment as directed."
    },
    {
      "duty": "Ability to withstand exposure to varying temperatures, humidity, and other elements while performing certain job duties."
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Retail Operations",
      "experience": 3
    },
    {
      "skill": "Merchandising",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Team Training",
      "experience": 3
    },
    {
      "skill": "Customer Engagement",
      "experience": 3
    },
    {
      "skill": "Operational Efficiency",
      "experience": 3
    },
    {
      "skill": "Retail Sales",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ]
}