{
  "meta": [
    {
      "job_title": "Regional Director",
      "job_category": "Healthcare",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 130000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct, plan, supervise, organize and control environment and activities of multiple center dermatology facilities within a defined territory."
    },
    {
      "duty": "Develop and implement a business plan for each center that achieves the financial and service goals of PhyNet."
    },
    {
      "duty": "Manage the clinic operations to ensure the corporate goals of service, associate engagement, patient experience are accomplished and maintain a culture that focuses on quality medical care and customer service while supporting the physicians’ needs within the organization."
    },
    {
      "duty": "Analyze market conditions, identify and interpret trends or deviations from standards and respond by initiating policy or procedure changes."
    },
    {
      "duty": "Resolve problems related to staffing, utilization of facilities, equipment and supplies."
    },
    {
      "duty": "Interact with other Center Administrators and senior management to ensure coordinated efforts in the development of professional relations and contractual arrangements with third party payers, clients and government agencies."
    },
    {
      "duty": "Consult with medical staff to ensure compliance with standards and regulations."
    },
    {
      "duty": "Represent clinics at public and professional meetings and conferences as required."
    },
    {
      "duty": "Maintain professional affiliations and enhance professional development to keep pace with the trends in health care administration."
    },
    {
      "duty": "Perform related work as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in health or business administration, preferably with an emphasis in finance or accounting"
    }
  ]
}