{
  "meta": [
    {
      "job_title": "Customer Success Manager, Associate",
      "job_category": "Customer Success",
      "job_class": "Associate",
      "sector": "Customer Success",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Technical Support",
      "experience": 5
    },
    {
      "skill": "POS System Knowledge",
      "experience": 5
    },
    {
      "skill": "Networking Knowledge",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Client-facing Experience",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support CSMs in onboarding new and existing Licensee Team through the Connect platform process when they are out of office or need additional support."
    },
    {
      "duty": "Act as the go-to resource for other CSMs to brainstorm technical solutions to address challenges including the ability to identify and suggest practices to suit the specific needs of a licensee."
    },
    {
      "duty": "Partner with cross-functional teams including Product Management, Customer Support, and Engineering to translate customer business needs and product feedback into product improvements."
    },
    {
      "duty": "Study, learn and become a subject matter expert with our business, customers and their unique needs, our data and visualizations."
    },
    {
      "duty": "Receive, manage, clarify, and prioritize communications from multiple customers. Requests may be delivered via ticketing system, email or phone."
    },
    {
      "duty": "Assist with communication plans for production rollouts as required while other CSMs are out of the office."
    },
    {
      "duty": "Efficiently & effectively handle multiple tasks and requests simultaneously and manage competing priorities."
    },
    {
      "duty": "Self-directed; is successful with minimal direction from other team members, providing escalation when necessary."
    },
    {
      "duty": "Proficiency in retail installation processes, including network, payments, and coordination with vendors."
    },
    {
      "duty": "Networking knowledge of VLANs, segmentations and components including firewall, DMZ, and VPN products."
    },
    {
      "duty": "Treat customers with integrity, compassion, and respect."
    },
    {
      "duty": "Ability to make data-driven decisions related to partners."
    },
    {
      "duty": "Ability to travel up to 15% for onsite customer workshops and events."
    },
    {
      "duty": "An ability to break down complex topics in simple terms to ensure client understanding."
    },
    {
      "duty": "Strong attention to detail and clear communication both orally and in writing."
    },
    {
      "duty": "Proven experience in conducting presentations to key individuals and C-level team members."
    },
    {
      "duty": "Effectively communicate how our system works including function, hardware, and networking setup."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Technology, or a related field (Master's preferred)"
    }
  ]
}