{
  "meta": [
    {
      "job_title": "Clinical Operations Pharmacist, Midnights",
      "job_category": "Pharmacy",
      "job_class": "Pharmacist",
      "sector": "Healthcare",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Pharmacotherapy",
      "experience": 3
    },
    {
      "skill": "Epic Order Review",
      "experience": 3
    },
    {
      "skill": "Medication Management",
      "experience": 3
    },
    {
      "skill": "Patient Care",
      "experience": 3
    },
    {
      "skill": "Supervision",
      "experience": 3
    },
    {
      "skill": "Clinical Interventions",
      "experience": 3
    },
    {
      "skill": "Drug Information",
      "experience": 3
    },
    {
      "skill": "Pharmacy Dashboard Reporting",
      "experience": 3
    },
    {
      "skill": "Code Blue Response",
      "experience": 3
    },
    {
      "skill": "Medication Policy Implementation",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide patient-specific pharmacotherapy recommendations and drug information to the medical and nursing staff."
    },
    {
      "duty": "Evaluate and verify Epic provider orders for therapeutic appropriateness, proper dosing, optimal dosage form, drug interactions, allergic reactions, route and rate of administration and therapeutic redundancy for Rush University Medical Center and Rush Oak Park Hospital."
    },
    {
      "duty": "Clarify provider orders, when necessary, through direct and timely contact with prescriber or designated practitioner."
    },
    {
      "duty": "Oversight of all workflow operations, including but not limited to, Pyxis restock, oral and IV batch production, compounded medication checking, dispensing carousel, IV Robot and Compounding and Repackaging product checks."
    },
    {
      "duty": "Perform daily review of specified pharmacy dashboard reports including pharmacokinetic monitoring, and other drug or patient specific reports, as necessary."
    },
    {
      "duty": "Precepting of IPPE and APPE students on rotation and residents during orientation, staffing roles and/or projects/research."
    },
    {
      "duty": "Supervise pharmacy technician staff involved in the preparation and delivery of medications ensuring coordination of workflows with established delivery schedules."
    },
    {
      "duty": "Coordinate medication ordering, preparation, dispensing, and administration systems."
    },
    {
      "duty": "Participate in SE (ADR and medication error) reporting programs."
    },
    {
      "duty": "Implement all drug use policy and formulary decisions of the Pharmacy, Nutrition and Therapeutics committee"
    },
    {
      "duty": "Maintain working knowledge of medical center and departmental policies and procedures."
    },
    {
      "duty": "Participate in code blue and code stroke situations, as required."
    },
    {
      "duty": "Demonstrate the ability to prioritize work to optimize resources."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 255,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Doctor of Pharmacy degree and completion of a PGY1 accredited pharmacy residency or 3 years of health system pharmacy experience."
    },
    {
      "credential": "Active Illinois Pharmacist License required."
    },
    {
      "credential": "Capable of assuming responsibility for evaluating and monitoring drug therapy relative to the total needs/problems of the ambulatory care patient in collaboration with physicians, nurses and other healthcare professionals."
    },
    {
      "credential": "Participation and membership in professional societies and organizations is desirable."
    },
    {
      "credential": "Excellent verbal, communication skills, organizational and time-management skills."
    },
    {
      "credential": "Team player with a positive attitude and work ethic."
    },
    {
      "credential": "May be exposed to certain hazardous materials, including but not limited to blood-borne pathogens, chemotherapeutic agents, cleaning and sanitizing agents."
    }
  ]
}