{
  "meta": [
    {
      "job_title": "Police Services Specialist",
      "job_category": "Law Enforcement",
      "job_class": "Specialist",
      "sector": "Police Services",
      "salary": 18,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Database Management",
      "experience": 3
    },
    {
      "skill": "Report Analysis",
      "experience": 3
    },
    {
      "skill": "Emergency Response",
      "experience": 3
    },
    {
      "skill": "Administrative Duties",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform administrative and public facing duties, promoting efficient operations and record-keeping for the University of Virginia Police Department."
    },
    {
      "duty": "Act as a point of first contact for visitors and patients, providing information and direction for academic and medical facilities."
    },
    {
      "duty": "Manage the Police Department's database and use business intelligence for data analysis."
    },
    {
      "duty": "Prepare material related to legal matters and ensure compliance with reporting requirements."
    },
    {
      "duty": "Activate the University's emergency alert system and emergency siren."
    },
    {
      "duty": "Obtain and maintain a Virginia Criminal Information Network (VCIN) certification."
    },
    {
      "duty": "Conduct fingerprinting service for the University community using a Live Scan finger-printing machine."
    },
    {
      "duty": "Operate the Virginia Criminal Information Network system and monitor security communications."
    },
    {
      "duty": "Respond to calls for service for security by phone call and radio, documented in a Computer Aided Dispatch system."
    },
    {
      "duty": "Relay emergency information from Security to the Emergency Communications Center and 911 dispatch."
    },
    {
      "duty": "Monitor and activate the University's Emergency Alert System and emergency siren for events such as tornadoes, active shooters, and hazmat situations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma. Valid Virginia driver’s license."
    }
  ]
}