{
  "meta": [
    {
      "job_title": "Warehouse Supervisor",
      "job_category": "Warehouse",
      "job_class": "Supervisor",
      "sector": "Logistics",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 3
    },
    {
      "skill": "Warehouse Operations",
      "experience": 3
    },
    {
      "skill": "Team Management",
      "experience": 3
    },
    {
      "skill": "Safety Management",
      "experience": 3
    },
    {
      "skill": "Microsoft Dynamics NAV",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate the receipt and distribution of products and materials both inbound and outbound from the facility, including receiving containers and transferring products between warehouses."
    },
    {
      "duty": "Keep in close contact with dispatch and logistics, helping coordinate the delivery/pick up of containers."
    },
    {
      "duty": "Streamline product moving outbound, upkeep and operation of the receiving dock, lead freight lanes."
    },
    {
      "duty": "Identify safety issues and concerns, address and/or communicate to management team."
    },
    {
      "duty": "Use Microsoft Dynamics NAV to receive Transfer Orders and ensure the correct amount of product coming in matches what is in the system."
    },
    {
      "duty": "Set up teams to accomplish daily goals, train and motivate team members, conduct cycle counts of inbound freight, check inbound freight for damages, and ensure daily metrics are being met."
    },
    {
      "duty": "Work well under pressure and time constraints in a fast-paced environment, maintain cleanliness of supervised work area, and ensure the safe working environment of the facility."
    },
    {
      "duty": "Maintain composure in critical situations and communicate clearly with both internal and external stakeholders, prioritize work, demonstrate effective time management skills, all with a high degree of flexibility."
    },
    {
      "duty": "Lead by motivating others and insist on the high standards around safety, performance, and behavior."
    },
    {
      "duty": "Performance of duties outside of normal responsibilities from time to time, as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum 2 years in a warehouse environment with at least 1 year of supervisory leadership."
    },
    {
      "credential": "Knowledge of inventory control and warehousing procedures."
    },
    {
      "credential": "Ability to manage and prioritize multiple tasks and projects at one time."
    }
  ]
}