{
  "meta": [
    {
      "job_title": "Marketing Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 85000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the design, implementation, and maintenance of multiple website’s front-end development using coding languages or outsource the development to third party companies."
    },
    {
      "duty": "Design responsive desktop, tablet, and mobile website mockups prior to implementation."
    },
    {
      "duty": "Collaborate with various business stakeholders and provides guidance to the design and implementation of digital marketing plans including SEO/SEM and social media."
    },
    {
      "duty": "Lead a variety of rail, leasing, and crane companies in identifying and evaluating existing and new digital technologies and using analytics tools to optimize marketing campaigns."
    },
    {
      "duty": "Analyze online statistics while identifying opportunities to optimize performance and report insights to leadership."
    },
    {
      "duty": "Manage and execute various projects including the production of company videos, internal market research, voice of customer and voice of employee for marketing MOAT building and branding, email marketing and SEO implementation, etc., for a variety of internal stakeholders."
    },
    {
      "duty": "Produce and edit both graphic and video content for a variety of stakeholders including the innovation team and other Marmon rail, leasing, and crane stakeholders for use on social media, our websites and as sales tools."
    },
    {
      "duty": "Collaborate with IT team to make sure our websites are developed within ADA standards, while also assisting IT in gathering all Marmon Rail and Crane company website domains from third party vendors."
    },
    {
      "duty": "Work with Innovation group on specific defined projects and support their efforts."
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field"
    }
  ]
}