{
  "meta": [
    {
      "job_title": "Clinic Based Therapist",
      "job_category": "Therapist",
      "job_class": "Therapist",
      "sector": "Mental Health",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Diagnostic Assessment",
      "experience": 3
    },
    {
      "skill": "Individual Therapy",
      "experience": 5
    },
    {
      "skill": "Family Therapy",
      "experience": 5
    },
    {
      "skill": "Crisis Intervention",
      "experience": 3
    },
    {
      "skill": "Client Care",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "Billing",
      "experience": 3
    },
    {
      "skill": "Treatment Planning",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Complete Diagnostic Assessments using trauma-responsive, culturally responsive, and age-appropriate assessment tools, resulting in clinical diagnosis."
    },
    {
      "duty": "Develop individualized treatment plans which define plan of services and intervention; update treatment plans according to regulatory requirements; and provide optimum client care."
    },
    {
      "duty": "Serve a client base of primarily youth and their families; 80% of NYFS clients are between 4 and 26 years of age."
    },
    {
      "duty": "Involve client caregivers in assessment and treatment planning process, and in care when indicated."
    },
    {
      "duty": "Independently provide individual, couple and family therapy as needed to address client treatment needs and provide crisis intervention services as appropriate."
    },
    {
      "duty": "Complete documentation and billing in a timely manner in accordance with NYFS guidelines and all relevant HIPAA and DHS guidelines."
    },
    {
      "duty": "Provide culturally responsive, trauma-responsive, community-based, and developmentally appropriate care."
    },
    {
      "duty": "Actively contribute to weekly case consultation, staff meetings, and agency and community events as assigned."
    },
    {
      "duty": "Abide by all professional ethical standards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s or PhD in Social Work, Psychology, Professional Counseling, or Marriage and Family Therapy"
    }
  ]
}