{
  "meta": [
    {
      "job_title": "Branch Manager IV",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 112500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Sales Operations Planning",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Training and Coaching",
      "experience": 10
    },
    {
      "skill": "Business Accounting",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Technology adoption",
      "experience": 10
    },
    {
      "skill": "P&L Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build a winning team and knowledge base for achieving excellence in all facets of branch operations including inventory management, team development, customer value, and overall financial performance and growth."
    },
    {
      "duty": "Lead a team and recruit top talent to determine individual strengths and weaknesses of branch associates. Actively coach and mentor to achieve high performance and to facilitate their long-term career development at SiteOne."
    },
    {
      "duty": "Train and coach all branch associates in customer value best practices and facilitate a culture whereby every team member is obsessed with customer success."
    },
    {
      "duty": "Create an incident-free environment by emphasizing safety daily through leading by example. Promote a strong safety culture through workplace organization, training and executing policies."
    },
    {
      "duty": "Thoroughly understand and translate company operating and financial data and be able to quickly identify business trends and determine root causes."
    },
    {
      "duty": "Set effective goals and monitor key performance metrics to assess daily, weekly, and monthly progress and to track improvement initiatives. Implement area strategy and develop a complimentary branch strategy to achieve excellent performance, growth, and customer value."
    },
    {
      "duty": "Use/Analyze performance metrics to track progress and continuously adjust strategies to achieve area goals in light of changing market conditions."
    },
    {
      "duty": "Partner with leadership and Field Support to understand the impact of emerging technologies and ways of working on business performance, and actively support and lead their implementation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 155,
      "student_teacher": 125,
      "introvert_extrovert": 170
    }
  ],
  "education_certification": [
    {
      "credential": "Higher education degree preferred"
    }
  ]
}