{
  "meta": [
    {
      "job_title": "Cloud Network Engineer",
      "job_category": "Information Technology",
      "job_class": "Senior",
      "sector": "Software Engineering",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cloud Network Engineering",
      "experience": 4
    },
    {
      "skill": "Network Infrastructure",
      "experience": 5
    },
    {
      "skill": "Connectivity Solutions",
      "experience": 5
    },
    {
      "skill": "Cloud Architecture",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Technical Documentation",
      "experience": 4
    },
    {
      "skill": "Network Security",
      "experience": 5
    },
    {
      "skill": "Cisco Networks",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and drive high priority network initiatives and projects in both cloud and hybrid cloud models."
    },
    {
      "duty": "Evaluate network infrastructure and connectivity solutions and make recommendations to migrate applications and data workloads to a Cloud based model."
    },
    {
      "duty": "Work in collaboration with leadership, enterprise business partners, vendors and project teams."
    },
    {
      "duty": "Participate in the development of documentation and tools to enable support organizations to resolve technical issues, including complex Cloud architecture, design, and service related issues."
    },
    {
      "duty": "Provide technical expertise to project managers and stakeholders about migrating and transitioning applications to Cloud based services and operating and maintaining applications once migrated."
    },
    {
      "duty": "Develop and maintain network scripts to allow operations to deploy and configure environments after operational turnover."
    },
    {
      "duty": "Share deep technical network knowledge, guidance, and mentoring for high visibility Cloud solutions, implementations, and migration initiatives for the enterprise network."
    },
    {
      "duty": "Interact with all levels of employees, including executives, vendors, involved in the cloud network design, connectivity, maintenance, review, approval, testing and communication of business plans and cloud connectivity plans."
    },
    {
      "duty": "Mentor junior-level team members."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Computer Science, Information Systems, or Computer Networking (Master's preferred)"
    },
    {
      "credential": "Cisco Certified Network Associate (CCNA) certification"
    }
  ]
}