{
  "meta": [
    {
      "job_title": "Site Procurement Manager",
      "job_category": "Procurement",
      "job_class": "Manager",
      "sector": "Operations",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Procurement",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Financial Management",
      "experience": 3
    },
    {
      "skill": "Lean Six-Sigma",
      "experience": 3
    },
    {
      "skill": "Cost Accounting",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Own the site’s indirect procurement operation responsibilities, including forecasting, inventory management, purchase order management, and Vendor management of 3rd party service providers."
    },
    {
      "duty": "Lead supplier management KPI and metrics reporting, and work with stakeholders to find and understand deviation and improvement areas."
    },
    {
      "duty": "Provide procurement leadership and align with the building leadership team to drive efficiencies and improvements at the site(s)."
    },
    {
      "duty": "Develop relationship across the building and network to ensure best practices are being shared and implemented."
    },
    {
      "duty": "Manage KPI to measure, control, and benchmark procurement processes including creation of recurring metrics reports to drive improvements for the Operations network."
    },
    {
      "duty": "Coordinate the demand identification, procurement, and inventory management of all non-merchandise items required for building operation."
    },
    {
      "duty": "Partner with Category team to manage and maintain supplier scorecards."
    },
    {
      "duty": "Support the procurement operations and category management teams."
    },
    {
      "duty": "Ensure timely resolution of vendor payment issues."
    },
    {
      "duty": "Lead team of non-inventory receivers to ensure building has adequate resources and is set up for success."
    },
    {
      "duty": "Develop deep knowledge of non-inventory items and align with like buildings to drive best practices."
    },
    {
      "duty": "Work in partnership both internally and with suppliers to develop innovative solutions to provide Procurement support to the Operations network."
    },
    {
      "duty": "Develop and implement ways to measure suppliers to drive continuous performance improvement on behalf of the organization."
    },
    {
      "duty": "Measure actual vs planned savings; as savings trends are identified, own action plans to meet goals and develop solutions."
    },
    {
      "duty": "Work is done in a warehouse environment that requires frequent walking around the building."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 110,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree, or 2+ years of Amazon (blue badge/FTE) experience"
    }
  ]
}