{
  "meta": [
    {
      "job_title": "Biomedical Equipment Technician",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs planned maintenance and electrical safety inspections on a broad range of patient care and selected support equipment in compliance with established standards."
    },
    {
      "duty": "Manages all assigned equipment and schedules service."
    },
    {
      "duty": "Performs pre-acceptance inspections and develop PM procedures on equipment; maintains files on procedures and manuals."
    },
    {
      "duty": "Ensures test equipment is working properly and calibrated within established intervals."
    },
    {
      "duty": "Responds expeditiously to calls from clinical departments to evaluate and rectify valid operator complaints and concerns."
    },
    {
      "duty": "Researches and initiates orders for repair parts, working within established budget parameters."
    },
    {
      "duty": "Maintains purchase order log and validate invoices for payment (field service personnel only)."
    },
    {
      "duty": "Provides informal training to equipment users and Crothall Services Group staff as requested or when circumstances dictate."
    },
    {
      "duty": "Makes recommendations to the Department Manager regarding service strategies on equipment; keeps supervisor informed of activities, needs, and problems."
    },
    {
      "duty": "Participates in the Quality Improvement / Risk Management program by gaining an understanding of the issues and concerns of customers and making recommendations for improvement."
    },
    {
      "duty": "Maintains an orderly and functional work environment."
    },
    {
      "duty": "Provides emergency on-call responsibilities as needed."
    },
    {
      "duty": "Documents all significant asset related actions in compliance with department practices."
    },
    {
      "duty": "Participates in department meetings."
    },
    {
      "duty": "Collaborates with fellow technical personnel in department meetings to ensure they are kept abreast of technical updates and/or device related problems."
    }
  ],
  "skills": [
    {
      "skill": "Electrical Safety Inspection",
      "experience": 5
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 5
    },
    {
      "skill": "Technical Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Order Management",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "Associates degree in electronics/biomedical equipment technology, military training or equivalent experience"
    }
  ]
}