{
  "meta": [
    {
      "job_title": "Sr. Platform Integration Engineer",
      "job_category": "Software Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 135000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Java",
      "experience": 5
    },
    {
      "skill": "Spring Boot",
      "experience": 5
    },
    {
      "skill": "Microservices",
      "experience": 5
    },
    {
      "skill": "Apigee",
      "experience": 5
    },
    {
      "skill": "Kubernetes",
      "experience": 5
    },
    {
      "skill": "Kafka",
      "experience": 5
    },
    {
      "skill": "Avro",
      "experience": 5
    },
    {
      "skill": "YAML",
      "experience": 5
    },
    {
      "skill": "Unit Testing",
      "experience": 5
    },
    {
      "skill": "Automated Testing",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Performance Optimization",
      "experience": 5
    },
    {
      "skill": "Technical Support",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, develop, and maintain robust enterprise-grade applications using technologies like Spring Boot, Microservices, and Apigee."
    },
    {
      "duty": "Collaborate with business users to understand requirements, provide estimates, and translate business needs into technical solutions."
    },
    {
      "duty": "Write clean, well-tested code following industry best practices. Create unit and automated tests to ensure high quality."
    },
    {
      "duty": "Support business users during testing and post-deployment, quickly diagnosing and resolving defects and performance issues."
    },
    {
      "duty": "Continuously improve existing systems by refactoring, optimizing performance, and enhancing functionality."
    },
    {
      "duty": "Provide Level 3 support for mission-critical production applications and services. Rapidly troubleshoot and restore service during outages."
    },
    {
      "duty": "Master technologies like Kubernetes, Kafka, Avro, and YAML to stay on top of industry trends."
    },
    {
      "duty": "Communicate effectively with stakeholders at all levels, setting and meeting expectations while explaining technical concepts clearly."
    },
    {
      "duty": "Thrive in a fast-paced team environment, actively collaborating and sharing knowledge."
    },
    {
      "duty": "Demonstrate strong problem-solving skills, intellectual curiosity, and passion for excellence. Relevant certifications like Spring Professional are a plus."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Computer Science, Software Engineering, or a related field"
    }
  ]
}