{
  "meta": [
    {
      "job_title": "Procurement Administrator",
      "job_category": "Procurement",
      "job_class": "Administrator",
      "sector": "Logistics",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Stakeholder Collaboration",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Organization",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide updates on schedules, and project next steps on the S2P system and ensure the vendor is performing duties as identified."
    },
    {
      "duty": "Assist in overseeing the schedule for each module/phase of implementation of S2P and delivery of services."
    },
    {
      "duty": "Work closely with various business partners including IT/Finance/AP through the implementation phase; help understand various business unit needs, and their current state and help align them with the S2P system."
    },
    {
      "duty": "Work closely with the selected vendor for the S2P system; become one of the main points of contact to review questions and help resolve any system issues."
    },
    {
      "duty": "Assist business units with questions, respond to and assist the business units to fix various issues related to the S2P."
    },
    {
      "duty": "Frequently communicate with other HFT business units and/or outside vendors to request or provide information or to clarify procedures."
    },
    {
      "duty": "Assist in the review of operating procedures and policies for efficiency and effectiveness; suggest/makes changes or recommend major changes or improvements."
    },
    {
      "duty": "Participate in planning and decisions regarding new or changed policies and procedures."
    },
    {
      "duty": "Independently assemble and interpret data, prepare reports, and handle correspondence for the department and for the S2P System; may include special projects or extensive reports."
    },
    {
      "duty": "Prepare narrative and informational reports, as needed or requested; compile and organize information requiring the understanding and evaluation of data sources; may include special projects or extensive reports."
    },
    {
      "duty": "Respond to requests for information and provide assistance in solving a wide variety of problems."
    },
    {
      "duty": "Communicate with HFT business units and or outside vendors to assist in the onboarding process, answer questions as they arise, and provide feedback in a timely manner."
    },
    {
      "duty": "All other duties as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 95
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or equivalent experience"
    }
  ]
}