{
  "meta": [
    {
      "job_title": "Estimator/Project Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Estimating",
      "experience": 5
    },
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Civil Plans Interpretation",
      "experience": 5
    },
    {
      "skill": "Project Scheduling",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Construction Documents Analysis",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Material Procurement",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and manage construction project cost estimates at various stages of a project, including conceptual, schematic, design-development and construction drawings."
    },
    {
      "duty": "Partner with team, project owners, engineers and consultants to clarify scope of work, materials and schedule requirements."
    },
    {
      "duty": "Develop and manage project schedules."
    },
    {
      "duty": "Conduct reviews of milestone documents for the development and pricing of alternative opportunities."
    },
    {
      "duty": "Direct, coordinate and provide information and documents to engineers, team and subcontractors."
    },
    {
      "duty": "Solicit and qualify subcontractor/vendor quotes based on job specifications."
    },
    {
      "duty": "Assemble, maintain and monitor a qualified bidders list for projects."
    },
    {
      "duty": "Analyze and maintain construction documents including plans, models, specifications and reports."
    },
    {
      "duty": "Prepare scope sheets for bid analysis and analyze bid scopes from prospective bidders."
    },
    {
      "duty": "Provide oversight for output, communications, schedule, risks and opportunities."
    },
    {
      "duty": "Establish and maintain solid relationships with customers, engineers, vendors and subcontractors."
    },
    {
      "duty": "Manage projects from start to finish including coordination and scheduling of resources, material procurement/delivery, and subcontractors."
    },
    {
      "duty": "Ability to read civil and architectural plans and develop cost estimates."
    },
    {
      "duty": "Strong understanding of residential, commercial and government construction processes and codes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Associates or Bachelor’s degree in Architecture, Engineering, Construction Management or equivalent field."
    }
  ]
}