{
  "meta": [
    {
      "job_title": "Control Room Operator",
      "job_category": "Engineering",
      "job_class": "Operator",
      "sector": "Engineering",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Control Room Operation",
      "experience": 5
    },
    {
      "skill": "Power Plant Experience",
      "experience": 5
    },
    {
      "skill": "Mechanical Aptitude",
      "experience": 5
    },
    {
      "skill": "Steam Plant Knowledge",
      "experience": 5
    },
    {
      "skill": "Turbine Operation",
      "experience": 5
    },
    {
      "skill": "Instrumentation Readings",
      "experience": 5
    },
    {
      "skill": "Maintenance and Repair",
      "experience": 5
    },
    {
      "skill": "Training",
      "experience": 5
    },
    {
      "skill": "Judgment and Decision Making",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitor, record and trend readings from the plant control system and steam generating equipment of various models."
    },
    {
      "duty": "Monitor the Gas Turbine control panels to ensure the proper operation of turbine equipment."
    },
    {
      "duty": "Perform all required plant water chemistry analysis, adjust as necessary to maintain chemistry control within the plant specified limits."
    },
    {
      "duty": "Operate the plant in a safe and efficient manner, following all plant procedures, health, and safety guidelines, and current operating practices."
    },
    {
      "duty": "Monitor instrumentation readings for variances from prescribed operating standards and procedures, adjust as necessary to maintain proper operation of plant equipment."
    },
    {
      "duty": "Maintain the control room logbook."
    },
    {
      "duty": "Report conditions beyond the troubleshooting/repair capabilities of shift personnel to management."
    },
    {
      "duty": "Maintain the lock-out/tag-out log and monitor maintenance activities to always ensure proper plant operation."
    },
    {
      "duty": "Visually inspect equipment at periodic intervals to detect malfunctions or need for repair or adjustments. Record any abnormalities in the control room log."
    },
    {
      "duty": "Report and/or correct unsafe conditions or hazards, (leaks, slip hazards, safety deficiencies, etc)."
    },
    {
      "duty": "Maintain cleanliness of all plant spaces and common areas."
    },
    {
      "duty": "Perform minor maintenance, outage repairs, and testing of equipment."
    },
    {
      "duty": "Train new employees, as required."
    },
    {
      "duty": "This position will be required to work overtime on a regular basis to support vacations, callouts, plant outages, emergency work, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "DC 1st Class Stationary Engineer’s license is highly preferred - Willing to consider candidates who have have the Washington DC specific 3rd Class Stationary Engineer License (or be near pursuing the 3rd class). Must have powerplant experience as well as the license listed."
    },
    {
      "credential": "5 years prior experience as a Control Room Operator in a power plant or equivalent combination of education and experience."
    },
    {
      "credential": "Strong mechanical aptitude, basic steam plant and combustion turbine knowledge."
    },
    {
      "credential": "Ability to read and interpret documents in English such as safety rules, data, operating and maintenance instructions and procedure manuals."
    },
    {
      "credential": "Ability to speak English plainly, write work orders and understand oral communications."
    },
    {
      "credential": "Ability to add, subtract, multiply, and divide in all units of measure, using whole numbers, common fractions, and decimals."
    },
    {
      "credential": "Ability to apply common sense understanding to carry out instructions furnished in written, oral, or diagram form."
    },
    {
      "credential": "Exercise judgment within defined procedures and practices to determine appropriate action. Decisions are made based on formal procedures, calculations, deductive reasoning, and consultation with supervisor."
    },
    {
      "credential": "Power plant experience with electrical generation and steam pressures >100 psi"
    }
  ]
}