{
  "meta": [
    {
      "job_title": "Program Manager - Education",
      "job_category": "Education",
      "job_class": "Manager",
      "sector": "Education",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Team Development",
      "experience": 5
    },
    {
      "skill": "High-Level Communication",
      "experience": 5
    },
    {
      "skill": "Event Coordination",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide leadership in the development, implementation, and monitoring of fellowship, residency, and clerkship programs."
    },
    {
      "duty": "Oversee all GME activities, residency recruitment and match activities, and medical student/resident rotation activities."
    },
    {
      "duty": "Manage various budgets including residency, clerkship, and fellowship."
    },
    {
      "duty": "Coordinate departmental re-credentialing and promotion activities, and orientation for faculty, staff, and fellows."
    },
    {
      "duty": "Work closely with key physician and administrative leaders, including participation in strategic planning."
    },
    {
      "duty": "Oversee all CME activities and coordinate the department's alumni activities."
    },
    {
      "duty": "Train professional development of fellowship, residency, and clerkship program team members."
    },
    {
      "duty": "Manage and coordinate the electronic resident application process."
    },
    {
      "duty": "Provide reports for accreditation, program reviews, and institutional effectiveness surveys."
    },
    {
      "duty": "Participate in regular staff meetings to offer input and identify problems or opportunities within the area."
    },
    {
      "duty": "Develop routine and special reports, surveys, evaluations, etc."
    },
    {
      "duty": "Ensure appropriate materials, resources, and information for faculty, residents, and medical students."
    },
    {
      "duty": "Maintains staff by recruiting, selecting, orienting, and training employees."
    },
    {
      "duty": "Maintains a high level of customer service and recommends system improvements as needed."
    },
    {
      "duty": "Fosters teamwork among direct reports and other members of department."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree required. At least five years of administrative or business management experience required, preferably in an academic environment. Proficiency with the Microsoft Office Suite. Ability to manage multiple priorities and meet deadlines. Excellent communication and relationship building skills. Ability to effectively represent the RUMG in a variety of stakeholder meetings."
    }
  ]
}