{
  "meta": [
    {
      "job_title": "Sales Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 24960,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support Sales, Hospitality, Operations, People, and Conversion through our Shop C3 Program."
    },
    {
      "duty": "Drive sales by providing an inspiring environment that motivates customers to add to their basket."
    },
    {
      "duty": "Deliver a consistent sales floor experience."
    },
    {
      "duty": "Build customer connections with a greeting and execute an authentic hospitality experience."
    },
    {
      "duty": "Support sales floor, fitting room, point of sale, and operational processes, as required."
    },
    {
      "duty": "Ensure all customers feel respected, appreciated, and rewarded."
    },
    {
      "duty": "Build trust to solve the customer shopping needs."
    },
    {
      "duty": "Leverage omni-channel offerings to deliver a frictionless customer experience."
    },
    {
      "duty": "Accurately deliver on our operational processes, BOPUS, BOSS, MLS, SFS."
    },
    {
      "duty": "Build rapport and make a genuine connection with the customer."
    },
    {
      "duty": "Acknowledge and assist customers through our company programs."
    },
    {
      "duty": "Complete transactions accurately and efficiently while engaging customers."
    },
    {
      "duty": "Be a savings consultant to help customers save with a Kohl's Card."
    },
    {
      "duty": "Converts, opens, and activates Kohl's Card applications."
    },
    {
      "duty": "Courteous and responsive to requests and questions."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "No Retail or Service Industry Experience Required"
    },
    {
      "credential": "Excellent written and verbal communication skills with the ability to influence in a clear and concise manner."
    },
    {
      "credential": "Naturally curious; desire to learn"
    },
    {
      "credential": "Commitment to valuing diversity and contributing to an inclusive work environment"
    }
  ]
}