{
  "meta": [
    {
      "job_title": "Assistant Account Manager",
      "job_category": "Security",
      "job_class": "Manager",
      "sector": "Security",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Training",
      "experience": 5
    },
    {
      "skill": "Supervision",
      "experience": 5
    },
    {
      "skill": "Security Management",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Emergency Response",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Account Manager in coordinating all aspects of executing the security contract at the assigned location, including technical and managerial tasks."
    },
    {
      "duty": "Assign work tasks to Security Professionals, direct their work, and serve as the first direct supervisory contact for shift supervisors or Security Professionals regarding performance, operations, and department needs."
    },
    {
      "duty": "Supervise, motivate, coach, and evaluate the work performance of Security Professionals, conducting on-the-job training for new employees, and overseeing all reports and pass downs generated by and for the Security Department."
    },
    {
      "duty": "Manage and supervise all sub-units within the Security Department, respond to minor incidents, and identify personnel problems occurring at posts, forwarding any such issues to Account Manager or Field Supervisor as appropriate."
    },
    {
      "duty": "Recommend counseling and/or disciplinary action as well as respond to client or site emergencies, maintaining positive client/security relationships through frequent tenant/client contact and support."
    },
    {
      "duty": "Occasionally perform Security Professional type job duties on an as-needed basis, but under no circumstances to exceed more than 50% of time in any given workweek."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent required; Some college education or business classes desirable."
    }
  ]
}