{
  "meta": [
    {
      "job_title": "Client Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Client Transactions",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Sales Support",
      "experience": 2
    },
    {
      "skill": "Financial Needs Assessment",
      "experience": 2
    },
    {
      "skill": "Cross-Selling",
      "experience": 2
    },
    {
      "skill": "Digital Banking Education",
      "experience": 2
    },
    {
      "skill": "Problem Resolution",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide timely and efficient completion of client transactions while maintaining accurate records and thorough proper handling of all monies assigned."
    },
    {
      "duty": "Deliver superior quality service, identifying and understanding the client's financial needs."
    },
    {
      "duty": "Cross-trained to support sales and service activities as needed."
    },
    {
      "duty": "Ensures a consistent client service experience through primarily handling clients’ transactional needs, including accepting deposits and loan payments, verifying cash and endorsements, cashing checks within limits, issuing money orders, cashier’s checks and redeeming savings bonds."
    },
    {
      "duty": "Participates fully in all components of the established Retail Community Bank Leadership Routines."
    },
    {
      "duty": "Adheres to internal controls, operational procedures and risk management policies."
    },
    {
      "duty": "Serves as secondary contact for new account openings and problem resolution, cross-selling applicable products and services to clients and prospects."
    },
    {
      "duty": "Educates clients on digital, self-service solutions including ATMs, Online and Mobile banking to make banking easier and enhance their service experience."
    },
    {
      "duty": "Provides professional client service, ensuring a consistent experience by engaging clients with smiling, courteous conversation while conducting transactions and uncovering needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent education"
    },
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}