{
  "meta": [
    {
      "job_title": "Compliance Officer II",
      "job_category": "Compliance",
      "job_class": "Officer",
      "sector": "Finance",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Policy Development",
      "experience": 5
    },
    {
      "skill": "Compliance Training",
      "experience": 5
    },
    {
      "skill": "Monitoring and Reporting",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise and manage the monitoring process according to internal procedures and schedules, ensuring adherence to compliance standards."
    },
    {
      "duty": "Stay up-to-date with regulatory changes and industry standards to update and maintain compliance department policies and procedures."
    },
    {
      "duty": "Provide direction and guidance on policy and procedure to business units, and assist in the maintenance and updating of the Company’s Compliance Resource Library."
    },
    {
      "duty": "Identify, communicate, and assess regulatory changes to effectively communicate to impacted business units/employees throughout the organization."
    },
    {
      "duty": "Develop and apply new preventative techniques and methods that identify compliance and legal exposures to the Company based on regulatory changes."
    },
    {
      "duty": "Act as a subject matter expert in the development of annual Compliance training content based on regulatory requirements and risk-based prioritization; coordinates training deployment with the Company’s Training Department."
    },
    {
      "duty": "Prepare meaningful and timely reports as required under management practices, and works collaboratively with other employees to support the overall objectives of the department."
    },
    {
      "duty": "Treat people with respect; keeps commitments; inspires the trust of others; works ethically and with integrity; upholds organizational values; accepts responsibility for own actions."
    },
    {
      "duty": "Follows policies and procedures; completes tasks correctly and on time; supports the company’s goals and values."
    },
    {
      "duty": "Follows monitoring, testing, and reporting processes to generate quantitative and qualitative reporting, and manages reporting to proactively control compliance risks."
    },
    {
      "duty": "Works collaboratively with other employees to support the overall objectives of the department, and interacts appropriately and professionally with Regulators and auditors."
    },
    {
      "duty": "Participates in community development activities outside the organization in support of the Company’s Community Reinvestment goals."
    },
    {
      "duty": "Performs duties specific to the position and other functions as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or more than 5 years of related experience and/or training within the financial industry."
    }
  ]
}