{
  "meta": [
    {
      "job_title": "Accounting Manager",
      "job_category": "Accounting",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead Monthly, Quarterly and Annual closing process ensuring all work is accurate and completed on a timely basis."
    },
    {
      "duty": "Prepare monthly and quarterly financial statements, ensuring all work is accurate and completed on a timely basis (ie. profit and loss statements, balance sheets, and statement of cash flows)."
    },
    {
      "duty": "Maintain internal reporting systems and responsible for the overall consolidation of the financial results."
    },
    {
      "duty": "Ensure the timely completion of standardized reporting packages which provide actual and projected financial results."
    },
    {
      "duty": "Lead and actively participate in the annual financial audit, including work paper preparation."
    },
    {
      "duty": "Oversee the accounting close process and continuously improve processes to scale with the organization."
    },
    {
      "duty": "Develop, implement, and maintain Accounting policies, procedures, and guidelines for company financial and reporting systems."
    },
    {
      "duty": "Provide interpretation and application of accounting procedures, principles and pronouncements in accordance with GAAP."
    },
    {
      "duty": "Identify, research, and conclude on technical accounting issues through technical memos and accounting policies."
    },
    {
      "duty": "Assist Financial Planning in preparation of the annual budget."
    },
    {
      "duty": "Lead development of strategies for accounts payable and general accounting."
    },
    {
      "duty": "Provide oversight for Accounts Payable. Oversee the management of multiple functions related to disbursement of cash including payment processing, cash management and accurate recording of all payments."
    },
    {
      "duty": "Formulate policy and process recommendations that support and enhance the Company’s goals and objectives and provide for the appropriate allocation of resources."
    },
    {
      "duty": "Establish and nurture highly effective relationships with employees, customers and stakeholders that support and advance business goals and objectives. Continually work to remove barriers to inter-and intra-department communications."
    },
    {
      "duty": "Demonstrates high degree of professionalism in communication, attitude and teamwork with customers, peers and management."
    },
    {
      "duty": "Demonstrates high level of quality work, attendance and appearance."
    },
    {
      "duty": "Adheres to all Company Policies & Procedures and Safety Regulations."
    },
    {
      "duty": "Adhere to local, state and federal laws."
    },
    {
      "duty": "Additional responsibilities assigned by supervisor related to your position/department."
    },
    {
      "duty": "Ability to be flexible and willing to work extended hours when necessary."
    },
    {
      "duty": "Provides coaching, direction, develops and empowers direct reports – General Accounting Team and Accounts Payable Manager."
    },
    {
      "duty": "Ensures work flow and processes are to maximum efficiencies for business necessity."
    },
    {
      "duty": "Interacts and supports all corporate departments. Works closely with the Finance Departments – Financial Planning, Treasury, Payroll, Cost Accounting and Accounts Receivable."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 180,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Accounting or related field is required. 10 or more years of experience in management and leadership in public accounting or operational finance. CPA license required."
    }
  ]
}