{
  "meta": [
    {
      "job_title": "Cucurbit Crop Specialist",
      "job_category": "Agriculture",
      "job_class": "Specialist",
      "sector": "Agriculture",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Agronomy",
      "experience": 5
    },
    {
      "skill": "Crop Production",
      "experience": 5
    },
    {
      "skill": "Agricultural Research",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Visit domestic and international production locations for commercial and Stock Seed productions to inspect crops and provide feedback to producers on Sakata genetics and best production practices."
    },
    {
      "duty": "Provide agronomic support to local teams and serve as species expert for cucurbit crops and provide valuable agronomic insight during the growing season."
    },
    {
      "duty": "Work with the cucurbit supply planner to provide input on crop placement to help ensure the highest potential of success."
    },
    {
      "duty": "Follow up on QA concerns and issues and work with experimental production, and seed physiology to identify problems and implement trials to determine best practices."
    },
    {
      "duty": "Analyze past production quantity, quality, base rates, cost and timeliness data and contribute to the overall strategic roadmap for cucurbit production at Sakata; Manage technical improvement projects with subsidiaries and vendors."
    },
    {
      "duty": "Review and analyze domestic and international production locations, maintain contacts there and suggest new producers where needed. Address areas for improvement, simplification, optimization or expansion of our business, including crop year performance and grower performance analysis."
    },
    {
      "duty": "Work with planning to ensure thorough communication with international vendors enabling delivery of critical updates and growing information."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. degree or equivalent experience required, with classes in crop production, agronomy, plant science. Preferred: Masters in an Agriculture related discipline a bonus."
    }
  ]
}