{
  "meta": [
    {
      "job_title": "Associate Director, Global Markets Advisory",
      "job_category": "Finance",
      "job_class": "Director",
      "sector": "Finance",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Global Financial Markets",
      "experience": 6
    },
    {
      "skill": "Client Relationship Management",
      "experience": 6
    },
    {
      "skill": "Asset Class Knowledge",
      "experience": 6
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Prospecting/Pitching",
      "experience": 5
    },
    {
      "skill": "Political Risk Assessment",
      "experience": 6
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 6
    },
    {
      "skill": "Strategic Account Planning",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build market share and revenue growth for an existing portfolio of institutional accounts (Asset Managers, Hedge Funds, Pension funds) mainly based in the East Coast."
    },
    {
      "duty": "Develop a strong understanding of Eurasia Groups business and become an expert in how political risks fit into client investment and risk process."
    },
    {
      "duty": "Leverage global resources in country, sectoral research, market strategy & geo-economics to create a value-add coverage and develop solutions-based engagements with investment professionals."
    },
    {
      "duty": "Maintain knowledge of market developments (on a multi-region basis), asset classes, and political risks to engage with and provide value to sophisticated institutional investors."
    },
    {
      "duty": "Create and build in-depth strategic account plans and provide support to senior leadership in business and strategy planning (including new business pipeline) and major new pitches."
    },
    {
      "duty": "Work closely and effectively with analysts, strategy teams, and all pillars of the firm as a value-added partner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required, Masters or MBA preferred."
    }
  ]
}