{
  "meta": [
    {
      "job_title": "Deputy Chief, Agile & Citizen Product Group",
      "job_category": "IT",
      "job_class": "Chief",
      "sector": "IT",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Agile Leadership",
      "experience": 8
    },
    {
      "skill": "Product Lifecycle Management",
      "experience": 8
    },
    {
      "skill": "Team Management",
      "experience": 8
    },
    {
      "skill": "IT Strategy",
      "experience": 8
    },
    {
      "skill": "Software Engineering",
      "experience": 8
    },
    {
      "skill": "Data Analytics",
      "experience": 8
    },
    {
      "skill": "Financial Management",
      "experience": 8
    },
    {
      "skill": "Agile Coaching",
      "experience": 8
    },
    {
      "skill": "Cloud Architecture",
      "experience": 8
    },
    {
      "skill": "Agile Project Management",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Own the product life cycle for Agile Delivery, Citizen Development, and Software Engineering Platform product lines."
    },
    {
      "duty": "Provide leadership in agile transformation and drive the digital agenda and roadmaps for application and/or infrastructure products."
    },
    {
      "duty": "Manage a team of product directors with agile coaches to define the launch of new products and services, develop technical roadmaps, and deliver product features in an agile environment."
    },
    {
      "duty": "Lead the establishment of a center of excellence to streamline processes, create efficiencies, and help teams deliver better products in a faster, more efficient way."
    },
    {
      "duty": "Set the direction for low code development, provide oversight, establish rules of engagement for Citizen Developers, and develop an adaptive governance framework."
    },
    {
      "duty": "Establish application development standards, secure coding techniques, and design patterns and methodologies for all development platforms."
    },
    {
      "duty": "Lead the development of transformation roadmaps with long and short-term plans for new and improved processes and policies."
    },
    {
      "duty": "Maintain contact with key IT suppliers and collaborate with IT Business Management Services to identify procurement contracts."
    },
    {
      "duty": "Direct the development of Information Technology products and plans, identify opportunities for cost-effective investment in IT systems and resources, and develop disaster recovery and business continuity plans."
    },
    {
      "duty": "Coordinate consultation with stakeholders to define business and systems requirements for new technology implementations and provide direction on evaluation, selection, implementation, and maintenance of information systems."
    },
    {
      "duty": "Participate in overall business planning, monitor product lifecycles, and ensure continuous product services delivery through oversight of service level agreements."
    },
    {
      "duty": "Advise on the selection, prioritization, development, and implementation of applications, infrastructure, and related products."
    },
    {
      "duty": "Develop business case justifications and cost/benefit analyses for IT spending and initiatives while advising on continued education training programs and career development for IT staff."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 190,
      "student_teacher": 160,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Computer Science, Business Administration, Engineering, Finance, or Information Services (Master’s preferred) plus a minimum of 14 years of Information Technology experience with at least 8 years of progressive IT managerial experience."
    }
  ]
}