{
  "meta": [
    {
      "job_title": "Quality Lab Technician",
      "job_category": "Quality Assurance",
      "job_class": "Technician",
      "sector": "Medical Device Manufacturing",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Analytical Testing",
      "experience": 3
    },
    {
      "skill": "HPLC (High-Performance Liquid Chromatography)",
      "experience": 3
    },
    {
      "skill": "Documentation",
      "experience": 3
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 3
    },
    {
      "skill": "Laboratory Equipment Maintenance",
      "experience": 3
    },
    {
      "skill": "Analytical Test Method Validation",
      "experience": 3
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 3
    },
    {
      "skill": "Continuous Improvement",
      "experience": 3
    },
    {
      "skill": "Safety Protocols",
      "experience": 3
    },
    {
      "skill": "Report Preparation",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform a wide range of analytical tests on raw materials, in-process samples, and finished products using various laboratory equipment."
    },
    {
      "duty": "Conduct routine and non-routine analysis using techniques such as HPLC (High-Performance Liquid Chromatography) and other appropriate methods."
    },
    {
      "duty": "Document and maintain accurate records of all test results, ensuring compliance with regulatory requirements and internal quality standards."
    },
    {
      "duty": "Identify and report any deviations or non-conformities and collaborate with a cross-functional team to investigate and resolve issues."
    },
    {
      "duty": "Participate in the calibration, maintenance, and troubleshooting of laboratory equipment to ensure reliable and accurate test results."
    },
    {
      "duty": "Assist in the development and validation of analytical test methods, ensuring their suitability for quality control purposes."
    },
    {
      "duty": "Collaborate with cross-functional teams to support investigations, root cause analysis, and corrective actions related to quality issues."
    },
    {
      "duty": "Contribute to continuous improvement initiatives by actively participating in process optimization and efficiency enhancement projects."
    },
    {
      "duty": "Adhere to safety protocols, good laboratory practices (GLP), and standard operating procedures (SOPs) at all times."
    },
    {
      "duty": "Assist and coordinate the preparation of reports in relation to Annual Product Reviews and Stability Studies for applicable products manufactured on site."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Chemistry, Biochemistry, or a related field is preferred. Candidates with relevant laboratory experience will also be considered."
    }
  ]
}