{
  "meta": [
    {
      "job_title": "Client Executive",
      "job_category": "Client Services",
      "job_class": "Executive",
      "sector": "Management",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build and maintain relationships with client C Suite executives and key contacts."
    },
    {
      "duty": "Work with Producer(s) and Client Managers, coordinate the renewal process for existing Employee Benefit accounts, including: marketing (as needed to assist Client Managers and Marketing Department), selling and implementation of Resources, and coordination of renewal, stewardship and new business meetings with insureds."
    },
    {
      "duty": "Work with Producer(s) in the evaluation of applicable resources, claims experience and product/service needs for their clients and prospects."
    },
    {
      "duty": "Initiate contact with client C Suite executives and key contacts periodically to ensure a high-level of client satisfaction."
    },
    {
      "duty": "Closely work with Marketing Department and Client Managers to negotiate with carriers to secure broad coverage and competitive pricing and terms for existing clients."
    },
    {
      "duty": "Coordinate the preparation of effective proposals for Producer to use for renewal/new business. Accompany Producer when making proposals and make proposals without Producer when needed/appropriate."
    },
    {
      "duty": "Assist Marketing Department and Client Managers with maintaining thorough documentation through the use and maintenance of marketing files, good transactional filing notes and telephone logs."
    },
    {
      "duty": "Present financial data analysis to clients. Oversees dashboard development and financial projections/monitoring of reports that ensure accuracy and compliance with service plan."
    },
    {
      "duty": "Inform team(s) of major developments, issues, renewal results, etc. as required."
    },
    {
      "duty": "Coordinate the delivery of agency value-added resources (e.g. Zywave, ThinkHR, etc.) as needed for prospects and clients."
    },
    {
      "duty": "Ensure clients are within compliance (e.g. FMLA, COBRA, HIPAA, ERISA, SPDs, Form 5500s) through regular contact and guidance."
    },
    {
      "duty": "Coordinate the Employee Benefits enrollment experience as needed."
    },
    {
      "duty": "Inform and assist clients with analysis and implementation of Benefits Administration systems."
    },
    {
      "duty": "Perform other duties, both major and minor, which are assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "4-year college degree or 5-7 years Employee Benefits insurance work experience. CEBS designation preferred; GBA or equivalent designation(s) required."
    },
    {
      "credential": "Working knowledge of both fully insured and self-funded health plans."
    },
    {
      "credential": "Prior sales and/or marketing experience in the insurance industry is preferred."
    },
    {
      "credential": "Strong knowledge of Employee Benefits products, services, and technology."
    },
    {
      "credential": "Strong understanding of Benefit Administration systems and command of value-added resources subscribed to by the company."
    },
    {
      "credential": "Excellent interpersonal skills, customer focus and the ability to work as part of a team with management and Client Managers."
    },
    {
      "credential": "Good analytical skills for evaluating claims experience and trends."
    },
    {
      "credential": "Proficiency in gathering data and applying skillful problem-solving."
    },
    {
      "credential": "Strong ability to cross-sell other EB product lines, communicate with carrier marketing departments and underwriters, and develop action plans for new business and renewal efforts."
    },
    {
      "credential": "Good computer skills (PowerPoint, BenefitPoint, Word, and Excel software experience preferred)."
    },
    {
      "credential": "Comprehensive knowledge and training on the requirements of health care reform and ability to effectively communicate this information to clients."
    },
    {
      "credential": "The ability to communicate clearly and effectively via phone, in person and in writing."
    },
    {
      "credential": "Possess and utilize strong leadership skills."
    },
    {
      "credential": "Enjoy presenting to and building relationships with clients."
    },
    {
      "credential": "Ability to travel up to 20%, including some overnight."
    }
  ]
}