{
  "meta": [
    {
      "job_title": "Clinical Specialist",
      "job_category": "Clinical Operations",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as an expert user of the Laguna Platform and subject matter expert."
    },
    {
      "duty": "Promote utilization of the Laguna Platform."
    },
    {
      "duty": "Provide insights and feedback to Product using your subject matter expertise to help in the development and implementation of the Laguna Platform and clinical workflows."
    },
    {
      "duty": "Work closely with Product, Engineering, Marketing and Laguna Customers to optimize Clinical Operations workflows."
    },
    {
      "duty": "Provide guidance and support to users of the Laguna Platform and escalate customer technical issues and product feedback as needed."
    },
    {
      "duty": "Collaborate with Clinical, Clinical Ops, Product, and Business to identify and address operational gaps, clinical needs, and opportunities for process automation, quality assurance and data harmonization."
    },
    {
      "duty": "Support documentation of clinical workflows."
    },
    {
      "duty": "Action Laguna process for user satisfaction surveys, including outbound Member, Coach and Provider communications."
    },
    {
      "duty": "Other duties as assigned to Clinical Specialists from time to time."
    }
  ],
  "skills": [
    {
      "skill": "Clinical Operations",
      "experience": 3
    },
    {
      "skill": "Clinical Workflow Optimization",
      "experience": 3
    },
    {
      "skill": "Product Feedback",
      "experience": 3
    },
    {
      "skill": "Process Automation",
      "experience": 3
    },
    {
      "skill": "Quality Assurance",
      "experience": 3
    },
    {
      "skill": "Data Harmonization",
      "experience": 3
    },
    {
      "skill": "Customer Technical Support",
      "experience": 3
    },
    {
      "skill": "Documentation",
      "experience": 3
    },
    {
      "skill": "User Satisfaction Surveys",
      "experience": 3
    },
    {
      "skill": "Outbound Communications",
      "experience": 3
    },
    {
      "skill": "Subject Matter Expertise",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "3+ years of relevant experience working within a digital health startup, health system, health plan, patient navigation, case or care management organization."
    },
    {
      "credential": "Excellent ability to analyze and organize information and think systematically."
    },
    {
      "credential": "Ability to work independently and proactively, manage competing priorities and deadlines, exercise sound judgment, and take ownership of issues and matters through their successful conclusion."
    },
    {
      "credential": "Familiarity with medical terminology including diagnoses, medications, etc."
    },
    {
      "credential": "An obsession with helping improve the emotional and physical well-being of others and passion for leveraging technology to provide better care."
    }
  ]
}