{
  "meta": [
    {
      "job_title": "Product Location Merchandiser",
      "job_category": "Merchandising",
      "job_class": "Analyst",
      "sector": "Retail",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Retail Buying/Merchandising",
      "experience": 3
    },
    {
      "skill": "Product Planning",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Excel",
      "experience": 3
    },
    {
      "skill": "Vendor Communication",
      "experience": 3
    },
    {
      "skill": "Ad Strategy",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and coordinate assortment placement in stores based on buying/merchandising experience."
    },
    {
      "duty": "Collaborate with the Buyer on product selection and store strategy."
    },
    {
      "duty": "Facilitate the planning and timing of order delivery and quantities of product by store grade."
    },
    {
      "duty": "Create and execute Buy Plan, ad strategy, and distributions for product strategy."
    },
    {
      "duty": "Coordinate returns and recalls of product, and manage size integrity at the chain level."
    },
    {
      "duty": "Communicate with cross-functional teams and vendors for effective coordination."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in relevant field and 2+ years’ experience in Corporate Merchandising/Planning or Buying, or equivalent experience in retail planning, required."
    },
    {
      "credential": "Comprehensive knowledge of retail systems, terms, and calculations."
    },
    {
      "credential": "Strong computer skills including Microsoft Office with advanced Excel experience required."
    },
    {
      "credential": "Strong understanding and familiarity with query and reporting tools, and a basic understanding of other financial and assortment planning tools."
    },
    {
      "credential": "Excellent verbal and written communication skills with the ability to articulate ideas."
    },
    {
      "credential": "Ability to work independently and as part of a team with excellent time management and organization skills."
    },
    {
      "credential": "Good analytical and problem-solving skills with the ability to evaluate problems and apply knowledge to identify appropriate solutions."
    },
    {
      "credential": "Highly flexible and adapts well to a rapidly changing environment."
    }
  ]
}