{
  "meta": [
    {
      "job_title": "Sr. Talent Acquisition Associate",
      "job_category": "Human Resources",
      "job_class": "Associate",
      "sector": "Manufacturing",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Recruitment",
      "experience": 8
    },
    {
      "skill": "Talent Acquisition",
      "experience": 8
    },
    {
      "skill": "HR Legislation",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Bilingual Communication (English and French)",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute hybrid manufacturing salaried and hourly recruiting strategy in the assigned region, focusing on recruitment process optimization and customer-centricity."
    },
    {
      "duty": "Strengthen the People strategy in North America through support of salaried and hourly talent acquisition strategies in multiple manufacturing locations within the assigned region."
    },
    {
      "duty": "Reduce time-to-fill, candidate turnover, and enhance current local market bench strength within the assigned region."
    },
    {
      "duty": "Work closely with Regional Recruiting Manager to identify and attract qualified and diverse candidates, screen and schedule candidates for interviews, oversee pre-employment processing, and track and document metrics for continuous improvement."
    },
    {
      "duty": "Combine strategic HR, Talent Acquisition, and related disciplines to serve effectively as a critical resource in the hourly recruitment space."
    },
    {
      "duty": "Build relationships with key stakeholders in the assigned region, and communicate openly with all candidates, hiring managers, and human resources teams."
    },
    {
      "duty": "Set up tracking tools to document data related to posting, sourcing, screening, scheduling, and pre-employment activities by location and position."
    },
    {
      "duty": "Identify sources for posting and sourcing candidates, ensure follow-up for most productive postings, and maximize the use of search channels, networks, diversity channels, social media, and university relationships."
    },
    {
      "duty": "Manage recruitment event planning and attendance, screen new applications timely, and conduct virtual/telephone interviews with qualified candidates for hiring consideration."
    },
    {
      "duty": "Ensure best-in-class candidate experience through effective communication, timely contact, and follow-up with all potential candidates."
    },
    {
      "duty": "Problem-solve and react quickly to concerns/issues presented in all stages of the recruitment life cycle, prepare, evaluate, and share data of productivity and effectiveness through regular distribution of defined, pre-identified performance indicators."
    },
    {
      "duty": "Identify areas for improvement and best practices across the region, participate and collaborate on assigned projects, and promote the client's attitudes and follow the guiding principles of conduct and action."
    },
    {
      "duty": "Perform other related duties and responsibilities as directed by the Regional Recruiting Manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in a related discipline (Master's preferred)"
    },
    {
      "credential": "Bi-lingual (English and French, for north region)"
    }
  ]
}