{
  "meta": [
    {
      "job_title": "Senior Manager, Sales Compensation",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages the design, development, implementation, and administration of the Sales Compensation plans."
    },
    {
      "duty": "Supervises the Sales Compensation Analysts and delegates responsibility amongst members of the team."
    },
    {
      "duty": "Support employees, managers, and HR Business Partners related to the programs and practices, and develops and delivers tools, training, and communications."
    },
    {
      "duty": "Leads the monthly and quarterly payout cycles associated with the plans and ensure employees are compensated in accordance with their plans."
    },
    {
      "duty": "Ensures the business needs of the sales organization are met through appropriate compensation data analytics, reporting, and tools."
    },
    {
      "duty": "Continuously analyzes the effectiveness of plan designs and tests the feasibility and cost of plan changes."
    },
    {
      "duty": "Consistently identifies ways to improve the process around performance and compensation analytics to drive sales performance, business strategy, and key objectives."
    },
    {
      "duty": "Ensures that effective protocols and measures are in place to confirm accurate compensation payments and organizational compliance."
    },
    {
      "duty": "Gather data and utilize data analysis techniques to prepare sales compensation analysis reports as needed."
    },
    {
      "duty": "Partner with other teams such as the HR Business Partners, HRIS, Payroll, Benefits, Talent Acquisition, Finance, Legal, etc., as required."
    },
    {
      "duty": "Performs other job-related duties as assigned or apparent."
    }
  ],
  "skills": [
    {
      "skill": "Sales Compensation Plan Design",
      "experience": 5
    },
    {
      "skill": "HR Systems (Workday, Xactly)",
      "experience": 3
    },
    {
      "skill": "Compensation Benchmarking Surveys",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    }
  ]
}