{
  "meta": [
    {
      "job_title": "Business Development Director",
      "job_category": "Business Development",
      "job_class": "Director",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Fundraising Strategy",
      "experience": 5
    },
    {
      "skill": "Grant Writing",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Budget Analysis",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and oversee fundraising strategies to maximize organizational sustainability and allow for mission-aligned growth."
    },
    {
      "duty": "Manage fundraising efforts from foundations and other institutional sources, stewarding current funders while growing revenue from new sources."
    },
    {
      "duty": "Work with the Business Development and Grants personnel on managing and improving development systems, tracking deadlines, reviewing and approving content, and coordinating timely and high-quality grants submissions."
    },
    {
      "duty": "Responsible for the implementation and strengthening of major gift programs, to contribute significantly to the growth of independent revenue for NCAIED."
    },
    {
      "duty": "Create engagement strategies including individualized donor cultivation, special events, and other relationship-building and activities. Ensure excellent cultivation and relationship maintenance with all donors and prospects."
    },
    {
      "duty": "Establish strong internal systems for coordinating and tracking development work. Ensure members of the Business Development and Grants teams have clear work plans and goals and monitor tracking and transparent reporting of progress towards goals."
    },
    {
      "duty": "Responsible for the maintenance of NCAIED’s donor database system. Oversee timely grant notifications, coordination of financial reporting, and allocations of grants. Lead monthly fundraising meetings with key staff."
    },
    {
      "duty": "Work closely with the Public Relations Coordinator and lead the creation and production of donor publications and communications such as annual reports, newsletters, donor stories, online donor outreach including video production, and website content."
    },
    {
      "duty": "Help lead the development of an NCAIED funder database. Create data collection, reporting, and editing guidelines for the NCAIED team, to ensure clear procedures."
    },
    {
      "duty": "Provide regular supervision and support to staff. Clarify roles among team members. Provide vision and leadership to the team. Provide coaching and support to the staff in building their fundraising skills and success."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in related field required. At least three years of directly related experience required."
    }
  ]
}