{
  "meta": [
    {
      "job_title": "Branch Business Manager",
      "job_category": "Business Manager",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Operation Management",
      "experience": 5
    },
    {
      "skill": "SAP",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct the day to day leadership over the activities of counter operations, warehousing, production, and route deliveries of a branch location."
    },
    {
      "duty": "Ensure efficiency and productivity of the branch location by devising and initiating work schedules of personnel."
    },
    {
      "duty": "Evaluate and monitor day to day activities to ensure cost-effective operation and make recommendations for necessary changes."
    },
    {
      "duty": "Ensure a safe and efficient working condition of the branch and all employees."
    },
    {
      "duty": "Ensure compliance by all assigned personnel to laws that govern the operation of the branch location operations."
    },
    {
      "duty": "Coordinate with other units of the region to solve operational or customer problems."
    },
    {
      "duty": "Ensure customers are given the highest level of service possible."
    },
    {
      "duty": "Ensure that the branch location is in good repair, clean, and neat."
    },
    {
      "duty": "Ensure that the proper Airgas Standard Operating Procedures (SOP's) are followed."
    },
    {
      "duty": "Coordinate efforts with Account Managers to more efficiently service existing and prospective customers."
    },
    {
      "duty": "Provide Account Managers with quotes and researched information for customer follow-up."
    },
    {
      "duty": "Process customer orders for Account Managers."
    },
    {
      "duty": "Directly supervise all assigned branch employees."
    },
    {
      "duty": "Carry out supervisory responsibilities in accordance with the organization's policies and applicable laws."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 20,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree (A.A.or A.S.) or equivalent from a two-year college or technical school; or three to five years related experience and/or training; or equivalent combination of education and experience"
    }
  ]
}