{
  "meta": [
    {
      "job_title": "Insurance Defense Attorney",
      "job_category": "Legal",
      "job_class": "Attorney",
      "sector": "Legal",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Litigation",
      "experience": 5
    },
    {
      "skill": "Legal Research",
      "experience": 5
    },
    {
      "skill": "Case Management",
      "experience": 5
    },
    {
      "skill": "Advocacy",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Insurance Law",
      "experience": 5
    },
    {
      "skill": "Court Proceedings",
      "experience": 5
    },
    {
      "skill": "Client Representation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide exceptional legal representation in insurance defense cases from inception to resolution."
    },
    {
      "duty": "Conduct comprehensive legal research and analysis to develop effective case strategies."
    },
    {
      "duty": "Prepare and draft legal documents, including pleadings, motions, and discovery requests."
    },
    {
      "duty": "Represent clients in court hearings, depositions, and arbitrations."
    },
    {
      "duty": "Interview witnesses and prepare clients for depositions and trial testimony."
    },
    {
      "duty": "Collaborate with internal teams to evaluate and assess claims, negotiate settlements, and participate in alternative dispute resolution methods."
    },
    {
      "duty": "Monitor and manage deadlines, ensuring timely and efficient case progression."
    },
    {
      "duty": "Stay up-to-date on relevant laws, regulations, and legal precedents in insurance defense litigation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Juris Doctor (J.D.) degree from an accredited law school"
    },
    {
      "credential": "Active license to practice law in California and in good standing"
    },
    {
      "credential": "Minimum 2 years of experience as an Insurance Defense Litigation Attorney with a strong focus on Construction Defect, Casualty, and others."
    },
    {
      "credential": "Extensive knowledge of insurance law, regulations, and court procedures"
    }
  ]
}