{
  "meta": [
    {
      "job_title": "Billing Specialist",
      "job_category": "Accounting",
      "job_class": "Specialist",
      "sector": "Accounting",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Following standard operating procedures, this role prepares monthly billing adjustments, obtains required approvals and enters adjustments into the billing system."
    },
    {
      "duty": "Researches and resolves routine billing questions and discrepancies. Refers unusual problems to higher level personnel."
    },
    {
      "duty": "Reviews invoices for completeness and accuracy. Follows up with customers or other division staff/management to resolve identified discrepancies."
    },
    {
      "duty": "May calculate and prepare basic manual billings for non-complex billing arrangements."
    },
    {
      "duty": "May gather and summarize supplemental billing information to accommodate customer billing requirements."
    },
    {
      "duty": "May review various billing system reports to identify billing discrepancies. Makes corrections as appropriate to ensure accurate billing following standard operating procedures."
    },
    {
      "duty": "Posts cash receipts to customer accounts based on information from lock box reports and local cash receipt listings. Performs basic and routine research to resolve differences or unidentified payments."
    },
    {
      "duty": "Posts payments as appropriate into the billing system to clear open obligations, or prepares remittance advices to accompany payments sent to the lock box or corporate office."
    },
    {
      "duty": "May accept credit card payment from customers over the phone and process recurring payments."
    },
    {
      "duty": "May complete customer set up in company billing system(s)."
    },
    {
      "duty": "May have limited contact with customers to assist with researching billing questions and providing copies of the support documentation."
    },
    {
      "duty": "Performs other job-related duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "MS Excel",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Attention to Detail",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or G.E.D. certification."
    }
  ]
}