{
  "meta": [
    {
      "job_title": "Director of Business Development",
      "job_category": "Sales",
      "job_class": "Director",
      "sector": "Hospitality and Food Service Sales",
      "salary": 145000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Exceed assigned pipeline and profit objectives, lead new business initiatives and processes, and work closely with Sales Leadership in developing overall sales strategies within a targeted territory."
    },
    {
      "duty": "Partner closely with Business Unit Executive leaders as well as Regional Executive leaders and directors in creating new university and college clients and implementing the sales processes."
    },
    {
      "duty": "Drive sales process leadership from contact through strategy, proposal, presentation & successful conclusion for dining services within a defined market of large universities and colleges."
    },
    {
      "duty": "Aggressively research, identify, qualify & target potential clients & develop access strategy to initiate contact."
    },
    {
      "duty": "Exercise creativity and independent judgment in developing and evaluating sales and marketing strategies in selling broad portfolio of facilities within defined market."
    },
    {
      "duty": "Develop and lead strategy process with regard to: Competitive Environment, Account Sales Strategy and Territory Development Strategy."
    },
    {
      "duty": "Identify needs and develop customer specific solutions for those needs. Build relationships personally with prospective customers."
    },
    {
      "duty": "Influence and develop team members without formal authority. Develop relationships with intermediaries to build pipeline of opportunities and awareness of capabilities."
    },
    {
      "duty": "Provide appropriate market & competitive information."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS is required for this position. MBA preferred."
    }
  ]
}