{
  "meta": [
    {
      "job_title": "Director of People + Culture",
      "job_category": "Human Resources",
      "job_class": "Management",
      "sector": "Management",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HR Generalist",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Labor Law Compliance",
      "experience": 5
    },
    {
      "skill": "Talent Acquisition",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Financial Acumen",
      "experience": 5
    },
    {
      "skill": "People Metrics",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Multi-Lingual Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as guardian of the culture pillars of People, Place and Character to promote an engaging, positive, and safe work environment for all employees."
    },
    {
      "duty": "Know the pulse of the local talent pool, attract like-minded individuals, and ensure competitive compensation offerings."
    },
    {
      "duty": "Ensure compliance with labor laws, acts, and fair practices, as well as expertise in employee benefits plans and enrollment."
    },
    {
      "duty": "Fluent in people metrics and performance management practices, which include guiding career development progression."
    },
    {
      "duty": "Strategic partner to the General Manager and the Executive Committee for planning the hotel’s goals and ensuring appropriate staffing levels."
    },
    {
      "duty": "Practicing sound financial decisions to provide necessary resources for the recognition, rewards, and development of the people."
    },
    {
      "duty": "Demonstrate a passion for 'being in the know' and exhibiting servant leadership by supporting departments during 'crunch' time."
    },
    {
      "duty": "Display a collaborative spirit with peers and managers, facilitate focus groups, and utilize various communication channels to ensure inclusivity."
    },
    {
      "duty": "Maintain confidentiality in sensitive matters, investigate issues, and be a confidant to all associates."
    },
    {
      "duty": "Utilize various communication channels to ensure inclusivity and relay information in other represented languages when applicable and feasible."
    },
    {
      "duty": "Minimum of 5 years as an HR Generalist within upscale and people-focused environments within Hospitality."
    },
    {
      "duty": "Engage others in general conversation tactics to build rapport quickly and adapt communication and presentation tactics for a wide range of audiences."
    },
    {
      "duty": "Approach fact-finding and discovery missions in a collaborative effort and value the importance of making decisions with integrity."
    },
    {
      "duty": "Be highly analytical in thought and recommendations, continually seeking out the facts, and able to express a point of view without ego."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a related field of Human Resources Management, Business, or Psychology respected, though not required."
    }
  ]
}