{
  "meta": [
    {
      "job_title": "Senior Director of Procurement",
      "job_category": "Procurement",
      "job_class": "Director",
      "sector": "Management",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Sourcing",
      "experience": 10
    },
    {
      "skill": "Vendor Relationship Management",
      "experience": 10
    },
    {
      "skill": "Contract Negotiation",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Procurement Policy Development",
      "experience": 10
    },
    {
      "skill": "Financial Impact Analysis",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Operations Management",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Strategic oversight and management of procurement process, including strategic sourcing, procurement, vendor relationship management, and contract negotiation, payments, e-procurement, and shipping and receiving."
    },
    {
      "duty": "Establish and implement short- and long-range organizational goals, strategic plans, policies, and operating procedures."
    },
    {
      "duty": "Develop organizational capabilities; build and manage an effective, professional, and diverse procurement team."
    },
    {
      "duty": "Develop and execute strategic sourcing initiatives, establish targets of cost savings, and determine financial impacts."
    },
    {
      "duty": "Review major procurement contracts; coordinate contract compliance, change orders, and problem resolution."
    },
    {
      "duty": "Oversee the vendor selection process, assessment of vendor capabilities, and evaluation of vendor performance."
    },
    {
      "duty": "Direct and oversee the management of the operations of Accounts Payable and Shipping and Receiving functions."
    },
    {
      "duty": "Maintain compliance with internal college policies and appropriate regulatory procurement regulations."
    },
    {
      "duty": "Develop and maintain internal procurement policies and rules that balance best business practices, compliance, customer needs, and flexibility."
    },
    {
      "duty": "Plan, develop, and implement strategies for generating resources and/or revenues for the organization."
    },
    {
      "duty": "Perform periodic cost and productivity analyses; acts as negotiator between the College and vendors/suppliers on procurement contracts."
    },
    {
      "duty": "Performs other job-related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration required; MBA preferred; Advanced certification (CPPO or CPM) is highly desired."
    }
  ]
}