{
  "meta": [
    {
      "job_title": "Construction Scheduler",
      "job_category": "Construction",
      "job_class": "Scheduler",
      "sector": "Construction",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Set up, chair and minute all client meetings, ensuring that DCD, DCE and DCOPs are fully informed."
    },
    {
      "duty": "Reporting on a weekly basis to the DCD PM of scope, budget and program status, and any other issues arising."
    },
    {
      "duty": "Liaise with the Client, Professional Team and Contractor to establish all key project processes and monitor these processes reporting and making recommendations to the Client."
    },
    {
      "duty": "Engage FAT / SAT attendance and Vendor attendance to site as appropriate."
    },
    {
      "duty": "Liaise with the Client, Professional Team and Contractors to establish, review and regularly update the Project Risk Register. Agree and monitor Risk Mitigation Plans and provide input into quantitative risk analysis reviews."
    },
    {
      "duty": "Initiate any actions/escalations such as acceleration programs for tasks falling behind and impacting critical path."
    },
    {
      "duty": "Monitor and report on Commissioning process, checking that the Commissioning Agent has developed a Commissioning Plan and all necessary test sheets and documentation."
    },
    {
      "duty": "Liaise with the DC Operations team to coordinate their involvement in all installation, commissioning and snagging activities."
    },
    {
      "duty": "Coordinate all parties to complete Practical Completion documentation and that all manuals are submitted and approved to an agreed schedule."
    },
    {
      "duty": "Establish and manage the defect identification and resolution process, and monitor all handover activity to the clients Turn-Over process."
    },
    {
      "duty": "Liaise with Integration Lead to develop and manage the Integration plan."
    }
  ],
  "skills": [
    {
      "skill": "Construction Scheduling",
      "experience": 4
    },
    {
      "skill": "Meeting Management",
      "experience": 4
    },
    {
      "skill": "Vendor Management",
      "experience": 3
    },
    {
      "skill": "Coordination",
      "experience": 3
    },
    {
      "skill": "Risk Management",
      "experience": 3
    },
    {
      "skill": "Commissioning Process",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Construction Management, Engineering, or a related field (Master's preferred)"
    }
  ]
}