{
  "meta": [
    {
      "job_title": "HR Business Partner",
      "job_category": "HR",
      "job_class": "Business Partner",
      "sector": "Human Resources",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support administration of company-wide HR initiatives to ensure compliance and an effective, sustainable people strategy over the long term."
    },
    {
      "duty": "Partner with employees and managers to provide customized solutions in accordance with internal standards and HR best practices that enhance communication, productivity, and organizational culture."
    },
    {
      "duty": "Provide counsel to managers on employment matters, coaching, and corrective actions for employee performance and conduct issues; recommend proactive solutions for improvement, providing support as needed."
    },
    {
      "duty": "Facilitate key activities in the employee lifecycle relating to onboarding, engagement, retention, performance, training & development, separation, and preparing reports as requested."
    },
    {
      "duty": "Act as a trusted advisor to employees and managers in sensitive HR areas, such as employee relations, investigations, and leaves of absence."
    },
    {
      "duty": "Conduct objective investigations into general employment matters to ensure a reasonable and compliant response to EEOC and DOL investigations (to include federal and state agency responses) in accordance with state and federal employment laws."
    },
    {
      "duty": "Assist with talent acquisition activities and partner in the execution of the attraction, selection, and onboarding strategy; serve as a consultative partner to hiring managers."
    },
    {
      "duty": "Partner in developing, updating, and communicating policies and processes for all HR-related programs; counsel employees in policy and procedure interpretation and compliance; evaluate processes for effectiveness and recommend improvements."
    },
    {
      "duty": "Participate in benefit enrollment and administration; provide benefit education to employees including during open enrollment; respond to inquiries and assist with claims; maintain benefit records and reports; liaise with benefit brokers and vendors."
    },
    {
      "duty": "Assist employees with time and leave questions; Process and administer leave of absence requests and related paperwork: medical, personal, disability, and FMLA."
    },
    {
      "duty": "Assist with the administration of the workers' compensation program, claims monitoring, report generation, and communication with employees, managers, and insurance carriers."
    },
    {
      "duty": "Remain up to date with federal, state, and local employment laws, and benefits laws and regulations; ensure the maintenance of compliant employee records and files; monitor programs and processes for compliance; identify areas of risk and recommend improvements."
    },
    {
      "duty": "Support and execute activities related to organizational changes, including mergers and acquisitions."
    },
    {
      "duty": "Assist with administration and maintenance of employee-related databases and HR systems; participate in the implementation of new systems as they are identified."
    },
    {
      "duty": "Manage relationships with vendors and external customers."
    },
    {
      "duty": "Participate in research and special projects."
    },
    {
      "duty": "Other projects or duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "skills": [
    {
      "skill": "HR Administration",
      "experience": 3
    },
    {
      "skill": "Employee Relations",
      "experience": 3
    },
    {
      "skill": "Talent Acquisition",
      "experience": 3
    },
    {
      "skill": "Compliance Management",
      "experience": 3
    },
    {
      "skill": "Policy Development",
      "experience": 3
    },
    {
      "skill": "Benefit Administration",
      "experience": 3
    },
    {
      "skill": "Database Management",
      "experience": 3
    },
    {
      "skill": "Vendor Management",
      "experience": 3
    },
    {
      "skill": "Research",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business, human resources, or related field of study (Master's preferred)"
    }
  ]
}