{
  "meta": [
    {
      "job_title": "Branch Manager",
      "job_category": "Banking",
      "job_class": "Manager",
      "sector": "Banking",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the administration of the Branch in accordance with the guidelines and objectives set by the Bank."
    },
    {
      "duty": "Directly supervises the Assistant Branch Manager(s), and ensures effective supervision of all Branch personnel."
    },
    {
      "duty": "Oversees Branch operations to maintain a consistent high level of customer service."
    },
    {
      "duty": "Monitors compliance by the Branch with all Bank policies and procedures."
    },
    {
      "duty": "Represents the Bank in the community through various civic, charitable and CRA activities."
    },
    {
      "duty": "Responsible for administrative functions associated with Branch operations and employee-performance management."
    },
    {
      "duty": "Establishes Branch business plan and sales objectives, sets individual sales and referral goals, and coordinates and directs Branch sales initiatives for all products and services including the sale of alternative investment products."
    },
    {
      "duty": "Responsible to implement sales and service initiatives designed to generate new relationships, deepen existing customer relationships and achieve assigned production goals."
    },
    {
      "duty": "Conducts individual, joint and team business calls on targeted prospects and existing business customers and follows-up on leads generated."
    },
    {
      "duty": "Provides support to the Assistant Branch Manager(s) to train Branch personnel, conduct disciplinary sessions, evaluate job performance, resolve employee grievances/conflicts, and make promotional decisions."
    },
    {
      "duty": "Responsible to review the Branch weekly work schedule and maintain compliance with timekeeping procedures."
    },
    {
      "duty": "Oversees all Branch operations and ensures the branch is operating in compliance with federal and state banking requirements and organizational policy and procedures."
    },
    {
      "duty": "Creates, implements, and presents staff development activities to enhance skills."
    },
    {
      "duty": "Authorizes requisitions for new staff, and works with the Assistant Branch Manager(s) to source, interview and hire individuals for open positions in accordance with Bank guidelines."
    },
    {
      "duty": "SOURCES AND ATTENDS LOCAL JOB FAIRS IN ACCORDANCE WITH BANK GUIDELINES."
    },
    {
      "duty": "Arranges customer seminars and promotions within local market."
    },
    {
      "duty": "Assists customers with their banking needs and reinforces / role models the sales process when opening accounts and cross-selling bank products and services."
    },
    {
      "duty": "Communicates with customers and resolves more complex problems, issues and complaints and properly reports incidents to Regional Management and Branch Administration."
    },
    {
      "duty": "Represents the Bank in various civic, community, corporate and CRA functions to further enhance its image and develop additional business."
    },
    {
      "duty": "Performs special projects, and additional duties and responsibilities, as needed."
    }
  ],
  "skills": [
    {
      "skill": "Comprehensive knowledge of bank policies and procedures",
      "experience": 7
    },
    {
      "skill": "Comprehensive knowledge of regulatory and compliance requirements",
      "experience": 7
    },
    {
      "skill": "Comprehensive knowledge of general banking and Consumer Lending products",
      "experience": 7
    },
    {
      "skill": "Strong leadership",
      "experience": 7
    },
    {
      "skill": "Sales and customer service",
      "experience": 7
    },
    {
      "skill": "Computer literate with proficiency in Microsoft Word and Microsoft Excel",
      "experience": 7
    },
    {
      "skill": "Excellent verbal, written and interpersonal communication",
      "experience": 7
    },
    {
      "skill": "Ability to coach and motivate staff",
      "experience": 7
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent. Four-year Bachelor's degree preferred. Five to seven years related work experience Experience as an Assistant Branch Manager SOS Unit preferred"
    }
  ]
}