{
  "meta": [
    {
      "job_title": "Supply Chain Technician, Jr",
      "job_category": "Logistics",
      "job_class": "Technician",
      "sector": "Supply Chain",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Supply Chain Operations",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Warehouse Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform daily inventory of primary and secondary inventory points using bar coding equipment on a predetermined schedule provided by the Government that will allow for timely replenishment orders."
    },
    {
      "duty": "Resolve differences between records and physical count of stock and communicate discrepancies to VA personnel."
    },
    {
      "duty": "Ensure products and shelving are marked with corresponding identification numbers."
    },
    {
      "duty": "Consolidate materials and provide maximum space utilization and protection of materials."
    },
    {
      "duty": "Clean assigned secondary areas (shelves and bins) in accordance with aseptic principles as published in infection control guidelines, local Standard Operating Procedures (SOPs), and Joint Commission standards as scheduled."
    },
    {
      "duty": "Support wall-to-wall and periodic inventories."
    },
    {
      "duty": "Provide customer service and professionalism with all clinical staff that uses medical supplies, along with other Logistics personnel; all contacts require tact and diplomacy. The Contractor shall work with clinical and administrative customers as well as outside stakeholders such as vendors to obtain information regarding clinical supplies."
    },
    {
      "duty": "Maintain stock at primary and secondary inventory locations for all clinical and administrative services. This involves pulling stock inventory and material from main inventory for delivery; replenishing stock inventory; interacting with clinical and administrative customers to ensure issues and needs are identified and either resolved or escalated to the responsible Inventory Management Specialists as needed; maintaining records on stock levels; recommending revisions in stock levels as needed to supply changes to Inventory Management Specialists; communicating to the responsible lead any concerns related to supplies, equipment and procedures, providing information as needed orally or in writing regarding customer or external stakeholder issues, general telephone inquiries and visitor referrals: communicating with customers and vendors to obtain information regarding medical supplies."
    },
    {
      "duty": "Monitor expiration dates, rotate stock to limit outdates and remove items from use as required by outdates. The Contractor shall support the responsible Inventory Management Specialists in checking inventory for stock identified for recalled items and hazard alerts; ensures critical supplies are appropriately monitored and controlled, resolving deviations when possible, and escalating significant deviations to the Inventory Management Specialists."
    },
    {
      "duty": "Perform daily inventory of primary and secondary inventory points using bar coding equipment on a predetermined schedule that will allow for timely replenishment orders. The Contractor shall Resolve differences between records and physical count of stock."
    },
    {
      "duty": "Distribute items according to established requirements in computerized inventory management systems such as GIP. The Contractor shall utilize a Government provided pager or similar device to Expedite the pick/delivery of items needed in user areas throughout the VA HCS and supported catchment area. The Contractor shall fill requests for items based on daily schedules of need or on an emergent basis as appropriate."
    },
    {
      "duty": "Clean assigned secondary areas (shelves and bins) in accordance with aseptic principles as published in infection control guidelines, local Standard Operating Procedures (SOPs), and Joint Commission standards as scheduled."
    },
    {
      "duty": "Deliver supplies in a timely and accurate manner, ensuring supplies and material delivered are in sterile and operational condition. Deliveries will be to wards, clinics and other secondary locations that may be in remote sites. Delivery by motor vehicle may be required by the contractor. The government will furnish a vehicle if required to deliver supplies to hospital from warehouse. The contractor shall complete specialty cart preparation and stocking."
    },
    {
      "duty": "Support wall-to-wall and periodic inventories and conduct Inventory Control – Receiving activities to include receipt of supplies and material into the VA Health Care System and supported catchment area."
    },
    {
      "duty": "Unpack/uncrate supplies from shipping cartons; properly store supplies and material in main/primary inventory areas. Store items in accordance with VA established guidelines, utilizing a computerized inventory system, to ensure sterility and integrity of the supplies and material and the data integrity of the inventory management system."
    },
    {
      "duty": "Receive, store and ships bin and bulk supplies, materials and equipment."
    },
    {
      "duty": "Conduct inventory of stock on hand and communicate discrepancies to leadership and shall ensure products and shelving are marked with corresponding identification numbers."
    },
    {
      "duty": "Consolidate materials and provide maximum space utilization and protection of materials."
    },
    {
      "duty": "Sign in and out for all schedule shifts at each facility location."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High school qualification or equivalent"
    },
    {
      "credential": "Prior experience as a warehouse manager, supply technician or a similar role."
    }
  ]
}