{
  "meta": [
    {
      "job_title": "Brand Coordinator",
      "job_category": "Marketing",
      "job_class": "Coordinator",
      "sector": "Sales",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Visual Merchandising",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Merchandising Presentation",
      "experience": 3
    },
    {
      "skill": "Team Coordination",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 4
    },
    {
      "skill": "Team Management",
      "experience": 3
    },
    {
      "skill": "Retail Operations",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create a first-class customer experience through flawless customer service and visual merchandising presentations in The North Face Shops within our stores."
    },
    {
      "duty": "Coordinate and execute weekly merchandising priorities, provide weekly communication to teammates, and partners regarding ongoing projects."
    },
    {
      "duty": "Ensure visual merchandising collateral is received at the store and maintain visual merchandising areas within the store at exceptional levels."
    },
    {
      "duty": "Lead seasonal floor set changes with direction from Customer Service Center partners, Store Leadership, and The North Face team."
    },
    {
      "duty": "Identify key styles and make appropriate recommendations to drive sales and increase inventory turn."
    },
    {
      "duty": "Coordinate seasonal technical rep training requests for Store Management and Teammates."
    },
    {
      "duty": "Complete all assigned customer service and product training, attend store meetings, and external clinics."
    },
    {
      "duty": "Adhere to established policies and procedures related to safety, loss prevention, and standard operating procedures. Maintain confidentiality of all Company information."
    },
    {
      "duty": "Support the team across the store and perform other tasks as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": []
}