{
  "meta": [
    {
      "job_title": "Distribution Center Manager",
      "job_category": "Logistics",
      "job_class": "Manager",
      "sector": "Logistics",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "WMS, TMS, and ERP Systems",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Operations Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead safety programs, ensure safety training, and enforce safety procedures to create a safe work environment."
    },
    {
      "duty": "Develop and implement technical, professional, and leadership development plans for team leads and assistant managers."
    },
    {
      "duty": "Utilize coaching, teaching, and training to develop successful team members and drive employee initiatives."
    },
    {
      "duty": "Create and implement staffing strategies, develop and maintain contingency plans, and assess performance of associates."
    },
    {
      "duty": "Direct daily operations, monitor productivity and quality, and ensure safety, inventory accuracy, and on-time deliveries."
    },
    {
      "duty": "Plan, organize, and monitor the receiving, storage, assembly, and distribution of all items received from vendors."
    },
    {
      "duty": "Ensure inventory accuracy, perform relocation and consolidation of product, and monitor the performance of the distribution center."
    },
    {
      "duty": "Ensure proper control, maintenance, protection, and utilization of the company’s physical assets."
    },
    {
      "duty": "Manage and administer distribution center budget, and ensure all records and reports are prepared and effectively maintained."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree in Business, Logistics, or related field (Bachelor’s degree preferred)"
    }
  ]
}