{
  "meta": [
    {
      "job_title": "InService Coordinator",
      "job_category": "Community Enrichment",
      "job_class": "Coordinator",
      "sector": "Youth Support Services",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mentoring",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 4
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Tech Savvy",
      "experience": 4
    },
    {
      "skill": "Bilingual (Spanish)",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Mentor and engage teens in community enrichment activities and service to oneself initiatives."
    },
    {
      "duty": "Conduct 'intakes' to walk students through TASC’s online system and familiarize them with other service members, staff, and the facilities."
    },
    {
      "duty": "Work directly with students on service projects as scheduled, including building mentoring relationships with students."
    },
    {
      "duty": "Update database and activity calendar with programming on time."
    },
    {
      "duty": "Maintain and update paperwork on each student as needed, including surveys and assessments and documentation about projects, updating the system in a timely and accurate manner."
    },
    {
      "duty": "Outreach to engage teens in TASC programming, letting them know what we offer and gathering information about what teens are interested in."
    },
    {
      "duty": "Present a Service Learning component to all students on projects, including job and life-skill topics and reflective observations."
    },
    {
      "duty": "Coordinate with Thrive and A&C staff to help facilitate weekly InService projects."
    },
    {
      "duty": "Work collaboratively with the Youth Support Services team to help connect with local organizations for weekly InService projects."
    },
    {
      "duty": "Be punctual to each project to ensure proper drop-off communication with parents and/or stay until each student has been picked up from a project or ensure another staff member is with the student."
    },
    {
      "duty": "Maintain active relationships with area agencies that will ensure confidence in student performance."
    },
    {
      "duty": "Provide expense documentation for project supplies."
    },
    {
      "duty": "Assist in maintaining InService presence on social media."
    },
    {
      "duty": "Assist the Director of Youth Support Services and Youth Support Services team with other projects as required."
    },
    {
      "duty": "Travel to and from project sites is necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Passion for and experience working with teens is a must. Pursuit of higher education in social services or related fields is desired but not required."
    }
  ]
}