{
  "meta": [
    {
      "job_title": "Sr. Therapeutics Discovery Technician",
      "job_category": "Laboratory Technician",
      "job_class": "Senior",
      "sector": "Therapeutics Discovery",
      "salary": 785000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Laboratory Techniques",
      "experience": 5
    },
    {
      "skill": "Infectious Agents Handling",
      "experience": 5
    },
    {
      "skill": "BSL-2, BSL-3, BSL-4 Compliance",
      "experience": 5
    },
    {
      "skill": "High-throughput Screening",
      "experience": 5
    },
    {
      "skill": "Microbiological Experiments",
      "experience": 5
    },
    {
      "skill": "Molecular Biology Techniques",
      "experience": 5
    },
    {
      "skill": "Animal Studies Support",
      "experience": 5
    },
    {
      "skill": "Technical Writing",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Laboratory Supplies Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in the planning, development, execution, and evaluation of high-throughput screening projects for antibacterial, antiviral, and antitoxin therapeutic areas."
    },
    {
      "duty": "Aid in the development of novel assays/methods for various programs, including basic cell culture to support these efforts."
    },
    {
      "duty": "Assist in screening molecular compound libraries for therapeutic efficacy to support Medical Countermeasure (MCM) development."
    },
    {
      "duty": "Perform in vitro and in vivo microbiological experiments to evaluate therapeutic compounds for antibacterial, antiviral, and antitoxin activity."
    },
    {
      "duty": "Conduct in vitro assays, including enzymatic assays, cell-based phenotypic and reporter assays, Minimum Inhibitory Concentration (MIC) and plaque assays."
    },
    {
      "duty": "Perform standard molecular biology techniques to support the development of assays."
    },
    {
      "duty": "Support mouse studies by assisting with animal inoculations, collecting specimens for processing, and conducting analysis, including immunological procedures such as Enzyme-Linked Immunoassay (ELISA), Western blot, and Mesoscale Discovery-based assays."
    },
    {
      "duty": "Prepare technical reports, standard operating procedures, and manuscripts related to research efforts."
    },
    {
      "duty": "Present research findings at scientific conferences as needed and may require CONUS travel."
    },
    {
      "duty": "Assess and maintain laboratory supplies in BSL-2, BSL-3, and BSL-4 laboratories."
    },
    {
      "duty": "Provide a Research Technical Report to the Technical Point of Contact (TPOC) by the last day of each month."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s in Biology or related field (Master's preferred)"
    }
  ]
}