{
  "meta": [
    {
      "job_title": "Vice President, Regulatory Affairs",
      "job_category": "Regulatory Affairs",
      "job_class": "Vice President",
      "sector": "Biopharmaceutical",
      "salary": 200000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Regulatory Leadership",
      "experience": 10
    },
    {
      "skill": "Global Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Team Building",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 10
    },
    {
      "skill": "Written Communication",
      "experience": 10
    },
    {
      "skill": "Verbal Communication",
      "experience": 10
    },
    {
      "skill": "Dermatology",
      "experience": 7
    },
    {
      "skill": "Immunology and Inflammation",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement global regulatory plans for the company’s product candidates."
    },
    {
      "duty": "Act as primary liaison and coordinate meetings with FDA, EMA and other health authorities as needed, representing the company with those agencies."
    },
    {
      "duty": "Responsible for regulatory operations, regulatory CMC and regulatory strategy."
    },
    {
      "duty": "Oversee planning and conduct of interactions with, and submissions to, global regulatory authorities (INDs, NDA/MAAs, DSURs, PIND/EOP2 meetings, etc.)"
    },
    {
      "duty": "Review clinical protocols and study reports, manufacturing process documentation, investigator brochures, safety reports, and other relevant documents."
    },
    {
      "duty": "Establish and maintain relationships with senior regulatory consultants and advisors; manages regulatory vendors and budget."
    },
    {
      "duty": "Actively track developments in global regulatory guidance and policy, and maintain strong relationships with industry peers to identify emerging trends, risks and opportunities."
    },
    {
      "duty": "Ensure compliance with applicable regulatory reporting requirements, laws and regulations."
    },
    {
      "duty": "Support business development and financing initiatives as needed (e.g., participate in due diligence efforts, interact with potential investors and partners)."
    },
    {
      "duty": "Serve on Company’s senior leadership team, interact closely with the CEO and other officers, participate in board of director meetings as appropriate."
    },
    {
      "duty": "Travel will be required to the extent necessary for regulatory interactions and other business needs (anticipated 5 – 10%)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Science degree (PhD, PharmD, MD, MSc) with extensive experience in regulatory leadership."
    }
  ]
}