{
  "meta": [
    {
      "job_title": "Sr. Manager, Customer Engagement & Medical Information Systems",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Support Omnichannel Contact Center Platform Business Applications by working in close collaboration with the Business and Digital teams to conduct new feature risk assessments and translate key technical decisions into clear language for business owners."
    },
    {
      "duty": "Collaborate with Digital teams to gather user requirements and draft user stories from Customer Engagement & Medical Information Operations, Commercial Operations, Clinical Safety & Pharmacovigilance, and Global Product Quality."
    },
    {
      "duty": "Conduct user acceptance testing on behalf of the CE&MI business for OC3 Business applications."
    },
    {
      "duty": "Support OC3 and other CE&MI system release roadmap discussions and planning for system enhancements"
    },
    {
      "duty": "Provide CE&MI subject matter expertise for Contact Center self-service tools on local microsites and medical content resources on Atlas, an HCP engagement platform, providing on-demand medical education content, publications, and medical information responses and tools."
    },
    {
      "duty": "Support the Customer Engagement & Medical Information Innovation lead and applicable Digital teams with new Contact Center tool discovery, design, development, and implementation."
    },
    {
      "duty": "Coordinate the submission of Commercial or Medical Information materials utilized within CE&MI tools through the Promotional Review Team (PMRT) or Medical Review Committee (MRC) prior to use on external tools."
    },
    {
      "duty": "Collaborate with vendors to implement omnichannel dashboards to support tracking of key Contact Center metrics and Key Performance Indicators (KPIs)"
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor’s degree\n5+ years of experience with Commercial, Medical Affairs, or Contact Center systems and platforms working in the pharma and/or biotech industry\nPrior industry experience in post-marketing setting\nVaccine/infectious disease therapeutic area experience and knowledge is strongly preferred.\nAdvanced scientific degree preferred\nAn understanding of and adherence to regulatory policies governing scientific interactions with HCPs, customers, and consumers.\nMedical information experience in the pharmaceutical/biotech industry is a plus.\nA collaborative mindset geared towards working in a team environment where results are achieved through influence and the incorporation of multiple points of view.\nStrong problem-solving ability.\nExcellent organizational skills and demonstrated ability to multi-task in a fast-paced environment with changing priorities.\nA desire to make an impact as part of a high-growth, transformational company that is Bold, Relentless, Curious, and Collaborative."
    }
  ]
}