{
  "meta": [
    {
      "job_title": "Head of Recruiting",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Recruiting",
      "experience": 2
    },
    {
      "skill": "Recruitment Strategy",
      "experience": 5
    },
    {
      "skill": "Interviewing",
      "experience": 5
    },
    {
      "skill": "Onboarding",
      "experience": 5
    },
    {
      "skill": "Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Financial Services",
      "experience": 2
    },
    {
      "skill": "Real Estate",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and establish a recruiting strategy to attract and retain top (predominantly sales) talent, working closely with executive team to determine specific recruitment needs."
    },
    {
      "duty": "Conduct comprehensive initial interviews with candidates based on their applications and evaluate their alignment with the role's requirements, including hard and soft skills, experience, and cultural fit."
    },
    {
      "duty": "Identify recruiting sources, create job descriptions and requirements, and determine compensation packages."
    },
    {
      "duty": "Identify and source candidates, utilizing a variety of recruitment channels to find qualified candidates."
    },
    {
      "duty": "Manage the interview process, coordinate with hiring managers to schedule and conduct interviews for potential candidates."
    },
    {
      "duty": "Develop and manage onboarding programs to ensure that new hires receive the necessary training and support to be successful in their new roles."
    },
    {
      "duty": "Manage the recruitment process from start to finish, including developing job postings, managing recruitment budgets, and maintaining applicant tracking systems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business, or a related field (Master's preferred)"
    }
  ]
}