{
  "meta": [
    {
      "job_title": "Associate Director of Policy, Governance, Audit and Compliance",
      "job_category": "Cybersecurity",
      "job_class": "Director",
      "sector": "Cybersecurity",
      "salary": 180000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cybersecurity Risk Management",
      "experience": 6
    },
    {
      "skill": "Compliance Management",
      "experience": 6
    },
    {
      "skill": "Governance Management",
      "experience": 6
    },
    {
      "skill": "Information Security",
      "experience": 6
    },
    {
      "skill": "Policy Management",
      "experience": 6
    },
    {
      "skill": "Enterprise Management",
      "experience": 6
    },
    {
      "skill": "Stakeholder Management",
      "experience": 6
    },
    {
      "skill": "Audit and Assessment",
      "experience": 6
    },
    {
      "skill": "Compliance Monitoring",
      "experience": 6
    },
    {
      "skill": "Regulatory Requirements",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establishing an information management and protection framework for an effective enterprise-wide information governance program and directing day-to-day activities."
    },
    {
      "duty": "Identifying information management and protection laws and regulations and implementing actions to ensure compliance."
    },
    {
      "duty": "Monitoring actions to identify emerging risks and to close gaps."
    },
    {
      "duty": "Developing and overseeing formalized programs related to compliance (ViSF, PCI) by evaluating the current landscape of each and developing plans for improved management which will include automation."
    },
    {
      "duty": "Proactively providing insightful recommendations across the internal environment to improve internal control procedures, increase audit efficiencies, and drive process optimization."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor's degree or four or more years of work experience."
    },
    {
      "credential": "Professional management certification, such as CISA, CRISC, CISM, CISSP, or other related credentials."
    },
    {
      "credential": "Sound knowledge of business management and a working knowledge of information risk management, cybersecurity and IT compliance technologies; knowledge and understanding of relevant legal and regulatory requirements."
    }
  ]
}