{
  "meta": [
    {
      "job_title": "Patient Advocate",
      "job_category": "Healthcare",
      "job_class": "Advocate",
      "sector": "Healthcare",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review and prepare data and demographics on recently discharged patients for initial assessment call with a Nurse Coach."
    },
    {
      "duty": "Collect and document required data for end-to-end seamless care and generate reports for clinical program's goals."
    },
    {
      "duty": "Make non-clinical outreach to patients to ensure successful home recovery and check in on non-clinical issue resolution."
    },
    {
      "duty": "Responsible for speaking with physicians and coordinating in-home care for the patient."
    },
    {
      "duty": "Participate in and contribute to performance and process improvement activities."
    },
    {
      "duty": "Monitor and support clinicians to ensure service levels and requirements are met."
    },
    {
      "duty": "Meet or exceed weekly efficiency and quality metrics. Monitor and support clinicians to ensure service levels and requirements are met."
    },
    {
      "duty": "Provide feedback when implementing process changes and raise opportunities to leadership ensuring compliance to policies, legal requirements and regulatory mandates."
    },
    {
      "duty": "Perform other duties as required or assigned."
    },
    {
      "duty": "Provide outreach to patients with incoming calls and questions, and escalate issues to Nurse Coaches or management when appropriate."
    },
    {
      "duty": "Participate in performance and process improvement activities and must be committed to high-quality standards."
    },
    {
      "duty": "Based on business needs, evening and weekend coverage may be needed."
    }
  ],
  "skills": [
    {
      "skill": "Medical Terminology",
      "experience": 1
    },
    {
      "skill": "Insurance",
      "experience": 2
    },
    {
      "skill": "Quality Improvement",
      "experience": 2
    },
    {
      "skill": "Healthcare Operations",
      "experience": 2
    },
    {
      "skill": "Negotiation",
      "experience": 1
    },
    {
      "skill": "Results-Driven",
      "experience": 1
    },
    {
      "skill": "Basic Computer Skills",
      "experience": 1
    },
    {
      "skill": "Problem Solving",
      "experience": 1
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Organizational Skills",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent. Minimum of two years insurance, quality improvement, or healthcare operations required."
    }
  ]
}