{
  "meta": [
    {
      "job_title": "Production Associate",
      "job_category": "Manufacturing",
      "job_class": "Associate",
      "sector": "Manufacturing",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Works as part of a team to manufacture and package medical device instruments and components while maintaining product quality and optimal product flow."
    },
    {
      "duty": "Follows written procedures and verbal instruction for the assigned production operations that are required in the manufacturing and packaging of medical devices."
    },
    {
      "duty": "Handles plastic and metal components, wires, cables, connectors, and needles."
    },
    {
      "duty": "Inspects work to ensure parts comply with specifications using basic hand tools and measuring/test equipment."
    },
    {
      "duty": "Participate in cross training programs as required by Team Captain / Coordinator."
    },
    {
      "duty": "Adheres to the established Quality System Policies and procedures as instructed in the training process."
    },
    {
      "duty": "Follows Good Manufacturing and Documentation practices (GMP, GDP)."
    },
    {
      "duty": "Follow all safety protocols, housekeeping, utilize appropriate safety equipment and PPE."
    },
    {
      "duty": "Reports safety issues and improvements proactively to Team Captain or direct supervisor."
    }
  ],
  "skills": [
    {
      "skill": "Manufacturing",
      "experience": 3
    },
    {
      "skill": "Product Packaging",
      "experience": 3
    },
    {
      "skill": "Quality Control",
      "experience": 3
    },
    {
      "skill": "Basic Math",
      "experience": 3
    },
    {
      "skill": "Hand Tools",
      "experience": 3
    },
    {
      "skill": "Safety Protocols",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED required."
    },
    {
      "credential": "Manufacturing experience in a Medical Device environment preferred."
    },
    {
      "credential": "Understanding of Good Manufacturing and good Documentation practices a plus."
    }
  ]
}