{
  "meta": [
    {
      "job_title": "Senior Rental Housing Analyst",
      "job_category": "Real Estate",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Real Estate Analysis",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Budget Analysis",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Technical Assistance",
      "experience": 5
    },
    {
      "skill": "Office Software",
      "experience": 5
    },
    {
      "skill": "Asset Management",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Scores, reviews and analyzes AHP rental project applications with complex structures and layered funding."
    },
    {
      "duty": "Analyzes complex real estate budgets and operating statements to determine project feasibility and communicates conclusions to management and the Board."
    },
    {
      "duty": "Analyzes complex Sources and Uses Statements, Cost Breakdowns, Proformas and legal documents."
    },
    {
      "duty": "Analyzes, recommends and negotiates repayment, settlement and modification options for non-compliant projects."
    },
    {
      "duty": "Completes feasibility review and analysis at project application, funding disbursement, project modification and project completion monitoring."
    },
    {
      "duty": "Partners with Information Technology on projects involving system changes and system testing."
    },
    {
      "duty": "Partners with Member Institutions, nonprofit and for profit developers and local, state & federal governments during the funding and monitoring of AHP projects."
    },
    {
      "duty": "Partners with Rental Housing Specialists and other Rental Housing Analysts to ensure projects are in compliance with AHP regulations and the FHLB Des Moines Implementation Plan."
    },
    {
      "duty": "Provides technical assistance to Sponsor Organizations and Member Institutions."
    },
    {
      "duty": "Reviews and provides assistance on AHP Pre-Applications."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Finance, Accounting, Business, Economics, Real Estate, City/Urban Planning, or related field (Progress towards MBA, graduate school of banking degree or equivalent preferred)"
    },
    {
      "credential": "Professional certification in an accredited housing and economic development educational program, such as the National Development Council Economic Development Finance Professional Certification is helpful."
    }
  ]
}