{
  "meta": [
    {
      "job_title": "Clinical Data Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Data Management",
      "experience": 4
    },
    {
      "skill": "Good Clinical Practices",
      "experience": 4
    },
    {
      "skill": "Medical Terminology",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the integrity of data reported into the clinical database system and ensure it meets quality standards and regulatory requirements."
    },
    {
      "duty": "Lead end-to-end delivery of data management services and collaborate in multidisciplinary teams for clinical trials."
    },
    {
      "duty": "Provide training, mentorship, and guidance to other members of the Data Management team."
    },
    {
      "duty": "Create, review, and revise training materials, SOPs, and process/procedural guidelines."
    },
    {
      "duty": "Lead more complex studies and programs with minimal guidance and ensure on-time delivery of all study deliverables."
    },
    {
      "duty": "Maintain metric reporting tools and dashboards, oversee all clinical data management activities, and manage Sponsor contact for data management processes."
    },
    {
      "duty": "Build and maintain positive and collaborative relationships with internal and external project teams and provide high-level customer service."
    },
    {
      "duty": "Maintain data management documents, perform data cleaning, and generate, resolve, and track queries to address discrepant data."
    },
    {
      "duty": "Assess project activities for issues or risks and escalate accordingly to management, ensuring adherence to all required training."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Science, or related field with 3-4 years industry experience required (2-3 years direct CDM Lead experience)"
    }
  ]
}