{
  "meta": [
    {
      "job_title": "Full-Stack Product Designer",
      "job_category": "Design",
      "job_class": "Designer",
      "sector": "Digital Health",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "User Experience Design",
      "experience": 5
    },
    {
      "skill": "Product Design",
      "experience": 5
    },
    {
      "skill": "UI/UX Design",
      "experience": 5
    },
    {
      "skill": "User Research",
      "experience": 5
    },
    {
      "skill": "Agile Methodology",
      "experience": 5
    },
    {
      "skill": "Prototyping",
      "experience": 5
    },
    {
      "skill": "Qualitative Research",
      "experience": 5
    },
    {
      "skill": "Quantitative Research",
      "experience": 5
    },
    {
      "skill": "Wireframing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create distinctive, branded digital experiences that are visually appealing, user-friendly, and consistent across multiple platforms, devices, and channels."
    },
    {
      "duty": "Develop new product concepts, storyboards, detailed interaction designs and screen flows, and prototypes to effectively communicate research findings and design solutions to stakeholders."
    },
    {
      "duty": "Advocate for user-centered design solutions and product development to ensure that the product meets the needs and expectations of users."
    },
    {
      "duty": "Collaborate closely with design, innovation, product, and engineering leaders to identify research opportunities, develop research roadmaps, and communicate insights to drive strategic alignment of organizational initiatives."
    },
    {
      "duty": "Conduct user research to gain insights into user behavior, define user personas, and map out user journeys to inform the design process."
    },
    {
      "duty": "Bring business stakeholders, product owners, and technology engineering teams together to establish and design the experience of digital products."
    },
    {
      "duty": "Conduct concept and usability testing to validate design solutions and to continuously iterate and improve the product."
    },
    {
      "duty": "Collaborate actively with cross-functional teams in an agile environment to ensure that designs are feasible and accurately implemented."
    },
    {
      "duty": "Track user experience metrics and generate reports to measure the success of UX improvements, including analytics to guide future design decisions."
    },
    {
      "duty": "Serve as subject matter expert on qualitative and quantitative research methods grounded in human-centered design."
    },
    {
      "duty": "Coach and mentor UI/UX designers and UX researchers on design principles and best practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or Equivalent years of directly related experience (or high school+13 yrs; Assoc.+9 yrs; M.S.+2 yrs; PhD+1 yr)"
    },
    {
      "credential": "Possesses User Experience Certifications (UX Master Certification, HFI Certified Usability or User Experience Analyst, etc)"
    }
  ]
}