{
  "meta": [
    {
      "job_title": "EVS Operator",
      "job_category": "Media",
      "job_class": "Operator",
      "sector": "Media",
      "salary": 64500,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "EVS Experience",
      "experience": 3
    },
    {
      "skill": "Video Editing",
      "experience": 3
    },
    {
      "skill": "Media Asset Management",
      "experience": 2
    },
    {
      "skill": "Live Production",
      "experience": 3
    },
    {
      "skill": "Esports Knowledge",
      "experience": 2
    },
    {
      "skill": "Time Management",
      "experience": 4
    },
    {
      "skill": "Multitasking",
      "experience": 4
    },
    {
      "skill": "Computer Skills",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ingesting media and building sources through internal router software for immediate replays and live settings."
    },
    {
      "duty": "Creating halftime and fulltime highlight packages, as well as monitor feeds coming into EVS and work closely with Media Asset Management."
    },
    {
      "duty": "Developing and play-out of Melts, building packages/recaps for the next day, and creating post-show documentation."
    },
    {
      "duty": "Updating and maintaining all SOPs and contributing to new SOPs and the sharing of business/skill knowledge."
    },
    {
      "duty": "Ensuring professional and best practice behaviors at all times and observing company risk assessments where applicable."
    },
    {
      "duty": "Taking ownership of improvements and escalating concerns related to health and safety."
    },
    {
      "duty": "Experiencing in EVS and NLE software, knowledge of Esports and internal router software, and involvement in live production."
    },
    {
      "duty": "Managing the EVS XT VIA while communicating with the Director, monitoring a number of audio sources, and demonstrating strong computer skills."
    },
    {
      "duty": "Demonstrating physical qualifications such as the ability to sit, reach, stand, walk, bend, stoop, and lift/push/pull specified weights."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "EVS experience in a professional or academic setting. Editing of packages with a particular eye for pacing. Experience with Premiere Pro, AVID or any other NLE software. Knowledge of Esports. Internal router software i.e., Orbit, VSM or Magnum. Any background or experience with Live production - with strong fundamentals in video content production workflows and related production technologies in a fast-paced environment."
    }
  ]
}