{
  "meta": [
    {
      "job_title": "Investment Officer",
      "job_category": "Finance",
      "job_class": "Officer",
      "sector": "Finance",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Fixed Income Research",
      "experience": 3
    },
    {
      "skill": "Investment Management",
      "experience": 3
    },
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Bloomberg",
      "experience": 3
    },
    {
      "skill": "Credit Evaluation",
      "experience": 3
    },
    {
      "skill": "Economic Analysis",
      "experience": 3
    },
    {
      "skill": "Investment Strategy Formulation",
      "experience": 3
    },
    {
      "skill": "Relationship Building",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "California State Codes Knowledge",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Research, monitor, and analyze investment credits. Prepare and update credit reports and present to the investment committee."
    },
    {
      "duty": "Study economic and financial trends and market conditions for investment opportunities in fixed-income securities consistent with the County’s investment policy."
    },
    {
      "duty": "Perform portfolio analysis and prepare periodic performance reports for the County investment portfolio."
    },
    {
      "duty": "Coordinate with the Treasury accounting group on cash flow analysis and trade settlements."
    },
    {
      "duty": "Monitor and maintain the investment portfolio’s AAA ratings, including monthly holdings updates and annual presentations to rating agencies."
    },
    {
      "duty": "Compile data and prepare a variety of analytical and marketing presentations to pool participants, rating agencies, and other constituents."
    },
    {
      "duty": "Assist with formulation and execution of investment strategies, policies, and asset allocation for the County Investment Pool."
    },
    {
      "duty": "Help prepare investment-related requests for proposals and contracts."
    },
    {
      "duty": "Gather and analyze data using a variety of computer-based analytical tools."
    },
    {
      "duty": "Negotiate the purchase and sale of securities."
    },
    {
      "duty": "Perform other investment-related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business or Public Administration, Finance, Economics or related field (Master’s preferred). Possession of a Chartered Financial Analyst (CFA) designation is highly desirable."
    }
  ]
}