{
  "meta": [
    {
      "job_title": "Track Laborer",
      "job_category": "Construction",
      "job_class": "Laborer",
      "sector": "Construction",
      "salary": 42000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Physical Labor",
      "experience": 5
    },
    {
      "skill": "Hand Tool Operation",
      "experience": 5
    },
    {
      "skill": "Railroad Maintenance",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform physical labor using hand tools and equipment to construct, alter, repair, maintain, and demolish railroad tracks, associated structures, and components."
    },
    {
      "duty": "Carry and place track materials using hand tools such as tie tongs, rail tongs, rail forks, lining bars, shovels, and jacks."
    },
    {
      "duty": "Attach the rail to ties using spike mauls or spike drivers."
    },
    {
      "duty": "Remove spikes with claw bars, spike lifters, and spike pullers."
    },
    {
      "duty": "Lift, position, handle, remove and install railroad crossties in and around the track structure."
    },
    {
      "duty": "Connect and disconnect rail using the track, impact, power wrenches, or welding materials."
    },
    {
      "duty": "Move, clean, and tamp ballast (crushed stone-like material) with shovels, tamping picks, clay picks, lining bars, and ballast forks."
    },
    {
      "duty": "Raise tracks, turnouts, crossings, and rails with track or power jacks."
    },
    {
      "duty": "Cut associated materials with oxygen-acetylene torches, rail saws, cut-off saws, and cold chisels."
    },
    {
      "duty": "Drill holes with gasoline, pneumatic, hydraulic, and electric drill motors."
    },
    {
      "duty": "Work alongside heavy equipment by connecting, disconnecting, and controlling material that is being moved and by directing such movement."
    },
    {
      "duty": "Participate in safety meetings."
    },
    {
      "duty": "Wear all appropriate personal protective equipment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED"
    }
  ]
}