{
  "meta": [
    {
      "job_title": "Client Support - Claims Systems Configuration Senior Analyst",
      "job_category": "Client Support",
      "job_class": "Analyst",
      "sector": "Healthcare",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Claims System Configuration",
      "experience": 5
    },
    {
      "skill": "Client Support",
      "experience": 5
    },
    {
      "skill": "Healthcare Claims Lifecycle",
      "experience": 5
    },
    {
      "skill": "Microsoft ACCESS and EXCEL",
      "experience": 3
    },
    {
      "skill": "SQL Querying",
      "experience": 3
    },
    {
      "skill": "Database Management Systems",
      "experience": 3
    },
    {
      "skill": "AS400, MC400, McNet, and RC3 systems",
      "experience": 3
    },
    {
      "skill": "Claims Adjudication",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide expert client support by meeting with Health Plan clients, answering questions, and resolving issues related to eviCore claims systems."
    },
    {
      "duty": "Serve as the Subject Matter Expert and partner with internal departments, external clients, and vendors to ensure configurations meet client requirements and quality standards."
    },
    {
      "duty": "Analyze and define business, technical, and claim data exchange requirements, and provide support for associated UA testing to ensure proper interaction for current and future claims product use."
    },
    {
      "duty": "Resolve non-routine issues escalated from leadership, business, clients, and junior team members, and act as a subject matter expert for eviCore claims product setups/processes."
    },
    {
      "duty": "Collaborate with internal and external clients, IT departments, and QA departments to understand processes, procedures, and identify solutions for procedural gaps."
    },
    {
      "duty": "Lead new product, complex, and change request implementations, design documentation creation and/or approval, and support the Claims Systems Director in production release approvals."
    },
    {
      "duty": "Additional responsibilities may include reporting development, RFP data processing requests, training, maintenance transition, and process/product workflow/documentation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED required, Bachelor’s degree preferred"
    }
  ]
}