{
  "meta": [
    {
      "job_title": "Customer Success Manager",
      "job_category": "Customer Success",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Success",
      "experience": 4
    },
    {
      "skill": "Account Management",
      "experience": 4
    },
    {
      "skill": "SaaS Environment",
      "experience": 4
    },
    {
      "skill": "Enterprise Customer Management",
      "experience": 4
    },
    {
      "skill": "Technical Knowledge",
      "experience": 4
    },
    {
      "skill": "Business Impact Analysis",
      "experience": 4
    },
    {
      "skill": "Online Engagement Strategy",
      "experience": 4
    },
    {
      "skill": "Product Knowledge",
      "experience": 4
    },
    {
      "skill": "Life Sciences",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build long-standing partnerships with daily users and executive stakeholders to understand how customers are using the product, increase their return on investment, and achieve customer business outcomes."
    },
    {
      "duty": "Successfully lead customers through the onboarding, adoption, value realization and scheduled check-ins, QBRs, and monitor and increase client satisfaction through mutually defined success plans."
    },
    {
      "duty": "Partner with Sales and Product teams to align and execute on account strategy, and ensure the BioRender platform aligns with the needs of sophisticated Enterprise Industry and Academic customers."
    },
    {
      "duty": "Monitor and analyze usage trends to uncover renewal risks, identify opportunities for contract growth/optimization, drive end-user engagement campaigns and overall engagement strategy."
    },
    {
      "duty": "Identify new business opportunities and develop strategic plans for ensuring customer retention and expansion."
    },
    {
      "duty": "Gain deep knowledge of the BioRender product and assist clients with executing their use cases."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science degree or equivalent with life sciences experience (e.g. within the fields of biology, biotechnology, biomedical engineering, biochemistry, etc)"
    }
  ]
}