{
  "meta": [
    {
      "job_title": "Sales and Artistry Coordinator",
      "job_category": "Sales",
      "job_class": "Coordinator",
      "sector": "Sales",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Retail Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Retail Partner Relationship Management",
      "experience": 5
    },
    {
      "skill": "Visual Merchandising",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Recruitment and Hiring",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive financial results in store to meet and exceed plan, including Key Performance Indicators (KPI’s) – examples; Average Unit Sales (AUS), Mix of Business (MOB), 0 + 12 Budget (Sales Plan), door ranking, and product ranking."
    },
    {
      "duty": "Lead by example at all times and consistently role model and promote exceptional customer service with the team and clients."
    },
    {
      "duty": "Proactively anticipate staffing needs, including sourcing and selecting talent to deliver business objectives. Recruit and hire the best makeup artists and customer service professionals who embody the Charlotte Tilbury brand as a part of the Brand Expert team."
    },
    {
      "duty": "Maintain the required inventory levels and accurate stock files; escalate inventory needs as directed by the channel to optimize sales."
    },
    {
      "duty": "Establish and develop a cooperative and mutually respectful relationship with the entire store team. Maintain the store standards and policies at all times. Proactively suggest win-win opportunities to drive sales within the store."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "3 plus years of Beauty industry experience. Bachelor's degree in Marketing, Business or a related field (Master's preferred)."
    }
  ]
}