{
  "meta": [
    {
      "job_title": "Payroll Analyst",
      "job_category": "Accounting/Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 65000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Process semi-monthly payroll, meticulously auditing data before and after submission, utilizing formulas and reports for accurate reconciliation."
    },
    {
      "duty": "Thoroughly review timecards of hourly employees to identify and rectify errors, ensuring precision in compensation."
    },
    {
      "duty": "Prepare final and manual checks when necessary, meeting employee needs promptly."
    },
    {
      "duty": "Convert payroll commissions and bonus payments from the Finance department into the appropriate format for upload."
    },
    {
      "duty": "Conduct audits of employee personal information in the database, maintaining meticulous and organized payroll records."
    },
    {
      "duty": "Collaborate with the Finance department to compile and submit payroll documents each pay period, assisting in audit-related report generation."
    },
    {
      "duty": "Address employee inquiries related to salaries, wages, and payroll system functions, promptly resolving discrepancies."
    },
    {
      "duty": "Distribute manual paper checks on a daily basis, ensuring accurate entry into the banking system."
    },
    {
      "duty": "Adhere to local, state, and federal regulations, meticulously maintaining payroll integrity while calculating wage attachments and administering IRS and Local Tax Levies."
    },
    {
      "duty": "Oversee and validate Compensation plans within the system to ensure accurate setup."
    },
    {
      "duty": "Serve as the UltiPro HRIS Administrator Subject Matter Expert (SME) for Payroll functions."
    },
    {
      "duty": "Manage employee data changes using the Payroll/HRIS system on a semi-monthly basis."
    }
  ],
  "skills": [
    {
      "skill": "Payroll Processing",
      "experience": 5
    },
    {
      "skill": "HRIS Administration",
      "experience": 5
    },
    {
      "skill": "Audit and Compliance",
      "experience": 4
    },
    {
      "skill": "Employee Inquiries Resolution",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 4
    },
    {
      "skill": "Financial Reconciliation",
      "experience": 5
    },
    {
      "skill": "Documentation and Reporting",
      "experience": 4
    },
    {
      "skill": "Compensation Oversight",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree required; Certification such as CPP or PCP preferred"
    }
  ]
}