{
  "meta": [
    {
      "job_title": "Early Childhood Teacher",
      "job_category": "Education",
      "job_class": "Teacher",
      "sector": "Education",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Co-teach in a trauma-responsive preschool program serving children ages 3-5 years, focusing on social and emotional development."
    },
    {
      "duty": "Create and implement developmentally appropriate learning activities and lesson plans."
    },
    {
      "duty": "Use TS Gold assessment data to individualize education and care to meet children’s needs."
    },
    {
      "duty": "Assess learners’ growth and development using Teaching Strategies Gold, and provide interventions for children using assessment data."
    },
    {
      "duty": "Maintain a clean, safe, engaging classroom environment, free of physical, psychological, and emotional dangers."
    },
    {
      "duty": "Establish consistent routines that foster self-esteem, security, and connection using the Conscious Discipline approach."
    },
    {
      "duty": "Create and maintain effective and consistent communication with families, facilitating home visits and conferences for goal setting and informing parents/guardians of children’s growth and development."
    },
    {
      "duty": "Collaborate and communicate with team members to provide the best environment for young children and the program as a whole."
    },
    {
      "duty": "Reflect on, improve, and enhance the environment and instructional practices on an ongoing basis."
    },
    {
      "duty": "Plan and implement activities to meet the physical, emotional, intellectual, and social needs of the children in the program. Promote inclusion through equitable practices in a culturally competent teaching position."
    },
    {
      "duty": "Create and follow lesson plans based on Creative Curriculum and Second Step Social Emotional Curriculum."
    },
    {
      "duty": "Assess students on an ongoing basis and document children’s progress toward improving learning outcomes."
    },
    {
      "duty": "Provide partners with families that promote family engagement and participation in children’s education and learning."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 75,
      "introvert_extrovert": 95
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Early Childhood Education or related field (Master's preferred)"
    }
  ]
}