{
  "meta": [
    {
      "job_title": "Senior Communications Manager",
      "job_category": "Communications",
      "job_class": "Manager",
      "sector": "Pharmaceutical",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 5
    },
    {
      "skill": "Branding",
      "experience": 5
    },
    {
      "skill": "Pharmaceutical Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement effective communication strategies and action plans that helps build and drive employee engagement."
    },
    {
      "duty": "Lead and design employee events and communication forums in partnership with the Phoenix Leadership Team, presenting and moderating at these various local employee communications and events, e.g. Town Halls."
    },
    {
      "duty": "Serve as Change & Communications Lead for Phoenix Site Expansion Program to ensure an integrated change management plan that enables change readiness and drives engagement."
    },
    {
      "duty": "Serve as a change agent for the continued education with key stakeholders on Change Management processes and Organizational Culture, best practices, templates, and guidelines."
    },
    {
      "duty": "Establish metrics for measuring effectiveness of global campaigns implemented locally as well as local campaigns, leveraging them to drive continuous improvement."
    },
    {
      "duty": "Support local roll-out and translation of enterprise-wide initiatives/communications such as corporate values, pulse surveys, total rewards communications, employee giving, etc.; pulls through all communications related to the people strategy and culture."
    },
    {
      "duty": "Partner with GPS Corporate Affairs to ensure consistent and compelling local messages and strategies are aligned with them, and ensure recognition and showcasing of the Phoenix site as the GPS and enterprise level to build internal awareness and branding."
    },
    {
      "duty": "Build relationships and collaborate with Phoenix LT, business partners and cross-functional leadership in the development of communications strategies for key initiatives."
    },
    {
      "duty": "Maintain an integrated calendar of communications considering cadence, timing and tone, creating clarity in our communications channels for the site."
    },
    {
      "duty": "Supports issues management and policy communications related to employee communications as needed, responding in a timely manner."
    },
    {
      "duty": "Develop company's Phoenix brand awareness in the wider talent marketplace by understanding workforce sentiment and impact of external forces; aligns communications accordingly, e.g. LinkedIn communications."
    },
    {
      "duty": "Monitors and analyzes the local industry as it relates to the role to ensure effective and appropriate communications strategies are being utilized in the market."
    },
    {
      "duty": "Build and maintain understanding of core business functions to manage strategic and tactical initiatives."
    },
    {
      "duty": "Manage cross-functional projects to support business strategies and execution, develop and implement successful strategies to support uninterrupted product supply."
    },
    {
      "duty": "Writes, edits, manages and/or translates creation of local communications."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Communications, Marketing, or a related field (Master's preferred)"
    }
  ]
}