{
  "meta": [
    {
      "job_title": "Compliance Manager",
      "job_category": "Compliance",
      "job_class": "Manager",
      "sector": "Compliance",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Banking Compliance",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "CRA Reporting",
      "experience": 5
    },
    {
      "skill": "Risk Assessments",
      "experience": 5
    },
    {
      "skill": "Issue Tracking",
      "experience": 5
    },
    {
      "skill": "Legal and Regulatory Analysis",
      "experience": 5
    },
    {
      "skill": "Compliance Subject Matter Expertise",
      "experience": 5
    },
    {
      "skill": "Policy and Procedure Development",
      "experience": 5
    },
    {
      "skill": "Communications Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure compliance within all Bank policies, procedures, as well as all applicable state and federal banking regulations."
    },
    {
      "duty": "Review and validate all CRA related services, sponsorships, donations and/or contributions and ensure sufficient documentation is obtained and made available for audits and examinations."
    },
    {
      "duty": "Develop and review periodic CRA related reports (e.g., loan reports, performance reports) and prepare CRA reporting for the CRA committee."
    },
    {
      "duty": "Perform basic CRA related analytics. Ensure the CRA Public File is up to date."
    },
    {
      "duty": "Manage and execute the Bank's annual Compliance Risk Assessments and oversee the RA Program."
    },
    {
      "duty": "Assist in developing, deploying, and managing a comprehensive 2nd Line Monitoring and Testing program for all lines of business."
    },
    {
      "duty": "Assist in developing, deploying, and managing a comprehensive Issue Tracking program, to include self-identified issues, root cause analysis (RCA) remediation and closure of items."
    },
    {
      "duty": "Reviews and analyzes new and pending laws and regulations and work with the business across the bank to develop or revise appropriate policies, procedures, contracts, and agreements to ensure compliance."
    },
    {
      "duty": "Provides daily, ongoing Compliance subject matter expertise/advisory support to the various business lines across the bank."
    },
    {
      "duty": "Assist with general compliance management system oversight and adherence to target operating model."
    },
    {
      "duty": "Assist with preparations for regulatory examinations."
    },
    {
      "duty": "Attend various seminars, webinars, and other outside compliance training."
    },
    {
      "duty": "Complete online training courses as assigned."
    },
    {
      "duty": "Complete other compliance tasks as directed by the Head of Compliance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "CRCM or similar Compliance certification is required, 8 years of hands-on Compliance experience will be considered in lieu of Industry Certification"
    }
  ]
}