{
  "meta": [
    {
      "job_title": "Biorepository Associate II",
      "job_category": "Biological Sciences",
      "job_class": "Associate",
      "sector": "Research and Development",
      "salary": 63000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sample Handling and Processing",
      "experience": 5
    },
    {
      "skill": "Biosafety Protocols",
      "experience": 5
    },
    {
      "skill": "Data Management",
      "experience": 5
    },
    {
      "skill": "Laboratory Terminology",
      "experience": 5
    },
    {
      "skill": "Equipment Protocols",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Laboratory Tools",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Complete sample accessioning, including receiving samples, making initial quality assessments, processing samples, and capturing all relevant data in electronic format."
    },
    {
      "duty": "Assist in establishing and maintaining a physical inventory of all samples."
    },
    {
      "duty": "Organize and coordinate all sample transactions into and out of the lab, ensuring proper sign-off for all material requests."
    },
    {
      "duty": "Identify process improvement opportunities."
    },
    {
      "duty": "Develop and maintain good working relationships with teams and external clients."
    },
    {
      "duty": "Communicate issues and/or risks to key stakeholders."
    },
    {
      "duty": "Attend and participate in cross-functional study team meetings, as needed."
    },
    {
      "duty": "Test new protocols and equipment, including sample processing, alternate storage methods, and barcoding systems."
    },
    {
      "duty": "Assist in the physical build-out and organization of the storage facility."
    },
    {
      "duty": "Assist with creating/reporting lab performance metrics."
    },
    {
      "duty": "Ensure sufficient inventory of sample-related supplies as consumables."
    },
    {
      "duty": "Apply strong analytical, problem-solving, and decision-making skills, especially when limited and incomplete information is available. Ability to seek help when necessary and ability to help bring focus and clarity when ambiguity arises."
    },
    {
      "duty": "Apply strong listening, verbal, and written communication skills among technical and non-technical personnel."
    },
    {
      "duty": "Integrate and apply feedback in a professional manner."
    },
    {
      "duty": "Prioritize and drive to results with a high emphasis on quality."
    },
    {
      "duty": "Work as part of a team."
    },
    {
      "duty": "Uphold company mission and values through accountability, innovation, integrity, quality, and teamwork."
    },
    {
      "duty": "Support and comply with the company’s Quality Management System policies and procedures."
    },
    {
      "duty": "Maintain regular and reliable attendance."
    },
    {
      "duty": "Act with an inclusion mindset and model these behaviors for the organization."
    },
    {
      "duty": "Work designated schedule."
    },
    {
      "duty": "Work on a mobile device, tablet, or in front of a computer screen and/or perform typing for approximately 35% of a typical working day."
    },
    {
      "duty": "Work seated for approximately 35% of a typical working day. Work standing for approximately 65% of a typical working day."
    },
    {
      "duty": "Lift up to 25 pounds for approximately 10% of a typical working day."
    },
    {
      "duty": "Comply with any applicable personal protective equipment requirements."
    },
    {
      "duty": "Use various types of laboratory equipment as required, including but not limited to items such as microscopes, microtomes, blades, strainers, slide scanners, biosafety cabinets, centrifuges, barcoding systems, pipettes, and ultra-low freezers for extended periods of time."
    },
    {
      "duty": "Perform repetitious actions using lab tools."
    },
    {
      "duty": "Use near vision to view samples at close range."
    },
    {
      "duty": "Be exposed to hazardous materials, human samples, and instruments with moving parts, lasers, heating and freezing elements, and high-speed centrifugation."
    },
    {
      "duty": "Travel between local Exact Sciences locations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 255,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Biological Sciences or field as outlined in the essential duties; or Associate’s degree in Biological Sciences or field as outlined in the essential duties and 2 years of relevant experience as outlined in the essential duties; or High School Diploma or General Education Degree (GED) and 4 years of relevant experience as outlined in the essential duties.3+ years of relevant experience working in a laboratory setting (e.g., need 3+ years of experience working in a histology laboratory setting if primarily handling tissues)."
    }
  ]
}