{
  "meta": [
    {
      "job_title": "Payroll Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitoring all tasks necessary to accomplish payroll processing objectives, including relationships with external vendors and state and federal agencies."
    },
    {
      "duty": "Planning, coordinating, and managing the functions of the payroll department."
    },
    {
      "duty": "Administering payroll operations for all full-time, part-time, and temporary employees, including rectifying inaccuracies and ensuring compliance with regulations."
    },
    {
      "duty": "Managing, entering, scheduling, and maintaining employee data in a payroll management system, including new hires, terminations, rate changes, and benefit deductions."
    },
    {
      "duty": "Preparing monthly, quarterly, and biweekly payroll reports to CFO, HR, Benefits, and Finance team."
    },
    {
      "duty": "Overseeing biweekly payroll activities, voiding checks, distributing paychecks, and ensuring proper employee classification."
    },
    {
      "duty": "Managing payroll specialist(s) to ensure timely and accurate biweekly payroll processing."
    },
    {
      "duty": "Reviewing tax reports and payments, overseeing unemployment eligibility claims, and wage/employment verifications."
    }
  ],
  "skills": [
    {
      "skill": "Payroll Administration",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Payroll Systems",
      "experience": 5
    },
    {
      "skill": "Data Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in finance, HR, or related field (Master's preferred)"
    },
    {
      "credential": "CPP certification or ability to obtain it within the first year of employment"
    }
  ]
}