{
  "meta": [
    {
      "job_title": "Immigration Supervisor/Supervising Attorney",
      "job_category": "Legal Services",
      "job_class": "Supervisor",
      "sector": "Legal",
      "salary": 83000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Immigration Law",
      "experience": 3
    },
    {
      "skill": "Litigation",
      "experience": 3
    },
    {
      "skill": "Supervision",
      "experience": 3
    },
    {
      "skill": "Case Management",
      "experience": 3
    },
    {
      "skill": "Legal Consultation",
      "experience": 3
    },
    {
      "skill": "Advocacy",
      "experience": 3
    },
    {
      "skill": "Grant Administration",
      "experience": 3
    },
    {
      "skill": "Language Skills (English/Spanish)",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leading the legal work under the Immigration Unit."
    },
    {
      "duty": "Supervising staff attorneys, DOJ Accredited Representatives, and administrative staff, including case staffing, reviewing work product, and supervising direct representation cases."
    },
    {
      "duty": "Conducting individualized legal consultations to screen for all types of immigration relief for individuals."
    },
    {
      "duty": "Maintaining a direct representation caseload providing direct legal representation to immigrants in a variety of matters before the EOIR and the USCIS."
    },
    {
      "duty": "Providing legal representation to clients in especially difficult and/or novel cases."
    },
    {
      "duty": "Advocating on behalf of clients who have been victims of crimes, including human trafficking, in interactions with law enforcement."
    },
    {
      "duty": "Representing NNLA and clients at local and regional stakeholder, coalition, and advocacy meetings."
    },
    {
      "duty": "Helping NNLA maintain accreditation through the Recognition & Accreditation (R&A) Program through the EOIR."
    },
    {
      "duty": "Stay current on relevant laws and policies, attend trainings and conferences, and review new laws, regulations, and court rules."
    },
    {
      "duty": "Assist with preparation of grant applications, grant administration, and reports."
    },
    {
      "duty": "Collecting, updating, and reviewing client and grant-reporting data on a monthly basis."
    },
    {
      "duty": "Making referrals both internally to other units within NNLA and other community partners."
    },
    {
      "duty": "Occasional outreach, community education, and other regional events."
    },
    {
      "duty": "Other tasks as assigned/necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Member of the Nevada Bar, active and good standing Bar License from any United States jurisdiction, or Fully Accredited OLAP Representative."
    }
  ]
}