{
  "meta": [
    {
      "job_title": "Senior Cybersecurity Analyst",
      "job_category": "Cybersecurity",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 83000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cybersecurity Assessment",
      "experience": 6
    },
    {
      "skill": "Vulnerability Testing",
      "experience": 6
    },
    {
      "skill": "Security Strategy Development",
      "experience": 6
    },
    {
      "skill": "Incident Response",
      "experience": 6
    },
    {
      "skill": "NIST Framework",
      "experience": 6
    },
    {
      "skill": "Security Technology Implementation",
      "experience": 6
    },
    {
      "skill": "Penetration Testing",
      "experience": 6
    },
    {
      "skill": "Network Security",
      "experience": 6
    },
    {
      "skill": "Cloud Security",
      "experience": 6
    },
    {
      "skill": "Security Documentation",
      "experience": 6
    },
    {
      "skill": "Threat Intelligence",
      "experience": 6
    },
    {
      "skill": "Networking Protocols",
      "experience": 6
    },
    {
      "skill": "Scripting (Python, PowerShell)",
      "experience": 6
    },
    {
      "skill": "Mentoring",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and conduct in-depth security assessments, vulnerability assessments, and penetration testing to identify potential risks and vulnerabilities within ASU systems, networks, and applications."
    },
    {
      "duty": "Collaborate with cross-functional teams to develop and implement effective security strategies, policies, and procedures that align with industry standards and regulatory requirements."
    },
    {
      "duty": "Provide technical expertise and guidance to junior analysts, fostering their professional growth and enhancing the overall capabilities of the team."
    },
    {
      "duty": "Stay current with emerging threats, vulnerabilities, and security technologies by monitoring cybersecurity trends and regular, self-directed research."
    },
    {
      "duty": "Collaborate with IT teams to ensure proper configuration and security of hardware, software, and network devices."
    },
    {
      "duty": "Lead the design and implementation of security controls, and other security technologies to enhance ASU defensive capabilities."
    },
    {
      "duty": "Monitor and respond to security alerts and incidents, working to minimize potential impact and facilitating post-incident analysis to prevent future occurrences."
    },
    {
      "duty": "Develop and maintain comprehensive documentation related to cybersecurity processes, policies, and incident response plans."
    },
    {
      "duty": "Perform work on an irregular schedule as security incidents require."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Information Technology or related field OR 6 years of experience in information technology OR Any equivalent combination of education and/or experience from which comparable knowledge, skills and abilities have been achieved."
    }
  ]
}