{
  "meta": [
    {
      "job_title": "Maintenance Planner",
      "job_category": "Maintenance",
      "job_class": "Planner",
      "sector": "Manufacturing",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide detailed and accurately planned job packages for the repair and improvements to the plant's equipment."
    },
    {
      "duty": "Ensure adherence to the Maintenance and Operations Workflow Process (MOWP)."
    },
    {
      "duty": "Solicit, embrace, and utilize planner feedback to maintain established KPIs, and continuously improve job plan accuracy and methods of execution."
    },
    {
      "duty": "Manage the notification backlog by working with assigned clients in the development of timely and precise work orders."
    },
    {
      "duty": "Create and maintain task lists and bill of materials (BOMs) for jobs requiring them."
    },
    {
      "duty": "Utilize the catalog system when ordering material."
    },
    {
      "duty": "Monitor planned vs actual KPIs on a monthly basis."
    },
    {
      "duty": "Utilize previous repair history, condition monitoring data, and personnel feedback to ensure the appropriate scope of work is developed."
    },
    {
      "duty": "Participate in the cost estimating process for services and materials by coordinating with vendors and internal clients during the bid package development."
    },
    {
      "duty": "Periodically work turnarounds and outages. This includes planning, coordinating and other lead roles."
    },
    {
      "duty": "Schedule and lead job plan discussions with all stakeholders (internal and external to the Mtc. Dept.)."
    },
    {
      "duty": "Participate in and lead safety huddles."
    }
  ],
  "skills": [
    {
      "skill": "Maintenance Planning",
      "experience": 5
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 5
    },
    {
      "skill": "Scheduling",
      "experience": 5
    },
    {
      "skill": "Cost Estimation",
      "experience": 5
    },
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Vendor Coordination",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "SAP Software",
      "experience": 3
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or GED with 5 years of maintenance/operational experience in the chemical /refining industry. Craft experience as a millwright, boilermaker or boilermaker/pipefitter is highly desired. Knowledge and experience of how to specify, troubleshoot, install and maintain plant rotating/stationary equipment. In-depth knowledge in reading and interpreting equipment drawings, specifications and QA/QC requirements. SAP Software experience preferred. Excellent interpersonal and communication skills (both oral and written) with the ability to effectively interact and communicate with all departments, and levels of the organization including external suppliers. Demonstrated ability to work with a cross functional work team consisting of internal/external departments in resolving issues that need planning or outside vendor support. Ability to work under minimal supervision, be proactive, self-motivated, demonstrate the ability to handle multiple projects, changing priorities and frequently heavy workloads which may require work in addition to normal working hours. This will include, participating and responding to site needs when assigned call-out duty."
    }
  ]
}