{
  "meta": [
    {
      "job_title": "Area Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 70000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify potential dealers and acquire and develop new auto and powersports dealer business relationships."
    },
    {
      "duty": "Present and sell company products and services to all levels of management."
    },
    {
      "duty": "Assist dealer partners with loan origination and deal funding."
    },
    {
      "duty": "Analyze current and future sales prospects and trends."
    },
    {
      "duty": "Monitor competition by gathering current marketplace information on pricing, products, and marketing techniques."
    },
    {
      "duty": "Resolve customer complaints, investigate problems, and develop solutions."
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "HS Diploma/GED required with equivalent work experience in related field."
    },
    {
      "credential": "Basic understanding of the auto dealer industry and finance industry."
    },
    {
      "credential": "Reliable internet and telephone service, and dedicated home office or workspace."
    },
    {
      "credential": "Ability to travel up to 75% within a designated territory."
    },
    {
      "credential": "A valid driver’s license and acceptable motor vehicle records history."
    },
    {
      "credential": "Preferred: Strong ability to establish and cultivate relationships with dealers. Ambitious, self-starter and have great work ethic. Entrepreneurial approach to managing and growing a defined sales territory. Detail-orientated and have exceptional follow-up. Outstanding communication skills in both verbal and written. Ability to collaborate with internal departments to increase application flow and loan bookings. Flexibility to quickly adapt to changes within scope of role and departments."
    }
  ]
}