{
  "meta": [
    {
      "job_title": "Digital Design Communication Specialist",
      "job_category": "Design",
      "job_class": "Specialist",
      "sector": "IT",
      "remote": false,
      "salary": 70000
    }
  ],
  "skills": [
    {
      "skill": "Graphic Design",
      "experience": 5
    },
    {
      "skill": "UX Design",
      "experience": 5
    },
    {
      "skill": "Writing",
      "experience": 3
    },
    {
      "skill": "Content Creation",
      "experience": 3
    },
    {
      "skill": "Web Design",
      "experience": 5
    },
    {
      "skill": "Adobe Creative Suite (Photoshop, Illustrator, Premiere, After Effects)",
      "experience": 3
    },
    {
      "skill": "Microsoft O365",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and create visual communication assets, including animation, video, photography, and other media solutions."
    },
    {
      "duty": "Provide advanced level writing and editing for content creation, benefiting internal communication in the IT department."
    },
    {
      "duty": "Support the development of the communication strategy for IT department."
    },
    {
      "duty": "Oversee the conception and execution of communication projects, ensuring they align with the company's design standards."
    },
    {
      "duty": "Manage intranet pages by refreshing content and design periodically."
    },
    {
      "duty": "Collaborate with customers and stakeholders to ensure correct messaging and achieve communication objectives."
    },
    {
      "duty": "Plan clear progressions of ideation by implementing structure into the creative process, including scripts, storyboards, presentation materials, timelines, and concept sketches."
    },
    {
      "duty": "Manage deadlines and workflows to deliver content that meets customer demand."
    },
    {
      "duty": "Interact with users to gather feedback and enhance the user experience."
    },
    {
      "duty": "Drive the development and communication of design guidelines and patterns."
    },
    {
      "duty": "Deliver work effort as part of Agile projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "B.A., B.F.A., or B.S. in Art, Design, Graphic Design or a related field."
    }
  ]
}