{
  "meta": [
    {
      "job_title": "Principal CRA",
      "job_category": "Clinical Research",
      "job_class": "Principal",
      "sector": "Healthcare",
      "salary": 160000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Clinical Research Management",
      "experience": 12
    },
    {
      "skill": "Regulatory Submission",
      "experience": 12
    },
    {
      "skill": "Clinical Risk Management",
      "experience": 12
    },
    {
      "skill": "Site Contract Negotiation",
      "experience": 12
    },
    {
      "skill": "Vendor Management",
      "experience": 12
    },
    {
      "skill": "FDA Compliance",
      "experience": 12
    },
    {
      "skill": "Clinical Data Review",
      "experience": 12
    },
    {
      "skill": "Project Management",
      "experience": 12
    },
    {
      "skill": "Clinical Reports",
      "experience": 12
    },
    {
      "skill": "Contract Research Organizations (CROs)",
      "experience": 12
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads aspects of the internal and external study operations across the lifecycle of clinical programs."
    },
    {
      "duty": "Works closely with Contract Research Organizations (CROs), Core Labs, Contractors, and Consultants to provide project work direction and monitor vendor performance."
    },
    {
      "duty": "Provides detailed oversight of progress to milestones through the use of metrics and study scorecards."
    },
    {
      "duty": "Translates strategies into executable plans and protocols leveraging input from stakeholders and physician advisors."
    },
    {
      "duty": "Develops regulatory submission deliverables and required clinical reports in close coordination with Clinical Affairs and Regulatory Affairs."
    },
    {
      "duty": "Drafts responses to FDA questions/deficiencies and leads clinical risk management activities."
    },
    {
      "duty": "Collaborates with legal and coordinates site contract terms and budget negotiation exchanges."
    },
    {
      "duty": "Conducts site visits as needed, including site qualification, training, initiation, interim monitoring, issue resolution, and/or close-out visits."
    },
    {
      "duty": "Reviews and approves vendor reports and routinely reviews CRF data, ongoing centralized data review reports, source documentation, and other protocol-driven data requirements."
    },
    {
      "duty": "Develops audit readiness plans and conducts preparation activities for/with the teams, ensuring quality documentation is complete and accurate."
    },
    {
      "duty": "Provides proactive updates regarding the status and progress of the study to all stakeholders and authors/owns SOPs and serves as a subject matter expert across multiple clinical areas."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree and 12+ years’ experience supporting or leading clinical research projects (Master's preferred)"
    },
    {
      "credential": "Working knowledge and experience on US IDE/pre-market studies and PMA submissions."
    },
    {
      "credential": "Knowledge of cardiovascular anatomy and current coronary interventional practices, procedures, literature, and society guidelines."
    },
    {
      "credential": "Sponsor/Medical Device experience."
    }
  ]
}