{
  "meta": [
    {
      "job_title": "HR  Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conducts employee investigations to determine appropriate company response; ensures investigation outcomes are fair, equitable, and compliant with company policy and state/federal employment laws."
    },
    {
      "duty": "Develops rapport and strong work relationships with Managers to influence and coach management on performance, organizational and leadership matters such as hiring, promotions, counseling, performance feedback, disciplinary actions, and terminations; actively participates with management to provide creative business solutions."
    },
    {
      "duty": "Facilitates and administers various employee relations matters such as performance management meetings, counseling, grievances, advancement, leaves of absence, accommodations, out-placement, and exit interviews."
    },
    {
      "duty": "Coordinates and communicates any employee wage/hour changes with the Compensation Team and Payroll Department within established timelines."
    },
    {
      "duty": "Assists with salary administration and coordinates with Compensation Team to ensure compliance and equity within the organization; conducts training as needed."
    },
    {
      "duty": "Conducts hiring interviews to fill vacancies with qualified candidates in a timely manner."
    },
    {
      "duty": "Interacts with and provides support to Safety and Workers Compensation Administration staff; serves as First Responder by providing first-aid when necessary and assists with initial reporting of injuries."
    },
    {
      "duty": "Prepares for and attends Equal Employment Opportunity Commission (EEOC) and Employment Development Department (EDD) hearings."
    },
    {
      "duty": "Administers and implements various human resources plans, procedures, and company policies; responsible for information accuracy."
    },
    {
      "duty": "Assists with maintenance and update of company policies and procedures to ensure compliance with state/federal laws."
    },
    {
      "duty": "Participates in various employee relations activities such as new hire orientation, benefits meetings, and employee functions."
    },
    {
      "duty": "Assists employees and managers with general inquiries regarding employment, benefits, company policies and procedures, compensation, and other related matters."
    },
    {
      "duty": "Identifies legal requirements and government reporting regulations to meet US and International compliance with respect to employment."
    },
    {
      "duty": "Keeps up-to-date on employment laws and regulations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 90,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Human Resources, Business Administration, or related discipline.Minimum of three (3) years of Human Resources Generalist experience."
    },
    {
      "credential": "(Master's preferred)"
    }
  ]
}