{
  "meta": [
    {
      "job_title": "Journeyman Program Manager",
      "job_category": "Program Management",
      "job_class": "Manager",
      "sector": "Program Management",
      "salary": 115000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 7
    },
    {
      "skill": "Acquisition Strategy",
      "experience": 7
    },
    {
      "skill": "Contract Execution",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Financial Management",
      "experience": 7
    },
    {
      "skill": "Program Reporting",
      "experience": 7
    },
    {
      "skill": "Logistics Support",
      "experience": 7
    },
    {
      "skill": "Mission Planning",
      "experience": 7
    },
    {
      "skill": "Policy Interpretation",
      "experience": 7
    },
    {
      "skill": "Technical Evaluation",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support cost and schedule reduction activities for acquisition and development efforts."
    },
    {
      "duty": "Lead program level acquisition support and guide successful program execution."
    },
    {
      "duty": "Provide expert program management inputs to Request for Proposal (RFPs) and other products."
    },
    {
      "duty": "Assist in the preparation of acquisition reports and milestone review documentations."
    },
    {
      "duty": "Develop and update program risk management plans."
    },
    {
      "duty": "Provide support in preparing and submitting funding documents and reports."
    },
    {
      "duty": "Interpret, organize, execute, and coordinate acquisition project assignments."
    },
    {
      "duty": "Keep abreast of DoD acquisition reform policies and recommend revisions to new and existing programs."
    },
    {
      "duty": "Provide direct support in preparation and review of program documents."
    },
    {
      "duty": "Ensure Mission Planning Environment systems are planned, managed, and developed to support requirements and capability demonstrations."
    },
    {
      "duty": "Provide direct support to Mission Planning Environment (MPE) systems in the PMO."
    },
    {
      "duty": "Assist with drafting contractual letters on program management issues."
    },
    {
      "duty": "Assist with development of source selection strategies, evaluation criteria, Request for Proposal (RFP) documentation, and other source selection administrative support."
    },
    {
      "duty": "Assist with mission execution including operational planning, operational analysis, capability development, and event integration."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100
    },
    {
      "student_teacher": 80
    },
    {
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High-school diploma or equivalent (Bachelor's or Master's Degree preferred)"
    },
    {
      "credential": "Security Clearance: Must have and be able to maintain a Secret level clearance"
    }
  ]
}