{
  "meta": [
    {
      "job_title": "Area Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Management",
      "experience": 5
    },
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Performance Evaluation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Operations Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Effectively manage, recruit, coach, and motivate Team Members across multiple branch locations."
    },
    {
      "duty": "Lead the daily activities of staff and overall origination processes of mortgage loans within branches to achieve defined sales and quality service goals."
    },
    {
      "duty": "Ensure branches operate in full compliance with all federal, state, regulatory, and Company policies and procedures."
    },
    {
      "duty": "Lead Loan Officers in building mortgage loan volume and realtor relationships."
    },
    {
      "duty": "Communicate goals and policy changes to staff through regular meetings."
    },
    {
      "duty": "Maintain an active recruitment pipeline and regularly conduct interviews with prospective sales, support, and general branch staff."
    },
    {
      "duty": "Oversee area performance through hiring, training, advancement, and turnover of staff; complete performance evaluations as needed."
    },
    {
      "duty": "Manage Profit and Loss of branches in the area."
    },
    {
      "duty": "Be present on Company Branch Manager calls and retreats."
    },
    {
      "duty": "If a producing Area Manager, be in top 20% of Loan Officers in the area based on production."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent. Active NMLS license."
    },
    {
      "credential": "Three to five years of experience in mortgage loan origination activities."
    },
    {
      "credential": "Preferred three to five years of experience leading sales and operations teams."
    },
    {
      "credential": "Proficiency in Microsoft Office Suite including Word, Excel, and Outlook applications."
    },
    {
      "credential": "Proficiency in DU/DO, LP, and major Originating systems."
    },
    {
      "credential": "Proficiency with all guidelines and websites necessary to complete job functions, including CFPB, FHA/VA, Rural Housing Development and Fannie Mae and Freddie Mac conventional programs."
    }
  ]
}