{
  "meta": [
    {
      "job_title": "Power BI Data Analyst",
      "job_category": "Data Analyst",
      "job_class": "Analyst",
      "sector": "Data Analytics",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Power BI",
      "experience": 2
    },
    {
      "skill": "Excel",
      "experience": 3
    },
    {
      "skill": "VBA",
      "experience": 3
    },
    {
      "skill": "Power Query",
      "experience": 3
    },
    {
      "skill": "Data Modeling",
      "experience": 3
    },
    {
      "skill": "SQL",
      "experience": 2
    },
    {
      "skill": "Remote Work",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Preparing, manipulating, and staging data from various sources and loading them into Power BI environments."
    },
    {
      "duty": "Creating dashboards and providing consistent Power BI reports."
    },
    {
      "duty": "Translating business needs to technical specifications and collaborating with stakeholders."
    },
    {
      "duty": "Acting as a primary analyst and translating business needs into clearly defined requirements and functional designs."
    },
    {
      "duty": "Developing sound methods to transform data from various sources into viable formats for ingestion into Power BI environments."
    },
    {
      "duty": "Designing, building, publishing, and scheduling Power BI reporting solutions."
    },
    {
      "duty": "Maintaining and supporting data analytics platforms and creating tools to store data."
    },
    {
      "duty": "Creating visualizations and reports for requested projects and updating technical documentation."
    },
    {
      "duty": "Providing monthly administrative reporting on project duration and technical support for specific Power BI needs."
    },
    {
      "duty": "Following quality assurance and control processes, and performing routine data management tasks."
    },
    {
      "duty": "Working as a member of a team or independently with minimal supervision."
    },
    {
      "duty": "Performing other assigned duties."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science degree in Engineering, Information Technology, or related degree. (Master's preferred)"
    }
  ]
}