{
  "meta": [
    {
      "job_title": "Master Data Specialist",
      "job_category": "Data Analysis",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "SAP",
      "experience": 5
    },
    {
      "skill": "ERP/MRP Systems",
      "experience": 5
    },
    {
      "skill": "MS Word, PowerPoint, Outlook, and Excel",
      "experience": 5
    },
    {
      "skill": "cGMP Regulations",
      "experience": 3
    },
    {
      "skill": "Master Data Maintenance",
      "experience": 5
    },
    {
      "skill": "Data Design",
      "experience": 5
    },
    {
      "skill": "Technical Training",
      "experience": 4
    },
    {
      "skill": "Business Process Improvements",
      "experience": 4
    },
    {
      "skill": "Testing Execution",
      "experience": 5
    },
    {
      "skill": "Manufacturing Processes",
      "experience": 5
    },
    {
      "skill": "Global ERP Systems",
      "experience": 5
    },
    {
      "skill": "Business Impact Assessment",
      "experience": 4
    },
    {
      "skill": "Boundary Systems Integration",
      "experience": 4
    },
    {
      "skill": "Risk-Based Testing",
      "experience": 4
    },
    {
      "skill": "Test Script Development",
      "experience": 4
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Project Coordination",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in designing, testing, and maintaining manufacturing data, including, items, specifications, lookups, recipes, routings, formulas, process instructions, and process variables."
    },
    {
      "duty": "Collaborate within the department and with manufacturing, quality control, quality assurance, IT, global master data management, and supply chain organization to determine business requirements for the design of master data."
    },
    {
      "duty": "Translate business requirements into a robust data design which is compliant, efficient, and effective."
    },
    {
      "duty": "Coordinate the testing of master data with peers and internal customers to ensure business requirements are achieved."
    },
    {
      "duty": "Develop and execute cGMP change controls and change requests for master data changes."
    },
    {
      "duty": "Provide department representation on site projects."
    },
    {
      "duty": "Develop and provide technical training to SAP S/4 HANA users."
    },
    {
      "duty": "Maintain an understanding of the manufacturing processes and SAP S/4 HANA."
    },
    {
      "duty": "Provide periodic on-call support to internal customers for emergent system issues."
    },
    {
      "duty": "Troubleshoot routine and complex problems to support internal customers."
    },
    {
      "duty": "Collaborate with site management and IT to develop business requirements for business process improvements within global information systems."
    },
    {
      "duty": "Coordinate with IT and other site departments to maintain supporting technologies that are compliant, efficient, effective, and reliable."
    },
    {
      "duty": "Perform business impact assessment on changes to ERP system, boundary systems, and business processes."
    },
    {
      "duty": "Collaborate with peers, SITE ERP, IT, and validation personnel to develop and prioritize testing of manufacturing-related ERP system and associated boundary systems."
    },
    {
      "duty": "Act as site project coordinator as required for new systems, enhancements to current systems, and/or required regression or other testing coordinated at a global level."
    },
    {
      "duty": "Periodically on-call to provide support to manufacturing and supply chain in case of emergent system issues."
    },
    {
      "duty": "Perform other tasks as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a related field from an accredited college or university required. 5+ years relevant work experience required, preferably in a pharmaceutical manufacturing environment."
    }
  ]
}