{
  "meta": [
    {
      "job_title": "Quality Management Technician",
      "job_category": "Quality Assurance",
      "job_class": "Technician",
      "sector": "Quality Management",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform audits per applicable sampling plans, shipping, converting audits."
    },
    {
      "duty": "Active involvement in data integrity, testing methodology standardize practice system and non-conformance material containment process."
    },
    {
      "duty": "Assist in process capability testing and routine inspection and testing of product."
    },
    {
      "duty": "Effective system-based communication with other Quality Department team members, and Operations."
    },
    {
      "duty": "Daily maintenance and calibration of testing equipment."
    },
    {
      "duty": "Perform aged testing for all departments and project testing for technical."
    },
    {
      "duty": "Help to maintain all quality record documentation including: Internal audit records, management review meeting minutes and charts, calibration records, training records, internal non-conformance’s, customer complaints, vendor non-conformance’s, corrective action reports and meeting action items."
    },
    {
      "duty": "Perform product inspection audits at set intervals at each machine to ensure product being produced meets or exceeds the specified standards."
    },
    {
      "duty": "Create and manage color standards."
    },
    {
      "duty": "Aid in the management of Process Control Plans and Product Spec Sheets. (Quality Windows Software)"
    },
    {
      "duty": "Understand and competently use the measurement tools required: UPC, Verifier, Scales, Ruler, Calipers, Static Meter, Sutherland Rub Tester, etc."
    },
    {
      "duty": "Manage non-conformance Product Procedure and Quality Hold Area."
    },
    {
      "duty": "Provide training on new quality processes and best practices"
    },
    {
      "duty": "Aid in the documentation of R&D projects."
    },
    {
      "duty": "Perform QA laboratory testing as required for specified product lines."
    },
    {
      "duty": "Follow all plant and department specific safety rules, including use of all required personal protective equipment."
    },
    {
      "duty": "Understands ISO or BRC and HAACP or similar principles and assist in facilitating compliance throughout the organization through a variety of activities"
    },
    {
      "duty": "Complies with established safety policies and procedures."
    },
    {
      "duty": "Participates in special projects and performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {}
  ],
  "education_certification": [
    {
      "credential": "Two to four years’ experience or related education.Must be proficient in Microsoft Office.Specific visions abilities include color, close vision, distance, and ability to focus.Must be able to stoop, bend, lift and stand. Use hands to finger, handle."
    }
  ]
}