{
  "meta": [
    {
      "job_title": "Quality Manager",
      "job_category": "Quality Assurance",
      "job_class": "Manager",
      "sector": "Manufacturing",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages quality of a multi-plant consumer products manufacturer with focus on developing and implementing process improvements."
    },
    {
      "duty": "Plans and conducts activities related to sustainable specification conformance at all company's facilities and at strategic partner manufacturing sites."
    },
    {
      "duty": "Plans and conducts activities related to corrective and preventative action and dissemination of information to internal and external stakeholders, and other interested parties."
    },
    {
      "duty": "Creates, curates and executes process, policy, methods and training related to quality assurance, contract manufacturing, customer service, and laboratory activities."
    },
    {
      "duty": "Manages day-to-day activity of Quality Team."
    },
    {
      "duty": "Must understand and demonstrate safe work practices at all times to ensure a safe work environment."
    },
    {
      "duty": "Create, maintain, and publish Quality Key Performance Indicators (KPIs) and dashboard Quality metrics; identify and report trends in data."
    },
    {
      "duty": "Coach, mentor, and lead Quality Team."
    },
    {
      "duty": "General problem-solving, including root cause analysis and corrective action implementation."
    },
    {
      "duty": "Create or revise standard operating procedures (SOPs), work instructions, and control plans to ensure quality of product."
    },
    {
      "duty": "Assist Purchasing with the selection and qualification of vendors and purchase of materials."
    },
    {
      "duty": "Inspection of vendor’s plants to ensure conformity to specifications and adherence to stated manufacturing processes."
    },
    {
      "duty": "Investigate and resolve Customer quality complaints."
    },
    {
      "duty": "Ensure good growing practices maintained."
    },
    {
      "duty": "Support New Product Development activities and the analysis of new or alternative raw materials."
    },
    {
      "duty": "Manage Laboratory activities."
    },
    {
      "duty": "Ensure good laboratory practices maintained."
    },
    {
      "duty": "Monitor, document, and audit test methods and results to ensure that test procedures are accurate and reproducible."
    },
    {
      "duty": "Ensure maintenance, upkeep, cleanliness, and calibration of laboratory equipment."
    },
    {
      "duty": "Report laboratory results of chemical and physical properties, analysis of results, and recommendations."
    },
    {
      "duty": "Measure compliance to specifications."
    },
    {
      "duty": "Manage inspection activities."
    },
    {
      "duty": "Inspection, testing, and approval of incoming raw materials."
    },
    {
      "duty": "Inspection, testing, and approval of finished products."
    },
    {
      "duty": "Develop operator based quality procedures."
    },
    {
      "duty": "Manage inspection activity of Quality Team at external manufacturing locations."
    }
  ],
  "skills": [
    {
      "skill": "Quality Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 5
    },
    {
      "skill": "Corrective and Preventative Action",
      "experience": 5
    },
    {
      "skill": "Manufacturing Specification Conformance",
      "experience": 5
    },
    {
      "skill": "Standard Operating Procedures (SOPs)",
      "experience": 5
    },
    {
      "skill": "Laboratory Management",
      "experience": 5
    },
    {
      "skill": "New Product Development",
      "experience": 5
    },
    {
      "skill": "Vendor Qualification and Management",
      "experience": 5
    },
    {
      "skill": "Customer Complaint Resolution",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science in Microbiology or Organic Chemistry"
    }
  ]
}