{
  "meta": [
    {
      "job_title": "Project Development Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for managing deliverables and delivering projects on time from the business requirement stages through post implementation activities."
    },
    {
      "duty": "Lead the planning and execution of projects to ensure that project goals are accomplished and company objectives are met."
    },
    {
      "duty": "Partners with Product Managers to ensure product’s success."
    },
    {
      "duty": "Gather requirements and develop a business case for project portfolio management, including high-level estimates."
    },
    {
      "duty": "Create project plans; budget, issues list, action items, status reports as well as adhere to internal project methodologies."
    },
    {
      "duty": "Manage, integrate and balance resource requirements across multiple projects without adversely impacting deliverables, timelines or quality."
    },
    {
      "duty": "Lead teams in the design, development, integration and support of software products and systems."
    },
    {
      "duty": "Lead teams to be more T-shaped."
    },
    {
      "duty": "Identify and resolve project issues and risks, including tracking, escalation and mitigation."
    },
    {
      "duty": "Perform ongoing support role with regard to application and system operations and results - includes direct support, problem investigation and/or liaison to other departments to ensure timely problem resolution."
    },
    {
      "duty": "Supervise performance and professional development for technical members of team."
    },
    {
      "duty": "Report project progress to senior management and stakeholders, identifying issues and resolutions."
    },
    {
      "duty": "Manage stakeholder expectations and deliver to them."
    }
  ],
  "skills": [
    {
      "skill": "Project Planning",
      "experience": 5
    },
    {
      "skill": "Project Execution",
      "experience": 7
    },
    {
      "skill": "Resource Management",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    },
    {
      "skill": "Software Development",
      "experience": 7
    },
    {
      "skill": "Stakeholder Management",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Computer Science or equivalent field desired. Agile certification (PMI or Scrum Alliance) preferred."
    }
  ]
}