{
  "meta": [
    {
      "job_title": "Mental Health Clinician",
      "job_category": "Healthcare",
      "job_class": "Clinician",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Completes detailed screens, mental health evaluations and crisis services inclusive of suicide watch assessments within their scope of practice"
    },
    {
      "duty": "Provides clinical direction to lower level worker. May serve as treatment team coordinator"
    },
    {
      "duty": "Conducts advanced practice individual and group clinical interventions as prescribed on the individual mental health treatment plan, using clinical intervention strategies within their scope of practice and directed by supervisor"
    },
    {
      "duty": "Provides clinical case management services to an assigned caseload, including the monitoring of the offender compliance with the mental health treatment plan"
    },
    {
      "duty": "Completes psychosocial needs and treatment assessments as part of interdisciplinary treatment planning"
    },
    {
      "duty": "Completes transfer and discharge summaries"
    },
    {
      "duty": "Consults with other institution staff regarding the mental health caseload inmate’s institutional adjustment and service needs"
    },
    {
      "duty": "Initiates and maintains contact with families and community agencies"
    },
    {
      "duty": "Provides and seeks information relative to patient care and treatment"
    },
    {
      "duty": "Makes appropriate community and re-reentry referrals, per mental health treatment team"
    },
    {
      "duty": "Writes reports or documentation to include documentation of all inmate contacts, clinical case management progress note entries, discharge plans and miscellaneous forms and reports as needed per policy and protocol"
    },
    {
      "duty": "Attends meetings with supervision"
    },
    {
      "duty": "Attends in-service training sessions and workshops for professional development"
    },
    {
      "duty": "Participates in peer review as assigned"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Licensed Independent Social Worker (LISW) by Ohio Counselor, Social Work, Marriage & Family Therapy Board. Or Licensed Professional Clinical Counselor (LPCC) by Ohio Counselor, Social Work, Marriage & Family Therapy Board."
    }
  ]
}