{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Financial Services",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain professional relationships with clients, agency personnel, and company staff via prompt, courteous, knowledgeable, and accurate service."
    },
    {
      "duty": "Answer client inquiries as needed relating to their policies, such as account status, coverage, and premium information."
    },
    {
      "duty": "Receive and process client requests via telephone, mail or walk-in to include completing paperwork, entering and updating account information on insureds’ risk file, requesting endorsements, completing RMV paperwork, and confirming vehicles registered."
    },
    {
      "duty": "Complete applications for new business and submit to the companies for processing within 24-48 hours of writing the policy."
    },
    {
      "duty": "Create new risk files via computer and enter insureds’ policy and coverage data. Enter follow-up to track new business or change rate class (date first licensed)."
    },
    {
      "duty": "Maintain contact with clients so their renewal policies reflect current values and their coverage is broadened where applicable. Send renewal letter with each policy advising recommendations including liability or deductible, etc. Add VRC."
    },
    {
      "duty": "Market accounts when sending home renewals, no auto, no VRC, no umb, INC OBI etc."
    },
    {
      "duty": "Understand and support the company’s sales policies and procedures so as to provide proper and effective service for clients."
    },
    {
      "duty": "Document all contact with clients in traxlog and gather expiration dates, account sell and to acquire information as to their insurance needs."
    },
    {
      "duty": "Follow expiration lists to assure policy renewal. Provide Processing Department with declaration if system needs to be updated."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 20,
      "student_teacher": 30,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or general education degree (GED) and two to three years related experience and/or training; or equivalent combination of education and experience. Minimum of 3 years Personal Lines experience required. Excellent Microsoft applications skills (Word, Excel, Access, and PowerPoint) and excellent verbal and written communication skills are essential. Ability to perform effectively in an environment where confidentiality, maturity, sound judgment, initiative, and professionalism are required. Experience with Epic System an asset."
    }
  ]
}