{
  "meta": [
    {
      "job_title": "Inventory Control Manager",
      "job_class": "Manager",
      "sector": "Inventory Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "ERP System Management",
      "experience": 5
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 5
    },
    {
      "skill": "Cross-Functional Leadership",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Inventory Analysis",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Overseeing & maintaining Inventory Management System within BAAN & LN platform; as well as, abiding by RPM’s Audit standards and requirements."
    },
    {
      "duty": "Create & set any necessary controls to secure an efficient inventory process and maintain required set controls through training and internal audits."
    },
    {
      "duty": "Manages all cycle-counting and full inventory functions at all manufacturing and warehouse locations. Reports out to Finance and auditors on all results."
    },
    {
      "duty": "Works closely with Manufacturing to review daily inventory transactions to ensure proper utilization of the ERP system and production orders are managed properly to reduce variances."
    },
    {
      "duty": "Responsible for inventory analysis to identify slow moving inventory and expired inventory situations and work with Sales and Distribution on proper processes to address."
    },
    {
      "duty": "Directly oversee all Rework & Return inventory manage all rework inventory."
    },
    {
      "duty": "Cross functionally works with Finance, Purchasing, Planning, Logistics and Accounting to ensure inventory is accurately handled within all areas."
    },
    {
      "duty": "Identifies issues within our various processes that lead to issues with inventory accuracy and works with stake holders to create procedures and protocols to address the issues and improve our inventory performance."
    },
    {
      "duty": "Works closely with Finance to ensure that the P&L impact of all inventory transactions is understood and managed properly."
    },
    {
      "duty": "Responsible to report out on all inventory metrics for all Continuous Improvement meetings and data submissions."
    },
    {
      "duty": "Confer with management and general staff to implement plans and recommendations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Supply Chain Management, Business Administration, or a related field (Master's preferred)"
    }
  ]
}