{
  "meta": [
    {
      "job_title": "Project Manager II",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Pharmaceutical",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Pharmaceutical Project Management",
      "experience": 5
    },
    {
      "skill": "Cross-functional Coordination",
      "experience": 5
    },
    {
      "skill": "Comprehensive Documentation",
      "experience": 5
    },
    {
      "skill": "Meeting Leadership",
      "experience": 5
    },
    {
      "skill": "Accountability for Excellence",
      "experience": 5
    },
    {
      "skill": "Project Direction",
      "experience": 5
    },
    {
      "skill": "Routing Process Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Expertise",
      "experience": 5
    },
    {
      "skill": "Resource Coordination",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    },
    {
      "skill": "Interactive Project Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Acumen",
      "experience": 5
    },
    {
      "skill": "Communication Proficiency",
      "experience": 5
    },
    {
      "skill": "Documentation Excellence",
      "experience": 5
    },
    {
      "skill": "Leadership Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the end-to-end project management of interactive projects within the pharmaceutical sector, ensuring adherence to industry regulations and standards."
    },
    {
      "duty": "Serve as a pivotal liaison between technical and creative teams, fostering effective communication and collaboration while maintaining a deep understanding of pharmaceutical requirements."
    },
    {
      "duty": "Prepare and maintain meticulous project documentation, including job summaries, Statements of Work (SOWs), and detailed project schedules compliant with pharmaceutical standards."
    },
    {
      "duty": "Lead all production-related meetings for pharmaceutical interactive projects under your purview, including project assessment meetings and regulatory compliance discussions."
    },
    {
      "duty": "Assume ultimate responsibility for on-time project delivery, precision, and alignment with pharmaceutical project strategies, ensuring compliance with regulatory requirements."
    },
    {
      "duty": "Effectively manage project changes and provide day-to-day direction, ensuring seamless workflow within the pharmaceutical agency."
    },
    {
      "duty": "Implement and oversee the routing process, conducting dynamic audits of reviewers' lists based on project stage and regulatory needs."
    },
    {
      "duty": "Possess a deep understanding of pharmaceutical regulatory processes, and ensure that all projects are prepared and compliant with necessary regulations, such as the ZINC process."
    },
    {
      "duty": "Collaborate closely with studio, programming, and creative leads to coordinate pharmaceutical resources effectively, guaranteeing project success."
    },
    {
      "duty": "Proactively provide information to pharmaceutical clients, monitor project progress, and produce change orders as required, maintaining transparency and client satisfaction."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 110,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Project Management, Business, or a related field (Master's preferred)"
    }
  ]
}