{
  "meta": [
    {
      "job_title": "Venture Capital Researcher",
      "job_category": "Research",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Report Writing",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Industry Trend Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Utilize research tools to identify and analyze venture capital firms, investment strategies, portfolio companies, team members, and track records."
    },
    {
      "duty": "Conduct in-depth research on industry trends, market opportunities, and emerging sectors for investment focus."
    },
    {
      "duty": "Collaborate with business development team to curate and maintain a database of prospective venture capital firms for future outreach."
    },
    {
      "duty": "Synthesize and present findings through comprehensive reports, summaries, and visualizations to support decision-making processes."
    },
    {
      "duty": "Monitor and track VC firm activities, funding rounds, exits, and industry partnerships for accurate and up-to-date information."
    },
    {
      "duty": "Maintain understanding of startup ecosystem, technology landscape, and macroeconomic trends to provide valuable insights."
    },
    {
      "duty": "Identify and recommend potential partnership opportunities between startups and VC firms based on thorough analysis."
    },
    {
      "duty": "Participate in team meetings to share insights and contribute to the refinement of research methodologies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, Economics, or related field (Master's or CFA designation is a plus)"
    }
  ]
}