{
  "meta": [
    {
      "job_title": "Public Health Consultant",
      "job_category": "Consulting",
      "job_class": "Consultant",
      "sector": "Public Health",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute on multiple projects concurrently, developing project deliverables, participating in client-facing meetings, and collaborating with the project team and leadership to ensure client success."
    },
    {
      "duty": "Develop grant proposals for clients, including identifying potential collaborators, defining roles and contributions, facilitate meetings with applicant organizations and collaborators, and developing work plans and budgets."
    },
    {
      "duty": "Work with healthcare providers to deepen their understanding of the opportunities available to them as partners in public health solutions and funding opportunities."
    },
    {
      "duty": "Lead needs assessments and gap analyses, including data acquisition and analysis, in line with public health approaches such as MAPP (Mobilizing for Action through Planning and Partnerships)."
    },
    {
      "duty": "Facilitate community engagement initiatives, including key stakeholder interviews, community forums, advisory committees, and similar efforts."
    },
    {
      "duty": "Develop client presentations, present to clients during meetings, and facilitate activities such as brainstorming and visioning."
    },
    {
      "duty": "Collaborate with internal teams and clients to develop strategic plans, feasibility studies, and similar deliverables."
    },
    {
      "duty": "Conduct research relevant to project needs and synthesize results for internal team and client-facing materials."
    },
    {
      "duty": "Maintain a flexible approach and pivot as project and client needs change throughout the engagement."
    },
    {
      "duty": "Develop proposals in response to Requests for Proposal (RFPs) to bring in new business to the company."
    },
    {
      "duty": "Perform duties as assigned by leadership."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in public health, healthcare administration, or similar field."
    },
    {
      "credential": "Strong writing skills required."
    },
    {
      "credential": "Prior grant and/or proposal writing experience strongly preferred."
    },
    {
      "credential": "Prior client-facing experience preferred."
    },
    {
      "credential": "Professional and friendly demeanor."
    },
    {
      "credential": "Exceptional verbal and written communication skills, including ability to develop PowerPoint presentations, Excel-based analyses, reports, and other relevant materials."
    }
  ]
}