{
  "meta": [
    {
      "job_title": "Analyst, Strategy & Portfolio Innovation",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Market Intelligence",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "MS Excel",
      "experience": 5
    },
    {
      "skill": "MS BI",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate the organization's strategic plans to ensure the continued successful growth and profitability of the Built Environment Customer Operating Unit."
    },
    {
      "duty": "Research organizational positioning, conduct environmental scans, and perform financial analysis to support business and strategic planning."
    },
    {
      "duty": "Identify and evaluate acquisitions, divestitures, and organic business opportunities in line with the organization's long-range goals."
    },
    {
      "duty": "Monitor market intelligence, market research, and knowledge management."
    },
    {
      "duty": "Support strategy, business development, and corporate initiatives by collaborating with business lines across Regional and Functional areas."
    },
    {
      "duty": "Communicate and generate support for recommendations among business leaders across the organization."
    },
    {
      "duty": "Conduct industry, market, competitive, and stakeholder intelligence research and analyses."
    },
    {
      "duty": "Work with leadership on the management of overall business strategy and long-range planning activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "University degree (Equivalent to a U.S. Bachelor’s degree) in Business Administration, Finance, Management, or related field plus generally 5 plus years of related experience. Master’s degree is a strong plus."
    }
  ]
}