{
  "meta": [
    {
      "job_title": "Packaging Engineer II",
      "job_category": "Engineering",
      "job_class": "Specialist",
      "sector": "Medical Device",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Packaging Knowledge",
      "experience": 5
    },
    {
      "skill": "Supporting and documentation",
      "experience": 5
    },
    {
      "skill": "MS Office",
      "experience": 5
    },
    {
      "skill": "Excellent communication skills and documentation practices",
      "experience": 5
    },
    {
      "skill": "Graphics changes and approvals",
      "experience": 5
    },
    {
      "skill": "Developing and writing specifications for purchase and approval of all packaging components",
      "experience": 5
    },
    {
      "skill": "Technical proficiency and creativity, collaboration with others and independent thought in suggesting new methods, processes, etc.",
      "experience": 5
    },
    {
      "skill": "One Vault experience",
      "experience": 5
    },
    {
      "skill": "Trackwise",
      "experience": 5
    },
    {
      "skill": "GMP Experience",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the packaging engineers in the development, implementation, and post-launch support of the graphics, labeling, packaging, handling, storage, and delivery of Medical Device and Biologic finished goods."
    },
    {
      "duty": "Create packaging/labeling component specifications and work with suppliers to develop and write specifications for purchase and approval of all packaging components to ensure uniformity and compliance."
    },
    {
      "duty": "Provide documentation support per manufacturing and change management requirements."
    },
    {
      "duty": "Manage on-demand label development activities and facilitate label approval process across departments."
    },
    {
      "duty": "Responsible for graphic changes working with Regulatory Affairs, Quality, Procurement, graphics vendors, and Manufacturing to implement new and revised labeling, components, specifications, and associated quality documentation."
    },
    {
      "duty": "Collaborate with others and provide independent thought in suggesting new methods, processes, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "BS in Packaging Engineering or related degree"
    }
  ]
}