{
  "meta": [
    {
      "job_title": "Operations Support Specialist",
      "job_category": "Operations",
      "job_class": "Support Specialist",
      "sector": "Operations",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in an administrative capacity for operational excellence initiatives to elevate the business and meet or exceed plant and company goals."
    },
    {
      "duty": "Assist the Operations team in streamlining collaboration by setting up meeting spaces, scheduling meetings, attending meetings, and taking minutes, summarizing, and updating the team, and following up on action items as required."
    },
    {
      "duty": "Create and perform administrative upkeep of various documents for the team, such as department rosters, organization charts, department forms, contact lists, written instructions, process and procedures, department sites, Microsoft Team channel, etc."
    },
    {
      "duty": "Communicate to Employees: Prepare documents, announcements, or other communications for dissemination to employees. Distribute communications as needed. Maintain the electronic communication boards and bulletin boards at each facility on a daily/weekly basis, as needed."
    },
    {
      "duty": "Organize team events by generating ideas with the team, reaching out and working with different vendors, quoting, coordinating, scheduling, physically setting up spaces, and acquiring necessary supplies and materials."
    },
    {
      "duty": "Create, change, and maintain BOMs, routings, master recipes, master data sheets, etc. in SAP. Collect and input data and generate required weekly and monthly reporting."
    },
    {
      "duty": "Handle miscellaneous and special tasks/projects as needed."
    }
  ],
  "skills": [
    {
      "skill": "Administrative Experience",
      "experience": 1
    },
    {
      "skill": "Microsoft Office Products",
      "experience": 5
    },
    {
      "skill": "SAP, UKG, Smartsheet",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Adaptability & Flexibility",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Self-Management",
      "experience": 5
    },
    {
      "skill": "Dependability & Reliability",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business or related field"
    }
  ]
}