{
  "meta": [
    {
      "job_title": "Sr. Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Food Safety",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Food Safety Supplier Management",
      "experience": 5
    },
    {
      "skill": "Strategic Leadership",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Food Safety Systems and Processes",
      "experience": 5
    },
    {
      "skill": "HACCP Knowledge",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and communicate Supplier Management strategic vision to manage risk and protect the brand with science-based approach via the Product Design Hazard Analysis (PDHA) process/desk audit and onsite assessment."
    },
    {
      "duty": "Responsible for implementing Supplier Management Standards for the assigned category. Work closely with the suppliers and the supply team. Ensuring supplier verification programs and parameters critical to food safety and associated regulatory compliance are appropriate and managing Supplier CAPAs."
    },
    {
      "duty": "Develop strategy, specifications, process and conduct internal, external audits, process validations review and risk assessment for higher risk product suppliers within assigned category."
    },
    {
      "duty": "Supporting the supplier onboarding process, launch of new products, and reformulations by providing technical consultation to internal stakeholders for qualifying new, and existing suppliers within the assigned category."
    },
    {
      "duty": "Managing supplier recalls internally with key stakeholders and externally liaising with Federal and State agencies."
    },
    {
      "duty": "Manage Food Safety related Complaints, investigations, and corrective actions from both customers, regulatory bodies, and stores."
    },
    {
      "duty": "Reviews, monitors, and measures supplier food safety key performance indicators (KPI) by understanding food safety standards; determining appropriate action steps to ensure compliance as well as proactively predicting potential risks and developing mitigation alternatives."
    },
    {
      "duty": "Facilitates engagement and appropriate communications with cross-functional teams (including Ethics & Compliance, Legal, Internal Audit, and key business stakeholders) to ensure a transparent and comprehensive compliance strategy consistent with business objectives."
    },
    {
      "duty": "Supports communication efforts to ensure leadership understanding of Food Safety risks."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree in Food Science, Microbiology or Chemical Engineering (Master's preferred)"
    }
  ]
}