{
  "meta": [
    {
      "job_title": "Brand Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure the crafting of a solid, fact-based, multi-year strategic vision and brand development framework to guide growth of a portfolio of international brands through the successful execution of business plans to meet business expectations and KPI’s for these brands."
    },
    {
      "duty": "Work closely with cross-functional teams as well as commercial partners to guarantee brand integrity guiding efforts across multiple channels and geographies."
    },
    {
      "duty": "Create innovative marketing plans and work with the Sales team in developing commercial plans suitable for all regions and types of trade, set and manage budgets, define volume growth, manage monthly forecasting, and encourage optimal execution of all brand initiatives observing uniformity across regions and customers to strengthen our client’s brand identity."
    },
    {
      "duty": "Be the brand champion and expert while ensuring our brands’ integrity in all aspects, from financial and thorough understanding of a brand P&L to the disciplined of building strong and positive relations within the organization and with our business partners."
    },
    {
      "duty": "Contribute to the generation of the annual brand planning process as part of the overall company and commercial planning process."
    },
    {
      "duty": "Has full understanding of the S&OP process and all the variables included in this monthly process from a brand perspective, collaborates with procurement and sales in the monthly revision of the sales forecast and inventory management processes."
    },
    {
      "duty": "Lead the development of strategies and objectives for building and executing year-round brand engagement through partnerships, social media, fan conventions, events, and other marketing vehicles."
    },
    {
      "duty": "Utilize category, customer, and consumer insights to identify growth opportunities and drive innovation in product development as well as brand initiatives."
    },
    {
      "duty": "Collaborate with sales team on the creation of specific strategies for clients."
    },
    {
      "duty": "Represent the company and provide support as needed at various trade shows and conventions."
    },
    {
      "duty": "Prepare and present reporting and presentations to the management and stakeholders through proper measurement of the business unit activities."
    },
    {
      "duty": "Monitor product catalog compliance working with regulatory and legal areas."
    },
    {
      "duty": "Ensure team is within brand budget and adhering to brand objectives and strategies."
    },
    {
      "duty": "Support as needed on the monthly report of open funds to maximize brand spend for reinvestment."
    },
    {
      "duty": "Perform other duties as necessary to support the company’s objectives."
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or related field (Master's preferred)"
    }
  ]
}