{
  "meta": [
    {
      "job_title": "Teller/Customer Service Rep",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Financial Services",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Cash Handling",
      "experience": 2
    },
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Banking",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Detail Oriented",
      "experience": 2
    },
    {
      "skill": "Computer Literacy",
      "experience": 2
    },
    {
      "skill": "Teamwork",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Process customer financial transactions, open new accounts, and prepare required documents."
    },
    {
      "duty": "Answer inquiries and provide information in person, by telephone, and by mail on various accounts and bank services."
    },
    {
      "duty": "Assist in achieving branch sales goals by actively selling bank products and promoting new business."
    },
    {
      "duty": "Develop and expand client relationships by identifying client needs and cross-selling bank products."
    },
    {
      "duty": "Balance cash drawer, service customer accounts, and execute account servicing requests."
    },
    {
      "duty": "Execute changes of address, ATM claims, and all other account servicing requests."
    },
    {
      "duty": "Provide exceptional customer experience by utilizing Bank service standards."
    },
    {
      "duty": "Perform special projects and additional duties as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent. Retail sales, customer service, cash handling experience preferred."
    },
    {
      "credential": "OR Minimum of one (1) year of experience in a process-driven role handling credit or financial transactions such as; billing analyst at a medical facility, auto dealership, insurance practice or other comparable experience."
    },
    {
      "credential": "Computer literate with general proficiency in an application such as; billing, invoicing, cash management or other workflow application."
    },
    {
      "credential": "Customer service focused, detail oriented, demonstrated multitasking skills, strong communication skills, critical thinking skills, ability to work well in a team environment."
    }
  ]
}