{
  "meta": [
    {
      "job_title": "Software Engineer - Intern",
      "job_category": "Software Engineering",
      "job_class": "Intern",
      "sector": "Software Engineering",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "JavaScript",
      "experience": 2
    },
    {
      "skill": "HTML/CSS",
      "experience": 2
    },
    {
      "skill": "Angular",
      "experience": 2
    },
    {
      "skill": "Node.js",
      "experience": 2
    },
    {
      "skill": "Java",
      "experience": 2
    },
    {
      "skill": "PHP",
      "experience": 2
    },
    {
      "skill": "Scala",
      "experience": 2
    },
    {
      "skill": "SQL",
      "experience": 2
    },
    {
      "skill": "MySQL",
      "experience": 2
    },
    {
      "skill": "Software Development",
      "experience": 2
    },
    {
      "skill": "Full-Stack Development",
      "experience": 2
    },
    {
      "skill": "Containerization",
      "experience": 2
    },
    {
      "skill": "Agile Methodologies",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Building systems to help customers understand and respond to experience data provided by their customers or employees."
    },
    {
      "duty": "Designing systems in an agile environment to withstand hyper growth and owning quality from end to end."
    },
    {
      "duty": "Creating trust in customers and teams through thorough communication and showing scrappiness in getting things done."
    },
    {
      "duty": "Partnering with managers, cross-functional teams, and teammates to work well in teams."
    },
    {
      "duty": "Taking an analytical mindset to approach problems and find solutions."
    },
    {
      "duty": "Learning to build scalable, fast, robust, and simple SaaS solutions and implementing new functionality from provided requirements and specifications."
    },
    {
      "duty": "Developing familiarity with containerization and full-stack development."
    },
    {
      "duty": "Working with other engineers, tech-ops, and product managers to learn Agile methodologies and prioritize tasks to deliver value to customers."
    },
    {
      "duty": "Owning a project that pushes the candidate out of their comfort zone and leads to meaningful growth."
    },
    {
      "duty": "Designing distributed, low latency services for ingesting, processing, and aggregating data."
    },
    {
      "duty": "Building integrations with SaaS leaders and creating analytics that identify trends and sentiment in free-form text data."
    },
    {
      "duty": "Developing integrated ticketing platforms and world-class survey editing and survey taking experiences."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 85,
      "student_teacher": 75,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Currently studying for a degree in Computer Science, Software Engineering, or Computer Engineering"
    }
  ]
}