{
  "meta": [
    {
      "job_title": "Ship Clerk",
      "job_category": "Logistics",
      "job_class": "Clerk",
      "sector": "Logistics",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Microsoft Office",
      "experience": 1
    },
    {
      "skill": "Load Planning",
      "experience": 1
    },
    {
      "skill": "Shipping Software",
      "experience": 1
    },
    {
      "skill": "Troubleshooting",
      "experience": 1
    },
    {
      "skill": "Communication",
      "experience": 1
    },
    {
      "skill": "Safety Measures",
      "experience": 1
    },
    {
      "skill": "Data Analysis",
      "experience": 1
    },
    {
      "skill": "Team Leadership",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Correspond with multiple shipping companies and their contacts to coordinate the shipping and tracking of packages."
    },
    {
      "duty": "Coordinate trailers to corresponding dock doors and cross docks using SSP (Shipping and Shipment Planning) software."
    },
    {
      "duty": "Troubleshoot shipping problems and errors to resolution to ensure smooth transportation processes."
    },
    {
      "duty": "Ensure trailer utilization is maximized to control transportation costs and maintain on-time dock performance."
    },
    {
      "duty": "Assist in updating Staging POD 5s and resource allocation, and oversee Load Flow Control for the building."
    },
    {
      "duty": "Maintain load level performance tracking for load planning, on-time dock performance, utilization, and misloads."
    },
    {
      "duty": "Coordinate with Transportation teams on Driver issues, Trailer Pool needs, Yard Move Delays, Late Inbound volume, and Load Swaps to protect customer experience."
    },
    {
      "duty": "Ensure comprehensive understanding of shipping requirements, rules, and obligations by carrier, destination, and package type to ensure compliance and efficiency."
    },
    {
      "duty": "Ensure all safety measures and precautions are in place and being used regarding the docks and trailers, and assist in training associates on SOP compliance."
    },
    {
      "duty": "Participate in safety initiatives and refer all job injuries or safety violations immediately to the Area Manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school or equivalent diploma"
    }
  ]
}