{
  "meta": [
    {
      "job_title": "Business Technology QA CoE Lead",
      "job_category": "Technology",
      "job_class": "Lead",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Quality Assurance",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "DevOps",
      "experience": 8
    },
    {
      "skill": "Test Automation",
      "experience": 8
    },
    {
      "skill": "Agile Methodology",
      "experience": 8
    },
    {
      "skill": "AI and Machine Learning",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with stakeholders to tailor QA processes to specific needs and proactively identify project risks related to quality."
    },
    {
      "duty": "Champion and promote the understanding of the latest trends, technologies, and advancements in QA and software testing."
    },
    {
      "duty": "Establish and evaluate Objectives & Key Results (OKRs) and performance metrics for QA initiatives, providing regular reports to stakeholders."
    },
    {
      "duty": "Provide leadership and direction to multiple teams through senior managers, developing mid to long-term plans to execute strategies in Quality Assurance."
    },
    {
      "duty": "Define and implement the overall QA vision, frameworks, and processes to ensure the effective delivery of high-quality software products and solutions."
    },
    {
      "duty": "Manage quality platforms and tools, migrate testing processes from legacy mindsets to automated practices, and drive the adoption of QA methodologies and tools through training and support."
    },
    {
      "duty": "Validate compliance with architecture and integration standards set by the Enterprise Architecture and Integration CoE groups."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Systems, or Computer Engineering (Master's may be required at higher levels)"
    }
  ]
}