{
  "meta": [
    {
      "job_title": "Controller",
      "job_category": "Accounting",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct day to day accounting, including account reconciliations, general ledger, accounts payable, deposits, payroll, etc."
    },
    {
      "duty": "Prepare: o Period end financial statements in accordance with GAAP o Period end balance sheet account reconciliations o Period end bank account reconciliations o Other period end items that support the growth and needs of the business"
    },
    {
      "duty": "Establish, monitor and maintain accounting policies and procedures and internal controls to safeguard assets, achieve objectives, and ensure the integrity of financial data."
    },
    {
      "duty": "Work with the Chief Financial Officer to guide the development and management of budgets, monitor performance against budget and forecast and manage cash flow."
    },
    {
      "duty": "Support annual financial audit. Work with external auditors to ensure timely and accurate completion of financial audit."
    },
    {
      "duty": "Support annual corporate tax filings. Work with tax preparer to ensure timely and accurate completion of corporate tax filings."
    },
    {
      "duty": "Prepare sales tax filings, property tax filings and other regulatory related filings."
    },
    {
      "duty": "Assist senior management in various ad-hoc analyses."
    },
    {
      "duty": "Complete and/or assist in other monthly tasks and projects as needed."
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 7
    },
    {
      "skill": "Financial Management",
      "experience": 7
    },
    {
      "skill": "Budgeting",
      "experience": 7
    },
    {
      "skill": "Tax Compliance",
      "experience": 7
    },
    {
      "skill": "Financial Reporting",
      "experience": 7
    },
    {
      "skill": "Internal Controls",
      "experience": 7
    },
    {
      "skill": "GAAP",
      "experience": 7
    },
    {
      "skill": "Payroll Management",
      "experience": 7
    }
  ],
  "education_certification": [
    {
      "credential": "BS/BA in accounting or finance"
    },
    {
      "credential": "CPA preferred"
    }
  ]
}