{
  "meta": [
    {
      "job_title": "Senior Manager",
      "job_category": "Management",
      "job_class": "Senior Manager",
      "sector": "Management",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Data Science",
      "experience": 10
    },
    {
      "skill": "Machine Learning",
      "experience": 10
    },
    {
      "skill": "Python",
      "experience": 10
    },
    {
      "skill": "R Programming",
      "experience": 10
    },
    {
      "skill": "Data Visualization",
      "experience": 10
    },
    {
      "skill": "Business Acumen",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Thinking",
      "experience": 10
    },
    {
      "skill": "Communication",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage a team of data analysts, data scientists, and business intelligence professionals, providing guidance, mentorship, and performance management."
    },
    {
      "duty": "Collaborate with clients, consultants, and stakeholders to understand business objectives and identify opportunities for leveraging data intelligence to drive strategic decision making and operational efficiencies."
    },
    {
      "duty": "Develop and execute comprehensive data strategies, including data collection, storage, processing, and analysis, to enable effective data-driven insights and solutions."
    },
    {
      "duty": "Oversee the design, development, and implementation of advanced analytics models, predictive models, machine learning algorithms, and data visualization techniques to extract insights and drive actionable outcomes."
    },
    {
      "duty": "Guide the team in utilizing advanced analytics tools and platforms, such as Python, R, SQL, and machine learning libraries, to perform complex data analysis and modeling."
    },
    {
      "duty": "Stay up-to-date with emerging trends and advancements in data intelligence, artificial intelligence, machine learning, and big data technologies, and apply them to solve complex business challenges."
    },
    {
      "duty": "Collaborate with technical teams to ensure data integration, data governance, and data quality standards are met throughout the project lifecycle."
    },
    {
      "duty": "Work closely with business development and consulting teams to identify new business opportunities, develop proposals, and deliver client presentations."
    },
    {
      "duty": "Provide strategic guidance to clients on data-driven decision making, data governance, and best practices in data intelligence."
    },
    {
      "duty": "Develop and maintain strong relationships with clients, acting as a trusted advisor and thought leader in data intelligence."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Computer Science, Data Science, Statistics, or a related field"
    }
  ]
}