{
  "meta": [
    {
      "job_title": "Associate Inside Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Solution Selling",
      "experience": 5
    },
    {
      "skill": "Territory Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Sales Performance Analysis",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Meet and exceed overall sales objectives within the assigned geography."
    },
    {
      "duty": "Successfully launch new product and service offerings."
    },
    {
      "duty": "Effectively balance a broad portfolio to ensure sales opportunities to achieve territory and business needs."
    },
    {
      "duty": "Consistently demonstrate Solution Selling capabilities and build effective relationships with customers."
    },
    {
      "duty": "Develop and execute an annual Territory Business Plan that leverages industry insights, strategies, and tactics."
    },
    {
      "duty": "Utilize Zoetis resources to maximize ROI and identify account growth opportunities."
    },
    {
      "duty": "Work with all Zoetis colleagues in a professional manner and conduct quarterly business reviews with managers."
    },
    {
      "duty": "Ability to work in cross-functional team-based environments and through a variety of platforms."
    },
    {
      "duty": "Successfully complete extensive product and industry Learning and Development curriculum developed by Zoetis and exhibit willingness to accept and incorporate feedback."
    },
    {
      "duty": "Exhibit through and attention to detail, manage assigned expense budgets, and contribute strategically to sales performance."
    },
    {
      "duty": "Customer focused, articulate complex concepts, maintain professional demeanor and presentation style, and manage goals and priorities effectively."
    },
    {
      "duty": "Demonstrated ability to work independently and in a close team environment."
    },
    {
      "duty": "Computer skills including MS Office, Outlook, and ability to learn Zoetis systems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree (BS/BA) preferred; Associate degree required."
    }
  ]
}