{
  "meta": [
    {
      "job_title": "Production Associate",
      "job_category": "Manufacturing",
      "job_class": "Associate",
      "sector": "Manufacturing",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Manufacturing",
      "experience": 2
    },
    {
      "skill": "Product Packaging",
      "experience": 2
    },
    {
      "skill": "Quality Control",
      "experience": 2
    },
    {
      "skill": "Basic Math",
      "experience": 2
    },
    {
      "skill": "Team Collaboration",
      "experience": 2
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 2
    },
    {
      "skill": "Good Manufacturing Practices (GMP)",
      "experience": 2
    },
    {
      "skill": "Safety Protocols",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manufacturing and packaging of medical device instruments and components while maintaining product quality and optimal product flow."
    },
    {
      "duty": "Sorting, basic plastic assembly, tapering/dressing, labeling, wire wrapping, wire cutting, splitting, stripping, swaging, welding, winging, looping, complex assemblies, grinding, and polishing."
    },
    {
      "duty": "Following written procedures and verbal instruction for the assigned production operations required in the manufacturing and packaging of medical devices."
    },
    {
      "duty": "Inspecting work to ensure parts comply with specifications using basic hand tools and measuring/test equipment."
    },
    {
      "duty": "Documenting work which may require basic math, attention to detail, and accuracy in information being recorded."
    },
    {
      "duty": "Participating in cross-training programs as required by Team Captain/Coordinator."
    },
    {
      "duty": "Upholding established lean manufacturing principles and tools used on the production floor."
    },
    {
      "duty": "Adhering to the established Quality System Policies and procedures as instructed in the training process."
    },
    {
      "duty": "Following Good Manufacturing and Documentation practices (GMP, GDP)."
    },
    {
      "duty": "Following all safety protocols, housekeeping, utilizing appropriate safety equipment and PPE. Reporting safety issues and improvements proactively to Team Captain or direct supervisor."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED required"
    }
  ]
}