{
  "meta": [
    {
      "job_title": "General Laborer",
      "job_category": "General Labor",
      "job_class": "Laborer",
      "sector": "Manual Labor",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Perform a wide variety of duties in general manual laborer work including the clean-up of all plants, offices, yards and quarries, which includes repetitive heavy lifting, shoveling, hand work, climbing and performing work at different heights."
    },
    {
      "duty": "Assist in equipment operation and servicing using basic tools such as shovels, brooms, wheelbarrows, etc."
    },
    {
      "duty": "Comply with company, state and governmental environmental, health and safety regulations, policies and procedures at all times."
    },
    {
      "duty": "Perform pre-shift inspections and document them."
    },
    {
      "duty": "Operate the plant within its means to help minimize issues that could occur from break downs and plug up."
    },
    {
      "duty": "Be physically capable of accessing all plant locations and perform all tasks in a timely and efficient manner."
    },
    {
      "duty": "Perform other duties as assigned."
    },
    {
      "duty": "Must comply with company, state and governmental environmental, health and safety regulations, policies and procedures at all times."
    },
    {
      "duty": "Cleans and disposes of waste materials, debris, residue from, on top of, and out of offices, lime houses, roofs, venture scrubbing systems, basements, silos, bins, storage areas, kilns, mills, screen and screen areas, grates, under conveyor belts and between rollers, crushers, catwalks, tail pulley, rail cars, tankers truck paths, rail tracks, driveways, and all yard areas including the quarries and maintenance areas."
    },
    {
      "duty": "Fill in or operate any equipment and assist operators as assigned."
    },
    {
      "duty": "Operate forklift and / or skid steer both safely and efficiently."
    },
    {
      "duty": "Perform all duties assigned regarding the operation of a vacuum truck."
    },
    {
      "duty": "Report any potential operational or safety problem to supervisor."
    },
    {
      "duty": "Tell Management about any safety hazards, repairs, or help that is needed to operate the plant in a safe and efficient manner."
    },
    {
      "duty": "Operate the plant within its means to help minimize issues that could occur from break downs and plug up."
    },
    {
      "duty": "Must be capable of working any shift, overtime, be on-call, or work seven days a week, if needed."
    },
    {
      "duty": "Must possess the basic reading and math skills."
    },
    {
      "duty": "Must have good written and verbal communication skills."
    },
    {
      "duty": "Must possess basic computer skills on how to use MS Office products and SAP."
    },
    {
      "duty": "Strong record of attendance reliability."
    },
    {
      "duty": "Must know, understand and observe all department and plant safety rules and maintain a high level of housekeeping in assigned work areas."
    },
    {
      "duty": "Must be physically able to perform work assigned."
    },
    {
      "duty": "Access all areas within a site which could include heights of 120 feet."
    },
    {
      "duty": "Perform all tasks in a timely and efficient manner."
    },
    {
      "duty": "Perform other duties as assigned."
    },
    {
      "duty": "Will be working at times in covered environment but mainly in a lime/mineral environment."
    },
    {
      "duty": "The employee will be exposed to the following working conditions: Extreme Heat and Cold, Noise, Vibration, Oils, and Atmospheric Conditions such as Dust, Fumes, and Lime/Mineral Particles."
    },
    {
      "duty": "The employee will be required to perform the following actions (from time to time): Standing, walking, balancing, stooping, kneeling, reaching, talking, seeing, hearing and sitting."
    },
    {
      "duty": "Ability to frequently lift/carry 50 pounds."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED Equivalent"
    }
  ]
}