{
  "meta": [
    {
      "job_title": "Grant Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Pharmaceutical",
      "salary": 100000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Facilitate resolution of complex research issues, including drug supply and safety."
    },
    {
      "duty": "Assist with budget forecasting and tracking of grant payments."
    },
    {
      "duty": "Serve as Project Manager for all assigned Competitive Programs."
    },
    {
      "duty": "Collaborate with internal and external partners and stakeholders for management of GMG tactics globally."
    },
    {
      "duty": "Adhere to applicable SOPs, written standards, working practices, and implementation guidelines for the Research Collaboration (RC)/IMG process."
    },
    {
      "duty": "Assist with Outcomes Assessment by generating customized ad hoc reports of data points not captured in dashboards."
    },
    {
      "duty": "Work closely with GO to set up the timeline for each Request for Proposal (RFP), develop and execute the communication plan."
    },
    {
      "duty": "Manage the Expert Review Panel: contracting, user access, reviewer instructions, conduct training calls as needed, and schedule review meetings for all competitive grant program types."
    },
    {
      "duty": "Execute collaboration process and ensures collaboration agreement in place for partner-projects/RFPs."
    },
    {
      "duty": "Assist Grant Officer (GO) and key stakeholders with additional activities, as requested."
    },
    {
      "duty": "Work closely with Business Process Owners of RC and IMG SOPs to implement and communicate process updates."
    },
    {
      "duty": "Serve as the overall manager for drug related submissions and queries globally for research grants."
    },
    {
      "duty": "Oversee the user access request process for the Pharmaceutical Medical Grant system- review access requests, determine the appropriate level of access required and work with Business Operations to implement."
    },
    {
      "duty": "Serve as main point of contact within GMG for any Safety related queries that arise related to research."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "SOP Adherence",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree and strong experience required, or other relevant degree and extensive experience. Master's Degree in a clinical background a plus."
    }
  ]
}