{
  "meta": [
    {
      "job_title": "Field HR Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Human Resources",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruiting",
      "experience": 4
    },
    {
      "skill": "Training",
      "experience": 4
    },
    {
      "skill": "HR Policies",
      "experience": 4
    },
    {
      "skill": "Administrative Tasks",
      "experience": 4
    },
    {
      "skill": "Employee Relations",
      "experience": 4
    },
    {
      "skill": "Documentation Management",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish a positive HR presence with all associates and management within the branch."
    },
    {
      "duty": "Apply federal, state, and local laws, collective bargaining agreements, and corporate and local HR policies and procedures."
    },
    {
      "duty": "Ensure that all required HR standards are understood and followed by associates."
    },
    {
      "duty": "Coordinate/facilitate HR investigations."
    },
    {
      "duty": "Proactively interact with associates, identify business and people issues, effectively resolve HR administration problems, maintain confidentiality, and escalate issues to the HR Generalist or HR Manager, as necessary."
    },
    {
      "duty": "Understand airport/landlord policies and procedures and partners with operations to assist with compliance."
    },
    {
      "duty": "Support the full recruitment process, including posting new positions, conducting initial applicant screenings, coordinating interviews, performing administrative tasks to complete system-based hiring process, and scheduling and tracking badging activities."
    },
    {
      "duty": "Respond to associate inquiries and questions related to pay, paid time off, scheduling, assignments, complaints, policies and procedures, and the onboarding process."
    },
    {
      "duty": "Perform general administrative functions including but not limited to maintaining employee files, document retention, report generation, processing changes to employee records in HRMS systems and appropriate persons, completing logs and checklists, processing required forms and worksheets, and maintaining HR data, forms, and documents."
    },
    {
      "duty": "Coordinate and deliver new hire orientation."
    },
    {
      "duty": "Promote positive associate and labor relations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or general education development (GED) diploma"
    },
    {
      "credential": "3-4 years of administrative experience in a Human Resources function/environment"
    },
    {
      "credential": "Coursework towards HR certification or demonstration of understanding of technical, statutory, and regulatory HR best practices"
    },
    {
      "credential": "Ability to speak, read, and comprehend instructions, short correspondence and policy documents, as well as converse comfortably with associates"
    },
    {
      "credential": "Strong knowledge of HR technical subjects"
    },
    {
      "credential": "Expertise in preparing computer-based documents, spreadsheets, and presentations, and familiarity with HRMS systems, PeopleSoft a plus"
    }
  ]
}