{
  "meta": [
    {
      "job_title": "Associate Automation IT Infrastructure Engineer",
      "job_category": "IT",
      "job_class": "Associate",
      "sector": "IT",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ownership of installation, setup, configuration, and system integration of the software applications."
    },
    {
      "duty": "Test existing software applications both for On-Premise, Off-premise including Virtual or bare metal deployments."
    },
    {
      "duty": "Training on new software applications based on customer demand; or self-paced/self-taught as well as on a formalized basis."
    },
    {
      "duty": "Responsible for providing technical implementation, support, and troubleshooting for systems on-site and remotely."
    },
    {
      "duty": "Provide telephone, remote, and/or on-site software support for existing customers and Caltrol groups."
    },
    {
      "duty": "Participate and contribute in client and internal meetings (both in person, virtually, and remotely)."
    },
    {
      "duty": "Work with Customer IT, Networking Engineers to Architect Network Layouts and assist with the creation of documentation for client use."
    },
    {
      "duty": "Train customers on software systems through effective communication, demonstration, and formal instruction."
    },
    {
      "duty": "Communicate with the lifecycle services team, sales, and Project Managers during the various phases of projects and lifecycle care."
    },
    {
      "duty": "Work collaboratively with the lifecycle services team to continually improve internal processes."
    },
    {
      "duty": "Software and Hardware Test, troubleshoot and debug as required."
    },
    {
      "duty": "Ensure all incidents are responded to and resolved in accordance with established standards and agreements."
    },
    {
      "duty": "Maintain current knowledge of the Caltrol family of products, solutions, software, application functionality, and the high-level architecture."
    },
    {
      "duty": "Maintain Caltrol development and test environments as well as respective demo systems."
    },
    {
      "duty": "Business acumen in a technical environment."
    },
    {
      "duty": "Actively participate in the technical project team."
    },
    {
      "duty": "Works independently and can guide others."
    },
    {
      "duty": "Ability to contribute and support multiple projects simultaneously."
    }
  ],
  "skills": [
    {
      "skill": "Software Installation",
      "experience": 3
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Customer Support",
      "experience": 4
    },
    {
      "skill": "Technical Documentation",
      "experience": 3
    },
    {
      "skill": "Network Architecture",
      "experience": 4
    },
    {
      "skill": "Hardware Testing",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Computer Science, IT, Networking, or equivalent technical degree with minimal experience in hardware and software applications."
    },
    {
      "credential": "Knowledge and understanding of IT applications."
    },
    {
      "credential": "Entry level in fixed infrastructure, such as dedicated hardware, virtual machines, switches, and firewalls."
    },
    {
      "credential": "Good knowledge of MS Excel, MS Access, and MS Word."
    },
    {
      "credential": "Knowledge of MS-SQL or other common programming languages such as Python is a plus."
    },
    {
      "credential": "Knowledge of setting up virtualized systems and network connectivity."
    },
    {
      "credential": "Knowledge of MS certificates and interface with Cloud Platforms such as Microsoft Azure."
    }
  ]
}