{
  "meta": [
    {
      "job_title": "Complaints and Grievances Supervisor",
      "job_category": "Customer Service / Operations",
      "job_class": "Supervisor",
      "sector": "Customer Service",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Supervisory Experience",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Writing Skills",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Auditing",
      "experience": 5
    },
    {
      "skill": "Training",
      "experience": 5
    },
    {
      "skill": "Performance Evaluation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the Complaints and Grievances Specialists to ensure compliance with client regulatory requirements, monitor turnaround times, prepare Client Corrective Action Plans, audit files, and assist in the ongoing evaluation of departmental policies and procedures."
    },
    {
      "duty": "Monitor complaints, grievances, appeals, and Fair Hearing turnaround times to ensure compliance with client contracts on a daily basis, maintain open communication with the Customer Service Department, and provide ongoing auditing of files for C&G team members."
    },
    {
      "duty": "Prepare Client Corrective Action Plans, ensure compliance, identify and communicate client expectations and regulatory requirements, and assist in the hiring process, including interviewing candidates."
    },
    {
      "duty": "Assist in the preparation of performance and wage evaluations, provide clear written correspondence, perform accurate and on-time reporting, conduct monthly staff meetings and quarterly department meetings, and assist in the formal training of all new and existing team members."
    },
    {
      "duty": "Coordinate and implement appropriate strategies for motivating team members, approve attendance and time off for all direct reports, maintain working relationships with plan contacts, and adhere to DentaQuest business practices."
    },
    {
      "duty": "Conduct monthly staff meetings and quarterly department meetings, coordinate and implement appropriate strategies for motivating team members, and adhere to DentaQuest business practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or equivalent experience, 1 year related supervisory experience in an office setting, previous experience working with regulatory requirements and direct contact with clients, knowledge of general computer software, excellent analytical skills, excellent verbal communication skills, excellent writing skills, excellent interpersonal skills, ability to prioritize and organize multiple tasks, ability to remain organized with multiple interruptions, and required to attend additional training as requested/deemed necessary."
    }
  ]
}