{
  "meta": [
    {
      "job_title": "Director of Development",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 82500,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Fundraising",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Data Management",
      "experience": 5
    },
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage a portfolio of 75 – 100 mid-level donors and prospects, employing strategic cultivation and solicitation techniques to achieve fundraising targets."
    },
    {
      "duty": "Lead the Annual Fund strategy, overseeing the development and execution of compelling appeals, engaging collaborations, and impactful recognition efforts."
    },
    {
      "duty": "Develop and implement a comprehensive stewardship plan that effectively meets the diverse needs of donors."
    },
    {
      "duty": "Collaborate with the Development team to produce the annual report and generate an inspiring honor roll of donors."
    },
    {
      "duty": "Oversee administrative systems and functions within the Development Department, optimizing data management systems and ensuring accuracy in reporting and donor communications."
    },
    {
      "duty": "Work with the Executive Director of Development to establish development priorities, set fundraising goals, and monitor progress."
    },
    {
      "duty": "Co-manage communications with the Communications department, ensuring clear, precise, and compelling messaging across various channels."
    },
    {
      "duty": "Collaborate with key stakeholders across departments and centers at PSR to support the institution's overall goals."
    },
    {
      "duty": "Provide supervision to student workers, contract staff, and volunteers, maximizing their potential and contribution as needed."
    },
    {
      "duty": "Lead social media campaigns, (Giving Tuesday, Planned Giving August, etc)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Business Administration, Nonprofit Management, or related field"
    }
  ]
}