{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 90000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Tightly project manage the development and timeline for all product launches and retail experience launches for the carrier customer."
    },
    {
      "duty": "Maintain accurate store list of over 6,500 locations nationwide."
    },
    {
      "duty": "Project management of demo unit distribution from shipment to replacements, through returns."
    },
    {
      "duty": "Respond in a timely manager to escalations reported by field sales support teams."
    },
    {
      "duty": "Coordinate cross functionally to ensure readiness of stores for executive visits during key initiatives and moments."
    },
    {
      "duty": "Ensure accuracy of planograms and merchandising elements across multiple channels leading up to retail resets and product launches."
    },
    {
      "duty": "Oversee status of all budget and vendor requests by working with the project manager and internal teams to ensure timely approvals."
    },
    {
      "duty": "Effectively communicate retail plans and strategy to the field sales team and carrier account team to ensure alignment across the organization."
    },
    {
      "duty": "Track ROI and KPIs for all retail projects."
    },
    {
      "duty": "Develop and maintain strong relationships with multiple cross functional teams, carrier account team and the customer."
    },
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote freight and logistics services."
    },
    {
      "duty": "Lead a team of marketing specialists, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's online presence, optimizing the website and social media channels for maximum engagement and conversions."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "skills": [
    {
      "skill": "Analytical Abilities",
      "experience": 5
    },
    {
      "skill": "Excel Skills",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Retail Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Marketing, or related field or equivalent work experience (Master's preferred)"
    }
  ]
}