{
  "meta": [
    {
      "job_title": "Warehouse Manager",
      "job_category": "Logistics",
      "job_class": "Manager",
      "sector": "Warehousing",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the oversight of the warehouse and personnel, including selecting, training, scheduling, coaching, and disciplining employees."
    },
    {
      "duty": "Communicating job expectations, planning, monitoring, and appraising job contributions."
    },
    {
      "duty": "Ensure compliance with all Company policies and procedures for continuous improvement and operational excellence."
    },
    {
      "duty": "Maintain documentation and train personnel to complete assignments safely and in compliance with all procedures."
    },
    {
      "duty": "Maximize use of available storage space by organizing floor area and adhering to storage design principles."
    },
    {
      "duty": "Maintain records in compliance with Warehouse Procedures and generate reports on a weekly basis for Purchase Orders."
    },
    {
      "duty": "Drive warehouse operational standards and metrics, and ensure physical inventory and/or inventory cycle counting is performed in compliance with Warehouse Procedures."
    },
    {
      "duty": "Comply with all Warehouse Policies & Procedures, and DOA requirements."
    },
    {
      "duty": "Perform other duties as requested by purchasing management to assure effective and efficient operation of the department."
    },
    {
      "duty": "Fully supports Company goals of continuous improvement and operational excellence at strategic and tactical levels."
    }
  ],
  "skills": [
    {
      "skill": "Warehouse Management",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Inventory Management",
      "experience": 7
    },
    {
      "skill": "Procurement",
      "experience": 7
    },
    {
      "skill": "Record Keeping",
      "experience": 7
    },
    {
      "skill": "Process Improvement",
      "experience": 7
    },
    {
      "skill": "Safety Compliance",
      "experience": 7
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. in Business related field preferred and seven years progressive warehouse experience required or progressive experience acceptable to management. Effective oral and written communication skills, ability to utilize PC and experience in general software applications such as SAP, Excel, Word, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ]
}