{
  "meta": [
    {
      "job_title": "Electrical Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Electrical Design",
      "experience": 5
    },
    {
      "skill": "PLC Programming",
      "experience": 5
    },
    {
      "skill": "Electrical Schematics",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Product Development",
      "experience": 5
    },
    {
      "skill": "Technical Leadership",
      "experience": 5
    },
    {
      "skill": "Mechanical Design",
      "experience": 5
    },
    {
      "skill": "Drafting",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide technical expertise in the design of electrical systems and products."
    },
    {
      "duty": "Evaluate systems' safety, reliability, and performance."
    },
    {
      "duty": "Recommend equipment, new concepts and techniques to improve performance, simplify processes, and improve material designs or material flaw as related to electrical systems and components."
    },
    {
      "duty": "Work collaboratively with the engineering team and various plant personnel to improve electrical/digital component and product designs on existing products or develop new products related to Zero Turn Lawnmowers (ZTR) and grain drying equipment."
    },
    {
      "duty": "Size and specify electrical parts and electronic components."
    },
    {
      "duty": "Lead the design improvements on existing products as related to electrical systems and components, and new product designs for ZTR lawnmowers, grain/crop dryers, heaters/burners, fans, controls, material handling equipment, and grain storage."
    },
    {
      "duty": "Use knowledge of electrical design, PLC programming, and engineering techniques to provide technical leadership to the other members for the department."
    },
    {
      "duty": "Interpret mechanical design drawings for electrical requirements."
    },
    {
      "duty": "Ensure that installation and operations conform to standards by preparing electrical systems specifications and technical drawings."
    },
    {
      "duty": "Use 2D and/or 3D drafting skills in product design and development, electrical schematics/diagrams, and specifications."
    },
    {
      "duty": "Interface with customers/dealers to obtain practical understanding of requirements to design new products and improve existing products to meet the demands of the market."
    },
    {
      "duty": "Communicate and coordinate with manufacturing staff and procurement specialists to ensure manufacturability and cost control of the finished product."
    },
    {
      "duty": "Participate in product development testing to validate the design concepts in the R&D Shop/Area, and often with in-field testing."
    },
    {
      "duty": "Create detailed manufacturing prints, bill of materials, and operating instructions for all products and improvements while interfacing with Sales, Manufacturing, and Procurement to ensure an integrated, efficient product roll-out."
    },
    {
      "duty": "Assist with troubleshooting and problem-solving by working directly with the design team, production supervisors/managers, quality personnel, and shop floor production teams as needed."
    },
    {
      "duty": "Maintain consistent communication with the supervisor on the status of assigned tasks."
    },
    {
      "duty": "Actively participate in continuous improvement activities."
    },
    {
      "duty": "Follow safety rules and regulations in performing work assignments and maintain a clean and orderly work area."
    },
    {
      "duty": "Travel to project sites to evaluate, research, and fix product issues, when needed."
    },
    {
      "duty": "May assist in other areas of engineering as desired."
    }
  ],
  "subjective_elements": [
    {
      "introvert_extrovert": 120,
      "soldier_general": 100,
      "student_teacher": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Electrical Engineer"
    }
  ]
}