{
  "meta": [
    {
      "job_title": "Assurance Manager",
      "job_category": "Accounting",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "GAAP and GAAS Knowledge",
      "experience": 5
    },
    {
      "skill": "Accounting Expertise",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "SEC Regulations",
      "experience": 5
    },
    {
      "skill": "Financial Reporting Control",
      "experience": 5
    },
    {
      "skill": "Internal Control Assessment",
      "experience": 5
    },
    {
      "skill": "Auditing",
      "experience": 5
    },
    {
      "skill": "Supervisory Experience",
      "experience": 5
    },
    {
      "skill": "Client Relations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise, direct, and review results through the planning, fieldwork, and 'wrap-up' stages of an audit client engagement."
    },
    {
      "duty": "Market, network, and develop business within an area of expertise, ensuring engagement profitability involving billings and collections."
    },
    {
      "duty": "Advise clients on economic and regulatory risks within their industry, resolving complex accounting issues, and applying GAAP and GAAS consistently within complex situations."
    },
    {
      "duty": "Validate and assess the effectiveness of internal control over financial reporting, and communicate suggestions to improve client internal controls and accounting procedures."
    },
    {
      "duty": "Review SEC filings, including MD&A, financial statements, and disclosures for appropriateness in form, content, completeness, and accuracy."
    },
    {
      "duty": "Supervise Associates and Senior Associates, review their work, provide performance feedback, and act as a career advisor."
    },
    {
      "duty": "Conduct research projects, draw conclusions based on appropriate research, and prepare memos supporting research and conclusions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 180,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Accounting, Finance, Economics or Statistics (Master’s preferred)"
    },
    {
      "credential": "Active CPA license or recognized equivalent (required). If active international equivalent, must obtain an active US CPA license within an approved timeframe as defined by firm licensing requirement guidelines."
    }
  ]
}