{
  "meta": [
    {
      "job_title": "Internal Audit Manager",
      "job_category": "Accounting",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 105000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive the enhancement and further development of the Company’s SOX environment."
    },
    {
      "duty": "Lead documentation efforts over the Company’s key processes."
    },
    {
      "duty": "Develop and implement an internal audit testing plan that is aligned with the company's objectives and risk management framework."
    },
    {
      "duty": "Implementing and developing dynamic improvements to objectives and risks within a growing organization."
    },
    {
      "duty": "Represent the Company’s processes to external auditors, and assist with providing evidence."
    },
    {
      "duty": "Plan and develop the internal audit team as the Company grows, including focuses on accounting, technology, and operations."
    },
    {
      "duty": "Track and evaluate audit issues to ensure proper remediation/mitigation, providing timely status updates to management."
    },
    {
      "duty": "Develop and maintain a strong internal control environment that supports the company's risk management objectives."
    },
    {
      "duty": "Assist in the development & implementation of a data analytics programs part of the audit methodology"
    }
  ],
  "skills": [
    {
      "skill": "Internal Audit",
      "experience": 5
    },
    {
      "skill": "SOX Compliance",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Team Development",
      "experience": 5
    },
    {
      "skill": "Accounting",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 140,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "CPA, CIA, or other relevant professional certification"
    },
    {
      "credential": "A minimum of 4 years’ experience in audit (internal and /or external) required, including public accounting experience."
    },
    {
      "credential": "Knowledge of and experience with Sarbanes-Oxley"
    }
  ]
}