{
  "meta": [
    {
      "job_title": "Senior Electrical Engineer, PE",
      "job_category": "Engineering",
      "job_class": "Senior Engineer",
      "sector": "Engineering",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Electrical Design",
      "experience": 10
    },
    {
      "skill": "Renewable Energy",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Technical Writing",
      "experience": 10
    },
    {
      "skill": "AutoCAD",
      "experience": 10
    },
    {
      "skill": "ERP Software",
      "experience": 10
    },
    {
      "skill": "Negotiation",
      "experience": 10
    },
    {
      "skill": "Business Development",
      "experience": 10
    },
    {
      "skill": "Technical Documents",
      "experience": 10
    },
    {
      "skill": "Regulatory Knowledge",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Mentoring",
      "experience": 10
    },
    {
      "skill": "Travel",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Contribute to the planning, design, permitting, and implementation of engineering projects in the renewable energy and power sectors."
    },
    {
      "duty": "Generate and/or review equipment drawings and specifications for photovoltaic system components, solar modules, inverters, BESS, transformers, cable management systems and balance of systems (BOS)."
    },
    {
      "duty": "Prepare electrical designs, including electrical loading and equipment sizing calculations, and apply technical knowledge of short circuiting, reactive capability, arc flash, cable ampacity, grounding, and voltage drop."
    },
    {
      "duty": "Prepare electrical construction project cost estimates and schedules, as well as progress-tracking and completion reports."
    },
    {
      "duty": "Provide technical expertise to navigate permitting challenges in the renewable energy and power sectors."
    },
    {
      "duty": "Prepare technical proposals, participate in business development with existing clients and identified leads, assist clients in developing strategies and preparing designs for proposed facilities."
    },
    {
      "duty": "Conduct field investigations, construction oversight, and quality assurance activities, and provide field exploration support as needed for design parameter development, and during construction for oversight and Construction Quality Assurance purposes."
    },
    {
      "duty": "Work with other resources to deepen relationships with key clients and establish new client relationships, participate in project teams and independently on a global platform in varying settings that demand new and creative solutions."
    },
    {
      "duty": "Lead, manage performance, hire and retain, inspire and mentor personnel for overall success of the technical team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. and/or M.S. in Electrical Engineering, with a focus on electrical"
    },
    {
      "credential": "Professional Engineer (PE) license"
    }
  ]
}