{
  "meta": [
    {
      "job_title": "Financial Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Planning",
      "experience": 7
    },
    {
      "skill": "Financial Reporting",
      "experience": 7
    },
    {
      "skill": "Business Analysis",
      "experience": 7
    },
    {
      "skill": "Accounting",
      "experience": 7
    },
    {
      "skill": "Cognos TM1",
      "experience": 3
    },
    {
      "skill": "Budgeting",
      "experience": 7
    },
    {
      "skill": "Team Building",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support expansion strategy and M&A activities for Advantage Dental Plus."
    },
    {
      "duty": "Provide financial planning and analytical support to the Finance team and develop understanding of business segments."
    },
    {
      "duty": "Assist in financial forecasting, budgeting, cost allocations, expense and metric analytics, and profitability analysis."
    },
    {
      "duty": "Support Finance Executive leadership by providing oversight of all financial aspects of the AD+ business including but not limited to the organization’s financial planning, financial reporting, growth, development, and long-term strategic plans."
    },
    {
      "duty": "Provide support for Care Group financial planning & analysis, including:Support both annual operating plan budgeting activities and monthly forecasting processes through development and maintenance of analytical financial models."
    },
    {
      "duty": "Establish annual financial goals, including the AD+ financial plan, operating expense budget and cost accounting framework, commensurate with the long-term strategic goals of AD+"
    },
    {
      "duty": "Support the Operations Team with important information used to manage the practices and monthly reforecasts."
    },
    {
      "duty": "Assist in review and analysis of monthly, quarter-to-date, and year-to-date actual variances vs. budget and prior forecast."
    },
    {
      "duty": "Maintain and improve reporting requirements through management of Cognos TM1 software tools for budgeting, forecasting, and actual reporting."
    },
    {
      "duty": "Recommend and implement improvements to business planning, finance, and reporting process."
    },
    {
      "duty": "Perform other financial modeling and analyses as appropriate."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Finance, Accounting, or Economics undergraduate degree required. CMA/CPA or MBA is considered a plus."
    }
  ]
}