{
  "meta": [
    {
      "job_title": "Director of Finance",
      "job_category": "Finance",
      "job_class": "Director",
      "sector": "Hotel Management",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Effectively manage and communicate cash flow related issues, as required to management and ownership."
    },
    {
      "duty": "Accurate and timely preparation of cash-flow statements, management of receivables, cash balances, control mechanisms and timely deposits of all funds."
    },
    {
      "duty": "Monitor hotel revenues and expenses and ensure accurate recording in accordance with established guidelines."
    },
    {
      "duty": "Investigate and critique variances to budget or to prior year and offer practical improvement strategies to management."
    },
    {
      "duty": "Monitor the capital planning process by assisting management with calculation of return on capital improvements and evaluating scope of work and specifications."
    },
    {
      "duty": "Ensure Hotels’ compliance on all regulatory licenses and permits, leases, contracts, legal agreements, and the proper execution of all operational taxes."
    },
    {
      "duty": "Provide assistance to management in enforcing compliance on all these items."
    },
    {
      "duty": "Coordinate the completion of all forecasts and budgets as required, with the full and active participation of EC Team and department managers."
    },
    {
      "duty": "Analyze financial data and operations to assist and advise management in maintaining the Hotels’ financial objectives."
    },
    {
      "duty": "Ensure that all balance sheet accounts, including bank reconciliations are reconciled on a timely basis."
    },
    {
      "duty": "Establish and continually audit all internal financial controls including purchasing, cash handling, disbursements, credit extension, inventories, hotel assets, master keys, payroll, and employee records."
    },
    {
      "duty": "Direct and/or prepare all financial reports in accordance with requirements meeting various due dates and deadlines."
    },
    {
      "duty": "Participate in the monthly and yearly financial activities and meetings."
    },
    {
      "duty": "Conduct and/or attend and contribute to periodic meetings to maintain favorable working relationships among employees and promote maximum morale, productivity, and efficiency."
    },
    {
      "duty": "Maximize efforts towards productivity, identify problem areas, and assist in finding and implementing their solutions."
    },
    {
      "duty": "Approach all encounters with guests and employees in an attentive, friendly, courteous, and service-oriented manner."
    },
    {
      "duty": "Maintain regular attendance in compliance with standards, as required by scheduling which will vary according to the needs of the hotel."
    },
    {
      "duty": "Comply at all times with standards and regulations to encourage safe and efficient hotel operations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 150,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Five (5) years of experience in hotel, RE, property accounting, or related field. A four-year college degree is preferred. Full-service hotel finance leadership required, independent hotel training preferred, strong PMS/property systems preferred, and MS Excel skills. Management skills with a strong sense of ownership, an operational knack for success and an eye for numbers."
    }
  ]
}