{
  "meta": [
    {
      "job_title": "Account Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management (CRM)",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Sales Forecasting",
      "experience": 5
    },
    {
      "skill": "HubSpot",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Public Safety Sales",
      "experience": 5
    },
    {
      "skill": "Lead Generation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Developing and executing a regional sales plan that includes outbound prospecting, lead generation, and field sales engagement to meet or exceed quarterly and annual sales targets."
    },
    {
      "duty": "Identifying decision makers amongst the targeted leads or accounts to start the sales process."
    },
    {
      "duty": "Providing effective product demos for end-user customers via phone and web conferencing."
    },
    {
      "duty": "Maintaining and expanding the CRM with prospects, accounts, and additional contacts."
    },
    {
      "duty": "Outbound and inbound account management."
    },
    {
      "duty": "Participating fully in training sessions, meetings, skill-building and professional development classes."
    },
    {
      "duty": "Attending sales group meetings concerning sales targets or forecasts and reporting on the market situation."
    },
    {
      "duty": "Handling changes in sales orders and communicating those changes with related departments."
    },
    {
      "duty": "Emphasizing the KOLOGIK Ecosystem by promoting product features and benefits, discussing credit terms, quoting prices, and preparing sales orders."
    },
    {
      "duty": "Capturing accurate and complete information in the Customer Relationship Management system (HubSpot)."
    },
    {
      "duty": "Attending industry conferences and regional trade shows to develop industry expertise."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or equivalent applicable experience"
    }
  ]
}