{
  "meta": [
    {
      "job_title": "Rehab Services Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide administrative oversight for, & day-to-day management of, the Rehabilitation Services Department in accordance with all regulatory & professional standards."
    },
    {
      "duty": "Manage &/or provide OT & related services including assessment, intervention, program planning, implementation and discharge planning in accordance with established DMH policies and procedures and in accordance with the Occupational Therapy Code of Ethics and Standards of Practice."
    },
    {
      "duty": "Provide the therapeutic milieu for patient programming."
    },
    {
      "duty": "Provide clinical care for patients and maintain clinical documentation."
    },
    {
      "duty": "Demonstrate respect and regard for the dignity of all patients, families, visitors and fellow employees to ensure a professional, responsible and courteous environment."
    },
    {
      "duty": "Promote effective working relations as part of a multi-disciplinary team to facilitate the Department/units ability to meet its goal and objectives."
    },
    {
      "duty": "Attend all training programs related to general services and specific job-related goals and objectives."
    },
    {
      "duty": "Be responsible for all activities related to general safety, department/service safety, specific job-related hazards."
    },
    {
      "duty": "Establish Peer Review/Clinical Pertinence for the Rehabilitation Services Department in accordance with established standards of practice & participate in Performance Improvement activities."
    },
    {
      "duty": "Perform other specific duties as required."
    }
  ],
  "skills": [
    {
      "skill": "Management",
      "experience": 5
    },
    {
      "skill": "Occupational Therapy",
      "experience": 5
    },
    {
      "skill": "Clinical Documentation",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Multi-disciplinary Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Performance Improvement",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Masters degree from an accredited school of Occupational Therapy preferred. Current Massachusetts certification/license in occupational therapy or related professional discipline."
    }
  ]
}