{
  "meta": [
    {
      "job_title": "Account Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Enterprise Sales",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Cold Calling",
      "experience": 5
    },
    {
      "skill": "Sales Target Achievement",
      "experience": 5
    },
    {
      "skill": "Influencing Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify, qualify, acquire, and grow seller commitment to the Selling on Amazon program."
    },
    {
      "duty": "Analyze customer data and make recommendations to maximize the potential of the seller and the assigned territory."
    },
    {
      "duty": "Implement and track metrics for recording the success and quality of the sellers in the territory."
    },
    {
      "duty": "Prospect and close business to achieve quota targets for both quantity and quality of sellers recruited."
    },
    {
      "duty": "Understand and utilize Salesforce.com CRM tools to track all pertinent account information and sales progress."
    },
    {
      "duty": "Develop a thorough understanding of the e-commerce industry, reverse logistics associations, and competitive environments."
    },
    {
      "duty": "Prepare and deliver business reviews regarding progress and state of health for the respective territory."
    },
    {
      "duty": "Manage numerous opportunities concurrently and strategically."
    },
    {
      "duty": "Create and articulate compelling value propositions around the Selling on Amazon product."
    },
    {
      "duty": "Engage with merchants to understand their needs and gauge fit with the Amazon Services product set."
    },
    {
      "duty": "Assist internal partners to drive change, remove roadblocks, and close business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Marketing, or a related field (MBA preferred)"
    }
  ]
}