{
  "meta": [
    {
      "job_title": "Director of Sales",
      "job_category": "Sales",
      "job_class": "Director",
      "sector": "Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 4
    },
    {
      "skill": "Marketing Strategy",
      "experience": 4
    },
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Market Analysis",
      "experience": 4
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 4
    },
    {
      "skill": "Budget Management",
      "experience": 4
    },
    {
      "skill": "Negotiation Skills",
      "experience": 4
    },
    {
      "skill": "Business Development",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive sales and marketing strategies to drive occupancy and ADR growth, maximizing total revenue."
    },
    {
      "duty": "Lead and oversee the hotel sales department, including sales administration, staff hiring, training, and coaching."
    },
    {
      "duty": "Manage sales and marketing budget, forecast, advertising, and business plans for the hotel, ensuring compliance with approved plans and budgets."
    },
    {
      "duty": "Coordinate all group, transient, and catering sales solicitations to maximize overall revenue."
    },
    {
      "duty": "Proactively conduct outside sales calls, sales tours, and entertain clients to drive business growth."
    },
    {
      "duty": "Monitor production of top accounts, evaluate market trends, and predict revenue opportunities to set proactive strategies."
    },
    {
      "duty": "Train team members to recognize and capitalize on sales opportunities, increasing occupancy and revenue."
    },
    {
      "duty": "Maintain strong visibility in the local community and industry organizations to enhance brand presence and drive business growth."
    },
    {
      "duty": "Travel on a weekly basis as required to conduct sales activities, represent the hotel, and build business relationships."
    },
    {
      "duty": "Act on behalf of the General Manager in their absence, performing any other duties as requested by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "At least 2 years of progressive hotel sales experience preferred; or a 4-year college degree and at least 1 year of related experience; or a 2-year college degree and at least 2 years of related experience"
    }
  ]
}