{
  "meta": [
    {
      "job_title": "Risk Manager",
      "job_category": "Risk Management",
      "job_class": "Program Administrator",
      "sector": "Information Technology",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Written and Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 4
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the Ohio Benefits Program risk management workstream to enable continued data sharing with CMS, IRS, and SSA through compliance with their program regulations."
    },
    {
      "duty": "Facilitate communication with risk management, legal, and procurement groups in DAS and with partner agencies for resolution."
    },
    {
      "duty": "Promote and ensure awareness of risk management requirements to meet state and federal compliance."
    },
    {
      "duty": "Complete risk assessments of new product releases, system enhancements, and service changes to supplement security assessments."
    },
    {
      "duty": "Periodically complete product security assessments."
    },
    {
      "duty": "Maintain functional workstreams for audit activities and serve as the primary point of contact and coordinator for all Ohio Benefits Program audits."
    },
    {
      "duty": "Monitor and report audit findings and corrective action plans to leadership and partner agencies as directed."
    },
    {
      "duty": "Maintain and communicate audit schedule and coordinate audit activities with other program activities."
    },
    {
      "duty": "Attend required state staff meetings, make presentations to program, agencies, executive management, public and private groups as directed, and attend authorized conferences and seminars."
    },
    {
      "duty": "Work effectively in matrix and team-based structures, demonstrate professionalism in all interactions with both internal and external stakeholders, and continuously acquire and leverage current information relevant to job duties."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 75,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of undergraduate core program in business administration, management or public administration; 36 months of training or experience in supervisory, administrative, managerial, or staff position involving planning, research, or policy/procedure development."
    }
  ]
}