{
  "meta": [
    {
      "job_title": "R&D Intern",
      "job_category": "Research & Development",
      "job_class": "Intern",
      "sector": "R&D",
      "salary": 48000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Analytical Chemistry",
      "experience": 1
    },
    {
      "skill": "Polymer Chemistry",
      "experience": 1
    },
    {
      "skill": "Advanced Imaging Technologies",
      "experience": 1
    },
    {
      "skill": "Lab Work",
      "experience": 1
    },
    {
      "skill": "Data Organization",
      "experience": 1
    },
    {
      "skill": "Technical Writing",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Hands-on experience with structure-property relationship studies of polymeric materials, advanced imaging technologies, chemical/biological characterization, solvent extraction, chromatographic separation, spectral interpretation, and structural elucidation. Independently develops new analytical methods, designs and executes complex, non-standard laboratory studies to solve technical challenges and provide scientific solutions. Thoroughly and clearly documents experiments and prepares high-quality Technical Documents."
    },
    {
      "duty": "Process development and manufacturing. Interact with lens designers, contact lens metrology leads, Clinical Project leads, and Vision/Data Scientists. Lab work, data organization, and conduct studies. Prepare and modify formulations, lens fabrication, and characterization."
    },
    {
      "duty": "Searching literatures, design & conduct experiments to test ideas. Discuss and write technical reports, present results."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Must be enrolled in an accredited university or college for at least one semester prior to internship or co-op, and at least one additional semester following internship or co-op.Must be pursuing at least a Bachelors level degree in Data Analytics, Computer Science / Engineering, Software, Information Technology, Data Science, Statistics, Mathematics, Vision Science, Computational Data Analytics, Cybersecurity, Information Security and Systems Engineering or related major.Academic performance: Minimum cumulative GPA 2.8/4.0.Demonstrated leadership skills (i.e. extracurricular activities or projects).Must be authorized to work in the US on a permanent basis without requiring sponsorship (students on an F1 visa with CPT may be accommodated).Ability to commit to a 10-12 week, full-time (40 hours per week) summer internship."
    }
  ]
}