{
  "meta": [
    {
      "job_title": "Dietary Manager",
      "job_category": "Clinical",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Nutrition Assessment",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Community Resource Coordination",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Menu Development",
      "experience": 5
    },
    {
      "skill": "Policy Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and implement all aspects of the nutritional program for the healthcare facility."
    },
    {
      "duty": "Provide leadership for dietary services and supervise and manage staff."
    },
    {
      "duty": "Identify and coordinate with community resources as appropriate, and track and monitor service implementation to ensure high-quality, patient-centered service delivery."
    },
    {
      "duty": "Recruit, train, and assist dietary staff in setting individuals goals and objectives."
    },
    {
      "duty": "Promote a positive and supportive work environment and provide continuing support to personnel."
    },
    {
      "duty": "Conduct performance appraisals, counsel employees on performance issues, and approve times cards and PTO."
    },
    {
      "duty": "Interface with Kitchen Manager to prepare ordering and menu planning for meals."
    },
    {
      "duty": "Responsible for the hiring, scheduling, and supervision of dietitians."
    },
    {
      "duty": "Coordinate menu development and nutritional program development."
    },
    {
      "duty": "Develop, review, and update policies and procedures for the Dietary Department."
    },
    {
      "duty": "Facilitate departmental performance improvement initiatives and ensure compliance with regulatory agencies and accreditation."
    },
    {
      "duty": "Assist with coordination of schedule and projects for float RD’s."
    },
    {
      "duty": "Perform other projects and duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in relevant field of nutrition. Current registration with the Commission on Dietetic Registration required. Minimum 3 years’ Registered Dietitian working with eating disorders patients. Supervisor experience preferred."
    }
  ]
}