{
  "meta": [
    {
      "job_title": "Operational Intelligence Center (OIC) Communications Specialist",
      "job_category": "Security",
      "job_class": "Communications Specialist",
      "sector": "Security",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Radio Communications",
      "experience": 2
    },
    {
      "skill": "Surveillance Systems",
      "experience": 2
    },
    {
      "skill": "Computer Skills",
      "experience": 2
    },
    {
      "skill": "Emergency Response",
      "experience": 2
    },
    {
      "skill": "Video Management",
      "experience": 2
    },
    {
      "skill": "Criminal Activity Identification",
      "experience": 2
    },
    {
      "skill": "Microsoft Office",
      "experience": 2
    },
    {
      "skill": "Technical Security Programs",
      "experience": 2
    },
    {
      "skill": "Verbal Communication",
      "experience": 2
    },
    {
      "skill": "Written Communication",
      "experience": 2
    },
    {
      "skill": "Data Logging",
      "experience": 2
    },
    {
      "skill": "Evacuation Procedures",
      "experience": 2
    },
    {
      "skill": "Technical Monitoring Equipment",
      "experience": 2
    },
    {
      "skill": "Record Management",
      "experience": 2
    },
    {
      "skill": "Video Surveillance",
      "experience": 2
    },
    {
      "skill": "Public Safety",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Answer, evaluate, and prioritize incoming telephone and radio calls."
    },
    {
      "duty": "Communicate effectively with various callers to obtain complete information to determine the necessary level of service."
    },
    {
      "duty": "Collaborate with on-site security personnel to properly resolve incidents."
    },
    {
      "duty": "Provide pre-arrival emergency or medical instructions to local law enforcement or fire personnel."
    },
    {
      "duty": "Monitor fire/life/safety alarms to determine the necessary level of response."
    },
    {
      "duty": "Become conversant with emergency procedures and evacuation procedures for multiple assigned retail centers."
    },
    {
      "duty": "Identify suspicious criminal activity and ensure an effective response from local law enforcement, retail center personnel, and/or corporate management."
    },
    {
      "duty": "Operate and monitor internal and external surveillance cameras and state of the art surveillance programs for multiple retail centers."
    },
    {
      "duty": "Support and assist in record management and data collection for multiple retail centers or corporate management which involve recorded video."
    },
    {
      "duty": "Ensure all components of the Operational Intelligence Center surveillance equipment are operating according to expected standards and protocols."
    },
    {
      "duty": "Maintain an effective video management system in accordance with expected standards and protocols."
    },
    {
      "duty": "Effectively maneuver multiple surveillance cameras to obtain a better understanding of a situation, document events and assist with an investigation regarding suspicious activity, property damage, acts of violence, etc."
    },
    {
      "duty": "Complete required monthly training in a timely fashion."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent"
    },
    {
      "credential": "Minimum of two (2) years of experience in a public or private safety organization"
    },
    {
      "credential": "Ability to perform regular equipment checks and report all equipment failures to Operational Intelligence Center Supervisor"
    },
    {
      "credential": "Ability to work specified shifts in a command center environment in order to maintain 24 hours and seven days a week operation"
    },
    {
      "credential": "Ability to complete CritiCall pre-employment assessment with favorable results"
    },
    {
      "credential": "Ability to pass Emergency Telecommunication Course"
    },
    {
      "credential": "Ability to pass a post-offer/pre-employment background check and drug and alcohol screening"
    },
    {
      "credential": "Successful completion of the new hire training program"
    }
  ]
}