{
  "meta": [
    {
      "job_title": "Fall Intern, Insights",
      "job_category": "Internship",
      "job_class": "Intern",
      "sector": "Sports and Entertainment",
      "salary": 20,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support ongoing projects or work alongside a project team to solve business problems related to improving revenue streams or the fan experience for teams, brands, and sport properties."
    },
    {
      "duty": "Perform detailed sports, and entertainment industry research focused on (but not limited to) professional teams, live entertainment venues, college landscape, sponsorship trends, digital and social activation trends, and more."
    },
    {
      "duty": "Implement qualitative and quantitative research best practices for the department to amplify our position and brand in the marketplace."
    },
    {
      "duty": "Communicate and present project updates and recommendations to team members and internal stakeholders."
    },
    {
      "duty": "Analyze high-volume data sets to identify narrative trends and actionable insights."
    },
    {
      "duty": "Build high-quality visualizations using data analysis tools that illustrate the stories underlying the data we collect."
    },
    {
      "duty": "Contribute to creating and sharing competitive findings with white papers and case studies."
    },
    {
      "duty": "Coordinate and develop internal project team materials, including calendar invites, meeting briefs, notes, etc."
    }
  ],
  "skills": [
    {
      "skill": "Research Analysis",
      "experience": 3
    },
    {
      "skill": "Data Visualization",
      "experience": 3
    },
    {
      "skill": "Market Research",
      "experience": 2
    },
    {
      "skill": "Qualitative Research",
      "experience": 2
    },
    {
      "skill": "Quantitative Research",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "MS Office Suite",
      "experience": 3
    },
    {
      "skill": "Google Drive Suite",
      "experience": 2
    },
    {
      "skill": "Data Analysis Tools",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 85,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Actively enrolled in an accredited college or university and pursuing an undergraduate degree"
    }
  ]
}