{
  "meta": [
    {
      "job_title": "Sales Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Sales",
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Perform daily branch and customer service duties, providing customers with efficient and accurate transaction processing."
    },
    {
      "duty": "Promote business by providing quality customer service and handling routine customer inquiries."
    },
    {
      "duty": "Provide customer referrals for products and services on a daily basis."
    },
    {
      "duty": "Balance assigned cash daily and maintain strict adherence to security procedures and sole control of cash drawer and assigned cash limits."
    },
    {
      "duty": "Identify customers, obtain proper identification, and verify endorsements/payees, cash, and checks/withdrawals/transfers."
    },
    {
      "duty": "Contribute to the responsibility in meeting monthly branch and/or individual scorecard goals on a consistent basis."
    },
    {
      "duty": "Ensure delivery of excellent customer service throughout the Bank by adhering to sales and @ your service standards."
    },
    {
      "duty": "Order, receive, verify, and distribute cash in accordance with bank policy."
    },
    {
      "duty": "Promote and maintain positive relationships with all internal and external customers."
    },
    {
      "duty": "Contribute to the fulfillment of the Bank’s objectives and goals by performing as a team member in allocating and coordinating the workflow."
    },
    {
      "duty": "Keep current and be knowledgeable in order to communicate the Bank’s products and services to clients."
    },
    {
      "duty": "Ability to open and/or close the Branch and may require working hours outside normal scheduled hours."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent; Successful completion of the Bank’s in-house Sales Associate Training Program."
    }
  ]
}