{
  "meta": [
    {
      "job_title": "Senior Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Salesforce",
      "experience": 5
    },
    {
      "skill": "CRM Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure the success of the designated sales vertical, setting individual and team goals and monitoring performance for optimization."
    },
    {
      "duty": "Identify and address gaps in team competence through training, coaching, and performance management."
    },
    {
      "duty": "Utilize Salesforce or equivalent CRM systems and KPI dashboards to manage performance."
    },
    {
      "duty": "Create an environment of trust and respect, and engage in active management for performance improvement."
    },
    {
      "duty": "Lead by example, embrace business and Sales Leadership Principles, and demonstrate ability to deliver against responsibilities."
    },
    {
      "duty": "Analyze available data to build a forecast, track performance, and manage sales at a strategic and operational level."
    },
    {
      "duty": "Network and communicate with senior and C-suite contacts both externally and internally."
    },
    {
      "duty": "Drive continuous professional development and lead by example with a growth mindset."
    },
    {
      "duty": "Manage for performance through active management and demonstrate a robust coaching approach."
    },
    {
      "duty": "Create a vision of success, actively listen, demonstrate empathy, and lead by example."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 125
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Sales, Business, or a related field (Master's preferred)"
    }
  ]
}