{
  "meta": [
    {
      "job_title": "Quantum FIS Treasury",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Quantum",
      "experience": 5
    },
    {
      "skill": "Cash Management",
      "experience": 5
    },
    {
      "skill": "Market Rates",
      "experience": 5
    },
    {
      "skill": "Accounting",
      "experience": 5
    },
    {
      "skill": "Crystal Reports",
      "experience": 5
    },
    {
      "skill": "Global Cash Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Daily monitoring of Quantum's processes to ensure that various file transmissions to and from the system are operating properly."
    },
    {
      "duty": "Actively working with Quantum and with internal IT teams to resolve any issues with bank files and data transmissions between Quantum and other systems including retrieval of market rates as applicable."
    },
    {
      "duty": "Resolving any accounting-related issues within Quantum in collaboration with the Accounting team."
    },
    {
      "duty": "Maintaining and managing transaction mapping rules in the system to ensure that the system is accurately categorizing prior-day transaction activity from daily bank statement transmissions into Quantum."
    },
    {
      "duty": "Manage the set-up and maintenance of all static data elements (bank accounts, counterparties, general ledger, etc.) and configuration defaults and rules for Quantum."
    },
    {
      "duty": "Build crystal reports to support Treasury Operations."
    },
    {
      "duty": "Being a subject matter expert in the functionality of the Quantum system by developing a deep understanding of how the system works."
    },
    {
      "duty": "Developing and updating user guides, when applicable, to ensure that the Global Cash Management teams across the globe have access to up-to-date instructions on how to perform their required tasks in Quantum."
    },
    {
      "duty": "Keeping Treasury Management up-to-date on issues/challenges within the system."
    },
    {
      "duty": "Projects and other duties as needed by Treasury."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, or a related field (Master's preferred)"
    }
  ]
}