{
  "meta": [
    {
      "job_title": "Sales Supervisor",
      "job_category": "Sales",
      "job_class": "Supervisor",
      "sector": "Retail",
      "salary": 20000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direction and supervise associates to support a sales driving culture and create a consistent customer experience."
    },
    {
      "duty": "Engage and connect with customers by providing excellent customer service through a hospitality mentality approach."
    },
    {
      "duty": "Offer information to customers on current merchandise assortment, store promotions and events, and execute operational processes effectively and efficiently."
    },
    {
      "duty": "Drive sales by providing an inspiring environment that motivates customers to add to their basket and deliver a consistent sales floor experience."
    },
    {
      "duty": "Build customer connections with a greeting and execute an authentic hospitality experience."
    },
    {
      "duty": "Support sales floor, fitting room, point of sale, and operational processes, as required and ensure all customers feel respected, appreciated, and rewarded."
    },
    {
      "duty": "Leverage omni channel offerings to deliver a frictionless customer experience and build rapport with the customer."
    },
    {
      "duty": "Acknowledge and assist customers through company programs and complete transactions accurately and efficiently while engaging customers."
    },
    {
      "duty": "Train associates to maximize credit and loyalty conversion performance and customer experience."
    },
    {
      "duty": "Oversee daily functions of the Cash Office and onboard, train, and develop associates."
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Operational Efficiency",
      "experience": 5
    },
    {
      "skill": "Omni-Channel Marketing",
      "experience": 5
    },
    {
      "skill": "Retail Operations",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "POS Systems",
      "experience": 5
    },
    {
      "skill": "Cash Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 135,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree in Business Administration or related field (Bachelor's preferred)"
    }
  ]
}