{
  "meta": [
    {
      "job_title": "Beauty Advisor",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Retail",
      "salary": 38000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Merchandising",
      "experience": 1
    },
    {
      "skill": "Retail Operations",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Marketing",
      "experience": 1
    },
    {
      "skill": "Communication",
      "experience": 1
    },
    {
      "skill": "Data Analysis",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Promptly acknowledging and warmly greeting each guest entering the store."
    },
    {
      "duty": "Offering friendly, knowledgeable, and courteous service that always takes priority over other related duties."
    },
    {
      "duty": "Determining each guest’s needs and answering questions concerning products and services."
    },
    {
      "duty": "Recommending additional and complementary products and/or services based on guest interests or items already selected for purchase."
    },
    {
      "duty": "Informing guests of current promotions, events and services within the store, booking appointment for in-store events."
    },
    {
      "duty": "Serving multiple guests at one time while maintaining composure during busy or peak selling times."
    },
    {
      "duty": "Helping to eliminate and/or reduce potential theft of product by providing exceptional guest service and maintaining awareness while on the sales floor."
    },
    {
      "duty": "Courteously handling sales, refunds, and exchanges."
    },
    {
      "duty": "Ensuring all resets and planograms are executed properly."
    },
    {
      "duty": "Setting up advertising displays or arranging merchandise to highlight sales and promotional events."
    },
    {
      "duty": "Ensuring the store is replenished throughout the day and merchandising all products to company standards on shelves and tables."
    },
    {
      "duty": "Participating in physical inventory preparation, execution, and follow-up."
    },
    {
      "duty": "Executing receipt of shipment truck within company guidelines."
    },
    {
      "duty": "Ensuring overall store cleanliness including restrooms, cashwrap, backroom, and sales floor."
    },
    {
      "duty": "Staying informed regarding new or existing products (e.g., their ingredients and benefits) to better serve guests."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma is preferred"
    }
  ]
}