{
  "meta": [
    {
      "job_title": "Wire Harness Designer",
      "job_category": "Engineering",
      "job_class": "Designer",
      "sector": "Automotive",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Catia V6 Design",
      "experience": 5
    },
    {
      "skill": "CAD Experience",
      "experience": 5
    },
    {
      "skill": "Automotive Industry Experience",
      "experience": 4
    },
    {
      "skill": "Electrical Engineering",
      "experience": 4
    },
    {
      "skill": "Drafting and Design",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 4
    },
    {
      "skill": "Computer-Aided Design Software",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and design wiring harnesses using Catia V6 Design platform based on engineering and manufacturing input."
    },
    {
      "duty": "Collaborate with Design Release Engineers to track and communicate CAD status/changes and 2D/3D releases."
    },
    {
      "duty": "Implement Engineering markups with precision and completeness before finalizing drafting/drawing."
    },
    {
      "duty": "Assess drawings to establish design standards, specifications, and required criteria; develop detailed digital prefabrication and assembly drawings for projects."
    },
    {
      "duty": "Collaborate with team members to ensure electrical component specifications, design quality, and timing expectations are achieved."
    },
    {
      "duty": "Participate in design-related matters within the company and with external suppliers to enhance harness and system efficiency."
    },
    {
      "duty": "Provide technical expertise and guidance throughout the vehicle lifecycle; offer troubleshooting and problem-solving for build issues."
    },
    {
      "duty": "Assist in hands-on integration, testing, and troubleshooting of devices on test benches and prototypes."
    },
    {
      "duty": "Execute process improvements based on prior build and test data."
    },
    {
      "duty": "Interpret rough sketches and drawing specifications to create conceptual drawings using Computer-Aided Design Software."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering (BSME, BSEE, BSIE) or equivalent experience"
    }
  ]
}