{
  "meta": [
    {
      "job_title": "Paralegal",
      "job_category": "Legal",
      "job_class": "Associate",
      "sector": "Legal",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Manage contract management system"
    },
    {
      "duty": "Assist with litigation management and tracking"
    },
    {
      "duty": "Track and process invoices for legal department"
    },
    {
      "duty": "Prepare organizational documents; file corporate governance documents"
    },
    {
      "duty": "Manage large amounts of documents, electronic and paper, work with organizing, indexing, tracking, and redlining agreements"
    },
    {
      "duty": "Regulatory and permit management"
    },
    {
      "duty": "Assist in evaluation of contracts including drafting, reviewing, and revising general contracts"
    },
    {
      "duty": "Assist in the maintenance of software utilized by the legal department"
    },
    {
      "duty": "ability to write reports and business correspondence, prepare excel spreadsheets, and prepare PowerPoint presentations"
    },
    {
      "duty": "Conduct online research under supervision of attorneys"
    },
    {
      "duty": "Manage meeting documents and reports"
    },
    {
      "duty": "Draft, review, and revise legal correspondence"
    },
    {
      "duty": "In addition to paralegal tasks, to perform legal assistant tasks including scheduling meetings, preparing and sending letters and legal documents, handling invoice payment, travel, and expense reimbursement"
    },
    {
      "duty": "Assist in due diligence review, data room management and related organizational matters"
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree preferred. Associate's degree required. Five years of paralegal experience required. Prefer experience in litigation, corporate governance and transactional/contract matters. Prior Experience working in an in-house legal department or managing litigation for a business preferred. Proficient in Microsoft Office, including Microsoft Word, Excel, and Outlook. Position-Specific Requirements: Position requires a professional disposition, strong communications skills, and the ability to work independently. Demonstrated ability to work in a fast-paced office environment. Excellent attention to detail. Florida Registered Paralegal required. Florida Notary required."
    }
  ]
}