{
  "meta": [
    {
      "job_title": "Badging Manager",
      "job_category": "Security and Safety",
      "job_class": "Manager",
      "sector": "Security",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Badging and Access Control Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Performance Appraisal",
      "experience": 5
    },
    {
      "skill": "Security Policy Implementation",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Supervision and Leadership",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "English Proficiency",
      "experience": 5
    },
    {
      "skill": "Standard Operating Procedures",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and conduct all badge related audit procedures, and the distribution of their workload, supply ordering and supply budget management."
    },
    {
      "duty": "Selection and placement of Badging Center personnel; career development of team members; conduct performance appraisals."
    },
    {
      "duty": "Oversee the evaluation and implementation of change management and best practices for the entire client access control policy, impacting up to C-suite level optics."
    },
    {
      "duty": "Oversee interpretation and implementation of policy regarding the shrinkage of access-control items which has a substantial impact to client budget and cost."
    },
    {
      "duty": "Oversee the investigation and resolution of issues of nefarious action found during badge audits; make recommendations to customer regarding process improvement and increased security measures."
    },
    {
      "duty": "Oversee quality assurance programs implemented by Badging Center team members; review, select, and compile training materials to design and implement a site/contract-specific training and development program."
    },
    {
      "duty": "Review and apply correction to reporting, review job performance, remove security personnel from their assignment in the event of access control violations; working with cross-functional teams to service client needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma"
    },
    {
      "credential": "Minimum of three (3) years of experience in badging, access systems, or similar programs"
    },
    {
      "credential": "Prior supervisory/management experience, ideally in a security role"
    },
    {
      "credential": "Previous experience in customer service or in an administrative position"
    },
    {
      "credential": "Proficiency in Microsoft Windows and Office Suite"
    },
    {
      "credential": "Ability to read, write, and speak clearly in English"
    }
  ]
}