{
  "meta": [
    {
      "job_title": "ESRI Enterprise Administrator",
      "job_category": "Software Engineering",
      "job_class": "Administrator",
      "sector": "Software Engineering",
      "salary": 90000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Publish and maintain web applications on the ESRI enterprise platform."
    },
    {
      "duty": "Troubleshoot and resolve issues related to published services, ensuring minimal downtime and maximum efficiency."
    },
    {
      "duty": "Administer the ESRI enterprise, including managing user access, permissions, and system configurations."
    },
    {
      "duty": "Collaborate with GIS analysts and developers to enhance the functionality and usability of GIS applications."
    },
    {
      "duty": "Implement best practices for data management, organization, and quality control within the ESRI environment."
    },
    {
      "duty": "Monitor system performance and conduct regular maintenance to optimize resource utilization and prevent potential bottlenecks."
    },
    {
      "duty": "Stay up to date with the latest ESRI technologies, trends, and best practices to ensure continuous improvement of the enterprise GIS platform."
    },
    {
      "duty": "Assist in the development of technical documentation, user guides, and training materials to support GIS users across the organization."
    },
    {
      "duty": "Collaborate with IT teams to integrate GIS capabilities with other enterprise systems."
    },
    {
      "duty": "Work closely with stakeholders to understand their requirements and provide effective GIS solutions."
    },
    {
      "duty": "Participate in GIS projects and contribute to the overall GIS strategy and roadmap."
    },
    {
      "duty": "Performs other related duties as assigned by management."
    },
    {
      "duty": "These tasks do not meet the Americans with Disabilities Act definition of essential job functions and are usually less than 5% of time spent. However, these tasks still constitute important performance aspects of the job."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 75,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree; preferably in GIS, Geography, Computer Science, or related field."
    }
  ],
  "skills": [
    {
      "skill": "ESRI Enterprise Administration",
      "experience": 5
    },
    {
      "skill": "GIS Troubleshooting",
      "experience": 5
    },
    {
      "skill": "GIS Application Development",
      "experience": 3
    },
    {
      "skill": "Data Management",
      "experience": 5
    },
    {
      "skill": "System Maintenance",
      "experience": 5
    },
    {
      "skill": "Technical Documentation",
      "experience": 4
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 5
    },
    {
      "skill": "IT Integration",
      "experience": 4
    }
  ]
}