{
  "meta": [
    {
      "job_title": "Account Executive II",
      "job_category": "Insurance",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Insurance Sales",
      "experience": 5
    },
    {
      "skill": "Underwriting",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Policy Coverage Evaluation",
      "experience": 5
    },
    {
      "skill": "Consulting",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Grow a book of business by selling professional and/or commercial lines products to prospects and providing best-in-class service to existing clients."
    },
    {
      "duty": "Build relationships with prospects as a trusted advisor and evaluate their risks and coverage needs."
    },
    {
      "duty": "Negotiate with underwriters to obtain appropriate and competitive quotes on behalf of clients and review coverage options provided by underwriters."
    },
    {
      "duty": "Meet established service standards, assist clients with policy coverage questions, and evaluate changes to client operation."
    },
    {
      "duty": "Maintain strong working knowledge of the healthcare delivery system and the exposures related to it, including medical specialties, practice modes, medical facilities, and systems."
    },
    {
      "duty": "Participate in training and educational seminars for professional development, ensure compliance with E&S and state-specific regulations, and research market conditions and changes."
    },
    {
      "duty": "Mentor and train account managers, assist in meeting ProAssurance Agency’s initiatives and goals, and perform special projects as directed by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business, insurance, or related field is required. Or 8 years of professional level insurance industry experience may be substituted if bachelor’s degree is not achieved."
    }
  ]
}