{
  "meta": [
    {
      "job_title": "Quality Engineer",
      "job_category": "Engineering",
      "job_class": "Engineering",
      "sector": "Engineering",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops, modifies, applies, and maintains quality standards for products and processes. Provides diverse and complex statistical information for quality improvement by determining and applying testing methods and criteria."
    },
    {
      "duty": "Responsible for guiding technical evaluations, analysis, and related data acquisition processes to achieve division quality objectives."
    },
    {
      "duty": "Assesses quality performance (or cost-of-quality) using statistical and analytical methods. Devices and implements various complex methods and procedures for inspecting, testing, and evaluating the precision, reliability, and accuracy of products, processes, and production equipment."
    },
    {
      "duty": "Develops and establishes advanced quality systems and procedures, inspection plans, quality performance trends, statistical plans, cost estimates, and technical quality plans for proposals. Ensures that project and/or process control documentation is compliant with requirements and/or contracts."
    },
    {
      "duty": "Identifies quality performance, trends, and corrective action by coordinating with customers and suppliers. Ensures compliance with specified quality requirements by performing in-house and supplier audits and surveys. Develops and initiates programs to improve supplier performance."
    },
    {
      "duty": "Designs or specifies inspection and testing mechanisms and equipment and conducts quality assurance tests. Develops sampling plans and inspections by applying attribute, variable, and sequential sampling methods. Devises sampling procedures and designs and develops forms and instructions for recording, evaluating, and reporting quality data."
    },
    {
      "duty": "Develops statistical process controls by applying and maintaining applicable control charts. Analyzes data by completing hypothesis, normal distribution, and process capability analysis tests."
    },
    {
      "duty": "Prepares comprehensive reports by collecting, interpreting, analyzing, and summarizing data and making recommendations."
    },
    {
      "duty": "Acts as a member of the Material Review Board and participates in related activities, failure analysis, and corrective action investigations."
    },
    {
      "duty": "Refines and enhances products and processes by applying continuous improvement and key lean manufacturing/production principles and techniques to critical areas of production."
    },
    {
      "duty": "Represents the company by interfacing with customers and regulatory agencies and assisting with internal and external audits."
    },
    {
      "duty": "May act as the main contact in the audit."
    },
    {
      "duty": "Represents the company on high-level projects. Work assignments may include cross-functional or project team responsibilities (e.g., continuous improvement)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Engineering or other closely related technical field (Master's preferred) and seven or more years of experience in Quality Engineering in a design, manufacture, assembly, and test environment"
    }
  ]
}