{
  "meta": [
    {
      "job_title": "Child Development Center Director",
      "job_category": "Education",
      "job_class": "Director",
      "sector": "Education",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure an educational, caring, and safe child development program to meet the developmental needs of children served by the center."
    },
    {
      "duty": "Manage and supervise the staff, program, and day-to-day operations of the Child Development Center."
    },
    {
      "duty": "Maintain awareness of trends and best practices related to children, families, poverty, and homelessness."
    },
    {
      "duty": "Act as the Instructional Leader in a birth to five child development center."
    },
    {
      "duty": "Ensure compliance with agency policies, state licensing standards, and other regulatory entities."
    },
    {
      "duty": "Develop and monitor expenses monthly to ensure adherence to budget projections and/or revise as needed."
    },
    {
      "duty": "Supervise the instructional staff and non-educational support staff, and lead collaborative curriculum planning."
    },
    {
      "duty": "Refer families and children to appropriate community resources."
    },
    {
      "duty": "Screen, interview, and hire staff in collaboration with the Director of Child and Family Services."
    },
    {
      "duty": "Review the performance of each direct report and communicate the results to the employee and the Director of Child and Family Services."
    }
  ],
  "skills": [
    {
      "skill": "Early Childhood Education",
      "experience": 5
    },
    {
      "skill": "Staff Management",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Policy Compliance",
      "experience": 5
    },
    {
      "skill": "Curriculum Planning",
      "experience": 5
    },
    {
      "skill": "Community Resource Referral",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS or MA in Early Childhood Education, or a closely related field."
    }
  ]
}