{
  "meta": [
    {
      "job_title": "Construction Estimator",
      "job_category": "Engineering",
      "job_class": "Estimator",
      "sector": "Construction",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work with clients, vendors, personnel in other departments and Production to discuss and formulate estimates and resolve issues."
    },
    {
      "duty": "Analyze blueprints and other documentation to prepare time, cost, materials, and labor estimates."
    },
    {
      "duty": "Provide all inclusive bid package to approving parties for evaluation and adjustment."
    },
    {
      "duty": "Confer with engineers, architects, owners, contractors and subcontractors on changes and adjustments to cost estimates."
    },
    {
      "duty": "Prepare estimates used by management for purposes such as planning, organizing, and scheduling work."
    },
    {
      "duty": "Prepare cost and expenditure statements and other necessary documentation at regular intervals for the duration of the project."
    },
    {
      "duty": "Tracking actual costs relative to bids as the project develops."
    },
    {
      "duty": "Set up cost monitoring and reporting systems and procedures."
    },
    {
      "duty": "Conduct special studies to develop and establish standard hour and related cost data or to effect cost reduction."
    },
    {
      "duty": "Review material and labor requirements to decide whether it is more cost-effective to produce or purchase components."
    },
    {
      "duty": "Prepare and maintain a directory of suppliers, contractors and subcontractors."
    },
    {
      "duty": "Requests/coordinates with Purchasing Department to submit bid packages to subcontractors and vendors for specialized portions of project."
    },
    {
      "duty": "Go onboard the ships while in the shipyard as frequently as practical to observe operations at various phases and become familiar with jobsite logistics, means and methods, and operations personnel."
    },
    {
      "duty": "Review and monitor on going jobs for changes from specifications. Estimate cost of change orders."
    },
    {
      "duty": "Compose estimates inclusive to labor man-hours, material and subcontractor requirements based on specifications, complex schematic drawings and related data for various solicitations."
    },
    {
      "duty": "Administer contract changes inclusive to composing, review and submit of offer associated with changes track log and negotiate with customer to finalize changes."
    },
    {
      "duty": "Provide turnover of information to production in regards to awards and authorized contract changes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 70,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Construction Management, Engineering, or a related field (Master's preferred)"
    }
  ]
}