{
  "meta": [
    {
      "job_title": "Credits Manager",
      "job_category": "Credit and Collections",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review past due accounts and plan an effective course of action to maximize collections and minimize past dues."
    },
    {
      "duty": "Initiate collection calls to customers, maintaining accurate and complete log of activities."
    },
    {
      "duty": "Provide customers with detailed information and request payment information."
    },
    {
      "duty": "Research and reconcile customer payments and open balances."
    },
    {
      "duty": "Process accounts up to and including third party agency if necessary."
    },
    {
      "duty": "Analyze individual accounts thoroughly and implement an effective course of action."
    },
    {
      "duty": "Process necessary adjustments on customers account."
    },
    {
      "duty": "Reconcile cash collections with outstanding balances."
    },
    {
      "duty": "Process incoming credit applications, apply sound judgment and objective criteria in assessing credit worthiness, and maintain credit application files."
    },
    {
      "duty": "Assemble required documentation to include responses from provided references, financials, credit reports, and corporate filings."
    },
    {
      "duty": "Recommend and obtain approval from management to change credit ratings as appropriate."
    },
    {
      "duty": "Calculate Bad Debt provisions and recommend to Finance management appropriate write-offs."
    },
    {
      "duty": "Articulate and document Policy and Procedure matters."
    },
    {
      "duty": "Provide recommendations and solutions for account issues."
    },
    {
      "duty": "Prepare ad hoc reporting for month-end, credit meetings, and special needs."
    },
    {
      "duty": "Prepare narrative comments for month-end reporting book."
    },
    {
      "duty": "Prepare schedules and support for month-end internal management reporting."
    },
    {
      "duty": "Create and monitor accounts receivable aging reports and contact delinquent customer accounts for payments."
    },
    {
      "duty": "Respond to internal and external customer inquiries regarding status of customer accounts."
    },
    {
      "duty": "Engage with internal and external customers to address billing."
    },
    {
      "duty": "Address ongoing customer complaints and issues concerning billing or services rendered."
    },
    {
      "duty": "Work with internal departments to implement processes and policies that contribute to accurate invoicing."
    }
  ],
  "skills": [
    {
      "skill": "Credit and Collections Management",
      "experience": 7
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Account Reconciliation",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 7
    },
    {
      "skill": "Microsoft Office",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Finance, Accounting, Economics or related discipline."
    }
  ]
}