{
  "meta": [
    {
      "job_title": "Clinical Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 7
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 7
    },
    {
      "skill": "Business Development",
      "experience": 7
    },
    {
      "skill": "Market Analysis",
      "experience": 7
    },
    {
      "skill": "Negotiation",
      "experience": 7
    },
    {
      "skill": "Presentation Skills",
      "experience": 7
    },
    {
      "skill": "Sales Forecasting",
      "experience": 7
    },
    {
      "skill": "Networking",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Grow sales revenue and test volume in territory by establishing new business in hospitals while increasing volume in existing hospitals."
    },
    {
      "duty": "Collaboration with Inside Sales, Customer Success, Medical Affairs, and Marketing to achieve territory and company goals."
    },
    {
      "duty": "Develop thought leaders and early adopters for this new approach to infectious disease diagnosis."
    },
    {
      "duty": "Help establish the foundation and culture of a world-class commercial organization."
    },
    {
      "duty": "Build, manage and nurture market-based/regional territory, comprising hospital & health system accounts."
    },
    {
      "duty": "Prioritize and segment hospital & health system accounts to maximize opportunity and growth."
    },
    {
      "duty": "Present product features and benefits to key stakeholders and clinical call points, utilizing consultative sales techniques (qualifying leads, assessing needs, supporting evaluations, and closing). Manage early evaluations to activate initial adoption of Karius test/solutions and drive increased utilization over time."
    },
    {
      "duty": "Serve as a subject matter expert, speaking with clinicians of all levels regarding the science and technology of the Karius test and how to best leverage its capabilities. Speak fluently on the unique merits and value of our proprietary test, positioning our differentiation from the competition."
    },
    {
      "duty": "Build deep relationships, educate and drive consensus across multiple stakeholders among both prospective and existing partners."
    },
    {
      "duty": "Develop a ‘trusted advisor’ relationship and establish oneself as fully accountable for demonstrating ROI to the partner account, ensuring both regular interaction and utilization review."
    },
    {
      "duty": "Secure contracts and agreements, where necessary or optimal, to memorialize long-term relationships with partners, define an exchange of value, and augment predictability into revenue."
    },
    {
      "duty": "Manage and secure renewals of partner agreements."
    },
    {
      "duty": "Collaborate with Sales, Marketing, and Product leadership to provide valuable market feedback, to inform all functions."
    },
    {
      "duty": "Partner, and co-present, with Karius’ Clinical/Medical Affairs teams (including Medical Science Liaisons) to support partner interactions, both remote and in-person, and manage follow-up."
    },
    {
      "duty": "Collaborate with Customer Success to onboard new accounts, share feedback, proactively address risks, immediately address concerns/problems, manage expectations, promote successes, and maintain close pulse on the health of the partner."
    },
    {
      "duty": "Partner with Marketing to identify and co-manage regional meeting opportunities, develop Key Opinion Leader (KOL) panels, and other local market activities."
    },
    {
      "duty": "Participate in broader sales meetings, training programs, conventions, and industry trade shows as required."
    },
    {
      "duty": "Complete paperwork and administrative duties in a timely and accurate fashion, including documentation in SalesForce, expense reporting, speaker program information, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree; advanced degree or MBA a plus."
    }
  ]
}