{
  "meta": [
    {
      "job_title": "Senior Account Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 135000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 10
    },
    {
      "skill": "Business Development",
      "experience": 10
    },
    {
      "skill": "Client Relationship Management",
      "experience": 10
    },
    {
      "skill": "Sales Presentations",
      "experience": 10
    },
    {
      "skill": "Contract Negotiation",
      "experience": 10
    },
    {
      "skill": "Market Research",
      "experience": 10
    },
    {
      "skill": "Prospecting",
      "experience": 10
    },
    {
      "skill": "E-commerce Platforms",
      "experience": 7
    },
    {
      "skill": "Professional Services Sales",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Analytical Skills",
      "experience": 10
    },
    {
      "skill": "Goal-Oriented",
      "experience": 10
    },
    {
      "skill": "Selling Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a strategic plan to drive sales growth within Globant Commerce Studio."
    },
    {
      "duty": "Identify new business opportunities through market research and prospecting activities."
    },
    {
      "duty": "Build and maintain strong relationships with key decision-makers."
    },
    {
      "duty": "Develop and deliver sales presentations and proposals to potential clients."
    },
    {
      "duty": "Negotiate contracts and agreements with clients."
    },
    {
      "duty": "Work closely with cross-functional teams to ensure successful implementation of client solutions."
    },
    {
      "duty": "Define/Refine the Go to market strategy for revenue growth of Globant Commerce Studio."
    },
    {
      "duty": "Lead solution definition and scoping to generate technical solutions, estimates, and project implementation approaches."
    },
    {
      "duty": "Define a solution for a customer by recommending relevant Commerce Solutions and broader ecosystem offerings."
    },
    {
      "duty": "Develop propositions for customers based on the PoV for the Industry, including writing proposals."
    },
    {
      "duty": "Present technical topics to senior, technical and business audiences and C-Levels."
    },
    {
      "duty": "Lead or co-lead answers to RFPs issued by clients."
    },
    {
      "duty": "Identifies product improvements or new products by remaining current on industry trends, market activities, and competitors."
    },
    {
      "duty": "Maintains professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; benchmarking state-of-the-art practices; and participating in professional societies."
    },
    {
      "duty": "Contributes to team effort by accomplishing related results as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in computer science or equivalent work experience."
    },
    {
      "credential": "More than 10 years of work experience in IT."
    },
    {
      "credential": "More than 7 years of experience with at least a few eCommerce platforms e.g. Salesforce Commerce Cloud, Commerce Tools, Adobe Commerce or similar."
    },
    {
      "credential": "Having relationships within the relevant platform partner ecosystem would be a huge plus."
    },
    {
      "credential": "At least 5 years of experience in selling and driving professional services business with large-scale US based organizations."
    },
    {
      "credential": "At least 5 years of progressive experience implementing and designing eCommerce solutions."
    },
    {
      "credential": "Excellent communication (written and oral) and interpersonal skills."
    },
    {
      "credential": "Analytical skills."
    },
    {
      "credential": "Goal-Oriented."
    },
    {
      "credential": "Proven track record in sales."
    },
    {
      "credential": "Strong communication, negotiation, sales planning, prospecting skills, meeting sales goals and presentation skills."
    }
  ]
}