{
  "meta": [
    {
      "job_title": "Assistant Development Manager",
      "job_category": "Construction Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Project Management",
      "experience": 4
    },
    {
      "skill": "Quality Control",
      "experience": 4
    },
    {
      "skill": "Progress Oversight",
      "experience": 4
    },
    {
      "skill": "Commercial Building Knowledge",
      "experience": 4
    },
    {
      "skill": "Team Management",
      "experience": 4
    },
    {
      "skill": "Analytical Skills",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as Owner's Representative with the primary responsibility of providing support to the Development Managers who are overseeing and facilitating the completion of a project."
    },
    {
      "duty": "Coordinate with Development Managers and other team members during all phases of a project."
    },
    {
      "duty": "Perform regular site visits to monitor project progress and provide oversight to ensure the project is on schedule and within budget. Report findings to management as needed."
    },
    {
      "duty": "Perform tasks as assigned, including but not limited to scheduling meetings, maintaining project documents, reviewing submittals, coordinating bid process for consultants and contractors, and reviewing change orders."
    },
    {
      "duty": "Act as a liaison between internal team members, consultants, contractors, and stakeholders."
    },
    {
      "duty": "Develop and foster relationships with outside resources, including third-party contractors, consultants, and vendors."
    },
    {
      "duty": "Coordinate with internal and external resources to ensure the project team is maximizing profit and minimizing downside risk."
    },
    {
      "duty": "Communicate and organize with team members to increase the company’s outreach."
    },
    {
      "duty": "Travel may periodically be required up to 25% of the time."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 50,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Engineering, Building Science, Construction Management, Architecture, or closely related field (Master's Preferred)"
    }
  ]
}