{
  "meta": [
    {
      "job_title": "Lead, HR Business Partner",
      "job_category": "Human Resources",
      "job_class": "Business Partner",
      "sector": "HR",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the execution of human resources strategy with key business units and act as a coach and consultant to achieve business strategies by focusing on employee performance, leader & team effectiveness, organizational design, organizational effectiveness, and diversity, equity, and inclusion solutions."
    },
    {
      "duty": "Establish and maintain an understanding of the business, employees, and leaders in the client organizations. Build effective working relationships with key stakeholders and employees at all levels of the organization."
    },
    {
      "duty": "Use insights to assess and provide solutions for key people and business issues. Employ a consultative approach and serve as a coach for leader and team effectiveness."
    },
    {
      "duty": "Collaborate and partner with leaders on organization design, workforce planning, and talent management to build a strong pipeline in the organization. Work closely with talent acquisition partners to attract great talent and ensure a diverse talent pipeline."
    },
    {
      "duty": "Assess employee training and development needs to help close gaps between current and future skill sets. Collaborate effectively across HR and actively support multiple HR priorities as a key member of the team."
    }
  ],
  "skills": [
    {
      "skill": "Business Strategy",
      "experience": 3
    },
    {
      "skill": "Employee Performance",
      "experience": 3
    },
    {
      "skill": "Organizational Design",
      "experience": 3
    },
    {
      "skill": "Talent Management",
      "experience": 3
    },
    {
      "skill": "Employee Training",
      "experience": 3
    },
    {
      "skill": "Talent Acquisition",
      "experience": 3
    },
    {
      "skill": "HR Collaboration",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 155,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent in Human Resources Management"
    }
  ]
}