{
  "meta": [
    {
      "job_title": "Customer Service Specialist",
      "job_category": "Customer Service",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Retail Experience",
      "experience": 1
    },
    {
      "skill": "Point-of-Sale Service",
      "experience": 1
    },
    {
      "skill": "Animal Nutrition Knowledge",
      "experience": 3
    },
    {
      "skill": "Product Knowledge",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Teamwork",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide exceptional customer service and product knowledge to guests within a pet care environment."
    },
    {
      "duty": "Engage with customers to determine their needs and make appropriate product and service suggestions."
    },
    {
      "duty": "Handle cash sales, credit and check transactions, and complete daily balance of cash drawer."
    },
    {
      "duty": "Stay updated on pet-related events and resources within the community and share this knowledge with customers."
    },
    {
      "duty": "Passionately promote animal welfare and integrity in the work area."
    },
    {
      "duty": "Stay knowledgeable about new products and services to effectively engage with customers."
    },
    {
      "duty": "Polite and professional response to inquiries regarding products, services, and pricing via telephone."
    },
    {
      "duty": "Create a positive culture of teamwork, inclusion, and collaboration."
    },
    {
      "duty": "Inform guests about upcoming adoption events and explain the 'Think Adoption First' philosophy."
    },
    {
      "duty": "Familiarize with current promotions, special services, and seasonal training."
    },
    {
      "duty": "Evaluate guest inquiries and refer to the Leader on Duty when needed."
    },
    {
      "duty": "Bend, kneel, lift (up to 50 pounds), and stand for long periods of time as necessary."
    },
    {
      "duty": "Utilize selling behaviors and contribute to a safe environment to provide an amazing guest experience within the pet care locations."
    },
    {
      "duty": "Be a part of a collaborative culture centered around solving for the health and wellness needs of pets."
    },
    {
      "duty": "Engage in career development and participate in developmental programs to support growth throughout the career."
    },
    {
      "duty": "Ask discovery questions to understand customer needs, communicate clearly and concisely, provide appropriate level of detail, and address customer needs."
    },
    {
      "duty": "Perform ethically, choose correctly, relate to others, perform work effectively, strive for results, readily adapt, and improve performance."
    },
    {
      "duty": "Maintain basic computer skills to quickly research information from the Internet, access product information using the PETCO PetNet and POLARIS system, and be certified on all Companion Animal Departments. Must also be Nutrition certified and PIJAC certified (California only)."
    },
    {
      "duty": "Have a thorough understanding of all aspects of Pet Services, previous PETCO experience preferred."
    },
    {
      "duty": "Conduct majority of job duties indoors, with some merchandise stocking and customer carry-outs requiring leaving the location briefly. Bending, kneeling, lifting (up to 50 pounds), and standing for long periods of time will be necessary, as the majority of time will be spent in direct contact with customers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED is generally preferred."
    },
    {
      "credential": "Minimum of 2 years of experience in providing public information in the animal nutrition, care/wellness/treatment knowledge areas, and a minimum of one year in a retail environment is highly preferred. Possess basic computer skills with the ability to quickly research information from the Internet. Must be proficient in the use of the PETCO PetNet and have the ability to access product information using the POLARIS system. Must be certified on all Companion Animal Departments. Must be Nutrition certified. Must be PIJAC certified (California only)."
    },
    {
      "credential": "Previous PETCO Experience Preferred."
    },
    {
      "credential": "The majority of job duties are conducted indoors, although merchandise stocking and customer carry-outs will require that an associate leave the location briefly. Because this position requires bending, kneeling, lifting (up to 50 pounds, as necessary) and standing for long periods of time. The large majority of this associate’s time will be spent in direct contact with our customers."
    }
  ]
}