{
  "meta": [
    {
      "job_title": "Assistant Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 2
    },
    {
      "skill": "Client Relations",
      "experience": 2
    },
    {
      "skill": "Team Leadership",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Technical Skills",
      "experience": 2
    },
    {
      "skill": "Microsoft Project",
      "experience": 2
    },
    {
      "skill": "Microsoft Excel",
      "experience": 2
    },
    {
      "skill": "Procore",
      "experience": 2
    },
    {
      "skill": "Bluebeam",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide project management experience to designated projects and assignments for a particular client account, property portfolio, or large facility/complex through interaction with the client and project management staff."
    },
    {
      "duty": "Monitor and coordinate the execution of various services and processes relating to client-contracted agreements for project management and tenant improvement consulting services."
    },
    {
      "duty": "Chairs and schedules meetings, prepares agendas, develops and maintains master project budgets and timelines as required for each project and project phase to ensure overall project objectives and client needs are met."
    },
    {
      "duty": "Assist in the selection and contracting process of consultants and construction teams as necessary for each project."
    },
    {
      "duty": "Participate in the marketing and presentation of services to clients."
    },
    {
      "duty": "Maintain high qualitative and quantitative standards of work performance, convey these expectations to others, and provide all necessary documentation and reports to the client and building/facility management team."
    },
    {
      "duty": "Strive constantly to improve skill and working knowledge in themselves and others; keep up to date in the field of specialization."
    },
    {
      "duty": "Cooperate with other building/facility personnel to achieve corporate goals and objectives as to quality, service, cost, and profit."
    },
    {
      "duty": "Implement government laws and regulations and adhere to established rulings of government authorities."
    },
    {
      "duty": "Carry out responsibilities in a professional, courteous manner at all times."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. degree in Engineering, Architecture, Construction Management or similar"
    }
  ]
}