{
  "meta": [
    {
      "job_title": "Territory Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "New Business Development",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Brand Representation",
      "experience": 5
    },
    {
      "skill": "Sales Reporting",
      "experience": 5
    },
    {
      "skill": "Customer Relations",
      "experience": 5
    },
    {
      "skill": "CRM Software",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a comprehensive sales strategy for the assigned territory, outlining goals, objectives, and action plans to achieve and exceed sales targets."
    },
    {
      "duty": "Maintain and strengthen relationships with existing accounts, ensuring regular communication, addressing concerns, and identifying upselling opportunities."
    },
    {
      "duty": "Identify and pursue new business opportunities within the territory, including prospecting potential accounts, negotiating contracts, and closing deals."
    },
    {
      "duty": "Possess in-depth knowledge of the beer portfolio, including flavor profiles, brewing processes, and production methods, enabling confident education of clients and consumers."
    },
    {
      "duty": "Continuously monitor market trends, competitive landscape, and consumer preferences to identify opportunities for growth and adaptation."
    },
    {
      "duty": "Serve as the brand ambassador at events, trade shows, and industry functions, fostering a positive brand image and expanding brand visibility."
    },
    {
      "duty": "Maintain accurate and up-to-date records of sales activities, account interactions, and market insights, regularly reporting to the Sales Director."
    },
    {
      "duty": "Provide exceptional customer service by promptly addressing inquiries, resolving issues, and building strong relationships with key accounts."
    },
    {
      "duty": "Work closely with the marketing and distribution teams to align on promotional strategies, product launches, and inventory management."
    },
    {
      "duty": "Travel within the designated territory to meet clients and prospects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Marketing, or a related field (or equivalent work experience)"
    }
  ]
}