{
  "meta": [
    {
      "job_title": "Visual Experience Designer",
      "job_category": "Creative",
      "job_class": "Designer",
      "sector": "Software Engineering",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "User Experience Design",
      "experience": 5
    },
    {
      "skill": "Visual Design",
      "experience": 5
    },
    {
      "skill": "Figma",
      "experience": 3
    },
    {
      "skill": "Interaction Design",
      "experience": 4
    },
    {
      "skill": "Typography",
      "experience": 4
    },
    {
      "skill": "Color Theory",
      "experience": 4
    },
    {
      "skill": "Animation",
      "experience": 3
    },
    {
      "skill": "Problem-solving",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create high-quality visual design deliverables including hi-fidelity UI mockups, icons, illustrations, prototypes, and visual assets for production, using Figma and other design software."
    },
    {
      "duty": "Partner closely with the experience design team, program management, and engineering team in exploring, planning, verifying, and building solutions that scale."
    },
    {
      "duty": "Adapt existing UI to modern mobile and web UI paradigms, balancing the needs of platform-specific patterns with consistent cross-platform user experiences."
    },
    {
      "duty": "Advocate for the Autodesk Design System, apply design standards to the product UI to create cohesive user experiences within and across products, and constantly look for opportunities to contribute back to the Autodesk Design System."
    },
    {
      "duty": "Contribute to efforts to strengthen platform-thinking perspective and improve design processes to help drive experience cohesion."
    },
    {
      "duty": "Engage as an active member of a diverse global design community."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Design, User Experience, Visual Arts, or a related field (Master's preferred)"
    }
  ]
}