{
  "meta": [
    {
      "job_title": "Procurement Manager",
      "job_class": "Manager",
      "job_category": "Purchasing",
      "sector": "Supply Chain",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Propose improvements to the current purchasing system that will improve vendor relationships and lower the cost of doing business."
    },
    {
      "duty": "Collaborate with inventory control and sales to develop metrics for gauging inventory level needs and then maintaining those levels throughout the year."
    },
    {
      "duty": "Take the lead in creating profitable ways to manage obsolete and slow-moving stock to help offset losses."
    },
    {
      "duty": "Manage the company's day-to-day purchasing activities and ensure that all purchasing agents are meeting their personal performance standards."
    },
    {
      "duty": "Responsible for the procurement of goods and services for the company."
    },
    {
      "duty": "Manages each part of the supply chain to ensure consistent delivery of goods and services while identifying possible obstacles that may affect productivity."
    },
    {
      "duty": "Assist in developing more effective invoicing and collection processes."
    },
    {
      "duty": "Developing sound, cost-effective strategies for the purchasing of materials used in the business."
    },
    {
      "duty": "Maintaining relationships with suppliers while continually scouting for additional vendors"
    },
    {
      "duty": "Evaluating spending operations while seeking ways to improve and enhance the quality of products purchased and the timeliness of deliveries"
    },
    {
      "duty": "Communicating with management regularly regarding the efficient flow of goods and services affecting production."
    },
    {
      "duty": "Conducting cost analysis and setting benchmarks for improvement."
    },
    {
      "duty": "Developing risk management procedures to mitigate losses in the event of product shortages."
    },
    {
      "duty": "Supervising a purchasing team and delegating tasks across departments when necessary."
    },
    {
      "duty": "Working closely with the company legal department to make sure contracts and terms are favorable."
    },
    {
      "duty": "Performs other duties as directed."
    }
  ],
  "skills": [
    {
      "skill": "Purchasing",
      "experience": 10
    },
    {
      "skill": "Inventory Control",
      "experience": 10
    },
    {
      "skill": "Supply Chain Management",
      "experience": 10
    },
    {
      "skill": "Negotiation",
      "experience": 10
    },
    {
      "skill": "Vendor Management",
      "experience": 10
    },
    {
      "skill": "Cost Analysis",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Invoicing",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Contract Management",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 110,
      "student_teacher": 90,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree with preference in Purchasing or Supply Chain Management (Master's preferred)"
    },
    {
      "credential": "CPM, CPSM or similar certification preferred"
    }
  ]
}