{
  "meta": [
    {
      "job_title": "IT Voice and Collaboration Platform Manager",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Information Technology",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Voice and Video Design",
      "experience": 5
    },
    {
      "skill": "Technology Selection",
      "experience": 5
    },
    {
      "skill": "Cloud Calling Technologies",
      "experience": 5
    },
    {
      "skill": "Vendor Selection",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Decision Making",
      "experience": 5
    },
    {
      "skill": "Technical Aptitude",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan the overall design and oversee the development of voice/collaboration platforms."
    },
    {
      "duty": "Develop the strategic IT plan to enable voice and video services delivery through consistent approaches and solutions across all lines of business."
    },
    {
      "duty": "Participate in disaster recovery infrastructure planning, building, and testing."
    },
    {
      "duty": "Define and deliver continuous improvement plans and programs so that system availability and performance is improved."
    },
    {
      "duty": "Communicate architecture decisions, roadblocks, and timelines to stakeholders."
    },
    {
      "duty": "Manage the design and approach to access, security, continuity, and maintenance of all services."
    },
    {
      "duty": "Participate in discussions with vendors and suppliers to resolve critical network issues and support the implementation of new technologies."
    },
    {
      "duty": "Serve as a technical mentor for staff through sharing knowledge and developing staff."
    },
    {
      "duty": "Defines and maintains all voice and video service’s key performance indicator (KPI) metrics."
    },
    {
      "duty": "Works collaboratively with IT leaders on strategic network services initiatives to continuously improve policy, standard, and procedures."
    },
    {
      "duty": "Analyzes market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Participates in disaster recovery infrastructure planning, building, and testing."
    },
    {
      "duty": "Defines and delivers continuous improvement plans and programs so that system availability and performance is improved."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a quantitative or business field (e.g., statistics, mathematics, engineering, computer science)"
    }
  ]
}