{
  "meta": [
    {
      "job_title": "Agile Coach",
      "job_category": "Technology",
      "job_class": "Coach",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Agile Coaching",
      "experience": 5
    },
    {
      "skill": "Agile Methods (Scrum, Kanban)",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Servant Leadership",
      "experience": 5
    },
    {
      "skill": "Facilitation",
      "experience": 5
    },
    {
      "skill": "Agile Training",
      "experience": 5
    },
    {
      "skill": "Collaboration Tools",
      "experience": 5
    },
    {
      "skill": "Agile Lifecycle Management",
      "experience": 5
    },
    {
      "skill": "Learning Management Systems",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide thought leadership and hands-on guidance to business and technology teams to drive a smooth transition into a Lean Agile mindset."
    },
    {
      "duty": "Engage with teams through observation/interaction, workshops, and training to increase understanding and productivity improvements to foster a cohesive Agile approach within the organization."
    },
    {
      "duty": "Support or lead service delivery including facilitation and continuous improvement."
    },
    {
      "duty": "Identify, introduce, and coach teams on opportunities for improvement and growth through coaching and questioning."
    },
    {
      "duty": "Deliver training to support delivery teams, scrum masters, product owners, managers, and leaders to better understand their roles and how they can best support the organization’s transformation to lean-agile ways of working."
    },
    {
      "duty": "Assess the health and agility of teams to help them identify areas for improvement and support them on their agile journey."
    },
    {
      "duty": "Train team members on Agile process and methodologies. Provide objective guidance free of personal or political bias."
    },
    {
      "duty": "Understand the goals of the project, create Agile development strategy, and assist in developing project planning and strategy."
    },
    {
      "duty": "Improve delivery team effectiveness through analysis, teaching, facilitation, and impediment removal."
    },
    {
      "duty": "Assess agile maturity of teams and coach to higher levels of maturity at a sustainable pace."
    },
    {
      "duty": "Communicate with stakeholders to address Agile knowledge gaps and support agile effectiveness."
    },
    {
      "duty": "Assist product owner in writing user stories and teams in estimating user stories. Assist Scrum Master with preplanning, planning, daily scrum, and retrospectives."
    },
    {
      "duty": "Develop strategies and tactics that drive enterprise agility through various learning modes and storytelling."
    },
    {
      "duty": "Collaborate with peers to support high-priority initiatives and build effective relationships with key stakeholders and cross-functional teams."
    },
    {
      "duty": "Manage key vendor relationships and align content to context, responsible for supplier performance and investment decisions and outcomes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience in a related field. Professional Agile Certification and industry experience in Agile roles. Must have strong knowledge of Agile Lifecycle Management tools and collaboration tools."
    }
  ]
}