{
  "meta": [
    {
      "job_title": "Production Superintendent",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Aircraft Maintenance",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Formulate policies, manage daily operations, and plan the use of materials and human resources for management of aircraft maintenance operations."
    },
    {
      "duty": "Ensure airworthiness of the Special Air Mission (SAM) aircraft fleet transporting high-ranking national and international dignitaries."
    },
    {
      "duty": "Responsible for work control, planning, and implementing company safety and environmental protection policies."
    },
    {
      "duty": "Direct maintenance, repair, and operation of all assigned systems and supporting infrastructure affecting aircraft airworthiness."
    },
    {
      "duty": "Implement daily flying schedules to ensure all aircraft requirements are met."
    },
    {
      "duty": "Chair the daily maintenance planning and scheduling meetings."
    },
    {
      "duty": "Serve as the point of contact for all aircraft maintenance and issues relating to aircraft operations mission support."
    }
  ],
  "skills": [
    {
      "skill": "Aircraft Maintenance",
      "experience": 15
    },
    {
      "skill": "Operations Management",
      "experience": 15
    },
    {
      "skill": "Leadership",
      "experience": 15
    },
    {
      "skill": "Safety Management",
      "experience": 15
    },
    {
      "skill": "Quality Control",
      "experience": 15
    },
    {
      "skill": "Emergency Procedures",
      "experience": 15
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience in Air Force/civilian aircraft maintenance and fifteen or more years in a DOD and or Civilian operations management environment."
    },
    {
      "credential": "FAA certificate mechanic with an airframe and power plant rating."
    }
  ]
}