{
  "meta": [
    {
      "job_title": "Sr. Compliance Manager",
      "job_category": "Compliance",
      "job_class": "Manager",
      "sector": "Pharmaceutical",
      "remote": false,
      "salary": 150000
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide trusted compliance guidance for Good Clinical Practice (GCP), Good Pharmacovigilance Practice (GVP), and healthcare compliance-related activities."
    },
    {
      "duty": "Work closely with other members of compliance teams to advance innovative, patient-focused solutions."
    },
    {
      "duty": "Develop Medical Affairs procedures aligned with global and local regulations and policies."
    },
    {
      "duty": "Design medical and healthcare-related monitoring strategies for U.S. Medical Affairs."
    },
    {
      "duty": "Ensure communication regarding quality and compliance throughout the U.S. Medical Affairs organization."
    },
    {
      "duty": "Develop and maintain U.S. Medical Affairs and business-facing SOPs, working documents, and job aids."
    },
    {
      "duty": "Provide compliance subject matter expertise to the U.S. Medical Affairs organization."
    },
    {
      "duty": "Support routine and ad hoc audits to monitor internal and external compliance."
    },
    {
      "duty": "Participate in Study Management Team (SMT) meetings and be a strategic partner for study teams."
    },
    {
      "duty": "Develop targeted, effective, and efficient compliance training for U.S. Medical Affairs."
    },
    {
      "duty": "Lead and participate in cross-functional initiatives, working groups, and project teams."
    },
    {
      "duty": "Contribute to short- and long-term departmental objectives, plans, programs, projects, and budgets for quality-related efforts."
    },
    {
      "duty": "Maintain current knowledge and understanding of Client’s products, medical and business strategies, and external factors."
    },
    {
      "duty": "Provide guidance and coaching to compliance team members."
    }
  ],
  "skills": [
    {
      "skill": "Compliance Management",
      "experience": 7
    },
    {
      "skill": "Risk Mitigation",
      "experience": 7
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 7
    },
    {
      "skill": "Life Sciences",
      "experience": 7
    },
    {
      "skill": "Medical Affairs",
      "experience": 7
    },
    {
      "skill": "Cross-functional Leadership",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Conflict Resolution",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree required in Life Sciences or other relevant technical disciplines. Advanced degree in life sciences or other relevant technical disciplines strongly preferred."
    }
  ]
}