{
  "meta": [
    {
      "job_title": "Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Hospitality",
      "salary": 23,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Open door and shut off alarm. Set lights and air conditioning."
    },
    {
      "duty": "Read Red Book and try to solve any pending issues from previous shift."
    },
    {
      "duty": "Assign opening duties to all Front of the House positions."
    },
    {
      "duty": "Review break violations reports and provide corrections."
    },
    {
      "duty": "Check email for catering orders and office requests. Send labor log and sales report."
    },
    {
      "duty": "Conduct 5 minutes meeting to communicate to employees about safety, guest service, any food related items, promotions, and training."
    },
    {
      "duty": "Prepare all paperwork and set cash for registers. Control cash and other receipts by adhering to cash handling and reconciliation procedures in accordance with policies and procedures."
    },
    {
      "duty": "Ensure that caffé is setup correctly."
    },
    {
      "duty": "Receive all pastries and dessert items for quality and presentation."
    },
    {
      "duty": "Receive all deliveries from all vendors, check in and organize stock."
    },
    {
      "duty": "Check uniforms for name badge, swipe cards, safety shoes, safety belts, and cutting gloves."
    },
    {
      "duty": "Prepare all required paperwork, including forms, reports, and schedules in an organized and timely manner."
    },
    {
      "duty": "Terminations need approvals from either Founder, Area Supervisor, and/or Human Resources."
    },
    {
      "duty": "Check trash outside, umbrellas, and outside set up."
    },
    {
      "duty": "Send employees on break, observe and provide training for employee’s performance and work productivity."
    },
    {
      "duty": "Every half hour check for guest satisfaction inside and outside dining areas. Deal with all Guest issues. Make sure you carry guest coupons with you always."
    },
    {
      "duty": "Deal with all employee issues including disciplinary actions."
    },
    {
      "duty": "Close registers and count and verify all monies."
    },
    {
      "duty": "Check and maintain the overall appearance of the caffé inside and outside."
    },
    {
      "duty": "Communicate with co-managers and cashiers about any 86 items."
    },
    {
      "duty": "Communicate with co-managers any guest and employee issues."
    },
    {
      "duty": "Use safety belt and safety shoes at all times. Use hand truck to move or lift anything over 15 lbs. Must perform physical activities in a variety of environmental conditions that require moderate strength including climbing, lifting, balancing, walking, and handling of materials. Must be able to stand for long periods of time. The position requires lifting of 25 lbs. anything over 25 lbs. assistance will be given to you. Watch for wet floors and spillage, put signs and dry immediately. CLEAN AS YOU GO! Watch for food, debris, and objects on the floor. The position requires the employee to be friendly and courteous. Our Guests always come first! Use Please and Thank you at all times!"
    },
    {
      "duty": "The ability to lift 25/pounds regularly & un-assisted. The ability to respond quickly to sounds. The ability to move safely over uneven terrain or in confined spaces. The ability to safely climb ladders. The ability to work in cold temperatures. The ability to wear personal protective gear correctly most of the day. The ability to perform repetitive standing, walking, squatting, bending, kneeling, twisting, stooping, balancing, reaching, pushing."
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Catering Management",
      "experience": 5
    },
    {
      "skill": "Cash Handling",
      "experience": 5
    },
    {
      "skill": "Guest Relations",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 140,
      "introvert_extrovert": 75
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Hospitality Management, Business, or a related field (Master's preferred)"
    }
  ]
}