{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Project Management",
      "job_class": "Professional",
      "sector": "Management",
      "salary": 90000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Strategic mapping of a high-level Project Plan and conducting a project scope and timeline review."
    },
    {
      "duty": "Managing engineering resources and equipment, including being the single point-of-contact for Customer and coordinating all Project-related activities through completion of tasks and Deliverables."
    },
    {
      "duty": "Hosting a kickoff meeting to communicate the schedule, responsibilities, and expectations and developing the deployment schedule and delivering the final Project Plan for formal review and acceptance with the Customer."
    },
    {
      "duty": "Conducting administrative functions such as completion of weekly status reports, attendance at project meetings, and project issue escalations."
    },
    {
      "duty": "Identifying and documenting dependencies, risks, and issues associated with the successful completion of the project and delivering weekly project status reports to the Customer."
    },
    {
      "duty": "Coordinating and managing all Subcontractor responsibilities under the SOW and delivering end-of-project report(s) and presenting key findings and recommendations."
    },
    {
      "duty": "Acting as the focal point for change control management and escalating any project-related issues requiring assistance to the Customer’s Project Manager."
    },
    {
      "duty": "Jointly developing milestones and delivery dates with the Customer and providing a handover, follow-on actions, lessons learned, and exception reports upon project completion."
    },
    {
      "duty": "Coordinating efforts with installation partners and being responsible for the management of the Project Plan and Deliverables."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Resource Management",
      "experience": 5
    },
    {
      "skill": "Stakeholder Communication",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Project Management, Engineering, or a related field (Master's preferred)"
    }
  ]
}