{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Resource Allocation",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 6
    },
    {
      "skill": "Change Control",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 6
    },
    {
      "skill": "Sales Engagement",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, organize, and manage the implementation of large-scale and complex projects/programs to meet scope, timing, and budget expectations."
    },
    {
      "duty": "Analyze work plans and schedules and develop project progress and status reports, including executive status updates."
    },
    {
      "duty": "Coordinate and facilitate project meetings, develop meeting minutes, and track/manage action items."
    },
    {
      "duty": "Assess/manage risk, impacts, and potential alternatives and escalate as required to the appropriate level of management."
    },
    {
      "duty": "Set program objectives and establish clear measures to successfully define and meet project deliverables and timelines."
    },
    {
      "duty": "Define Key Performance Indicators (KPI), training, process standards, policies, and procedures associated with complex projects."
    },
    {
      "duty": "Ensure adherence to project-related policies and processes, reiterate scope, roles/responsibilities, and schedule on a regular basis."
    },
    {
      "duty": "Identify additional sales opportunities, engage Sales organization as appropriate, and act as a customer-facing single point of contact during the project."
    },
    {
      "duty": "Understand project goals and objectives as it relates to customer’s business strategies and long-term needs."
    },
    {
      "duty": "Mentor and lead other teammates."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree and/or 5+ years of related experience. Project Management Professional or PRINCE2 Certification is preferred. 6+ years in project management experience."
    }
  ]
}