{
  "meta": [
    {
      "job_title": "Spa Supervisor",
      "job_category": "Spa & Wellness",
      "job_class": "Supervisor",
      "sector": "Hospitality",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Service Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Spa & Wellness Operations",
      "experience": 5
    },
    {
      "skill": "Training and Coaching",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Sales and Promotion",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as an Ambassador for the spa representing the brand values for colleagues establishing relationships with internal and external stakeholders representing the values of the brand and Accor."
    },
    {
      "duty": "Manage the operations and efficiency of the spa and wellness facilities."
    },
    {
      "duty": "Effective colleague communication and welfare for new and existing staff as well as other departments at the property."
    },
    {
      "duty": "Support strategic initiatives for the spa and wellness areas applicable to the hotel to help market the overall well-being offer / product which is executed by the Spa Director."
    },
    {
      "duty": "Knowledgeable about all aspects of treatments, spa therapy, and the facility; in person and over the telephone."
    },
    {
      "duty": "Training and coaching of spa colleagues."
    },
    {
      "duty": "Maintaining a high level of professionalism in all aspects of the job."
    },
    {
      "duty": "Carry out any other duties and responsibilities as assigned by the hotel team."
    },
    {
      "duty": "Schedule treatment bookings and ensure smooth operation of the reception."
    },
    {
      "duty": "Implement monthly promotions or offers to drive business and maximize revenues with a focus on treatment, membership, and other sales."
    },
    {
      "duty": "Ensure spa staff are maximizing the spa bookings, upselling, and tracking any lost business."
    },
    {
      "duty": "Operate point of sale system and collect payments from clients for all services rendered."
    },
    {
      "duty": "Maintain inventory and stocking of all reception materials and their accurate records as required by local regulations."
    },
    {
      "duty": "Report any maintenance requirements of the spa."
    },
    {
      "duty": "Responsible for driving the guest experience and communication amongst the colleagues orchestrating a smooth guest sequence delivery."
    },
    {
      "duty": "Ensure guest preferences and special requests are accommodated to the best of the property’s abilities."
    },
    {
      "duty": "Perform regular treatment and facility audits to maintain brand standards."
    },
    {
      "duty": "Be present in daily operations to oversee the success of the guest and colleague experience, including daily walk-throughs to assess quality."
    },
    {
      "duty": "Provide tools for the team to best manage the day-to-day operations resulting in excellent and anticipated guest service."
    },
    {
      "duty": "Train reception and spa attendant staff to ensure outstanding guest service."
    },
    {
      "duty": "Ensure the spa is receiving the highest ratings from the TrustYou VOG scores as well as LQA guest satisfaction and is a priority at all times"
    },
    {
      "duty": "Follow and ensure that all colleagues follow all safety procedures and practices of the property; lead by example."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Certification in Spa and Wellness Management and/or Bachelor's degree in Hospitality or related field"
    }
  ]
}