{
  "meta": [
    {
      "job_title": "Project Manager - III",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Technology",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead complex programs or projects including vendor product implementations, infrastructure initiatives, cloud migration, cyber security efforts, platform and network upgrades, operationalizing processes, and more."
    },
    {
      "duty": "Engage with stakeholders both within the Bank and at System IT to provide comprehensive program/project management oversight on various initiatives."
    },
    {
      "duty": "Collaborate with senior leadership to establish scope, success criteria, appropriate delivery model, and communication plan that ensures sufficient engagement and transparency across all stakeholders."
    },
    {
      "duty": "Ensure project and/or product success by monitoring, measuring, and communicating project progress, potential risks/delays, and team performance to internal stakeholders."
    },
    {
      "duty": "Lead meetings of project workgroups, including facilitating discussion around project deliverables, identifying action items, and assigning tasks to team members for follow up and completion."
    },
    {
      "duty": "Create presentations for report outs, including relevant visual presentation materials and written narrative as needed. Ensure that the project adheres to established Bank and System project standards, including creation and maintenance of required project artifacts."
    },
    {
      "duty": "Manage risk throughout the project lifecycle and make contingency plans to manage issues that pose risk to budget, timely delivery, or functionality."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Project Management, Business, or a related field (Master's preferred)"
    }
  ]
}