{
  "meta": [
    {
      "job_title": "Office Support Specialist",
      "job_category": "Administration",
      "job_class": "Specialist",
      "sector": "Administration",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides clerical/administrative assistance/support, as assigned, which may include,but is not limited to, the following tasks:\nCoordinates the bi-weekly Incident Determination Committee (IDC) meeting. Develops and submits agendas, to include case information, to the CAP supervisor or his/her designee for approval. Notifies commands by letter and email of case presentations. Prepares presentation materials for IDC board members and command representatives. Contacts command representatives and board members to ensure attendance. Prepares disposition letters to commands. Prepares minutes of meetings and 2486's that address CRC findings. Completes entries in and maintains the Counseling Case Log and FAP Case Log and checks the FAP Data Base to obtain any pertinent history on a new referral providing, when possible, the results to the assigned worker prior to the first formal assessment. Utilizes appropriate databases and Central Registry to ensure complete and accurate information on the sponsor and prior FAP history. As directed, implements customer evaluation procedures to gather customer feedback and satisfaction with services offered. Reviews, revises, and maintains CAP local standard operating procedures (SOPs) to ensure proper grammar, punctuation, and administrative content. Tracks to ensure specialized program/clinical information is updated by staff specialists periodically and at the frequency required by Center policy. Conducts prior history screenings for Child Development, MWR and other requesting agencies as directed. The employee uses the full range of functions, including advanced processes of one or more word processing software and/or desktop publishing application to produce a variety of documents. May also use various functions of other software types such as calendars, electronic mail, spreadsheets, or graphics. The employee plans and carries out assignments with considerable independence. Operates a computer, peripheral equipment, and appropriate software to perform various computer operations in support of office operations, such as producing reports and maintaining databases, etc. Uses basic and advanced program functions to perform such operations as updating and revising databases and searching for and retrieving data for reports. When preparing correspondence, reports, presentation and briefing materials, integrates material from one type of software application (i.e. database, graphics, spreadsheet) into the word processing document. Maintains documents in electronic files for easy retrieval. Creates/maintains a database for program statistical tracking. Makes backup copies of stored data as appropriate. In a timely and accurate manner, enters workload and other key data into a web-based database and generates/disseminates reports as directed. Other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Clerical Support",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Social Service Knowledge",
      "experience": 2
    },
    {
      "skill": "Technical Writing",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ]
}