{
  "meta": [
    {
      "job_title": "Senior Account Executive",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Decision Making",
      "experience": 10
    },
    {
      "skill": "Financial Statements Analysis",
      "experience": 10
    },
    {
      "skill": "Business Development",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Makes daily funding decisions and reviews daily transactions for accuracy and risk issues."
    },
    {
      "duty": "Manages collateral performance and conducts client and portfolio reviews."
    },
    {
      "duty": "Monitors statistical trends and financial performance of clients, taking appropriate action if needed."
    },
    {
      "duty": "Maintains proper client risk ratings and makes decisions on collection and verification call levels and coverage."
    },
    {
      "duty": "Formulates an exit strategy if needed to minimize potential losses."
    },
    {
      "duty": "Recover funds advanced in a collect-out situation and ensures all chargeable fees are processed when required."
    },
    {
      "duty": "Assists in field exams if required and undertakes client visits if necessary."
    },
    {
      "duty": "Maintains client risk ratings and ensures client terms are set up correctly."
    },
    {
      "duty": "Provides continuous support to Collateral Analysts and Data Entry teams."
    },
    {
      "duty": "Undertakes other related duties and tasks as necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a business-related field preferred."
    },
    {
      "credential": "Five to 10 years Factoring and/or ABL experience with a financial institution."
    },
    {
      "credential": "Computer literate with excellent keyboarding skills and competency with Microsoft Office; ability to learn new systems quickly."
    },
    {
      "credential": "Excellent verbal and written communication skills required, strong customer service."
    }
  ]
}