{
  "meta": [
    {
      "job_title": "Senior Paralegal",
      "job_category": "Legal",
      "job_class": "Paralegal",
      "sector": "Legal",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain insider beneficial ownership for proxy statement."
    },
    {
      "duty": "Prepare D&O questionnaires."
    },
    {
      "duty": "Prepare and file Forms 3, 4 and 5."
    },
    {
      "duty": "Assist with other SEC filings (8-K, 10-Q, 10-K)."
    },
    {
      "duty": "Reporting to NYSE and DTC."
    },
    {
      "duty": "Oversee entity management and corporate services, including incorporations, amendments, qualifications, withdrawals, name changes, and tracking registrations/ filing reports."
    },
    {
      "duty": "Provide information, copies of documents, and certificates to a wide range of internal and external clients including Tax, Finance and Treasury Departments, as well as vendors, outside counsel and internal counsel."
    },
    {
      "duty": "Obtain apostilles and other legalizations of corporate records and other documents."
    },
    {
      "duty": "Prepare minutes, consents and resolutions to authorize corporate activities."
    },
    {
      "duty": "Maintain corporate books and records, databases of legal entities."
    },
    {
      "duty": "Assist with various corporate reorganizations assigned by attorneys and tax dept."
    },
    {
      "duty": "Assist with M&A and divestitures as needed, including integration of acquisitions into company structure by adopting standard bylaws and officer and director slates, changing names, etc."
    },
    {
      "duty": "Supervise Corporate Specialist who assists with various corporate matters."
    },
    {
      "duty": "Assist with managing process and billing for above activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 30,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from an accredited university."
    },
    {
      "credential": "Paralegal Certificate from an accredited Paralegal Program."
    },
    {
      "credential": "NALA certification a plus."
    },
    {
      "credential": "10+ years’ paralegal experience strongly preferred, with 5+ years’ experience working with publicly traded companies on corporate matters."
    },
    {
      "credential": "Familiarity with Section 16 filing software and Section 16 filings generally."
    },
    {
      "credential": "Knowledge of corporate matters and ability to prepare documents to form new entities, cancel entities, complete foreign qualifications and withdrawals in the US."
    },
    {
      "credential": "Knowledge of compliance regulations (e.g., Know your Customer, Ultimate Beneficial Owner)."
    },
    {
      "credential": "Familiarity with foreign corporate entities."
    },
    {
      "credential": "Proficiency with Microsoft Office Suite."
    },
    {
      "credential": "Experience with a document management system and in-house billing systems a plus."
    }
  ]
}