{
  "meta": [
    {
      "job_title": "Manager of Studio and Video/Editing Production",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Creating high level video content in the studio and in the field for strong visual presentations."
    },
    {
      "duty": "Managing the technical direction of original digital video content from inception to distribution, including animation, streaming live video, curating and capturing photo imagery, and editing/producing videos and content for events, broadcast outlets, social media, b-roll, audio files, podcasts and the web."
    },
    {
      "duty": "Managing the in-house production studio for the entire agency."
    },
    {
      "duty": "Operate multiple complex Cinema cameras, DSLR's, video cameras, and industry standard equipment with expertise."
    },
    {
      "duty": "Operate aerial drone videography and photography for agency."
    },
    {
      "duty": "Promoting and supporting the agency, its programs, initiatives and web-based services through the creation of motion pictures, photography, design, and motion graphics."
    },
    {
      "duty": "Conceptualizing and producing complex video, audio and motion graphics with an innovative and creative approach."
    },
    {
      "duty": "Managing and procuring equipment in accordance with technological advancements in motion pictures, photography and design; maintains inventory, maintenance and disbursement of equipment to members in the field and support staff."
    },
    {
      "duty": "Working with multiple teams and stakeholders in a collaborative, creative, team-oriented approach."
    },
    {
      "duty": "Reinforcing agency branding guidelines and practices in all creative materials, which includes serving as a resource for such standards for programs and external partners."
    },
    {
      "duty": "Assisting with managing the lifecycle of video products (treatment, script, production, post-production, updating, distribution, archiving)."
    },
    {
      "duty": "Developing, compiling, and tracking video and photography materials and usage in the agency's digital asset management and content management systems, and other multi-platform campaigns."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ]
}