{
  "meta": [
    {
      "job_title": "Direct Support Professional",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 16,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety & Support",
      "experience": 2
    },
    {
      "skill": "Administrative & Company Policies",
      "experience": 2
    },
    {
      "skill": "Physical Demands",
      "experience": 2
    },
    {
      "skill": "Education/Qualifications",
      "experience": 2
    },
    {
      "skill": "Exemplifies DSP Competencies",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure health, safety, and welfare of individuals; Safeguard and respect the confidentiality of the individuals and their families; Promote individual’s independence within their homes and community; Assist the individuals to develop and maintain relationships; Promote and protect the health, safety, and emotional well-being of the individuals; Commit to person-centered supports and honor the personality, preferences, culture, and strengths of the individuals; Work in partnership with others to support all individuals to lead self-directed lives; Implement and adhere to established treatment plans; Ability to communicate effectively; Transport individuals in agency vehicles as needed."
    },
    {
      "duty": "Commitment to company values and adherence to policies; Uphold the standards set by the National Alliance for Direct Support Professionals (NADSP) Code of Ethics; Be familiar with fire evacuation and emergency procedures within the home and community environment; Maintain all required certifications; May be required to report to an alternate work location (e.g., Hospital, Dr.’s Office etc.); Report problems and concerns to supervisors immediately; Perform other duties as assigned by supervisors and/or senior management."
    },
    {
      "duty": "Ability to run, when needed; Ability to safely assist lifting individuals of various weights and 20 lb items."
    },
    {
      "duty": "High School Diploma or GED required; Experience working with people with intellectual/developmental disabilities highly preferred; Valid driver’s license and good driving record is highly preferred."
    },
    {
      "duty": "Putting People First; Building and Maintaining Positive Relationships; Demonstrating Professionalism; Supporting Good Health and Safety; Support Individuals to be Active and Productive in Society."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED required; Experience working with people with intellectual/developmental disabilities highly preferred; Valid driver’s license and good driving record is highly preferred."
    }
  ]
}