{
  "meta": [
    {
      "job_title": "Maintenance Supervisor",
      "job_category": "Maintenance",
      "job_class": "Supervisor",
      "sector": "Engineering",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Management",
      "experience": 8
    },
    {
      "skill": "Resource Management",
      "experience": 8
    },
    {
      "skill": "Maintenance Planning",
      "experience": 8
    },
    {
      "skill": "Safety Compliance",
      "experience": 8
    },
    {
      "skill": "Contract Performance",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Organization Skills",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Advise the Superintendent on technical matters and lead a mission-focused maintenance effort."
    },
    {
      "duty": "Manage assigned resources necessary to accomplish the mission and control maintenance through leads and seniors."
    },
    {
      "duty": "Enforce strict adherence to technical data and management procedures, adjusting resources to meet production requirements."
    },
    {
      "duty": "Initiate management actions to meet new workloads or correct reported/perceived deficiencies, ensuring compliance with safety directives and appropriate occupational safety standards."
    },
    {
      "duty": "Participate in the maintenance planning cycle, ensuring only qualified personnel accomplish maintenance with the appropriate equipment and tools."
    },
    {
      "duty": "Review and evaluate management and production effectiveness, analyzing personnel and equipment performance history using QA reports."
    },
    {
      "duty": "Ensure accurate daily documentation of maintenance actions and analyze personnel and equipment performance history using QA reports."
    },
    {
      "duty": "Advise the production supervisor of conditions that may disrupt the orderly and controlled execution of the maintenance plan."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Engineering, or Management is preferred, or 5-8 years private sector or military experience directly related to contract performance or equivalent."
    },
    {
      "credential": "Excellent communication, interpersonal, organizational, and analytical skills are required."
    },
    {
      "credential": "Position may require travel and the ability to obtain/maintain any company/government required qualification, certification, licensing, or security clearance."
    },
    {
      "credential": "Must have a valid driver's license and be able to work any assigned shift or schedule."
    }
  ]
}