{
  "meta": [
    {
      "job_title": "Electrical Engineer (Power Distribution & Control Systems)",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Power Distribution & Control Systems",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "National Electrical Code",
      "experience": 10
    },
    {
      "skill": "P&IDs and control schematics",
      "experience": 10
    },
    {
      "skill": "Electrical power and control systems",
      "experience": 10
    },
    {
      "skill": "Microsoft Office (Word, Excel, Outlook, PowerPoint, MS Project)",
      "experience": 10
    },
    {
      "skill": "Communication Skills (oral and written)",
      "experience": 10
    },
    {
      "skill": "SKM Power Tools power systems analysis software",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Engage with internal and external project managers and clients."
    },
    {
      "duty": "Perform engineering services during design, including attend/lead meetings; coordinate with project team and vendors; and develop of Plan and Specification."
    },
    {
      "duty": "Perform engineering services during construction, including submittal review, RFI response, field observations."
    },
    {
      "duty": "Performing system analysis using SKM Power Tools power systems analysis software; provide engineering responsibility for staff using these software packages to publish a power systems study with arc flash hazard analysis."
    },
    {
      "duty": "Prioritize and balance competing project demands and conflicting project requirements."
    },
    {
      "duty": "Mentor other E/I&C engineers and technicians to effectively complete work with attention to detail."
    },
    {
      "duty": "Develop scopes, schedules and budgets for projects and project tasks."
    },
    {
      "duty": "Monitors project scope, schedule, and budget and controls the work to the project plan."
    },
    {
      "duty": "Delegate tasks to others; follow up on completion and quality of work."
    },
    {
      "duty": "Make accurate and implementable decisions in a timely manner."
    },
    {
      "duty": "Participate in client contacts and business development efforts."
    },
    {
      "duty": "Reduces complex aspects of instrumentation and control engineering to terms understandable to others."
    },
    {
      "duty": "Travel will be required to support project needs (approximately 10-15% of time)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Electrical Engineering, Professional Electrical Engineering License in California, or ability to obtain reciprocity in 6 months."
    }
  ]
}