{
  "meta": [
    {
      "job_title": "Pet Care Specialist",
      "job_category": "Health & Wellness",
      "job_class": "Specialist",
      "sector": "Health & Wellness",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Animal Care",
      "experience": 1
    },
    {
      "skill": "Sales Techniques",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure proper care and maintenance of companion animals and aquatic life in the Pet Care Center."
    },
    {
      "duty": "Process register transactions and provide a positive guest experience."
    },
    {
      "duty": "Maintain stock, price, and display of merchandise for guest presentation."
    },
    {
      "duty": "Complete training programs and educate other Pet Care Center partners in animal care and maintenance."
    },
    {
      "duty": "Promote a positive culture of teamwork, inclusion, and collaboration."
    },
    {
      "duty": "Adhere to operational guidelines, policies, and procedures."
    },
    {
      "duty": "Evaluate guest inquiries and provide animal education and care information."
    },
    {
      "duty": "Order companion animals, aquatic life, supplies, and merchandise to maximize sales and inventory."
    },
    {
      "duty": "Analyze department inventory data and recommend improvements."
    },
    {
      "duty": "Perform routine housekeeping tasks and animal-related maintenance."
    },
    {
      "duty": "Handle and document relinquished and adoption animals."
    },
    {
      "duty": "Participate in animal and aquatic life physical inventory counts."
    },
    {
      "duty": "Adhere to safety and loss prevention procedures."
    },
    {
      "duty": "Contribute to creating a safe and collaborative culture for pet care."
    },
    {
      "duty": "Engage in career development and skills growth programs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent (GED); proficiency in mathematics and basic accounting; exceptional communication skills."
    }
  ]
}