{
  "meta": [
    {
      "job_title": "Compensation Analyst",
      "job_category": "Human Resources",
      "job_class": "Analyst",
      "sector": "HR",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Microsoft Excel",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Functions",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supports end-to-end administration of the company’s Employee Stock Purchase Plan (ESPP) and specific company compensation programs, policies and procedures according to the requirements of the programs and policies."
    },
    {
      "duty": "Works directly with third party administrators (TPA) as needed to ensure a high level of customer satisfaction and cost savings across Constellation."
    },
    {
      "duty": "Understands the end-to-end process and may create/design new processes."
    },
    {
      "duty": "Supports the administration of the company’s ESPP and compensation programs, primarily long-term incentive (LTI), deferred short-term incentive (STI) and annual incentive, but may include market pricing, salary administration, retention, and reward and recognition."
    },
    {
      "duty": "Supports management of TPAs as necessary and monitors compliance with contractual performance standards."
    },
    {
      "duty": "Supports administration of compensation-related planning tools and evaluates and interprets plan programs, policies, procedures, and contracts related to compensation."
    },
    {
      "duty": "Identifies, develops, and implements process improvements to ensure service levels and customer satisfaction are met."
    },
    {
      "duty": "Participates in job audits, analyses, governmental reporting, and surveys, and identifies controls to ensure compliance with any applicable requirements."
    },
    {
      "duty": "Self-audits and monitors operations to ensure controls are operating as designed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business administration, HR, accounting or related field or equivalent."
    }
  ]
}