{
  "meta": [
    {
      "job_title": "Home Infusion Account Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify, establish, and maintain professional relationships with targeted physician groups and office staff members to maximize business opportunities."
    },
    {
      "duty": "Demonstrate effective selling skills during physician and/or office staff presentations with existing and potential customers."
    },
    {
      "duty": "Consult with clinicians as well as medical office staff (i.e. biologics coordinator) to appropriately promote and provide industry-leading customer service."
    },
    {
      "duty": "Review and analyze all available growth data to create effective territory plans and utilize promotional budget funds."
    },
    {
      "duty": "Establish and maintain strong relationships with regional branch team members to ensure alignment and support of growth efforts."
    },
    {
      "duty": "Maintain a call average as outlined in the growth plan, defined as face-to-face interactions with healthcare providers, focusing on top target customers."
    },
    {
      "duty": "Achieve all growth performance goals and objectives for geographical responsibility."
    },
    {
      "duty": "Show expertise in local market dynamics (competition, payers, therapies), as well as complex disease state services."
    },
    {
      "duty": "Collaborate cross-functionally to resolve issues in the best manner for customers."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree preferred. Two (2) years of sales experience in the home infusion market or related area with proven track record of success preferred. Specialty healthcare products experience preferred. Broad therapeutic area experience preferred."
    }
  ],
  "skills": [
    {
      "skill": "Sales Experience",
      "experience": 2
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Territory Management",
      "experience": 5
    },
    {
      "skill": "Cross-Functional Collaboration",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 5
    },
    {
      "skill": "Travel",
      "experience": 5
    }
  ]
}