{
  "meta": [
    {
      "job_title": "Technology Specialist",
      "job_category": "Technical Support",
      "job_class": "Specialist",
      "sector": "IT",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Support",
      "experience": 4
    },
    {
      "skill": "Troubleshooting",
      "experience": 4
    },
    {
      "skill": "Network Administration",
      "experience": 3
    },
    {
      "skill": "Hardware Maintenance",
      "experience": 4
    },
    {
      "skill": "Software Installation",
      "experience": 4
    },
    {
      "skill": "Technical Research",
      "experience": 3
    },
    {
      "skill": "Information Technology",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Field incoming support requests from end-users via the work order system, telephone, and email in a courteous manner."
    },
    {
      "duty": "Maintain inventory by keeping track of where or to whom assets are assigned."
    },
    {
      "duty": "Install, configure, upgrade, and maintain computer systems."
    },
    {
      "duty": "Perform required maintenance on all computer systems within the district."
    },
    {
      "duty": "Assist the network administrator/systems administrator with hardware and software updates."
    },
    {
      "duty": "Install, configure, and troubleshoot interactive panels/boards, projectors, security cameras, computer systems, other peripherals, related A/V equipment, and software."
    },
    {
      "duty": "Assist in defining the information needs of the district and in determining equipment configurations that will ensure software/hardware compatibility."
    },
    {
      "duty": "Support student devices (Chromebooks) and 1:1 program."
    },
    {
      "duty": "Provide support to district faculty and staff."
    },
    {
      "duty": "Coordinate repair, replacement, or return of hardware with vendors to resolve operating system and hardware problems."
    },
    {
      "duty": "Travel to school and district office sites to address work orders and other technical issues."
    },
    {
      "duty": "Assist with disposal of obsolete or broken devices."
    },
    {
      "duty": "Assume responsibility for developing and maintaining proficiency with hardware and software related to the job."
    },
    {
      "duty": "Assume responsibility for keeping abreast of changes in technology by reading, researching, and studying technical manuals, professional periodicals, and publications, and by attending technology conferences and training sessions."
    },
    {
      "duty": "Other tasks may be specified by the CIO."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Associate’s degree or Bachelor’s degree in a Technology related field and/or a minimum of 4 years relevant experience"
    }
  ]
}