{
  "meta": [
    {
      "job_title": "Avionics Technician",
      "job_category": "Engineering",
      "job_class": "Technician",
      "sector": "Aerospace",
      "salary": 70470,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Electronics",
      "experience": 3
    },
    {
      "skill": "Troubleshooting",
      "experience": 3
    },
    {
      "skill": "Repair and Maintenance",
      "experience": 3
    },
    {
      "skill": "UAV Operation",
      "experience": 3
    },
    {
      "skill": "Electrical Systems Testing",
      "experience": 3
    },
    {
      "skill": "Technical Documentation",
      "experience": 3
    },
    {
      "skill": "Wiring Harness Installation",
      "experience": 3
    },
    {
      "skill": "Component Assembly",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Fabricate, modify, install, troubleshoot, repair, and maintain ground, airborne, and electronic equipment such as unmanned aerial vehicles, ground control stations, and ground support equipment."
    },
    {
      "duty": "Operate UAV, ground control stations and ground support equipment at assigned location."
    },
    {
      "duty": "Construct individual components of electronic equipment following detailed schematics, layout diagrams, and work instructions."
    },
    {
      "duty": "Correct minor discrepancies by removal, repair, or replacement of defective or deleted parts of aircraft electrical systems."
    },
    {
      "duty": "Perform limited functional checks on existing and newly installed aircraft electrical systems and equipment."
    },
    {
      "duty": "Operate automatic test equipment to locate, diagnose, and repair defective parts."
    },
    {
      "duty": "Represent group with team leaders, supply personnel, A&P mechanics, pilots and internal and external customers."
    },
    {
      "duty": "Responsible for observing all laws, regulations and other applicable obligations wherever and whenever business is conducted on behalf of the Company. Expected to work in a safe manner in accordance with established operating procedures and practices."
    },
    {
      "duty": "Additional Functions Other duties as assigned or required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree in Electronics, Aviation Technology, or a related field (Bachelor's preferred)"
    }
  ]
}