{
  "meta": [
    {
      "job_title": "Senior Prime Contracts Administrator",
      "job_category": "Contract Administration",
      "job_class": "Senior",
      "sector": "Construction",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Contract Administration",
      "experience": 13
    },
    {
      "skill": "Subcontract Management",
      "experience": 13
    },
    {
      "skill": "Contract Law",
      "experience": 13
    },
    {
      "skill": "Project Management",
      "experience": 13
    },
    {
      "skill": "Negotiation",
      "experience": 13
    },
    {
      "skill": "Risk Management",
      "experience": 13
    },
    {
      "skill": "Policy and Procedure Implementation",
      "experience": 13
    },
    {
      "skill": "Governmental Contract Compliance",
      "experience": 13
    },
    {
      "skill": "Cost Engineering",
      "experience": 13
    },
    {
      "skill": "Engineering/Construction Contracting Practices",
      "experience": 13
    },
    {
      "skill": "Federal Acquisition Regulations",
      "experience": 13
    },
    {
      "skill": "Contract Closeout",
      "experience": 13
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise the administration of the Teaming Partner Subcontracts along with any other assigned subcontracts administered through the Prime Contracts organization."
    },
    {
      "duty": "Participate in Prime Contract Administration as assigned, particularly administration at the Administrative Contracting Officer/Field Office level with the customer."
    },
    {
      "duty": "Gather and compile support data for the preparation of documents and the administration of (sub) contracts."
    },
    {
      "duty": "Research and/or provide subject matter expertise in Federal Acquisition Regulations, and applicable Agency Supplements."
    },
    {
      "duty": "Identify areas of risk and opportunity for risk due to ambiguities, omissions, and conflicts in the contents of documents relative to the subcontracts (including proposals); and, assist in preparing a risk mitigation plan with the project team and managing the plan’s execution."
    },
    {
      "duty": "Perform work in accordance with the project Contract Management Program such that it is consistent with the practices and procedures set forth in the Prime Contracts Management Manual, including the Contract Responsibility Management Matrix, the Contract Requirements Action List, and the Contract Notice Requirements Action List."
    },
    {
      "duty": "Assist in the administration of the Pending Item Program."
    },
    {
      "duty": "Manage the working relationship with Construction, Engineering, Procurement, Legal and Risk Management to ensure that subcontracts contain and maintain current prime contract flow down terms/requirements and that subcontractors execute work in accordance with them."
    },
    {
      "duty": "Ensure compliance with prime/sub contract terms and conditions."
    },
    {
      "duty": "Assist in the handling of the prime contract closeout requirements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Quantity Surveying, Law, Engineering, Construction Management or Cost Engineering and 13 years of direct contract experience"
    }
  ]
}