{
  "meta": [
    {
      "job_title": "Customer Service Coordinator",
      "job_category": "Customer Service",
      "job_class": "Coordinator",
      "sector": "Customer Service",
      "salary": 22000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "To be an enthusiastic first point of contact for Soho House member queries via telephone and email. Responding to these queries in a timely manner and adhering to the departments SLA’s."
    },
    {
      "duty": "Offering a pro-active service to our diverse membership through telephone and email. Duties including but not limited to membership administration and club and restaurant enquiries."
    },
    {
      "duty": "Use our Salesforce, GEM and Open Table database to create, look up and update records for current and potential members.- bookings"
    },
    {
      "duty": "Set up new member and member renewal payments via credit card, Direct Debit, Sepa and the occasional bank transfer payment, ensuring all transactions are handled accurately and as per company/legal guidelines."
    },
    {
      "duty": "You will be part of a team responsible for the general administration of our North America houses (and future house openings). Along with table reservations and event queries for US properties."
    },
    {
      "duty": "Responsibility for amending, pausing, transferring and upgrading memberships, ensuring compliance with the appropriate Terms & Conditions."
    },
    {
      "duty": "Supporting other departments with information requests etc."
    },
    {
      "duty": "Plus any ad-hoc projects given by the Head of Support / Soho Support Manager"
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Membership Administration",
      "experience": 1
    },
    {
      "skill": "Salesforce",
      "experience": 1
    },
    {
      "skill": "Open Table",
      "experience": 1
    },
    {
      "skill": "Database Management",
      "experience": 1
    },
    {
      "skill": "Payment Processing",
      "experience": 1
    },
    {
      "skill": "Administrative Support",
      "experience": 1
    },
    {
      "skill": "Information Request Handling",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "At least one year of customer facing experience, preferably in a membership environment."
    }
  ]
}