{
  "meta": [
    {
      "job_title": "Accounts Payable Specialist",
      "job_category": "Accounting",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 50000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review and verify vendor invoices for accuracy, completeness, and proper authorization."
    },
    {
      "duty": "Match invoices to purchase orders and receiving documentation."
    },
    {
      "duty": "Enter invoice data into the accounting system accurately and promptly."
    },
    {
      "duty": "Communicate professionally with vendors regarding invoice discrepancies, payment inquiries, and other related matters."
    },
    {
      "duty": "Code invoices with appropriate account codes, project codes, and cost centers."
    },
    {
      "duty": "Reconcile vendor statements with accounts payable records to ensure accuracy."
    },
    {
      "duty": "Prepare payment batches for approval and processing."
    },
    {
      "duty": "Maintain organized and up-to-date accounts payable files and records."
    },
    {
      "duty": "Identify and resolve discrepancies in a timely manner."
    },
    {
      "duty": "Continuously identify opportunities to streamline accounts payable processes."
    },
    {
      "duty": "Propose and implement process improvements to enhance efficiency and accuracy."
    }
  ],
  "skills": [
    {
      "skill": "Accounts Payable Processing",
      "experience": 5
    },
    {
      "skill": "Vendor Relations",
      "experience": 5
    },
    {
      "skill": "Expense Coding and Allocation",
      "experience": 5
    },
    {
      "skill": "Account Reconciliation",
      "experience": 5
    },
    {
      "skill": "Payment Processing",
      "experience": 5
    },
    {
      "skill": "Data Entry and Documentation",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Accounting Software",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Financial Regulations and Compliance",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent; some college coursework in accounting or finance is preferred."
    },
    {
      "credential": "Proven experience as an Accounts Payable Specialist, preferably in a construction or related industry."
    },
    {
      "credential": "Familiarity with construction project accounting and cost allocation is a plus."
    },
    {
      "credential": "Proficiency in using accounting software and Microsoft Office applications, particularly Excel."
    },
    {
      "credential": "Strong analytical and problem-solving skills with high attention to detail."
    },
    {
      "credential": "Excellent communication skills, both written and verbal."
    },
    {
      "credential": "Ability to work collaboratively in a team environment and communicate effectively with vendors and colleagues."
    },
    {
      "credential": "Strong organizational skills and ability to manage multiple tasks and priorities."
    },
    {
      "credential": "Understanding of financial regulations and compliance."
    },
    {
      "credential": "Adaptability to changing priorities and deadlines in a dynamic construction setting."
    }
  ]
}