{
  "meta": [
    {
      "job_title": "Director of Catering",
      "job_category": "Hospitality",
      "job_class": "Director",
      "sector": "Hospitality",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Catering Sales",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops and implements sales strategies to achieve maximum revenues and manages the property's catering sales efforts."
    },
    {
      "duty": "Leads and manages the catering sales team, delegates responsibilities, and approves and negotiates contracts."
    },
    {
      "duty": "Builds a local client base through sales calls, prospecting, networking, and referrals, and responds to customer inquiries independently."
    },
    {
      "duty": "Analyzes competition to maintain competitiveness, ensures successful events that meet client needs, and communicates relevant information to appropriate departments."
    },
    {
      "duty": "Prepares all monthly reports for support center including accurate sales forecasts, booking reports, and financial performance verification."
    },
    {
      "duty": "Establishes team and individual sales goals, promotes the restaurant through local networking and organizations, and responds in a timely manner to customer issues."
    },
    {
      "duty": "Provides support and coaching to team members, celebrates team success, and ensures employees are appropriately trained and have an adequate workload."
    },
    {
      "duty": "Wears approved manufacturer certified slip-resistant or non-slip shoes at all times while working."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "5 years of progressive, strong sales experience with a catering company, full-service hotel or restaurant, at least 2 of those years being in a director level role."
    },
    {
      "credential": "Experience managing a catering sales team."
    },
    {
      "credential": "Strong catering sales and event planning experience."
    },
    {
      "credential": "Experience in accurate forecasting and preparation of sales plans and financial reports."
    }
  ]
}