{
  "meta": [
    {
      "job_title": "HR Partner",
      "job_category": "Human Resources",
      "job_class": "Partner",
      "sector": "Human Resources",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Partner with front-line business leaders to innovate, implement, and deploy HR strategies focused on employee engagement, internal customer service, talent management, organizational effectiveness, and workforce planning."
    },
    {
      "duty": "Foster an environment of inclusion for all employees and advocate for employees' success through end-to-end experiences that help employees feel fully engaged in the work they do and valued for who they are."
    },
    {
      "duty": "Serve as the first point of escalation for employee concerns and manage through ambiguity with high judgment."
    },
    {
      "duty": "Create and drive an active approach to impact change and innovation around employee engagement, and promote the adoption of technology, self-service, and continuous improvement."
    },
    {
      "duty": "Support employee queries and situations with discretion and expertise, including routine standard work around employee onboarding, performance management, engagement processes, and benefits services."
    },
    {
      "duty": "Provide effective internal and external customer service with a focus on strong communication and business acumen, and coach, develop, and support leadership through decision making with empathy and sound judgment."
    },
    {
      "duty": "Collaborate with multiple levels of the organization, influence and guide partners to prioritize employee experience and customer obsession when innovating, and use data and metrics to identify trends, anticipate business needs, and develop action plans."
    },
    {
      "duty": "Proactively manage professional and personal development through continuous learning and training."
    }
  ],
  "skills": [
    {
      "skill": "Employee Engagement",
      "experience": 5
    },
    {
      "skill": "Talent Management",
      "experience": 5
    },
    {
      "skill": "Organizational Effectiveness",
      "experience": 5
    },
    {
      "skill": "Workforce Planning",
      "experience": 5
    },
    {
      "skill": "Leadership Development",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Business Acumen",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Human Resources, HR Management, Business Management, or a related field (Master's Preferred)"
    }
  ]
}