{
  "meta": [
    {
      "job_title": "Commercial Analyst",
      "job_category": "Business Analysis",
      "job_class": "Analyst",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Business Acumen",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Strategy Development",
      "experience": 5
    },
    {
      "skill": "Forecasting",
      "experience": 5
    },
    {
      "skill": "Price Analysis",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct Comprehensive Analysis: Perform in-depth analysis of sales data, market trends, customer behavior, and competitive landscape to identify patterns, opportunities, and risks."
    },
    {
      "duty": "Forecasting & Demand Planning: Develop accurate sales forecasts, revenue projections, and budgets based on historical data, market conditions, and business goals."
    },
    {
      "duty": "Pricing & Promotion Analysis: Evaluate pricing and promotional strategies, monitor pricing trends, and recommend optimizations."
    },
    {
      "duty": "Market Research: Support research efforts including and competitor analysis to identify market trends, consumer preferences, and competitive strategies, and translate findings into actionable recommendations."
    },
    {
      "duty": "Sales support: Collaborate with the sales team to provide sales measurement and analysis, and support strategic initiatives to drive revenue growth."
    },
    {
      "duty": "Reporting and presentations: Prepare regular reports, dashboards, and presentations summarizing key findings, trends, and recommendations for senior management and other stakeholders."
    },
    {
      "duty": "Process improvement: Identify opportunities for streamlining and automating data collection, analysis, and reporting processes to improve efficiency and data accuracy."
    },
    {
      "duty": "Cross-functional collaboration: Work closely with cross-functional teams, including Sales, Marketing, Finance, and Operations across North America and Global Teams."
    },
    {
      "duty": "Data management: Ensure data integrity and accuracy by effectively managing databases, data sources, and reporting tools."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Economics, Math/Statistics, Finance, or a related field. A master's degree is a plus."
    }
  ]
}