{
  "meta": [
    {
      "job_title": "Pet Care Specialist",
      "job_category": "Pet Care",
      "job_class": "Specialist",
      "sector": "Animal Care",
      "salary": 32000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Companion Animal Care",
      "experience": 1
    },
    {
      "skill": "Aquatic Life Care",
      "experience": 1
    },
    {
      "skill": "Sales Techniques",
      "experience": 1
    },
    {
      "skill": "Verbal Communication",
      "experience": 1
    },
    {
      "skill": "Basic Accounting",
      "experience": 1
    },
    {
      "skill": "Mathematics",
      "experience": 1
    },
    {
      "skill": "Team Collaboration",
      "experience": 1
    },
    {
      "skill": "Animal Education",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Have a strong interest in animal welfare and possess a high level of knowledge of companion animal and aquatic care."
    },
    {
      "duty": "Ensure that all companion animals and aquatic life in the PCC are receiving appropriate care."
    },
    {
      "duty": "Process register transactions in a way that creates a great experience for each guest."
    },
    {
      "duty": "Be proficient within our selling model and support guest interactions as needed."
    },
    {
      "duty": "Complete and apply training programs to maintain a high level of expertise of their role and educate other PCC partners in animal care and maintenance."
    },
    {
      "duty": "Adhere to established operational guidelines, policies, and procedures."
    },
    {
      "duty": "Efficiently orders companion animals and aquatic life, supplies and merchandise in partnership with the sales team to maximize sales, margin, and inventory."
    },
    {
      "duty": "Perform routine housekeeping tasks as required to maintain the professional image and appearance of the companion animal habitat and aquatic areas."
    },
    {
      "duty": "Efficiently orders companion animals and aquatic life, supplies and merchandise in partnership with the sales team to maximize sales, margin, and inventory."
    },
    {
      "duty": "Participates in the completion of all animal and aquatic life related physical inventory counts."
    },
    {
      "duty": "Performs additional duties and projects as required or assigned with or without regular supervision."
    },
    {
      "duty": "Engage in selling behaviors, contribute to a safe environment, be part of a collaborative culture, and engage in career development as part of the role."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 60,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or its equivalent (GED)"
    }
  ]
}