{
  "meta": [
    {
      "job_title": "Referral Coordinator",
      "job_category": "Administrative",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervises and facilitates the process of sending and receiving referrals throughout the provider group."
    },
    {
      "duty": "Supports the Call Center Supervisor in all duties and responsibilities."
    },
    {
      "duty": "Plan, review and supervise all ambulatory referral activities and personnel."
    },
    {
      "duty": "Responsible for monitoring and maintaining quality assurance and accuracy of demographic information and testing results are sent with outbound referrals."
    },
    {
      "duty": "Coordinates follow-up process for referrals sent outside of the health system."
    },
    {
      "duty": "Coordinate with service line and department managers to achieve maximum efficiency in physician-to-physician referrals."
    },
    {
      "duty": "Completes and monitors staffing schedules and ensures proper coverage when there are call offs."
    },
    {
      "duty": "Monitors and measures operational metrics including productivity and accuracy."
    },
    {
      "duty": "Complete performance appraisals on time based on policy."
    },
    {
      "duty": "Select qualified competent department staff to provide quality services."
    },
    {
      "duty": "Approve payroll, including overtime and requests for paid time off."
    },
    {
      "duty": "Responsible for training and development of staff and adherence to metrics."
    },
    {
      "duty": "Develop and maintain relationships with referring physician offices."
    },
    {
      "duty": "Ensure policies and procedures are carried out as directed by the management team."
    },
    {
      "duty": "Orientation and training of new and current team members."
    },
    {
      "duty": "Communicate effectively upward to the next level of management for issues or ideas for process improvements."
    },
    {
      "duty": "Promote a favorable image of the facility to physicians, patients, insurance companies, and the general public."
    }
  ],
  "skills": [
    {
      "skill": "Referral Management",
      "experience": 3
    },
    {
      "skill": "Quality Assurance",
      "experience": 3
    },
    {
      "skill": "Staffing Schedules",
      "experience": 3
    },
    {
      "skill": "Operational Metrics",
      "experience": 3
    },
    {
      "skill": "Training and Development",
      "experience": 3
    },
    {
      "skill": "Relationship Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Training or courses in business office activities, computer skills, and medical terminology."
    },
    {
      "credential": "Certified Revenue Cycle Representative (CRCR) preferred."
    }
  ]
}