{
  "meta": [
    {
      "job_title": "Senior Accounting Analyst",
      "job_category": "Accounting",
      "job_class": "Analyst",
      "sector": "Financial Services",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "General Ledger Reporting",
      "experience": 5
    },
    {
      "skill": "Accounts Payable",
      "experience": 5
    },
    {
      "skill": "Financial Transactions",
      "experience": 5
    },
    {
      "skill": "US GAAP",
      "experience": 5
    },
    {
      "skill": "Accounting Software",
      "experience": 5
    },
    {
      "skill": "Journal Entry",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Excel",
      "experience": 5
    },
    {
      "skill": "Payroll Processing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure timely and accurate end-to-end accounts payable processes, work with vendors, review vendor statements, and resolve queries."
    },
    {
      "duty": "Manage loan-level detail of the pledged loans in the warehouse facility and preparation of the borrowing base files."
    },
    {
      "duty": "Confirm all intercompany accounts eliminate; reconcile all liability accounts (monthly) and various month-end duties such as aging schedules and journal entries."
    },
    {
      "duty": "Keep track of all payments and expenditures including AP (bill.com and Brex), payroll entries (through Gusto), retailer/lienholder payoffs (ACH/wires through banking portal) at the specific entity level."
    },
    {
      "duty": "Assist in audit-related items including providing PBCs related to payables/liabilities and prepare the yearly 1099s and 1098s; file and pay various state agencies (Dept of Rev) for taxes."
    },
    {
      "duty": "Manage end-to-end process around insurance premiums (hazard and flood) including monthly upfront premiums, payment of 'outside insurance', reconciling auto-debited premiums, insurance claims, etc."
    },
    {
      "duty": "Complete special projects such as creating a subledger for escrows and reconciling escrows at the loan level and cleaning up benefit liabilities/adjustments with Carriers."
    },
    {
      "duty": "Prepare bonus calculations (for payroll purposes) and help streamline any processes related to payables."
    },
    {
      "duty": "Handle various ad hoc requests/projects from the Controller (related to payables/liabilities)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting or Finance (Master's preferred)"
    }
  ]
}