{
  "meta": [
    {
      "job_title": "Recruiter",
      "job_category": "HR",
      "job_class": "Recruiter",
      "sector": "Talent Acquisition",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Agency Recruiting",
      "experience": 3
    },
    {
      "skill": "Cold Calling",
      "experience": 3
    },
    {
      "skill": "Sales and Marketing",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Planning and Organizing",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Aggressive prospecting and cold calling within target market."
    },
    {
      "duty": "Organic account development and maintain existing relationships."
    },
    {
      "duty": "Identify, screen and phone interview prospective candidates."
    },
    {
      "duty": "Assist in the sales and marketing of new and existing clients to candidates through phone calls, client visits, trade show attendance, and candidate interviews."
    },
    {
      "duty": "Participate in annual and long-term planning related to client development and market development."
    },
    {
      "duty": "Provide detailed candidate assessments for assigned searches to the lead search consultant."
    },
    {
      "duty": "Develop and implement strategy, as directed by the lead search consultant, in order to target specific companies to recruit from, for specific searches, in the interests of our clients."
    },
    {
      "duty": "Conduct detailed candidate profiles (interviews), with the intent to match the best-suited candidate for our clients. Special attention to product and responsibility background, culture fit, and willingness to make a change for the right opportunity."
    },
    {
      "duty": "Assist in developing new business leads and fostering existing client relationships."
    },
    {
      "duty": "Develop and maintain a thorough knowledge of the job profiles for positions within the industry."
    },
    {
      "duty": "Represent the company with professionalism and integrity."
    },
    {
      "duty": "Develop and present regular reports and analysis on recruiting activities to the management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "3+ years of Agency Recruiting experience."
    },
    {
      "credential": "BS or BA in a technical or business discipline is preferred."
    }
  ]
}