{
  "meta": [
    {
      "job_title": "Chief Development Officer",
      "job_category": "Management",
      "job_class": "Senior Manager",
      "sector": "Management",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Fundraising Strategy",
      "experience": 7
    },
    {
      "skill": "Donor Cultivation",
      "experience": 7
    },
    {
      "skill": "Institutional Gift Management",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Relationship Building",
      "experience": 7
    },
    {
      "skill": "Team Management",
      "experience": 7
    },
    {
      "skill": "Salesforce",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Financial Management",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Event Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement a comprehensive multi-year fundraising plan to support the company’s strategic plan, including corporate funding, individual gifts, and foundation/government grants."
    },
    {
      "duty": "Cultivate national philanthropic partnerships for funding opportunities in Washington, DC, and nationwide."
    },
    {
      "duty": "Represent the company externally at public appearances, speaking engagements, meetings, and networking events to share information about the company's mission."
    },
    {
      "duty": "Manage a donor portfolio, including existing corporate partners, major donors, foundation contributions, and government grants."
    },
    {
      "duty": "Identify, cultivate, and develop new funding and revenue opportunities by acquiring new philanthropic partners and expanding the existing donor base."
    },
    {
      "duty": "Oversee the development and execution of all fundraising and grant proposals, solicitations, gift agreements, grant and/or funder reports, acknowledgments, and other communications required to support ongoing fundraising activities."
    },
    {
      "duty": "Develop and implement a stewardship program that cultivates deeper ties with donors."
    },
    {
      "duty": "Manage direct reports, providing clear goals, coaching, and support."
    },
    {
      "duty": "Collaborate with outside agencies and consultants that provide fundraising, promotional, public relations, marketing, and overall brand support."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree (Master’s preferred)"
    }
  ]
}