{
  "meta": [
    {
      "job_title": "Case Worker, Crisis Intervention",
      "job_category": "Social Services",
      "job_class": "Non-Exempt",
      "sector": "Human Services",
      "salary": 47500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Crisis Intervention",
      "experience": 3
    },
    {
      "skill": "Client Assessment",
      "experience": 3
    },
    {
      "skill": "Referral Services",
      "experience": 3
    },
    {
      "skill": "Community Resource Navigation",
      "experience": 3
    },
    {
      "skill": "Case Management",
      "experience": 3
    },
    {
      "skill": "Empathy",
      "experience": 3
    },
    {
      "skill": "Attention to Detail",
      "experience": 3
    },
    {
      "skill": "Microsoft Word and Excel",
      "experience": 3
    },
    {
      "skill": "Bilingual Communication (Russian or Spanish)",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct intake and assessments on clients for emergency cash grant assistance towards needed financial assistance, such as rental arrears, utility turn offs, and other eligible household expenses."
    },
    {
      "duty": "Help to determine client's eligibility for assistance by working with client to complete agency application and obtain all required documentation to verify assistance needed."
    },
    {
      "duty": "Assist clients in completing Met Council applications and gathering necessary documentation, and where appropriate, grant clients financial assistance."
    },
    {
      "duty": "Recognize and adhere to professional roles and boundaries, able to assess client's capacity to carry out mutually decided upon, realistic goals."
    },
    {
      "duty": "Participate in weekly individual supervision meetings, as well as weekly and monthly team meetings."
    },
    {
      "duty": "When necessary, complete assigned phone appointments from agency Call Center and crisis information and referral assistance to answer caller questions and assess callers for Met Council services, as well as connect to external partner agencies and other social service programs for assistance."
    },
    {
      "duty": "Ensure accurate inputting of required grant data and client information (into agency electronic database and other required systems) as well as maintain required paperwork for all clients and their applications in a timely and efficient manner."
    },
    {
      "duty": "Provide information and referrals to resources in the community, case worker services, including assisting clients with applying for benefits, housing, and other services."
    },
    {
      "duty": "Represent agency in meetings, as needed."
    },
    {
      "duty": "Assist with Crisis Call Center, as needed."
    },
    {
      "duty": "Other job-related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150
    },
    {
      "student_teacher": 100
    },
    {
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BSW degree preferred or Human Services Associates degree with social service experience"
    },
    {
      "credential": "Clerical/administrative work experience (preferred)"
    },
    {
      "credential": "Bi-lingual Russian or Spanish (preferred)"
    }
  ]
}