{
  "meta": [
    {
      "job_title": "Retail Sales Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Retail",
      "salary": 42000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Retail Operations",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem-solving",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and foster a culture of hospitality through exceptional customer experiences that build enduring relationships both internally and externally."
    },
    {
      "duty": "Help customers to look and feel their best by providing style advise based on their specific needs."
    },
    {
      "duty": "Provide exceptional and meaningful customer service experiences that promote the product and builds brand loyalty."
    },
    {
      "duty": "Develop and maintain positive working relationships that support a productive work environment."
    },
    {
      "duty": "Achieve sales and service metrics in key measurable areas including Talbots Classic Awards."
    },
    {
      "duty": "Reinforce consistent selling and service standards through coaching, training, and accountability."
    },
    {
      "duty": "Support all areas of operational excellence, including the management of inventory, execution of floorsets, filling orders, recalls, recovery, replenishment, re-tickets etc."
    },
    {
      "duty": "Prioritize daily tasks and responsibilities to meet the needs of the customer, team, and business."
    },
    {
      "duty": "Understand the appropriate balance needed between operational and selling energy and ensure proper planning/scheduling and prioritizing tasks and responsibilities to meet the needs of the business."
    },
    {
      "duty": "Maintain knowledge of business and competitive landscape, fashion trends and key business drivers to strategically identify opportunities that will maximize sales and ensure financial goals are achieved."
    },
    {
      "duty": "Ensure compliance of all company policies and procedures as well as local, state, and federal employment laws."
    },
    {
      "duty": "Maintain a clean, organized and efficient work environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 120,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED equivalent"
    }
  ]
}