{
  "meta": [
    {
      "job_title": "Process and Control Mapping",
      "job_category": "Risk Management",
      "job_class": "Risk Analyst",
      "sector": "Finance",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "ERM Requirements",
      "experience": 7
    },
    {
      "skill": "Financial Markets",
      "experience": 7
    },
    {
      "skill": "Process Modeling",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Compliance Practices",
      "experience": 7
    },
    {
      "skill": "Audit Reporting",
      "experience": 7
    },
    {
      "skill": "Policy Communication",
      "experience": 5
    },
    {
      "skill": "Evidence Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish an integrated and collaborative relationship with first, second and third line of defense partners from business areas, ERM, Compliance and Audit to ensure continued compliance with ERM requirements."
    },
    {
      "duty": "Utilize insight into financial markets and industry practices to understand and navigate interdependencies of the various business models within the business area and the client organization."
    },
    {
      "duty": "Maintain working understanding of process modeling, internal control systems, risk management and compliance practices."
    },
    {
      "duty": "Approve and present reports of findings and recommendations to management."
    },
    {
      "duty": "Assess the cause of gaps to understand risk drivers, themes, trends and where similar exposures may exist in other areas of the business."
    },
    {
      "duty": "Support the identification of control gaps and assist first line management in creating and documenting necessary remediation steps."
    },
    {
      "duty": "Communicate new or revised policies, procedures, processes and related documents to appropriate team members and/or business units."
    },
    {
      "duty": "Ensure that required evidence and documentation is maintained within the system of record."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "University (Degree) is preferred. 5+ Years of work experience is required; 7+ Years is preferred."
    }
  ]
}