{
  "meta": [
    {
      "job_title": "Spa Trainer",
      "job_category": "Health & Wellness",
      "job_class": "Trainer",
      "sector": "Beauty and Wellness",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Quality Standards Management",
      "experience": 5
    },
    {
      "skill": "Therapist Coaching",
      "experience": 5
    },
    {
      "skill": "Retail Sales Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Spa Facility Maintenance",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Safety and Fire Procedures",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for training spa therapists, teaching them skills, and ensuring proper procedures are in place to perform spa treatments."
    },
    {
      "duty": "Maintain knowledge of departmental policies, service procedures, and standards; monitor achievements and quality standards at the spa."
    },
    {
      "duty": "Coordinate therapist schedules, performance, and retail sales; organize the annual training schedule and monitor operating supplies inventory."
    },
    {
      "duty": "Verifying spa facilities' quality and tool conditions, executing spa standards, and ensuring a courteous, professional service."
    },
    {
      "duty": "Inspect treatment areas, maintain clean, organized work areas, and handle guest inquiries and complaints."
    },
    {
      "duty": "Comply with company policies, maintain a positive attitude, and model the company’s culture, vision, mission, and core values."
    },
    {
      "duty": "Develop and update policies and manuals, ensuring brand integrity and clarity are maintained; attend departmental and general staff meetings."
    },
    {
      "duty": "Handle cleaning materials in accordance with safety rules and assist other staff when needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma; Diploma or degree in a related field; Certified massage therapist or esthetician; dual-licensed is a plus"
    }
  ]
}