{
  "meta": [
    {
      "job_title": "Voice and Collaboration Platform Architect",
      "job_category": "Technology",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 125000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Voice and Video Design",
      "experience": 7
    },
    {
      "skill": "Technology Selection",
      "experience": 7
    },
    {
      "skill": "Cloud Calling Technologies",
      "experience": 7
    },
    {
      "skill": "Vendor Selection",
      "experience": 7
    },
    {
      "skill": "Collaboration",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Analytical Skills",
      "experience": 7
    },
    {
      "skill": "Communication",
      "experience": 7
    },
    {
      "skill": "Decision Making",
      "experience": 7
    },
    {
      "skill": "Technical Aptitude",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and oversee the development of voice/collaboration platforms, enterprise voice and video architecture, and modernization of cloud technology networks."
    },
    {
      "duty": "Develop the strategic IT plan to deliver voice and video services through consistent approaches and solutions across all lines of business."
    },
    {
      "duty": "Define and maintain all voice and video service’s key performance indicator (KPI) metrics and manage the design and approach to access, security, continuity, and maintenance of all services."
    },
    {
      "duty": "Participate in disaster recovery infrastructure planning, building, and testing, and deliver continuous improvement plans and programs to improve system availability and performance."
    },
    {
      "duty": "Collaborate with IT leaders on strategic network services initiatives and participate in discussions with vendors and suppliers to resolve critical network issues and support implementation of new technologies."
    },
    {
      "duty": "Serve as a technical mentor for staff and communicate architecture decisions, roadblocks, and timelines to stakeholders. Comply with all policies and standards."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a quantitative or business field (e.g., statistics, mathematics, engineering, computer science) and 5 – 7 years of related experience, or equivalent experience acquired through accomplishments of applicable knowledge, duties, scope, and skill reflective of the level of this position."
    }
  ]
}