{
  "meta": [
    {
      "job_title": "Manufacturing Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Manufacturing",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 5
    },
    {
      "skill": "AutoCAD",
      "experience": 3
    },
    {
      "skill": "Industrial Engineering",
      "experience": 4
    },
    {
      "skill": "Supply Chain Management",
      "experience": 4
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage new product development projects in support of the overall plant objectives, delivering measurable results on schedule and on budget."
    },
    {
      "duty": "Create Process FMEAs to drive Control Plan and Work Instruction development."
    },
    {
      "duty": "Review engineering designs and changes to product development, ensuring timely and cost-effective sourcing or manufacturing."
    },
    {
      "duty": "Update inspection and manufacturing documentation and processes to support engineering changes."
    },
    {
      "duty": "Drive the development and validation of tooling and processes for reliable product production."
    },
    {
      "duty": "Troubleshoot to determine root cause and formulate appropriate corrective action, ensuring final process capability and stability."
    },
    {
      "duty": "Enter and maintain process routings, standards of work, sequence of events, and other documents controlled by the Manufacturing Engineering Department."
    },
    {
      "duty": "Design fixtures, tooling, methods of work holding, and methods of transportation as required for product manufacture."
    },
    {
      "duty": "Oversee the procurement and manufacture of required items, identifying and justifying capital equipment as needed."
    },
    {
      "duty": "Ensure workplace safety and organization (5-S), modeling values in the workplace and leading positively and optimistically."
    },
    {
      "duty": "Self-motivated, flexible, and able to work in a team environment with excellent interpersonal and communication skills."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Manufacturing, Industrial, Mechanical Engineering preferred – candidates with equivalent OTJ experience will be considered as well."
    }
  ]
}