{
  "meta": [
    {
      "job_title": "Export Compliance Coordinator",
      "job_category": "Logistics",
      "job_class": "Coordinator",
      "sector": "Logistics",
      "salary": 72000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Export Compliance",
      "experience": 5
    },
    {
      "skill": "Regulatory Knowledge",
      "experience": 5
    },
    {
      "skill": "TSA Security Coordination",
      "experience": 5
    },
    {
      "skill": "Training Program Development",
      "experience": 4
    },
    {
      "skill": "Documentation Management",
      "experience": 5
    },
    {
      "skill": "Compliance Reporting",
      "experience": 5
    },
    {
      "skill": "Stakeholder Collaboration",
      "experience": 5
    },
    {
      "skill": "SOP Development",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Stay up-to-date with all relevant export regulations, including but not limited to the International Traffic in Arms Regulations (ITAR), Export Administration Regulations (EAR), and Office of Foreign Assets Control (OFAC) requirements."
    },
    {
      "duty": "Conduct comprehensive reviews of export documentation, including commercial invoices, packing lists, and export licenses, to ensure compliance with applicable regulations."
    },
    {
      "duty": "Collaborate with internal teams, including sales, operations, and legal, to ensure adherence to export compliance procedures throughout the shipment process."
    },
    {
      "duty": "Provide guidance and support to internal stakeholders on export compliance matters, including classification, licensing, and restricted party screening."
    },
    {
      "duty": "Develop and implement export compliance training programs for employees to enhance awareness and understanding of regulations."
    },
    {
      "duty": "Collaborate with internal and external stakeholders to ensure compliance with TSA security requirements"
    },
    {
      "duty": "Prepare and maintain accurate records of export compliance activities, including license applications, classification determinations, and restricted party screenings."
    },
    {
      "duty": "Generate reports on export compliance metrics, highlighting areas of improvement and potential risks."
    },
    {
      "duty": "Assist in the preparation of reports and documentation required for government agencies, audits, and customer inquiries."
    },
    {
      "duty": "Collaborate with internal teams to develop and maintain standard operating procedures (SOPs) related to export compliance and TSA security coordination."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 60,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in international trade, supply chain management, or a related field."
    }
  ]
}