{
  "meta": [
    {
      "job_title": "Voice and Collaboration Platform Architect",
      "job_category": "Technology",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Voice and Video Design",
      "experience": 7
    },
    {
      "skill": "Technology Selection",
      "experience": 7
    },
    {
      "skill": "Cloud Calling Technologies",
      "experience": 7
    },
    {
      "skill": "Vendor Selection",
      "experience": 7
    },
    {
      "skill": "Collaboration",
      "experience": 7
    },
    {
      "skill": "Analytical Skills",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Excellent Judgment",
      "experience": 6
    },
    {
      "skill": "Decision Making",
      "experience": 6
    },
    {
      "skill": "Technical Aptitude",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan the overall design and oversee the development of voice and collaboration platforms."
    },
    {
      "duty": "Develop the strategic IT plan to enable voice and video services delivery through consistent approaches and solutions across all lines of business."
    },
    {
      "duty": "Participate in disaster recovery infrastructure planning, building, and testing."
    },
    {
      "duty": "Communicate architecture decisions, roadblocks, and timelines to stakeholders."
    },
    {
      "duty": "Manage the design and approach to access, security, continuity, and maintenance of all services."
    },
    {
      "duty": "Serve as a technical mentor for staff through sharing of knowledge and development of staff."
    },
    {
      "duty": "Participate in discussions with vendors and suppliers to resolve critical network issues and support implementation of new technologies."
    },
    {
      "duty": "Define and deliver continuous improvement plans and programs so that system availability and performance is improved"
    },
    {
      "duty": "Works collaboratively with IT leaders on strategic network services initiatives to continuously improve policy, standard, and procedures by anticipating issues, providing advice, and sharing best practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a quantitative or business field (e.g., statistics, mathematics, engineering, computer science). Requires 5 – 7 years of related experience."
    }
  ]
}