{
  "meta": [
    {
      "job_title": "Head of Internal Audit",
      "job_category": "Finance",
      "job_class": "Executive",
      "sector": "Finance",
      "salary": 150000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement a risk-based internal audit strategy, annual audit plan, and budget that aligns with the organization's goals and objectives."
    },
    {
      "duty": "Buildout and direct and manage a team of internal auditors or consultants, providing guidance, coaching, and performance feedback."
    },
    {
      "duty": "Conduct and oversee the planning, scoping, execution, and reporting of internal audits to assess the effectiveness of internal controls, risk management, and governance processes."
    },
    {
      "duty": "Evaluate and provide recommendations for improving the organization's internal control systems, operational efficiency, and risk management practices."
    },
    {
      "duty": "Monitor and follow up on the implementation of audit recommendations to ensure timely and effective resolution of identified issues."
    },
    {
      "duty": "Stay up to date with emerging trends, developments, and best practices in internal auditing, risk management, and corporate governance."
    },
    {
      "duty": "Establish and maintain effective working relationships with key stakeholders, including senior management, audit committee, external auditors, and regulatory authorities."
    },
    {
      "duty": "Coordinate with external auditors to ensure the efficient and effective use of resources and minimize duplication of efforts."
    },
    {
      "duty": "Provide periodic reports and presentations to senior management and the audit committee on the status of internal audit activities, significant findings, and recommendations."
    },
    {
      "duty": "Ensure compliance with applicable laws, regulations, and professional standards governing internal auditing activities."
    }
  ],
  "skills": [
    {
      "skill": "Internal Audit Strategy",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Governance Processes",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "Stakeholder Management",
      "experience": 10
    },
    {
      "skill": "Compliance Management",
      "experience": 10
    },
    {
      "skill": "Corporate Governance",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100
    },
    {
      "student_teacher": 80
    },
    {
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or master's degree in accounting, finance, business administration, or a related field."
    }
  ]
}