{
  "meta": [
    {
      "job_title": "Executive Vice President of Sales",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 180000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Generate new revenue for the company within the assigned geographical area."
    },
    {
      "duty": "Manage independent distributors and sales representatives to achieve and exceed performance goals."
    },
    {
      "duty": "Develop monthly sales quotas for territories and project expected sales volume for existing and new products."
    },
    {
      "duty": "Think like a P&L owner, develop a deep understanding of the market, competition and provide region-specific insights."
    },
    {
      "duty": "Aggressively visit hospitals and solicit orders from present and prospective customers for the assigned products."
    },
    {
      "duty": "Manage penetration within targeted new accounts with a regional perspective."
    },
    {
      "duty": "Manage independent sales teams' communication and sales support infrastructure to ensure customer satisfaction."
    },
    {
      "duty": "Recruit, train, and oversee the development of sales professionals."
    },
    {
      "duty": "Establish and maintain effective one-to-one relationships with sales professionals through counseling and leadership skills."
    },
    {
      "duty": "Track the performance trends of sales professionals and assure adherence to all standards, policies, and procedures."
    },
    {
      "duty": "Build rapport and trust with key stakeholders to foster strong connectivity."
    },
    {
      "duty": "Coordinate training events for sales personnel within the region."
    },
    {
      "duty": "Assess the quality of the sales force and recommend necessary changes to accomplish sales objectives."
    },
    {
      "duty": "Provide senior sales management with regular reports regarding the region's strengths, weaknesses, opportunities, and threats."
    },
    {
      "duty": "Provide constant interaction with senior sales management regarding area sales objectives."
    },
    {
      "duty": "Provide senior sales management with weekly reports regarding travel schedules."
    },
    {
      "duty": "Additional duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Sales, Marketing, or related field (Master's preferred)"
    }
  ]
}