{
  "meta": [
    {
      "job_title": "Pricing Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Transportation/Pricing Experience",
      "experience": 2
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Word",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Microsoft Access",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop an understanding of the transportation network and identify where excess capacity exists."
    },
    {
      "duty": "Perform detailed costing analysis to develop pricing options to present to sales for customer negotiations."
    },
    {
      "duty": "Use different pricing scenarios to rate shipments and compare net results."
    },
    {
      "duty": "Perform revenue management and cost analysis for new and existing customers."
    },
    {
      "duty": "Review shipping patterns and characteristics to identify opportunities for increased margins and/or reduced costs."
    },
    {
      "duty": "Quote customers on new lanes when requested and develop pricing proposals using internal and market tools."
    },
    {
      "duty": "Communicate pricing decisions verbally and in written form directly to the sales teams and customers."
    },
    {
      "duty": "Proactively monitor the results of pricing decisions and revise pricing if necessary."
    },
    {
      "duty": "Evaluate customer contracts to verify that all terms are within parameters set forth."
    },
    {
      "duty": "Negotiate service contracts, including freight rates, terms, and conditions."
    },
    {
      "duty": "Maintain detailed records of completed pricing and customer agreements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Finance, Economics or related field (Master's preferred)"
    }
  ]
}