{
  "meta": [
    {
      "job_title": "Sales Supervisor",
      "job_category": "Sales",
      "job_class": "Supervisor",
      "sector": "Sales",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Contributes to the overall store success by ensuring store sales goals are met while also achieving individual sales goals."
    },
    {
      "duty": "Responsible for delivering exceptional customer experiences and driving sales by styling and wardrobing each customer based on their needs."
    },
    {
      "duty": "Responsible for setting the example for customer engagement that exceeds industry standards."
    },
    {
      "duty": "Responsible for building client relationships and driving store sales along with excitement about our brand through client outreach."
    },
    {
      "duty": "Assists with training, coaching, developing and motivating associates to achieve maximum sales productivity."
    },
    {
      "duty": "Assists the Store Manager and Assistant Manager with leading the store team and serves as the expert on company culture, store operations and policies & procedures."
    },
    {
      "duty": "Assists with managing payroll and ensuring payroll goals are met within established guidelines to ensure proper coverage based on business needs."
    },
    {
      "duty": "Supports and executes directives from Visual Merchandising, Operations and Marketing and ensures that information is properly communicated to the store team and that all deliverables are completed within specified deadlines."
    },
    {
      "duty": "Communicates with Store Manager and/or Assistant Manager regarding all employee relations, day to day operations and any compliance related matters and to set goals for personal skill development."
    },
    {
      "duty": "Represents the brand and ensures team members are embodying the brand in all interactions with customers and peers."
    },
    {
      "duty": "Ensures Loss Prevention policies and procedures are followed. Assist with financial/sales audits and inventories to protect the store from internal and external shortage."
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Sales Management",
      "experience": 2
    },
    {
      "skill": "Store Operations",
      "experience": 2
    },
    {
      "skill": "Team Management",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Marketing, or a related field"
    }
  ]
}