{
  "meta": [
    {
      "job_title": "Senior Product Manager",
      "job_category": "Product Management",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Product Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Technical Background",
      "experience": 5
    },
    {
      "skill": "Data-Driven Decision Making",
      "experience": 5
    },
    {
      "skill": "B2B Product Management",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "BI Dashboard",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the full product life cycle, including strategy, build, execution, and utilization for 8 engineers."
    },
    {
      "duty": "Work with the team on everything product, and act as the glue for our team."
    },
    {
      "duty": "Develop and lead the strategy for adding integrations or new features."
    },
    {
      "duty": "Collaborate with our engineering team throughout the entire product development cycle to provide guidance and feedback."
    },
    {
      "duty": "Define, track, and measure the success of your work through key performance indicators (KPIs)."
    },
    {
      "duty": "Regularly talk with customers and engage with the broader community."
    },
    {
      "duty": "Support documentation, blog posts, demos, designs, and other collateral for product features."
    },
    {
      "duty": "Has a scrappy mindset. Replo is a not-yet-profitable startup with under 20 people, we’re growing super quickly and our customers love us, but there is a lot to be done."
    },
    {
      "duty": "Has a strong understanding of how software is built (e.g. dependencies, packaging, testing, deployment). Has a strong technical background and understanding of design/development processes."
    },
    {
      "duty": "Has 5+ years of B2B product management experience."
    },
    {
      "duty": "You won’t have to write code, but you’ll also be the first PM on our team, so you’re gonna be writing SQL, putting together designs, setting BI dashboards, etc."
    },
    {
      "duty": "Has strong analytical and problem-solving skills, with a data-driven approach to decision-making."
    },
    {
      "duty": "Have been a founder or started your own business."
    },
    {
      "duty": "Loves talking to customers and has a healthy amount of paranoia about product-market-fit."
    },
    {
      "duty": "Experience building products and product process from scratch. Ideally, you’ve built a product or feature people have used from scratch (code or low-code, design, product decisions, etc)."
    },
    {
      "duty": "Experience working on product-led sales and growth problems (acquisition, activation, retention)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Computer Science, or a related field (Master's preferred)"
    }
  ]
}