{
  "meta": [
    {
      "job_title": "Customer Success Manager",
      "job_category": "Customer Success",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Cross-functional Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Risk Analysis",
      "experience": 5
    },
    {
      "skill": "Advocacy",
      "experience": 5
    },
    {
      "skill": "CRM Software",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and maintain strong, long-lasting customer relationships through regular engagement and effective communication."
    },
    {
      "duty": "Act as the primary point of contact for assigned customer accounts, addressing their inquiries and concerns promptly and professionally."
    },
    {
      "duty": "Collaborate with the sales team in the later stages of presale to ensure a smooth transition from the sales process to onboarding."
    },
    {
      "duty": "Participate actively in the onboarding process, guiding customers to effectively adopt our products/services and achieve their desired outcomes."
    },
    {
      "duty": "Conduct regular customer check-ins and meetings, discussing their progress, addressing challenges, and identifying opportunities for growth."
    },
    {
      "duty": "Advocate for customers internally, ensuring their needs, feedback, and concerns are communicated to relevant teams for prompt resolution."
    },
    {
      "duty": "Navigate legal and compliance processes by collaborating with the legal and compliance teams, ensuring timely adherence to regulations and agreements."
    },
    {
      "duty": "Analyze customer usage and health data to identify potential risks and proactively implement churn prevention strategies."
    },
    {
      "duty": "Work closely with cross-functional teams to drive customer success and ensure alignment between customer objectives and our offerings."
    },
    {
      "duty": "Provide valuable insights and feedback to improve our products, services, and overall customer experience."
    },
    {
      "duty": "Identify upselling and cross-selling opportunities that align with customers' evolving needs and business objectives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Marketing, or a related field (Master's preferred)"
    }
  ]
}