{
  "meta": [
    {
      "job_title": "Ordering Specialist (Library Specialist)",
      "job_category": "Library",
      "job_class": "Specialist",
      "sector": "Library",
      "salary": 72000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Library Science",
      "experience": 5
    },
    {
      "skill": "Information Management",
      "experience": 5
    },
    {
      "skill": "Cataloging",
      "experience": 5
    },
    {
      "skill": "Foreign Language Proficiency",
      "experience": 5
    },
    {
      "skill": "Data Entry",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the main contact and resource for ordering materials in subject and/or language-specific collection areas."
    },
    {
      "duty": "Receive and respond to high volume of order requests for print, electronic, and media resources in various languages."
    },
    {
      "duty": "Expertly search requests and place orders in the library system and vendor databases or online catalogs."
    },
    {
      "duty": "Handle special collections materials acquired in Western European languages, including rare books, manuscripts, photographs, and digital records."
    },
    {
      "duty": "Import or create brief bibliographic records in MARC record format."
    },
    {
      "duty": "Assist with e-resource lifecycle management and perform routine maintenance on order records."
    },
    {
      "duty": "Establish and maintain professional relationships with external service providers, including foreign and domestic vendors, publishers, and content providers."
    },
    {
      "duty": "Work closely with department units to solve complex problems in acquiring monograph, serial, database, e-book, e-journal, media, government document, map, special collection, out-of-print, and other unique library materials."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Two-year college degree plus three or more years of experience in an academic library, or equivalent combination of education and relevant experience. Proficiency in Cyrillic script and other Slavic languages."
    }
  ]
}