{
  "meta": [
    {
      "job_title": "Associate Advisor",
      "job_category": "Financial Services",
      "job_class": "Advisor",
      "sector": "Finance",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and maintain knowledge on complex tax, retirement, insurance, and estate-planning techniques."
    },
    {
      "duty": "Learn financial projection methods end-to-end to effectively create financial plans for clients within eMoney, Holistiplan, SSAnalyzer, and other systems."
    },
    {
      "duty": "Develop proficiency in Schwab Institutional, BlackDiamond, YCharts, and other systems."
    },
    {
      "duty": "Work with Financial Advisors to conduct financial reviews with clients via Zoom/phone or face-to-face meetings."
    },
    {
      "duty": "Support the scheduling and preparation of investment check-ins between clients and the Investment Specialist."
    },
    {
      "duty": "Execute trades at Schwab Institutional on a discretionary basis."
    },
    {
      "duty": "Initiate money movements by accepting client requests and determining trades needed."
    },
    {
      "duty": "Maintain clean trading compliance."
    },
    {
      "duty": "Maintain workflow documentation and evidence for regulatory and compliance purposes and ensure files are easily found and understood."
    },
    {
      "duty": "Execute trades and rebalancing in non-discretionary variable annuity and 529 plan accounts."
    },
    {
      "duty": "Assist the Investment Specialist with portfolio rebalancing along with managing and mitigating risk tolerances."
    },
    {
      "duty": "Assist with year-end tax planning for clients, namely with gathering and analyzing dividend, interest, and capital gain/loss data."
    },
    {
      "duty": "Assist clients with the rollover process of previous employer-sponsored retirement plans."
    },
    {
      "duty": "Provide target investment allocations of clients’ 401(k), 403(b), and other held-away retirement plan accounts."
    },
    {
      "duty": "Learn business processing and compliance systems and provide backup support as needed for all team members."
    },
    {
      "duty": "Follow requirements outlined in Employee handbook."
    },
    {
      "duty": "Working extensively within the Microsoft Office365 suite (and other systems) both via PC and smartphone."
    },
    {
      "duty": "Share new ideas or better ways of doing things with the team."
    },
    {
      "duty": "Prepares and executes on follow up items for client meetings."
    },
    {
      "duty": "Assigns tasks to other team members on follow up items from client meetings."
    }
  ],
  "skills": [
    {
      "skill": "Financial Planning",
      "experience": 3
    },
    {
      "skill": "Investment Management",
      "experience": 3
    },
    {
      "skill": "Tax Planning",
      "experience": 3
    },
    {
      "skill": "Retirement Planning",
      "experience": 3
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 3
    },
    {
      "skill": "Client Advisory",
      "experience": 3
    },
    {
      "skill": "Portfolio Rebalancing",
      "experience": 3
    },
    {
      "skill": "Financial Reviews",
      "experience": 3
    },
    {
      "skill": "Financial Projection",
      "experience": 3
    },
    {
      "skill": "Schwab Institutional",
      "experience": 3
    },
    {
      "skill": "BlackDiamond",
      "experience": 3
    },
    {
      "skill": "YCharts",
      "experience": 3
    },
    {
      "skill": "Estate Planning",
      "experience": 3
    },
    {
      "skill": "Dividend Analysis",
      "experience": 3
    },
    {
      "skill": "Risk Management",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree required. CFP designation preferred but not required."
    }
  ]
}