{
  "meta": [
    {
      "job_title": "Data Entry Specialist",
      "job_category": "Data Entry",
      "job_class": "Specialist",
      "sector": "Administration",
      "salary": 30000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Entry",
      "experience": 1
    },
    {
      "skill": "Computer Skills",
      "experience": 1
    },
    {
      "skill": "Communication",
      "experience": 1
    },
    {
      "skill": "Organization",
      "experience": 1
    },
    {
      "skill": "Typing",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Enter and locate work-related information using computers and/or point of sale systems."
    },
    {
      "duty": "Transmit information or documents using a computer."
    },
    {
      "duty": "Read and visually verify information in a variety of formats (e.g., small print)."
    },
    {
      "duty": "Enter and retrieve information contained in computer databases using a keyboard, mouse, or trackball to update records, files, reservations, and answer inquiries from guests."
    },
    {
      "duty": "Operate standard office equipment such as telephone, typewriter, fax, photocopier, calculator, and electronic peripherals."
    },
    {
      "duty": "Follow company policies and procedures, ensure uniform and personal appearance are clean and professional, maintain confidentiality of proprietary information, and protect company assets."
    },
    {
      "duty": "Speak with others using clear and professional language, prepare and review written documents accurately and completely, and answer telephones using appropriate etiquette."
    },
    {
      "duty": "Develop and maintain positive working relationships with others, support team to reach common goals, and listen and respond appropriately to the concerns of other employees."
    },
    {
      "duty": "Ensure adherence to quality expectations and standards; and identify, recommend, develop, and implement new ways to increase organizational efficiency, productivity, quality, safety, and/or cost-savings."
    },
    {
      "duty": "Follow all company safety and security policies and procedures; report accidents, injuries, and unsafe work conditions to manager; and complete safety training and certifications."
    },
    {
      "duty": "Move, lift, carry, push, pull, and place objects weighing less than or equal to 10 pounds without assistance."
    },
    {
      "duty": "Perform other reasonable job duties as requested by Supervisors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 70,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma/G.E.D. equivalent"
    }
  ]
}