{
  "meta": [
    {
      "job_title": "Logistical Communications Manager",
      "job_category": "Logistics",
      "job_class": "Manager",
      "sector": "Logistics",
      "salary": 90000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Receive and process New, Revised, and Updated LIRs for signatures."
    },
    {
      "duty": "Distribute LIRs to Internal and External contacts."
    },
    {
      "duty": "Maintain and update CALM LIR agenda with new/revised LIR information such as dates and permits, including expired permit/LIR dates."
    },
    {
      "duty": "Maintain and update Google Drive LIR Permit Tracking with all permits for the LIR and associated expiration dates."
    },
    {
      "duty": "Maintain and update information for the Shutdown Control Center to include all new, revised, and updated LIRs."
    },
    {
      "duty": "Prepare and update CALM LIR Agenda for each weekly CALM LIR Workshop."
    },
    {
      "duty": "Maintain document filing system."
    },
    {
      "duty": "Coordinate with City agencies and provide information to assist in the permit process."
    },
    {
      "duty": "Request concurrence from LAWA subject matter experts and notify outside contractors of concurrence and any restrictions."
    },
    {
      "duty": "Track and document concurrence requests and distribute notification of the upcoming project(s)."
    },
    {
      "duty": "Various duties as assigned such as presentation preparation, collecting and organizing information to be used in for deliverables, and assisting in tracking the daily deployment of multiple construction projects."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree and 10 years of professional experience; graduate degree may substitute for one year of experience"
    }
  ]
}