{
  "meta": [
    {
      "job_title": "Public Health Research Digital Marketing Intern",
      "job_category": "Marketing",
      "job_class": "Intern",
      "sector": "Marketing",
      "salary": 15000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct research on public health topics, staying up-to-date with the latest trends, research findings, and best practices."
    },
    {
      "duty": "Analyze data and identify key insights to support evidence-based decision-making and strategy development."
    },
    {
      "duty": "Assist in the development and execution of digital marketing campaigns to promote our mission, initiatives, and events."
    },
    {
      "duty": "Create engaging content, including SEO blog posts, infographics, videos, and social media posts, to drive awareness and engagement."
    },
    {
      "duty": "Collaborate with the marketing team to optimize website content and improve search engine visibility."
    },
    {
      "duty": "Monitor and report on campaign performance, social media analytics, and website traffic to assess the effectiveness of marketing efforts."
    },
    {
      "duty": "Support the team in managing social media platforms, including content scheduling, community engagement, and influencer campaigns."
    },
    {
      "duty": "Stay informed about industry trends, digital marketing tools, and emerging technologies to propose innovative strategies."
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 1
    },
    {
      "skill": "Data Analysis",
      "experience": 1
    },
    {
      "skill": "Digital Marketing",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Online Presence Management",
      "experience": 1
    },
    {
      "skill": "SEO",
      "experience": 1
    },
    {
      "skill": "Infographic Design",
      "experience": 1
    },
    {
      "skill": "Social Media Management",
      "experience": 1
    },
    {
      "skill": "Content Creation",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 160,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Currently pursuing a degree in Public Health, Marketing, Communications, or a related field."
    }
  ]
}