{
  "meta": [
    {
      "job_title": "Environmental Permits Manager",
      "job_category": "Environmental",
      "job_class": "Manager",
      "sector": "Environmental",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Environmental Permitting",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "NEPA Compliance",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Environmental Studies",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage permitting activities throughout the site development process for a pipeline of wind, transmission, solar, storage and green fuels projects including permit applications, site control, layout planning, and review of environmental studies."
    },
    {
      "duty": "Lead and advise project managers, company development directors, and others regarding the environmental permitting of projects from planning phases through implementation."
    },
    {
      "duty": "Supervise the work of project environmental consultants, managing project schedules and budgets, and ensuring quality of documents."
    },
    {
      "duty": "Assist with the preparation of NEPA (National Environmental Policy Act) and state environmental documents, including EISs, EAs, and other federal, state, and local environmental permits as needed."
    },
    {
      "duty": "Peer-review drafts of permit applications, studies, scopes of work, and reports for environmental permitting and studies."
    },
    {
      "duty": "Respond to internal environmental-related inquiries in support of Power Purchase Agreement bids, project financing, and third-party due diligence."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree; a master’s degree a plus"
    }
  ]
}