{
  "meta": [
    {
      "job_title": "HR Service Center Analyst",
      "job_category": "Human Resources",
      "job_class": "Analyst",
      "sector": "Human Resources",
      "salary": 67000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "HR Case Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Analytical Skills",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 4
    },
    {
      "skill": "HR Programs",
      "experience": 3
    },
    {
      "skill": "HRIS Application",
      "experience": 3
    },
    {
      "skill": "Workday",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Respond to questions and support employees and managers on HR policies and processes, HR systems, and employee data."
    },
    {
      "duty": "Utilize knowledge base, call tracking systems, and third-party resources to educate employees and managers of the HR Services available to them."
    },
    {
      "duty": "Encourage self-service tools such as the HR Portal and other systems when appropriate."
    },
    {
      "duty": "Portray a positive, professional, customer-oriented image of the company."
    },
    {
      "duty": "Provide continuous status updates, guidance, and information to key stakeholders and peers within the HR functional area team(s) to ensure case resolution."
    },
    {
      "duty": "Provide feedback and recommend process improvements to management."
    },
    {
      "duty": "Ensure high-quality standards for all activities, initiatives, and tasks."
    },
    {
      "duty": "Adhere to all service level agreements (SLAs) established for the HR Services team."
    },
    {
      "duty": "Appropriately document case details and relevant information in the case management system."
    },
    {
      "duty": "Ensure appropriate documentation for HR Services processes are up-to-date."
    },
    {
      "duty": "May be responsible for training other HR Service Center analysts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "College or University degree and/or relevant work experience in human resources preferred."
    }
  ]
}