{
  "meta": [
    {
      "job_title": "Acoustics Engineering Project Manager",
      "job_category": "Engineering",
      "job_class": "Project Manager",
      "sector": "Hardware Engineering",
      "salary": 190000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Production and Test Processes",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "International Partner Management",
      "experience": 5
    },
    {
      "skill": "Acoustics Knowledge",
      "experience": 5
    },
    {
      "skill": "Technology Environment Adaptability",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive the design, development, and integration of speaker, microphone, and receiver modules into products."
    },
    {
      "duty": "Oversee internal efforts of Audio HW, Validation, and Tuning teams as well as externally with SW, Mechanical Engineering, and Operations teams."
    },
    {
      "duty": "Define and drive the build plan for multiple module integrators and serve as the primary interface during module development."
    },
    {
      "duty": "Manage and communicate project definition, development landmarks and schedules, and project status in the development of new acoustic modules."
    },
    {
      "duty": "Advocate for the best overall acoustic performance throughout the organization."
    },
    {
      "duty": "Prioritize issues, track the details, and drive a talented, passionate, experienced multi-functional team and external suppliers."
    },
    {
      "duty": "Deliver acoustic modules on schedule, facilitate risk management, and communicate status and issues to the development team and executives."
    },
    {
      "duty": "Understand the roles and responsibilities of the key partners and identify partners to efficiently drive key decisions, while remaining in touch with big picture issues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree in Mechanical Engineering, Physics, or Electrical Engineering preferred"
    }
  ]
}