{
  "meta": [
    {
      "job_title": "Inside Sales Rep",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Remotely sell medical technology (ventilators) service agreements and other service-related products to customers within an assigned geographic area and specific customer accounts."
    },
    {
      "duty": "Identify, develop, and close leads for the business and refer on internal leads when appropriate."
    },
    {
      "duty": "Provide input on new markets, new service product introductions, and existing service products."
    },
    {
      "duty": "Promote and establish education of Medtronic (ventilation) services."
    },
    {
      "duty": "Assist field sales representatives in the planning and execution of service sales activities as well as provide ongoing service sales support including sales calls, data analysis, customer opportunities, and sales rep follow-up."
    },
    {
      "duty": "Participate in contract negotiations (within approved pricing parameters) with both field employees and external customers with minimal supervisory involvement."
    },
    {
      "duty": "Ensure the sales and service teams are updated on significant customer related issues regarding service and brainstorm solutions."
    },
    {
      "duty": "Administer, extend, and negotiate standard and nonstandard contracts including completing the red-line/editing process to meet customer specifications, and partnering with Legal where appropriate."
    },
    {
      "duty": "Collaborate with Sales and Service management in forecasting monthly and quarterly sales and in long term funnel management."
    },
    {
      "duty": "Regularly update and maintain opportunities to reflect their point in the sales stage."
    },
    {
      "duty": "Develop creative service and or pricing solutions to complex hospital scenarios."
    },
    {
      "duty": "Participate in contract negotiations involving hospital group purchasing contracts, possibly involving other Medtronic businesses, as appropriate."
    },
    {
      "duty": "Create training programs for sales team on how to position and sell service offerings."
    },
    {
      "duty": "Proactively contact customers that currently do not have a service agreement and attempt to sell an agreement to those customers."
    },
    {
      "duty": "Collaborate cross-functionally to determine annual list prices, improvements to service offerings, sales tools, and other pertinent issues involving service revenue."
    },
    {
      "duty": "Creates customer sales quotes in accordance with pre-determined guidelines for pricing and discounting."
    },
    {
      "duty": "Maintain customer files and complete and accurate information in various customer databases."
    },
    {
      "duty": "Review and confirm customer purchase orders and prepare them for order entry."
    },
    {
      "duty": "Provide other field support as necessary related to Services."
    },
    {
      "duty": "Perform duties in compliance with the Quality System."
    },
    {
      "duty": "Perform duties in compliance with environmental, health, and safety-related site rules, policies, or governmental regulations."
    },
    {
      "duty": "All other duties as assigned."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 70,
      "introvert_extrovert": 120
    }
  ]
}