{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Retail Sales",
      "experience": 4
    },
    {
      "skill": "Store Management",
      "experience": 2
    },
    {
      "skill": "Leadership",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Recruiting",
      "experience": 2
    },
    {
      "skill": "Sales Growth",
      "experience": 3
    },
    {
      "skill": "Team Development",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure store sales goals are met and achieve individual sales goals."
    },
    {
      "duty": "Assist with day-to-day management of the store, in the absence of the Store Manager."
    },
    {
      "duty": "Deliver exceptional customer experiences and drive sales by styling and wardrobing each customer."
    },
    {
      "duty": "Represent the brand and ensure team members embody the brand in all interactions with customers and peers."
    },
    {
      "duty": "Build client relationships and drive store sales through client outreach."
    },
    {
      "duty": "Communicate effectively with Store Manager regarding individual goals, skill development updates, employee relations, and day-to-day operations."
    },
    {
      "duty": "Assist with recruiting top talent and retain talent that will contribute to sales growth."
    },
    {
      "duty": "Assist with managing payroll and store scheduling within established guidelines to ensure proper coverage based on business needs."
    },
    {
      "duty": "Support and execute directives from Visual Merchandising, Operations, and Marketing."
    },
    {
      "duty": "Ensure Loss Prevention policies and procedures are followed. Assist with financial/sales audits and inventories to protect the store from internal and external shortage."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration or related field (Master's preferred)"
    }
  ]
}