{
  "meta": [
    {
      "job_title": "Criminal Investigation Department Supervisor",
      "job_category": "Criminal Investigation",
      "job_class": "Supervisor",
      "sector": "Law Enforcement",
      "remote": false,
      "salary": 85000
    }
  ],
  "skills": [
    {
      "skill": "Crime Investigation",
      "experience": 6
    },
    {
      "skill": "Law Enforcement",
      "experience": 6
    },
    {
      "skill": "Accounting",
      "experience": 6
    },
    {
      "skill": "Auditing",
      "experience": 6
    },
    {
      "skill": "Tax Preparation",
      "experience": 6
    },
    {
      "skill": "Strategic Planning",
      "experience": 6
    },
    {
      "skill": "Budgeting",
      "experience": 6
    },
    {
      "skill": "Staff Supervision",
      "experience": 6
    },
    {
      "skill": "Relationship Management",
      "experience": 6
    },
    {
      "skill": "Legal Proceedings",
      "experience": 6
    },
    {
      "skill": "White Collar Crimes",
      "experience": 6
    },
    {
      "skill": "Data Analysis",
      "experience": 6
    },
    {
      "skill": "Tax Laws",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, coordinate, and supervise criminal investigation activities for the Criminal Investigation Department at the Department of Revenue."
    },
    {
      "duty": "Evaluate and prepare reports of investigations into criminal tax activities and make recommendations for the Director, Deputy Director, and Enforcement & Protection Special Agent in charge."
    },
    {
      "duty": "Assist the Attorney General and the Solicitor's Office in the prosecution of criminal cases brought by SCDOR."
    },
    {
      "duty": "Recruit, hire, supervise, and train investigative staff."
    },
    {
      "duty": "Establish, coordinate, and maintain cooperative relationships with other State, Local, and Federal agencies involving white collar crimes."
    },
    {
      "duty": "Assist in the divisional strategic planning and budgeting process."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 40,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree with multiple accounting and/or finance courses and professional experience in accounting, auditing, finance, insurance, or tax preparation and/or analysis. Valid driver’s license. Completion of the basic law enforcement certification program at the SC Criminal Justice Academy if not already certified. Must be able to pass a credit check, psychological evaluation, reading comprehension test, and a medical screening. Must be able to obtain a SC Constable Commission I, as required by SLED."
    },
    {
      "credential": "Preferred qualifications are not required but considered when setting a starting salary within the hiring range. A bachelor's degree, with a minimum of twelve semester hours in accounting, and six years experience in tax accounting or auditing. Experience in investigations. Extensive knowledge of all the State tax laws, civil audit procedures, and criminal investigation procedures. Ability to recognize, develop, and present evidence in a manner that meets requirements for presentation in various legal hearings and court proceedings."
    },
    {
      "credential": "SCDOR employees are required to comply with all SCDOR tax requirements and are subject to a National Criminal Background Check, including fingerprinting."
    },
    {
      "credential": "Equal Employment Opportunity (EEO) policy."
    }
  ]
}