{
  "meta": [
    {
      "job_title": "Technical Program Manager",
      "job_category": "Technology",
      "job_class": "Program Manager",
      "sector": "Software Engineering",
      "salary": 175000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Business Intelligence",
      "experience": 5
    },
    {
      "skill": "Security Risk Mitigation",
      "experience": 5
    },
    {
      "skill": "Technical Project Planning",
      "experience": 5
    },
    {
      "skill": "Security Domain Experience",
      "experience": 3
    },
    {
      "skill": "Cross-functional Team Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Own team-wide metrics, business review processes, and business intelligence to support continuous improvement of security processes and inform risk reduction activities."
    },
    {
      "duty": "Develop, query, and report on metrics to produce valuable insights about internal risk and drive technical and business projects."
    },
    {
      "duty": "Partner with multiple teams to produce comprehensive reports that educate senior leaders and lead to progress."
    },
    {
      "duty": "Coordinate with internal customers within the team and other security teams to ensure circular business processes produce valuable inputs and outputs."
    },
    {
      "duty": "Resolve ambiguities, align team plans to minimize risk, and drive engagement with partner organizations to surface opportunities to solve security problems."
    },
    {
      "duty": "Creating valuable insights about internal risk and drive technical and business projects. Collaborating with technical and non-technical stakeholders at all levels to track progress, flag issues, and ensure milestones are achieved."
    },
    {
      "duty": "Creating and managing technical project plans to reduce security risk."
    },
    {
      "duty": "Developing, querying, and reporting on metrics to produce valuable insights about internal risk. Partnering with multiple teams to produce comprehensive reports that educate senior leaders and lead to progress."
    },
    {
      "duty": "Identifying and quantifying security risk. Closely collaborating with technical and non-technical stakeholders at all levels to track progress on action items, flag issues, and ensure milestones are achieved."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Engineering, or related field (Master's preferred)"
    }
  ]
}