{
  "meta": [
    {
      "job_title": "Technical Program Manager",
      "job_category": "Engineering",
      "job_class": "Program Manager",
      "sector": "Software Engineering",
      "salary": 220000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Product Management",
      "experience": 5
    },
    {
      "skill": "Engineering Team Management",
      "experience": 7
    },
    {
      "skill": "Software Development",
      "experience": 3
    },
    {
      "skill": "Identity Protocol",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Cross-functional Team Management",
      "experience": 5
    },
    {
      "skill": "Definition of KPIs/SLAs",
      "experience": 5
    },
    {
      "skill": "Identity Best Practices",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the definition, design, and delivery of the products and services to enable industry best Identity and Access Management capabilities within Worldwide Operations."
    },
    {
      "duty": "Engage with and influence the many stakeholders to ensure that compliance, security, and cross-functional requirements are met (or exceeded.)"
    },
    {
      "duty": "Design solutions for foundational IAM principals including: least privilege access, password management, audit logging, certificate management, privileged access, and user behavior analytics."
    },
    {
      "duty": "Clearly communicate product vision, user stories, plans, and project status to management and key technical and business stakeholders."
    },
    {
      "duty": "Work closely with the software development and engineering team on delivering high-quality solutions, and provide guidance regarding architecture, design, and priorities."
    },
    {
      "duty": "Develop monitoring and reports on the health, effectiveness, and efficiency of IAM services and products."
    },
    {
      "duty": "Engage with other teams across Amazon to evangelize the team and your projects, to build relationships and help identify existing technologies that may be complementary."
    },
    {
      "duty": "Identify, assess and mitigate risks, provide escalation management, anticipate and make tradeoffs balancing the business needs versus constraints."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Engineering, or a related technical field (Master's preferred)"
    }
  ]
}