{
  "meta": [
    {
      "job_title": "Import & Food Safety Compliance Manager",
      "job_category": "Food Safety Compliance",
      "job_class": "Compliance Manager",
      "sector": "Import & Food Safety",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the company’s Foreign Supplier Verification Program (FSVP); conduct compliance audits of food and foreign suppliers; review and analyze reports, identify gaps and resolve issues, and ensure all certifications for the suppliers are current and in good standing."
    },
    {
      "duty": "Review, update and maintain product specification sheets to standardize product information and ensure consistency and accuracy."
    },
    {
      "duty": "Maintain and update databases/systems of product specifications and supporting documentation."
    },
    {
      "duty": "Provide strategic regulatory advice and support regarding inquiries from customers and internal teams on ingredients, formulations, and associated requirements."
    },
    {
      "duty": "Assist in the approval of and ongoing performance management of suppliers."
    },
    {
      "duty": "Ensure compliance with applicable food safety regulatory requirements including USDA, FDA, FSVP, and Importing."
    },
    {
      "duty": "Responsible for overall Import Customs Compliance and prepare customs documents to ensure compliance with all customs clearance requirements, laws, and regulations."
    },
    {
      "duty": "Determine the correct HTS classification and Duty Rate for new and existing items; Maintain HTS Classification & Duty Rates; Consult with Customs Brokers regarding correct HTS classification and Duty Rates."
    },
    {
      "duty": "Ensure all Import documentation is properly labeled, filed, and available for review. Maintain Lists of Import Entry #’s, Files by Customs Broker, etc."
    },
    {
      "duty": "Help manage the import process by maintaining relationships with customs brokers and other third-party service providers. Support the team in resolving any unforeseen discrepancies with suppliers, customs brokers, and other third-party service providers."
    },
    {
      "duty": "All other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Foreign Supplier Verification Program (FSVP)",
      "experience": 5
    },
    {
      "skill": "Preventive Controls Qualified Individual (PCQI)",
      "experience": 5
    },
    {
      "skill": "Hazard Analysis and Critical Control Points (HACCP)",
      "experience": 5
    },
    {
      "skill": "Knowledge of Federal (FDA/USDA) and state labeling regulations",
      "experience": 5
    },
    {
      "skill": "Experience with maintaining & enforcing proper documentation & protocol to follow FSVP requirements",
      "experience": 5
    },
    {
      "skill": "Experience in Imports, Customs Compliance, and documentation",
      "experience": 5
    },
    {
      "skill": "Experience in distribution, supply chain, or warehouse environment",
      "experience": 5
    },
    {
      "skill": "Working with Registrar Corp, or other similar vendors, to implement and oversee Food Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Prop 65 requirements experience",
      "experience": 5
    },
    {
      "skill": "Experience working with labs",
      "experience": 5
    },
    {
      "skill": "Knowledge of food plant processing",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Foreign Supplier Verification Program (FSVP) certification"
    },
    {
      "credential": "Preventive Controls Qualified Individual (PCQI) certification"
    },
    {
      "credential": "Hazard Analysis and Critical Control Points (HACCP) certification"
    },
    {
      "credential": "Bachelor's degree in a relevant field (Master's preferred)"
    }
  ]
}