{
  "meta": [
    {
      "job_title": "Digital Design Communication Specialist",
      "job_category": "Design",
      "job_class": "Specialist",
      "sector": "Design",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Graphic Design",
      "experience": 5
    },
    {
      "skill": "Visual Communication",
      "experience": 5
    },
    {
      "skill": "Design Systems",
      "experience": 3
    },
    {
      "skill": "Customer Interface",
      "experience": 3
    },
    {
      "skill": "Web Design",
      "experience": 5
    },
    {
      "skill": "Application Design",
      "experience": 3
    },
    {
      "skill": "Adobe Creative Suite",
      "experience": 5
    },
    {
      "skill": "Microsoft O365",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Creates, designs, and develops in-house communications to service various functions within the IT Americas Region."
    },
    {
      "duty": "Delivers content through careful management of deadlines and workflows to meet agreed upon customer demand."
    },
    {
      "duty": "Develops and creates visual communication such as animation, video, photography, and audio."
    },
    {
      "duty": "Manages assignments and activities performed by Graphics & Communications Intern."
    },
    {
      "duty": "Plans clear progressions of ideation by implementing structure into the creative process."
    },
    {
      "duty": "Collaborates with customers and stakeholders to ensure correct messaging and achievement of objectives."
    },
    {
      "duty": "Drives development and communication of design guidelines and patterns."
    },
    {
      "duty": "Performs advanced writing and editing for content creation and development benefiting internal communication in the IT Americas."
    },
    {
      "duty": "Supports the development of the communication strategy for IT Americas."
    },
    {
      "duty": "Oversees the conception and execution of communication projects."
    },
    {
      "duty": "Manages intranet pages through periodical content and design refresh."
    },
    {
      "duty": "Interacts with users in order to gather feedback to enhance user experience."
    },
    {
      "duty": "Delivers work-effort as part of Agile projects."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 75,
      "student_teacher": 60,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "B.A., B.F.A., or B.S. in Art, Design, Graphic Design or a related field. 5+ years of demonstrated success in the field of design or visual communications."
    }
  ]
}