{
  "meta": [
    {
      "job_title": "Off-page Specialist",
      "job_category": "Marketing",
      "job_class": "Specialist",
      "sector": "Marketing",
      "salary": 50000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Link Building",
      "experience": 3
    },
    {
      "skill": "SEO Strategy",
      "experience": 3
    },
    {
      "skill": "Content Marketing",
      "experience": 3
    },
    {
      "skill": "Client Management",
      "experience": 4
    },
    {
      "skill": "Communication/Networking",
      "experience": 4
    },
    {
      "skill": "Outreach Software",
      "experience": 3
    },
    {
      "skill": "Google Workspace",
      "experience": 3
    },
    {
      "skill": "Social Media Management",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    },
    {
      "skill": "Analytical Skills",
      "experience": 3
    },
    {
      "skill": "Market Research",
      "experience": 3
    },
    {
      "skill": "Online Presence Management",
      "experience": 3
    },
    {
      "skill": "Event Planning",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "English Language",
      "experience": 4
    },
    {
      "skill": "WordPress",
      "experience": 2
    },
    {
      "skill": "HARO",
      "experience": 2
    },
    {
      "skill": "Writing",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create effective link building strategies for new clients, and execute on strategies for existing clients."
    },
    {
      "duty": "Actively source and vet link building prospects based on the overarching link building and SEO strategy."
    },
    {
      "duty": "Manage daily outreach and related link building correspondence for our list of clients (including via email, phone calls, and social media)"
    },
    {
      "duty": "Attend bi-weekly client calls to provide link building updates, explain the link building strategy, and answer any client questions."
    },
    {
      "duty": "Report on newly acquired links to management and clients and actively monitor links to ensure they remain live on sites."
    },
    {
      "duty": "Compile quarterly link building reports across all our clients. Provide monthly link building updates to other departments once a month."
    },
    {
      "duty": "Manage a pool of hours which are provided by clients."
    },
    {
      "duty": "Develop link building deliverables for clients."
    },
    {
      "duty": "Directly manage our link building freelancer."
    },
    {
      "duty": "As the company grows, you will also be responsible for training and directly managing new off-page employees."
    },
    {
      "duty": "Create and schedule social media and Google Business calendars."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Marketing, PR, or Communications, or similar field (Master's preferred)"
    },
    {
      "credential": "1-3 years of experience in a link building, off-page SEO, public relations, or similar role. Agency experience is preferred."
    },
    {
      "credential": "Proficient in Google Workspace: Docs, Sheets, Slides, Drive, etc."
    },
    {
      "credential": "Experience with email platforms like Gmail, Outlook, Office365, etc. preferred."
    },
    {
      "credential": "Familiarity with SEMrush, Ahrefs, and email outreach software like Buzzstream."
    },
    {
      "credential": "Experience directly managing Google Business profiles is a plus."
    },
    {
      "credential": "Ability to work in a fast-paced environment for a growing digital marketing agency."
    },
    {
      "credential": "Desire to continuously improve workflow and work efficiently."
    },
    {
      "credential": "Must have excellent time management and organizational skills."
    },
    {
      "credential": "Must have great communication/networking skills and be able to nurture online relationships."
    },
    {
      "credential": "Proficient in the social media landscape and experience with social media as a means of communication."
    },
    {
      "credential": "Excellent command of the English language. Motivation to stay informed about the latest news in the digital marketing world including link building, social media, and content marketing."
    },
    {
      "credential": "Experience with WordPress and HARO a plus. An interest or passion for writing is a plus."
    }
  ]
}