{
  "meta": [
    {
      "job_title": "Claim Operator",
      "job_category": "Logistics",
      "job_class": "Operator",
      "sector": "Logistics",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Microsoft Excel Proficiency",
      "experience": 1
    },
    {
      "skill": "Freight Claims Processing",
      "experience": 1
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 1
    },
    {
      "skill": "Critical Thinking",
      "experience": 1
    },
    {
      "skill": "Problem-Solving",
      "experience": 1
    },
    {
      "skill": "Organization",
      "experience": 1
    },
    {
      "skill": "Collaboration",
      "experience": 1
    },
    {
      "skill": "Project Management",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review new submissions to ensure all required documentation and claim details are included."
    },
    {
      "duty": "File and manage shortage claims based on shortage investigation report, theft notification, and/or warehouse incident report."
    },
    {
      "duty": "Investigate and process damage claim submissions based on return authorizations and QA reports."
    },
    {
      "duty": "Communicate with the logistics service provider to ensure a timely and accurate resolution."
    },
    {
      "duty": "Thoroughly review all claim declinations and communicate the final resolution to customers, if valid."
    },
    {
      "duty": "Dispute invalid claim resolutions to overturn declination and negotiate claim payment."
    },
    {
      "duty": "Analyze data to determine claim’s validity; evaluate independent reports, including video, written incident reports, valuation estimated, etc."
    },
    {
      "duty": "Compile comprehensive claim analyses for monthly reporting to clients."
    },
    {
      "duty": "Work within company guidelines to analyze contractual agreements of the customer, shipper, consignee, or carrier and then assess the physical damage reports and the cargo claims findings."
    },
    {
      "duty": "Notify involved parties of claim filings and/or rejected claims and clearly communicate with the claimant the best course of action to mitigate loss."
    },
    {
      "duty": "Email updates on progress or conflicts regarding the accident to all internal parties involved."
    },
    {
      "duty": "Escalate high-value declinations with management to discuss possible recourse."
    },
    {
      "duty": "Negotiate timely settlements and communicate detailed findings to the claimant."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": []
}