{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "PMP Certification",
      "experience": 5
    },
    {
      "skill": "Agile Project Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Resource Management",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Project Documentation",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluate complex situations accurately and identify viable solutions that create successful outcomes for the customer."
    },
    {
      "duty": "Develop and maintain project documentation including schedules/timelines and various detailed plans for Communication, Risk Management, Deployment and others as required."
    },
    {
      "duty": "Develop and maintain \"lessons-learned\" for utilization on future projects."
    },
    {
      "duty": "Manage and direct a large upgrade project (i.e., project staffing, developing, monitoring and controlling schedules; identifying and resolving issues and risks; and communicating status to stakeholders)"
    },
    {
      "duty": "Work on complex problems where analysis of situation or data requires an in-depth evaluation of various factors to achieve the best results."
    },
    {
      "duty": "Work effectively with internal and external clients, third party vendors and senior management in accomplishing project objectives."
    },
    {
      "duty": "Manage effective project oversight and reviews to affect project success."
    },
    {
      "duty": "Manage political, resource, budgeting, change and issues affecting the project."
    },
    {
      "duty": "Manage change requests associated with the project."
    },
    {
      "duty": "Manage vendor participation related to the project."
    },
    {
      "duty": "Develop and maintain status reports, decision and issue logs."
    },
    {
      "duty": "Drive project work to completion"
    },
    {
      "duty": "Work closely with the Project Sponsor(s) and Governance Committees to facilitate decisions necessary for project delivery."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Project Management or related field (Master's preferred)"
    },
    {
      "credential": "Current PMP certification is required."
    }
  ]
}