{
  "meta": [
    {
      "job_title": "General Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of Pet Care Center managers, leaders, and partners, driving business through talent acquisition, training, and development."
    },
    {
      "duty": "Meet or exceed goals related to Pet Care Center sales, profitability, and operational excellence."
    },
    {
      "duty": "Ensure the proper health, appearance, welfare, and proper handling of all animals in the center."
    },
    {
      "duty": "Oversee marketing the Pet Care Center and its products, including planning on-site and community events, such as adoptions and school visits."
    },
    {
      "duty": "Ensure the Pet Care Center's appearance adheres to operational standards, safety procedures, and professional image."
    },
    {
      "duty": "Model inspiring leadership and selling behaviors to Pet Care Center partners and associates."
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Performance Management",
      "experience": 3
    },
    {
      "skill": "Financial Reporting",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Sales Management",
      "experience": 3
    },
    {
      "skill": "Process Excellence",
      "experience": 3
    },
    {
      "skill": "Marketing",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent (GED) with proficiency in basic business & finance acumen, analysis, and problem-solving skills."
    },
    {
      "credential": "Three or more years of management experience, with previous retail management experience preferred."
    },
    {
      "credential": "Working knowledge of general business practices and strong organizational skills."
    },
    {
      "credential": "Aptitude for demonstrating strong customer service and the ability to instruct others, along with a keen and genuine interest in all kinds of animals."
    }
  ]
}