{
  "meta": [
    {
      "job_title": "Bilingual Research Coordinator",
      "job_category": "Research",
      "job_class": "Coordinator",
      "sector": "Epidemiology",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Bilingual Proficiency (English and Spanish)",
      "experience": 5
    },
    {
      "skill": "Participant Recruitment",
      "experience": 5
    },
    {
      "skill": "Data Collection",
      "experience": 5
    },
    {
      "skill": "Research Coordination",
      "experience": 5
    },
    {
      "skill": "Biometric Data Collection",
      "experience": 5
    },
    {
      "skill": "Survey Administration",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Community Partnership Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct participant recruitment in Spanish including: eligibility screening calls, scheduling eligibility data collection appointments, consenting participants into studies."
    },
    {
      "duty": "Conduct data collection in Spanish including: biometric data collection, survey data collection, and review and audit of case reports."
    },
    {
      "duty": "Assist with building research instruments using standard survey tools such as Redcap, Qualtrics, etc."
    },
    {
      "duty": "Work with the PIs and other research staff in the synthesis and interpretation of qualitative data using appropriate data analysis methods and programs."
    },
    {
      "duty": "Meeting planning and support, schedule research team meetings, and update project plans and associated tasks."
    },
    {
      "duty": "Draft IRB applications and modifications and submit for approvals for research projects under supervision."
    },
    {
      "duty": "Conduct literature reviews on assigned research topics and summarize results."
    },
    {
      "duty": "Contribute to the development and administration of survey instruments (in English and Spanish) for focus groups and one-on-one interviews."
    },
    {
      "duty": "Contribute to data analysis and update research materials."
    },
    {
      "duty": "Assist with the design of flyers, outreach materials, and educational tools as needed for research activities and dissemination activities."
    },
    {
      "duty": "Coordinate and contribute to collaborative research activities with community partners, collaborators, and/or students."
    },
    {
      "duty": "Keep track of project plans and budgetary expenditures to help ensure that projects are completed on-time and within budget."
    },
    {
      "duty": "May supervise students who are engaged in related research studies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Arts degree in an applicable social science related field, or combination of education and relevant experience in an applicable social science."
    }
  ]
}