{
  "meta": [
    {
      "job_title": "Team Leader",
      "job_category": "Social Services",
      "job_class": "Leader",
      "sector": "Social Services",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 6
    },
    {
      "skill": "Staff Management",
      "experience": 6
    },
    {
      "skill": "Program Quality and Compliance",
      "experience": 6
    },
    {
      "skill": "Clinical Duties",
      "experience": 6
    },
    {
      "skill": "Business Development",
      "experience": 6
    },
    {
      "skill": "Housing Responsibilities",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and oversee the daily operations, administration, and team management of Residential Support Services (RSS) program."
    },
    {
      "duty": "Assist program management with administrative and clinical record keeping tasks, and ensure compliance with financial responsibilities."
    },
    {
      "duty": "Oversee the hiring, training, supervision, and performance evaluations of professional and non-professional staff."
    },
    {
      "duty": "Ensure that all services meet high standards of care and comply with legal, regulatory, and contractual requirements."
    },
    {
      "duty": "Provide direction to staff in the planning, development, and implementation of client treatment planning and services."
    },
    {
      "duty": "Maintain positive collaboration with community partners and agency/program fundraising efforts."
    },
    {
      "duty": "Assist in the procurement of additional housing, and oversee the maintenance of Buckelew housing to ensure safety and compliance with regulations."
    },
    {
      "duty": "Conduct housing inspections, maintain landlord/owner and neighborhood relationships, and address concerns as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Associates degree in Social Services/Psychology (or related field) plus 6 years of experience; or a Bachelors degree plus four years of experience; or a Masters degree plus two years of experience in social services/psychology. Successful completion of 40-hour Adult Residential Facility Initial Certification within the first twelve months and maintenance of certification."
    }
  ]
}