{
  "meta": [
    {
      "job_title": "Operational Training Manager",
      "job_category": "Training",
      "job_class": "Manager",
      "sector": "Airport Operations",
      "salary": 90000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Participate in and support planning for the AOR Program."
    },
    {
      "duty": "Assess operational training needs of all stakeholders."
    },
    {
      "duty": "Creation of operational training curricula, maps and other aids."
    },
    {
      "duty": "Develop comprehensive and overall operational training program to match the stakeholder needs and ensure competency levels are achieved."
    },
    {
      "duty": "Develop orientation and familiarization training courses that cover generic facility spaces, functions and systems and individual stakeholder requirements."
    },
    {
      "duty": "Review Design Builders Proposed training plans, syllabus and instructional materials for all equipment & systems; manage training Airport operations, maintenance personnel, service contractors and other stakeholders."
    },
    {
      "duty": "Develop and execute Train-the-Trainer programs."
    },
    {
      "duty": "Manage & coordinate schedule & quality assurance, for each training plan."
    },
    {
      "duty": "Develop with the design builder the Training Quality measurement & post-training evaluation/assessment program."
    },
    {
      "duty": "Coordinate, review training activities with all pertinent and relevant stakeholder groups."
    },
    {
      "duty": "Coordinate and assist with filming of training sessions and quality reviews of the classes."
    },
    {
      "duty": "Assist with the development, refinement and implementation of work plans, including checklists, simulations, trials, and training programs."
    },
    {
      "duty": "Manage Training program including development of concept, execution, gathering feedback and resolution."
    },
    {
      "duty": "Assist in project close out process."
    },
    {
      "duty": "Assist Project closeout administration from the training requirements standpoint, including coordination and assistance for final inspection, preparation of contractor deficiency lists and punch lists and receipt of relevant training documents."
    },
    {
      "duty": "Coordinate the preparation of training syllabus, review training materials."
    },
    {
      "duty": "Prepare final report with a summary of the training programs developed and executed, training issues, and data on the training provided and the types of training. Include a section on lessons learned."
    },
    {
      "duty": "Become thoroughly familiar with required contractual obligations and technical aspects of all training to be performed."
    },
    {
      "duty": "Monitors, reviews and comments on the overall training planning activities to identify critical milestones and priorities."
    },
    {
      "duty": "Review and monitor the services of contractors and subcontractors, tied to training program dependent resources to ensure will be available at the appropriate time for maximum efficiency and productivity."
    },
    {
      "duty": "Assess progress and identify potential gaps in training. Keep alert to possible additional needs and take preventative action to ensure that critical milestones are met for training."
    },
    {
      "duty": "Prepare periodic reports summarizing progress of training activities for LAWA executive management."
    },
    {
      "duty": "Perform other responsibilities associated with this position as may be appropriate."
    },
    {
      "duty": "May assume other duties as required/needed."
    },
    {
      "duty": "Maybe required to work past regular work shift."
    },
    {
      "duty": "Maybe required to work various shifts as needed."
    },
    {
      "duty": "This position offers a hybrid/telework schedule. Telework - Monday and Friday. Onsite - Tuesday, Wednesday and Thursday. Please refer to LAWA’s Pilot Policy for details."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Training Program Development",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Technical Writing",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Engineering, Business Administration, Construction, Planning or related fields ;preferred with a concentration in training and development; or related field."
    }
  ]
}