{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage all aspects of installation, upgrade, conversion, migration, and professional services projects from initial kick-off to go-live."
    },
    {
      "duty": "Oversee 25-35 short/long-term projects for multiple applications."
    },
    {
      "duty": "Consistently manage client expectations, ensure delivery of the highest quality service, and solicit and act on client feedback."
    },
    {
      "duty": "Follow a prescribed roll-out plan and make real-time updates within your project disposition."
    },
    {
      "duty": "Provide an overview of the implementation process, review system and installation requirements, and determine the best course of action to implement the product."
    },
    {
      "duty": "Review pre-installation surveys and obtain information needed for installation/configuration."
    },
    {
      "duty": "Note key resources involved and initiate Mutual Non-Disclosure Agreement (MNDA)."
    },
    {
      "duty": "Review hardware components and ensure the order is processed in a timely manner."
    },
    {
      "duty": "Deliver OVA server and instructions via secure email."
    },
    {
      "duty": "Confirm 3rd party system integration is enabled."
    },
    {
      "duty": "Coordinate/lead project status calls to review issues, concerns, questions, and discuss next steps."
    },
    {
      "duty": "Conduct project meetings, customer calls/follow-ups in a professional and courteous manner."
    },
    {
      "duty": "Coordinate all technical resources and client engagements."
    },
    {
      "duty": "Drive projects to completion on time and within budget."
    },
    {
      "duty": "Define expectations and timelines to keep the project moving and confirm FI adheres to the deadlines."
    },
    {
      "duty": "Prioritize, organize, and update projects accordingly and in time for the weekly scrum/project meetings."
    },
    {
      "duty": "Oversee the upgrade and installation queues for new project opportunities."
    },
    {
      "duty": "Respond to project requests within 24 hours."
    },
    {
      "duty": "Send weekly follow-up emails and reminders to customers to check on the project status/progress."
    },
    {
      "duty": "Assess stalled and/or customer hold projects and initiate communication to get the projects moving."
    },
    {
      "duty": "Provide training materials and documentation."
    },
    {
      "duty": "Establish customer-facing and/or internal procedures when necessary."
    },
    {
      "duty": "Triage client issues when appropriate and engage the necessary resources."
    },
    {
      "duty": "Manage the lifecycle of all technical issues arising out of your projects."
    },
    {
      "duty": "Ensure projects are invoiced in a timely manner and/or the invoice date."
    },
    {
      "duty": "Interface with the Support, Installations, Digital, QA, Development, Design, and other teams as needed."
    },
    {
      "duty": "Participate in daily/weekly scrums to review progress, issues, and next steps."
    },
    {
      "duty": "Prepare travel arrangements for client-site services when necessary."
    },
    {
      "duty": "Provide deployment projections and meet prescribed company goals."
    },
    {
      "duty": "Assist with order proposal preparation as needed."
    },
    {
      "duty": "Advocate for the client and provide an exceptional client experience."
    },
    {
      "duty": "Offer excellent problem-solving and abstract thinking skills when confronted with challenges due to various environments."
    },
    {
      "duty": "Adhere to company security policies and protocols."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 75
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Project Management or a related field (Master's preferred)"
    }
  ]
}