{
  "meta": [
    {
      "job_title": "Executive Assistant",
      "job_category": "Administration",
      "job_class": "Assistant",
      "sector": "Management",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Calendar Management",
      "experience": 3
    },
    {
      "skill": "Gsuite",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Emotional Intelligence",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 3
    },
    {
      "skill": "Decision Making",
      "experience": 3
    },
    {
      "skill": "Confidential Material Handling",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Proactive management of meetings, commitments, and communication, including calendar, email, scheduling internal & external meetings, conference calls, and appointments."
    },
    {
      "duty": "Assist with planning and execution of meetings and events, including managing logistics, coordinating agendas, taking meeting notes, and following up on action items."
    },
    {
      "duty": "Proactively manage all travel arrangements, including air, hotel & ground transportation, visa assistance, and detailed itineraries."
    },
    {
      "duty": "Accurately complete expense reports."
    },
    {
      "duty": "Manage calendars strategically, maximizing usage of time and anticipating potential schedule conflicts."
    },
    {
      "duty": "Assist in managing day-to-day office functions, responding to emails, and attending meetings on behalf of the CEO if needed."
    },
    {
      "duty": "Proactively take on new tasks or projects without instruction and assume responsibility for key outcomes and deliverables."
    },
    {
      "duty": "Effectively manage interruptions of workflow with courtesy and flexibility while working through confidential information."
    },
    {
      "duty": "Ad Hoc Office Management work, such as ordering supplies and groceries."
    },
    {
      "duty": "Completion of some personal tasks related to work duties, such as booking dog boarding when the CEO is on work travel."
    },
    {
      "duty": "Work closely with our COO and Chief of Staff and perform EA duties as able for them."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Communication, or related field"
    }
  ]
}