{
  "meta": [
    {
      "job_title": "Sales Supervisor",
      "job_category": "Sales",
      "job_class": "Supervisor",
      "sector": "Sales",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Team Building",
      "experience": 5
    },
    {
      "skill": "Retail Operations",
      "experience": 5
    },
    {
      "skill": "Loss Prevention",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Visual Merchandising",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Contribute to the overall store success by ensuring store sales goals are met while also achieving individual sales goals."
    },
    {
      "duty": "Responsible for delivering exceptional customer experiences and driving sales by styling and wardrobing each customer based on their needs."
    },
    {
      "duty": "Assist with training, coaching, developing and motivating associates to achieve maximum sales productivity."
    },
    {
      "duty": "Assist with managing payroll and ensuring payroll goals are met within established guidelines to ensure proper coverage based on business needs."
    },
    {
      "duty": "Communicate with Store Manager and/or Assistant Manager regarding all employee relations, day to day operations and any compliance related matters and to set goals for personal skill development."
    },
    {
      "duty": "Represent the brand and ensure team members are embodying the brand in all interactions with customers and peers."
    },
    {
      "duty": "Ensure Loss Prevention policies and procedures are followed. Assist with financial/sales audits and inventories to protect the store from internal and external shortage."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "2+ years of related sales experience in specialty or luxury retail and/or customer service experience and at least 1 year of supervisor experience."
    }
  ]
}