{
  "meta": [
    {
      "job_title": "Pet Care Center Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Animal Welfare",
      "experience": 3
    },
    {
      "skill": "Sales Techniques",
      "experience": 3
    },
    {
      "skill": "Merchandising",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure all companion animals and aquatic life in the Pet Care Center are receiving appropriate care and maintenance."
    },
    {
      "duty": "Handle register transactions and support guest interactions to create a great experience."
    },
    {
      "duty": "Stock, price, and display merchandise to create a great presentation for our guests."
    },
    {
      "duty": "Promote a positive culture of teamwork, inclusion, and collaboration within the Pet Care Center."
    },
    {
      "duty": "Evaluate guest inquiries and act as a primary resource for guests and other PCC partners regarding animal education and care."
    },
    {
      "duty": "Efficiently order companion animals, aquatic life, supplies, and merchandise to maximize sales and inventory."
    },
    {
      "duty": "Perform routine housekeeping tasks to maintain the professional image and appearance of the companion animal habitat and aquatic areas."
    },
    {
      "duty": "Ensure proper handling and documentation for all relinquished and adoption animals."
    },
    {
      "duty": "Participate in the completion of all animal and aquatic life related physical inventory counts."
    },
    {
      "duty": "Adhere to and promote established safety and loss prevention procedures."
    },
    {
      "duty": "Utilize selling behaviors and contribute to a safe working environment."
    },
    {
      "duty": "Be a part of a collaborative culture and engage in career development programs."
    },
    {
      "duty": "Ensure quick and courteous service to all guests, maintain high merchandising standards, and adhere to safety procedures for partners, guests, and pets."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent (GED) with proficiency in mathematics, basic accounting relationships, and exceptional communication skills."
    },
    {
      "credential": "Completion and maintenance of the Petco Animal Care Certification program."
    }
  ]
}