{
  "meta": [
    {
      "job_title": "Electrical and Automation Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Engineering",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Automation and Controls",
      "experience": 8
    },
    {
      "skill": "Electrical Engineering",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "PLC/HMI Programming",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 6
    },
    {
      "skill": "Budget Management",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead efforts to improve the facilities operating systems through the review, testing, repair, and maintenance of the Power Distribution System and networks associated with the operating mechanisms and manufacturing processes."
    },
    {
      "duty": "Develops and implements a project plan and schedule for automation projects or acts as a project team member supporting automation aspects of project execution."
    },
    {
      "duty": "Provides engineering technical assistance to product development and manufacturing staff to support, control, and automation modifications, and/or improvements, to help reach attainment goals on new or existing production lines."
    },
    {
      "duty": "Responsible for the documentation, implementation, startup, and technical support of Programmable Logic Controller (PLC) and Human Machine Interface (HMI) programming in an industrial automation environment."
    },
    {
      "duty": "Leads development and training efforts of plant operations and maintenance personnel in the design features process operation and interpretation of system information and application of that information regarding control system functionality."
    },
    {
      "duty": "Responsible for the effective utilization of employee’s skills, development, mechanical downtime, equipment effectiveness, housekeeping, safety policy administration, discipline, employee relations, cost control, and problem-solving while ensuring budgeted performance is monitored and compliant."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Engineering, Electrical Engineering preferred"
    }
  ]
}