{
  "meta": [
    {
      "job_title": "Manager, Platform Solutions",
      "job_category": "Information Technology",
      "job_class": "Manager",
      "sector": "Information Technology",
      "salary": 143000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Enterprise Planning",
      "experience": 10
    },
    {
      "skill": "HRIS",
      "experience": 10
    },
    {
      "skill": "Salesforce Platform",
      "experience": 10
    },
    {
      "skill": "Feasibility Study",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "System Development",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Client Relationship Management",
      "experience": 10
    },
    {
      "skill": "Personnel Development",
      "experience": 10
    },
    {
      "skill": "Policy Adherence",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and lead the Platform Solutions team to plan, conduct, and coordinate business programming applications activities for Enterprise Planning, HRIS, Salesforce Platform, and other applications."
    },
    {
      "duty": "Prepare feasibility studies and cost estimates for new data processing applications or revisions to existing systems."
    },
    {
      "duty": "Establish programming standards, program documentation requirements, and review current status of system applications for recommendations and improvements."
    },
    {
      "duty": "Supervise staff to ensure successful project delivery, service request fulfillment, and client satisfaction."
    },
    {
      "duty": "Coordinate and align HAEA resources to support KMA and HMA IT initiatives."
    },
    {
      "duty": "Establish personnel development plans, provide training and project opportunities, and ensure adherence to company policy and procedures."
    },
    {
      "duty": "Manage the work efforts of supervisors/individual contributors, responsible for hiring, firing, performance appraisals, and pay reviews."
    },
    {
      "duty": "Make decisions based on unit objectives, company policies, and procedures, and work on issues of diverse scope where analysis of situation or data requires evaluation of a variety of factors."
    },
    {
      "duty": "Follow processes and operational policies, act as an advisor to subordinate(s) to meet schedules and/or resolve technical problems, and develop and administer schedules with possible budget responsibilities."
    },
    {
      "duty": "Occasional travel may be required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS / BA degree in business, information systems, or related field (Master's preferred)"
    },
    {
      "credential": "10 years experience in system implementation or maintenance"
    },
    {
      "credential": "5+ years experience as a manager or PM, preferably in the automobile industry"
    },
    {
      "credential": "Good inter-personal skill and good organizing and analytical skill"
    }
  ]
}