{
  "meta": [
    {
      "job_title": "Task Associate",
      "job_category": "Retail",
      "job_class": "Associate",
      "sector": "Retail",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Keeping fixtures stocked with merchandise, maintaining overall store cleanliness, and completing tasks as assigned."
    },
    {
      "duty": "Ensuring all tasks are executed as planned and product is available for purchase."
    },
    {
      "duty": "Supporting store management by following process and procedures and completing tasks."
    },
    {
      "duty": "Managing task dashboard and ensure the timely completion of all operational processes, including the shipment and replenishment processes of goods, merchandise sets, and inventory counts and procedures."
    },
    {
      "duty": "Contributing to an inclusive environment that supports teammates, peers, and the internal and external guests served."
    },
    {
      "duty": "Participating regularly in ongoing training, including timely completion of daily digital trainings, to enable continuous professional development and drive sales performance."
    },
    {
      "duty": "Completing merchandise resets, planograms, marketing displays, physical inventory procedures, and processing shipment using Ulta Beauty’s technology and best practices."
    },
    {
      "duty": "Ensuring assigned work area is replenished, signed, and faced, and ensuring testers are available."
    },
    {
      "duty": "Maintaining outstanding store standards and overall store cleanliness including salesfloor, restrooms, cashwrap, backroom, and break area."
    },
    {
      "duty": "Ensuring compliance by being knowledgeable of Ulta Beauty’s policies, procedures, and standards."
    },
    {
      "duty": "Helping eliminate and/or reduce potential theft of product by providing exceptional guest service and maintaining awareness while on the sales floor."
    },
    {
      "duty": "Executing other operational tasks as directed."
    }
  ],
  "skills": [
    {
      "skill": "Time Management",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Retail Sales",
      "experience": 1
    },
    {
      "skill": "Merchandising",
      "experience": 1
    },
    {
      "skill": "Cash Handling",
      "experience": 1
    },
    {
      "skill": "Teamwork",
      "experience": 1
    },
    {
      "skill": "Problem Solving",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 80,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma is preferred"
    }
  ]
}