{
  "meta": [
    {
      "job_title": "Data Center Civil Engineer",
      "job_category": "Engineering",
      "job_class": "Civil Engineer",
      "sector": "Engineering",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Geotechnical Engineering",
      "experience": 7
    },
    {
      "skill": "Civil Design",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Technical Writing",
      "experience": 7
    },
    {
      "skill": "AutoCAD",
      "experience": 7
    },
    {
      "skill": "MS Office Suite",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Analyze data collected during geotechnical investigations to identify potential geotechnical hazards that may affect the project's design, construction, or operation."
    },
    {
      "duty": "Manage external civil design consultants through the Data Center design and construction process."
    },
    {
      "duty": "Review designs for site layout, grading, power substations, storm water, utilities, and pavement."
    },
    {
      "duty": "Coordinate with internal and external MEP design engineers."
    },
    {
      "duty": "Effectively communicate design standards to internal and external project partners."
    },
    {
      "duty": "Communicate conceptual designs and create/maintain project documentation before, during, and after construction."
    },
    {
      "duty": "Develop and maintain design standards, design prototypes, and template specifications related to site design for Data Centers and supporting infrastructure."
    },
    {
      "duty": "Coordinate with AWS Due Diligence and Real Estate teams to determine site selection criteria and review Due Diligence reports."
    },
    {
      "duty": "Create, review, and release design RFPs for various projects, including DCs and special program facilities."
    },
    {
      "duty": "Manage multiple fast paced projects simultaneously."
    },
    {
      "duty": "Foresee and manage internal Technical Program Manager’s (TPM’s) expectation regarding project-specific cost and schedules variables."
    },
    {
      "duty": "Lead initiatives aimed at improving cost, quality, schedule, and consistency."
    },
    {
      "duty": "Travel for site assessments, internal design meetings, construction review, and interfacing with authorities having jurisdiction. Anticipated travel is approximately 25%."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "ABET accredited BS in Civil Engineering (Professional Engineering License required)"
    }
  ]
}