{
  "meta": [
    {
      "job_title": "Transactional Real Estate Attorney",
      "job_category": "Legal",
      "job_class": "Attorney",
      "sector": "Legal",
      "salary": 125000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Real Estate Law",
      "experience": 5
    },
    {
      "skill": "Legal Compliance",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Due Diligence",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Legal Research",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Mediation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide legal counsel and guidance on various real estate matters, including acquisitions, dispositions, leasing, financing, and development projects."
    },
    {
      "duty": "Draft, review, and negotiate complex real estate contracts, agreements, leases, and other legal documents."
    },
    {
      "duty": "Conduct thorough due diligence on real estate transactions, including title review, environmental assessments, and zoning analysis."
    },
    {
      "duty": "Collaborate with clients, stakeholders, and opposing counsel to facilitate successful deal closings."
    },
    {
      "duty": "Offer strategic advice to clients regarding real estate investment opportunities, risk assessment, and potential legal issues."
    },
    {
      "duty": "Stay up-to-date with local and state real estate laws, regulations, and market trends to ensure compliance and inform clients."
    },
    {
      "duty": "Represent clients in negotiations, mediations, and dispute resolutions related to real estate transactions."
    },
    {
      "duty": "Work closely with paralegals and support staff to ensure efficient workflow and accurate documentation."
    },
    {
      "duty": "Maintain organized case files, documentation, and communication records related to each transaction."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 150,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Juris Doctor (J.D.) degree from an accredited law school and active membership in the Washington State Bar Association. Minimum of 3 years of experience practicing transactional real estate law, preferably in the Tacoma area."
    }
  ]
}