{
  "meta": [
    {
      "job_title": "Ecommerce Merchandising and Web Content Specialist",
      "job_category": "Digital Marketing",
      "job_class": "Specialist",
      "sector": "E-commerce",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Website Merchandising",
      "experience": 3
    },
    {
      "skill": "UI/UX Design",
      "experience": 3
    },
    {
      "skill": "Product Analysis",
      "experience": 3
    },
    {
      "skill": "Data-driven Insights",
      "experience": 3
    },
    {
      "skill": "A/B Testing",
      "experience": 3
    },
    {
      "skill": "Digital Marketing",
      "experience": 3
    },
    {
      "skill": "Supply Chain Collaboration",
      "experience": 3
    },
    {
      "skill": "Customer Experience Optimization",
      "experience": 3
    },
    {
      "skill": "Google Analytics",
      "experience": 3
    },
    {
      "skill": "Adobe Photoshop",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Effectively manage the aesthetic presentation of the online assortment, including product information, category information, and website merchandising to influence sales and conversion."
    },
    {
      "duty": "Monitor website content and product assortments, ensuring that product information is accurate and up to date."
    },
    {
      "duty": "Conduct thorough checks for online product quality, including images, categorization, pricing, and availability."
    },
    {
      "duty": "Create an elevated website experience by using data-driven insights and digital best practices to activate a seamless customer experience."
    },
    {
      "duty": "Collaborate with the Digital Marketing, Consumer Service, Supply Chain, and Merchandise teams to identify compelling product narratives and ideas for the season."
    },
    {
      "duty": "Research industry best practices to identify, evaluate, and maintain holiday calendars to ensure builds, testing, and launch dates are met."
    },
    {
      "duty": "Collaborate with media planners and the HQ Digital Content team to evaluate commercial messages."
    },
    {
      "duty": "Partner with internal and external IT resources to troubleshoot customer order issues."
    },
    {
      "duty": "Work cross-functionally with the Supply Chain department to drive improvements in their processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Business, Merchandising, User Experience, or Statistics"
    }
  ]
}