{
  "meta": [
    {
      "job_title": "Maintenance Supervisor",
      "job_category": "Maintenance",
      "job_class": "Supervisor",
      "sector": "Facilities Management",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Bilingual (English/Spanish)",
      "experience": 5
    },
    {
      "skill": "Facilities Management",
      "experience": 5
    },
    {
      "skill": "Maintenance and Repair",
      "experience": 3
    },
    {
      "skill": "Safety Inspections",
      "experience": 3
    },
    {
      "skill": "Training and Supervision",
      "experience": 4
    },
    {
      "skill": "Inventory Management",
      "experience": 4
    },
    {
      "skill": "Plumbing",
      "experience": 3
    },
    {
      "skill": "HVAC",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure buildings and equipment are maintained in a safe, clean, and orderly condition."
    },
    {
      "duty": "Run on-site maintenance program including the painting program (painting/patching/taping) as well as Air Conditioning and plumbing repairs."
    },
    {
      "duty": "Coordinate and monitor work activities, write reports, perform quality, service, and safety inspections."
    },
    {
      "duty": "Track supplies inventory, equipment inventory, maintenance, and repair. Train, supervise, and instruct employees in tasks, safety, policies, and procedures."
    },
    {
      "duty": "Carry out supervisor responsibilities in accordance with company policies and applicable laws. Provide directions and assign tasks to various staff."
    },
    {
      "duty": "Monitor employees for proper use of personal protective equipment, supplies, and equipment. Report employee personnel issues, concerns, and recognition to manager."
    },
    {
      "duty": "Correct at-risk behavior immediately, then report to the manager immediately. Provide recommendations for corrective action on areas that need improvement."
    }
  ],
  "subjective_elements": [
    {
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Six months to 1-year related experience and/or training; High School diploma or general education degree (GED); or equivalent combination of education and experience"
    }
  ]
}