{
  "meta": [
    {
      "job_title": "Program Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Nonprofit",
      "salary": 68000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Team Building",
      "experience": 5
    },
    {
      "skill": "Resource Management",
      "experience": 5
    },
    {
      "skill": "Volunteer Management",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Community Partnership Development",
      "experience": 5
    },
    {
      "skill": "Public Relations",
      "experience": 5
    },
    {
      "skill": "Administration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and administer all programs and activities offered at the Club, including Education & Career Development, Character & Leadership Development, Sports, Fitness & Recreation, The Arts, and Health & Life Skills."
    },
    {
      "duty": "Provide effective leadership and direction to staff and Club Members, complying with organization policies and focusing on deepening Club IMPACT."
    },
    {
      "duty": "Develop and manage world-class Club experience using the Youth Development Strategy, and implementing programs to meet the organization’s mission."
    },
    {
      "duty": "Recruit and retain members, promote the Club, and maintain recommended membership levels with a focus on safety and discipline."
    },
    {
      "duty": "Manage, recruit, hire, train, and supervise all Clubhouse staff while building a positive and dynamic relationship between staff and Club members."
    },
    {
      "duty": "Implement Volunteer Program for program support, manage financial resources, and ensure up-to-date technology and information management systems."
    },
    {
      "duty": "Act as the primary point of contact between parents and local schools, maintain a safe and clean Club facility, and support the development of strategic alliances and collaborative partnerships."
    },
    {
      "duty": "Complete all administrative tasks on time and oversee the daily operation of the Child Nutrition Program if necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Four-year degree in related field from an accredited college or university preferred, with a minimum of three years' work experience in a similar organization."
    }
  ]
}