{
  "meta": [
    {
      "job_title": "Graphic & Web Designer",
      "job_category": "Design",
      "job_class": "Designer",
      "sector": "Creative",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Graphic Design",
      "experience": 5
    },
    {
      "skill": "Illustration",
      "experience": 5
    },
    {
      "skill": "Multimedia Design",
      "experience": 5
    },
    {
      "skill": "Brand Identity",
      "experience": 5
    },
    {
      "skill": "Photography and Image Editing",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Adobe Creative Suite",
      "experience": 5
    },
    {
      "skill": "UX/UI Design",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Creativity",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop visually stunning graphics, illustrations, and layouts for digital and print media, including social media content, website assets, email marketing campaigns, presentations, brochures, posters, and more."
    },
    {
      "duty": "Maintain a consistent and cohesive brand identity across all materials, ensuring brand guidelines are followed while finding innovative ways to push creative boundaries."
    },
    {
      "duty": "Design engaging multimedia content, including videos, animations, and interactive elements that capture and retain the audience's attention."
    },
    {
      "duty": "Bring ideas to life through original illustrations that complement and enhance various design projects."
    },
    {
      "duty": "Source and edit high-quality images to enrich visual content and support storytelling."
    },
    {
      "duty": "Collaborate with cross-functional teams, including marketing, product development, and sales, to understand project requirements and deliver design solutions that meet objectives."
    },
    {
      "duty": "Participate in brainstorming sessions, offering innovative ideas and contributing to the continuous evolution of our creative processes."
    },
    {
      "duty": "Manage multiple design projects simultaneously, ensuring timely delivery and meeting deadlines without compromising quality."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Graphic Design, Fine Arts, or a related field"
    }
  ]
}