{
  "meta": [
    {
      "job_title": "Client Service Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide timely and efficient completion of client transactions while maintaining accurate records and thorough proper handling of all monies assigned."
    },
    {
      "duty": "Deliver superior quality service, identifying and understanding the client’s financial needs."
    },
    {
      "duty": "Cross-trained to support sales and service activities, with a particular focus on assisting with outbound calling and supporting Integrated Relationship Management (IRM) activities."
    },
    {
      "duty": "Educate clients on digital, self-service solutions including ATMs, Online and Mobile banking to make banking easier and enhance their service experience."
    },
    {
      "duty": "Support team sales process by participating in client outreach through outbound calls, checking for client offers, and identifying client needs or opportunities by fulfilling the need or referring the client to the appropriate branch team members or specialist."
    },
    {
      "duty": "Serve as secondary contact for new account openings and problem resolution, cross-selling applicable products and services to clients and prospects. Handles proportionate volume of work based on branch demands."
    }
  ],
  "skills": [
    {
      "skill": "Client Relationship Building",
      "experience": 2
    },
    {
      "skill": "Sales Experience",
      "experience": 0.5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 2
    },
    {
      "skill": "Digital Banking Knowledge",
      "experience": 0.5
    },
    {
      "skill": "Cross-Selling",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 50,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent education"
    }
  ]
}