{
  "meta": [
    {
      "job_title": "Sales Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 20000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Retail",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Pet Care",
      "experience": 2
    },
    {
      "skill": "Merchandising",
      "experience": 2
    },
    {
      "skill": "Health and Wellness",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Teamwork",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide a great experience by engaging with guests utilizing your acquired skills and training."
    },
    {
      "duty": "Assist guests in the proper selection of merchandise in accordance with their identified needs."
    },
    {
      "duty": "Demonstrate a high level of interest in the welfare, health, and proper handling of all animals."
    },
    {
      "duty": "Process transactions in a way that creates a great experience for each guest."
    },
    {
      "duty": "Generate future business through a deep understand of the guests and their pet/s."
    },
    {
      "duty": "Perform related duties in support of the Pet Care Center attaining its assigned sales goals."
    },
    {
      "duty": "Ensure merchandise is stocked, priced, and displayed to create a great presentation for our guests."
    },
    {
      "duty": "Completes and applies training programs to maintain a high level of expertise of their role."
    },
    {
      "duty": "Adhere to established operational guidelines, policies, and procedures."
    },
    {
      "duty": "Promote a positive culture of teamwork, inclusion, and collaboration."
    },
    {
      "duty": "Evaluate guest inquiries and as needed refers to the Leader on Duty."
    },
    {
      "duty": "Utilize selling behaviors within our Pet Care Locations."
    },
    {
      "duty": "Contribute to a safe environment through maintaining safety protocols."
    },
    {
      "duty": "Be a part of a collaborative culture centered around solving for the health and wellness needs of pets."
    },
    {
      "duty": "Engage in your career by participating in developmental programs to support your continued growth throughout your career."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": []
}