{
  "meta": [
    {
      "job_title": "Territory/Account Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Territory Management",
      "experience": 5
    },
    {
      "skill": "Retail Distribution",
      "experience": 5
    },
    {
      "skill": "Promotional Planning",
      "experience": 5
    },
    {
      "skill": "Key Account Planning",
      "experience": 5
    },
    {
      "skill": "Demand Planning",
      "experience": 5
    },
    {
      "skill": "Event Management",
      "experience": 5
    },
    {
      "skill": "Field Reporting",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Developing the Sales Relationship with the assigned account base, locating new distribution opportunities, and strategically executing the Sales and Service Cycle accordingly."
    },
    {
      "duty": "Planning, setting up, expanding, and maintaining product assortment in retail distribution."
    },
    {
      "duty": "Merchandising, retail and digital asset delivery, and implementation."
    },
    {
      "duty": "Promotional and Event planning, pre-planning, scheduling, and budgeting."
    },
    {
      "duty": "Retail in-person and digital training, spiff, and loyalty program execution."
    },
    {
      "duty": "Forecasting and demand planning, including identifying and communicating issues that lead to assortment retractions and additions."
    },
    {
      "duty": "Gathering field call intel and communicating retail landscape, trends, and competitive intel. Providing product development counsel and identifying market opportunities."
    },
    {
      "duty": "Participating in shooting sport trade shows, consumer events, regional shooting events, and regional retail events."
    },
    {
      "duty": "Building, maintaining, and executing a comprehensive territory plan, setting clear and measurable business goals, and identifying account challenges and proposing relevant solutions."
    },
    {
      "duty": "Assisting internal A/R to ensure timely payment for accounts and identifying, growing, maximizing, and maintaining quality stocking dealer accounts for repeat business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree strongly preferred. In lieu of degree, 10+ years of relevant experience may suffice."
    }
  ]
}