{
  "meta": [
    {
      "job_title": "Lead",
      "job_category": "Retail",
      "job_class": "Leadership",
      "sector": "Sales",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supports building and hiring a strong team by observing in-store interviews and department tours."
    },
    {
      "duty": "Builds a people-first culture by connecting with every teammate in the store to build mutual trust, respect, and contribute to the strong store recognition culture."
    },
    {
      "duty": "Plans, organizes, controls 30-days out with the guidance of Assistant Store Manager; including building an effective approach and align on necessary workforce to execute daily assignments, game plans, projects, or store events."
    },
    {
      "duty": "Strategically leverages teammates to ensure brand standards are met, programs and processes are executed daily, and tasks are delegated based on their priority level."
    },
    {
      "duty": "Upholds company merchandising and presentation standards by following established floor sets, signage requirements, price changes, inventory presentation and replenishment standards, etc."
    },
    {
      "duty": "Assists the store leadership team with general supervision in the store in accordance with Company policies and procedures, where applicable."
    },
    {
      "duty": "Assists with training teammates on company procedures and programs; this includes onboarding new teammates and cross-training current teammates."
    },
    {
      "duty": "Prioritizes coaching and developing oneself and others; provides hands-on coaching and teaches the \nwhy\n behind tasks, plans, and processes (e.g., NSPP, Scorecards, LP, etc.)"
    },
    {
      "duty": "Leads by example to support the vision of the organization and store by helping teammates understand how their responsibilities directly align to the common purpose, organizational goals, and delivering a hassle-free shopping experience."
    },
    {
      "duty": "Creates an inclusive store environment where everyone (teammates & customers) feels welcome and safe and is treated with respect."
    },
    {
      "duty": "Adhere to established policies and procedures related to safety, loss prevention and standard operating procedures. Maintains confidentiality of all Company information."
    },
    {
      "duty": "Takes an all-hands-on-deck approach to support the team across the store."
    },
    {
      "duty": "Performs other tasks as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma/GED required. Some college or degree is a plus."
    }
  ]
}