{
  "meta": [
    {
      "job_title": "Manufacturing Engineer Manager",
      "job_category": "Manufacturing",
      "job_class": "Manager",
      "sector": "Aerospace",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Manufacturing Operations",
      "experience": 10
    },
    {
      "skill": "Lean Principles",
      "experience": 10
    },
    {
      "skill": "Project Leadership",
      "experience": 10
    },
    {
      "skill": "Mechanical Engineering",
      "experience": 7
    },
    {
      "skill": "Composite Fabrications",
      "experience": 2
    },
    {
      "skill": "Supervisory Experience",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and implement all manufacturing technical requirements"
    },
    {
      "duty": "Review and approve Engineering designs with Manufacturing Engineers to ensure product manufacturability"
    },
    {
      "duty": "Direct and supports Manufacturing Engineers on all make or buy decisions on production products as well as tooling"
    },
    {
      "duty": "Support Manufacturing Engineers in method of planning on critical areas"
    },
    {
      "duty": "Support Operations Manager on all technical equipment selection, maintenance, and repair"
    },
    {
      "duty": "Represent Company with customers and vendors in problem-solving meetings"
    },
    {
      "duty": "Establish and present a Capital Program for new equipment"
    },
    {
      "duty": "Review and process all NCMR’s, MRO’s, and returned products for rework methods"
    },
    {
      "duty": "Advise and support Engineering and Quality in material review dispositions on rework feasibility, write all rework method planning to support decisions"
    },
    {
      "duty": "Provide technical assistance to offshore manufacturing facilities"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. Degree in Engineering, preferably Mechanical Engineering or Industrial Systems/Manufacturing Engineering. 7-10 years of experience in a manufacturing operations environment, 2 years experience as a Manufacturing Engineer in a related manufacturing environment with Composite fabrications experience; supervisory experience preferred. Demonstrated expertise in implementation of lean principles and improvements. Strong project leadership experience managing productivity pipelines to illustrate and improve overall plant efficiency."
    }
  ]
}