{
  "meta": [
    {
      "job_title": "Senior Contracts Manager",
      "job_category": "Contracts",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 135000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Successfully manage moderate to highly complex Supply Chain contracting activities and the associated relationships to ensure that goods and services are delivered to the customer at the right time, to the right place, and at the right cost amount while optimizing total costs under minimal supervision."
    },
    {
      "duty": "Develop, negotiate, implement, maintain, support, and enhance contractual relationships between Supply Chain internal stakeholders and external suppliers."
    },
    {
      "duty": "Execute and support Supply Chain and TVA policies and procedures to ensure effective compliance throughout the enterprise."
    },
    {
      "duty": "Implement various Supply Chain program/project and/or initiative deliverables to ensure the continued improvement of Supply Chain overall."
    },
    {
      "duty": "Foster relationships with suppliers and customers to encourage diversity, continuous improvements, and product/service offerings to accomplish cost-effective supply chain objectives."
    },
    {
      "duty": "Identify the most favorable contracting strategies to meet customer needs, including the execution of contracts and maintaining positive relationships with an emphasis on total cost reduction and delivery of quality services."
    },
    {
      "duty": "Assist business unit partners as a Sourcing liaison in work planning, specification development, and other relevant partner activities."
    },
    {
      "duty": "Provide mentoring to facilitate knowledge transfer and guidance to non-senior Contract Managers and general mentorship to other roles as needed."
    },
    {
      "duty": "Other temporary assignments to support business needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a business-related field of study, or equivalent related education, training & experience. MBA or similar degree is also desirable."
    },
    {
      "credential": "CPM, CPSM, PMP, Lean Six Sigma or other related certifications preferred."
    }
  ]
}