{
  "meta": [
    {
      "job_title": "Financial Center Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 76000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Center Management",
      "experience": 2
    },
    {
      "skill": "Compliance",
      "experience": 2
    },
    {
      "skill": "Banking Experience",
      "experience": 4
    },
    {
      "skill": "Decision Making",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Leadership",
      "experience": 4
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 4
    },
    {
      "skill": "Collaboration",
      "experience": 4
    },
    {
      "skill": "Client Relationship Management",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Team Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee Financial Center Operations such as client service, cash flow, teller transaction processing, and POD scanning."
    },
    {
      "duty": "Maintain the Financial Center physical location and respond to facilities issues."
    },
    {
      "duty": "Manage Teller unit and other Financial Center staff, including hiring, terminations, performance reviews/management, time and attendance, scheduling, workflow management, and employee relations."
    },
    {
      "duty": "Review daily reports (new clients, overdrafts, general ledgers, etc.) and may proof teller, vault, and overall financial center on a daily basis."
    },
    {
      "duty": "Perform reviews and audits, prepare and submit monthly & quarterly reports in accordance with policy and procedure."
    },
    {
      "duty": "Assist PCGs/others with understanding bank policies and procedures, providing direction on transactions, etc."
    },
    {
      "duty": "Work with Group Directors to create/maintain an efficient business space and may assist with wires and other administrative tasks."
    },
    {
      "duty": "Provide training for new hires including on all product enhancements, and ensure proper procedures are adhered to in all areas of business in the Financial Center."
    },
    {
      "duty": "Maintain adequate supplies needed by tellers and bankers including cash, counter checks, official checks, money orders, cash, starter kits, stamps, etc."
    },
    {
      "duty": "Compile financial data by organization and government regulations; perform internal reviews of activity via reports and respond accordingly based on findings."
    },
    {
      "duty": "Complete ongoing training as required - Compliance, HR, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or general education degree (GED)"
    },
    {
      "credential": "Minimum two years management experience in a financial center and compliance"
    },
    {
      "credential": "Four years banking experience (commercial banking preferred)"
    },
    {
      "credential": "Knowledge of financial service products and experience opening business accounts"
    }
  ]
}