{
  "meta": [
    {
      "job_title": "Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Retail Business Knowledge",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Trade Show Participation",
      "experience": 5
    },
    {
      "skill": "Bilingual (Spanish)",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and nurture relationships with current and potential customers within the assigned sales territory."
    },
    {
      "duty": "Provide product knowledge and training to store personnel, ensuring they can effectively present products and negotiate with consumers."
    },
    {
      "duty": "Conduct market research to understand product positioning, competitive landscape, and retail business financials for effective consulting with dealers."
    },
    {
      "duty": "Manage displays, samples, and selling tools to ensure customer availability."
    },
    {
      "duty": "Generate sales contracts, quote prices, discuss credit terms, and estimate delivery dates for customer orders."
    },
    {
      "duty": "Review and analyze sales reports to identify sales potential with current and potential customers."
    },
    {
      "duty": "Utilize marketing tools such as catalogs, brochures, and vendor collateral to expand reach in the territory."
    },
    {
      "duty": "Investigate and resolve customer claims/problems related to deliveries, returns, and credits."
    },
    {
      "duty": "Attend trade shows and travel locally, nationally, and internationally as required."
    },
    {
      "duty": "Perform additional duties as required and requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Sales, Business, or related field"
    }
  ]
}