{
  "meta": [
    {
      "job_title": "Document Control Specialist",
      "job_category": "Administration",
      "job_class": "Specialist",
      "sector": "Construction",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Document Control",
      "experience": 5
    },
    {
      "skill": "Data Gathering",
      "experience": 5
    },
    {
      "skill": "Proofreading",
      "experience": 5
    },
    {
      "skill": "Office Administration",
      "experience": 5
    },
    {
      "skill": "Team Player",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Gather statistics and general data; review and combine this information into established reports for use internally."
    },
    {
      "duty": "May be responsible for verifying data gathered, such as matching supplier invoices against file copies."
    },
    {
      "duty": "Receive direction from immediate supervisor in completing non-routine assignments."
    },
    {
      "duty": "Scan, fax and bind documents, reports, and proposals as required."
    },
    {
      "duty": "May develop new or revise existing reports and SharePoint presentations, as directed."
    },
    {
      "duty": "Distribute reports as directed by immediate supervisor."
    },
    {
      "duty": "Prepare general correspondence and maintain general files."
    },
    {
      "duty": "Maintain a project-wide Calendar and schedule meetings as needed."
    },
    {
      "duty": "Answer telephone, take and relay messages, screen callers and direct calls accordingly."
    },
    {
      "duty": "Maintain an organized work space by keeping documents and supplies properly stored."
    },
    {
      "duty": "May establish and maintain records of equipment, including a log of equipment service dates. May initiate requests for service."
    },
    {
      "duty": "Maintain an organized work space by keeping documents and supplies properly stored."
    },
    {
      "duty": "Perform other responsibilities associated with this position as may be appropriate."
    },
    {
      "duty": "May represent immediate supervisor at project-related or other meetings as directed."
    },
    {
      "duty": "Must be a proactive team player who shares routine office duties with members of the Office Administrative team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 30,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma. Certifications for document control professionals highly desirable. Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}