{
  "meta": [
    {
      "job_title": "Consumer Safety Inspector",
      "job_category": "Quality Control",
      "job_class": "Inspector",
      "sector": "Quality Control",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure that regulated establishments produce a safe product by executing appropriate inspection methods, determining non-compliance with regulatory requirements, documenting noncompliance and initiating enforcement action, where warranted."
    },
    {
      "duty": "Verify that meat and poultry slaughter and/or processing establishment's Sanitation Standard Operating Procedures (SSOP) and Hazard Analysis and Critical Control Point (HACCP) Plans meet regulatory requirements."
    },
    {
      "duty": "Execute Sanitation Standard Operating Procedures (SSOP) and Hazard Analysis and Critical Control Point (HACCP) Plans effectively to prevent unsanitary conditions and adulteration of product."
    },
    {
      "duty": "Review records, observe plant operations and conduct hands-on verification to ensure compliance with regulatory requirements and prepare detailed documentation (Non-Compliance Records) of non-compliance with regulatory requirements."
    },
    {
      "duty": "Determine when regulatory control action is necessary. You will assess whether the plant's corrective or preventative actions are acceptable and effective, if there are trends in non-compliance, or if enforcement action is warranted."
    },
    {
      "duty": "Conduct regulatory oversight activities inside plants in matters relating to other consumer protections (e.g., economic adulteration and misbranding)."
    },
    {
      "duty": "Have contact with plant managers, owners and others to explain legal and regulatory requirements, discuss operation of the plant's SSOP, HACCP plan and other food safety programs."
    },
    {
      "duty": "Communicate and defend determinations on non-compliance issues and discuss plans for addressing non-compliance."
    },
    {
      "duty": "Work with a variety of individuals to resolve problems, clarify differences of interpretation concerning HACCP and other food safety or consumer protection requirements."
    },
    {
      "duty": "Assure that products approved for import are in full compliance with all applicable Federal regulations governing the importation of meat and poultry products."
    },
    {
      "duty": "Authorize entry of all meat or poultry products considered to comply with Federal regulations or refuse entry of any products which violate any of the requirements for admission into this country."
    },
    {
      "duty": "Coordinate with other Federal agencies (e.g., the Animal and Plant Health Inspection Service (APHIS) and U.S. Customs and Border Protection (CBP) on such matters as animal health restrictions and refused entry lots."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Agricultural, Biological, Physical Sciences, Food Technology, Epidemiology, Home Economics, Pharmacy, Engineering, or Nutrition. Specialized government or military training may be creditable if it is related directly to this position."
    }
  ]
}