{
  "meta": [
    {
      "job_title": "Event Coordinator & Office Administrator",
      "job_category": "Administration",
      "job_class": "Coordinator",
      "sector": "Administration",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Plan and execute high volume onsite events, managing vendors, and resolving challenges that arise."
    },
    {
      "duty": "Assist and liaise with board members, volunteers, and external organizations."
    },
    {
      "duty": "Coordinate monthly board meetings, draft minutes, and ensure proper audiovisual setup."
    },
    {
      "duty": "Maintain and confirm accuracy in all materials and information requested by the Board, including logs, financials, dates, etc."
    },
    {
      "duty": "Maintain accounts receivables and payables, membership dues collections, and vendor payments."
    },
    {
      "duty": "Connect and communicate with international entities to keep the Board and members informed of events and policies."
    },
    {
      "duty": "Maintain a working knowledge of company bylaws and inform the Board of potential issues and violations."
    },
    {
      "duty": "Travel to regional and national events throughout the year as requested by the Board Chairs."
    },
    {
      "duty": "Coordinate and participate in local and regional events, meetings, and receptions."
    },
    {
      "duty": "Work in the office two days per week, with occasional air and car travel."
    },
    {
      "duty": "Coordinate food, refreshments, and venue arrangements for board meetings and events."
    },
    {
      "duty": "Support the board in administrative tasks, event planning, and member communications."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 160,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Administration, Event Management, Business, or related field (Master's preferred)"
    }
  ]
}