{
  "meta": [
    {
      "job_title": "SIU Investigator",
      "job_category": "Insurance",
      "job_class": "Investigator",
      "sector": "Compliance and Investigations",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Complex Insurance Investigations",
      "experience": 5
    },
    {
      "skill": "Fraud Detection",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Investigative Reporting",
      "experience": 5
    },
    {
      "skill": "Compliance Audits",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Travel",
      "experience": 5
    },
    {
      "skill": "Report Writing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Independently conduct expert investigations, handle complex fraud referrals and complete fraud reviews."
    },
    {
      "duty": "Develop and document information on any investigation, file review, audit, training assignment, or other project."
    },
    {
      "duty": "Have working knowledge and understanding of anti-fraud laws, insurance regulations, and compliance rules and standards."
    },
    {
      "duty": "Outline a game plan for assignment objectives and appropriately document and communicate to clients and the SIU Supervisor."
    },
    {
      "duty": "Offer expert advice to clients regarding SIU investigations."
    },
    {
      "duty": "Conduct CEU level courses and Fraud Awareness training for clients and others."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Must possess one or more of the following: A Bachelor’s Degree in criminal justice or related field and 4 years demonstrated experience conducting complex insurance investigations or adjusting complex claims. Or a minimum of two (5) years of experience in law enforcement, military law enforcement, or government/private investigations. 5 years SIU experience in the areas of General Liability, Auto Liability, PIP, Homeowner, Small Commercial, and Workers’ Compensation areas (preferred)."
    }
  ]
}