{
  "meta": [
    {
      "job_title": "College Access and Success Associate",
      "job_category": "Operations",
      "job_class": "Associate",
      "sector": "Education",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Datakeeping",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Group Facilitation",
      "experience": 5
    },
    {
      "skill": "Experiential Learning",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Google Suite",
      "experience": 5
    },
    {
      "skill": "Salesforce",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and facilitate year round programming, including weekend events and after-school workshops."
    },
    {
      "duty": "Manage and support external partners that facilitate college access programming."
    },
    {
      "duty": "Support students through the undergraduate/graduate school application process."
    },
    {
      "duty": "Expose, engage, and support students through the financial aid process including FAFSA, CA Dream Act and CSS Profile."
    },
    {
      "duty": "Maintain database to track student participation, contact information, demographics, and outcome measures."
    },
    {
      "duty": "Build and maintain relationships with youth that offer high support and mutual accountability."
    },
    {
      "duty": "Provide coaching and advising sessions to each participant, ensuring they have an actionable plan in place for enrolling into higher education."
    },
    {
      "duty": "Work in partnership with the program team to support the overall vision and mission of the program."
    },
    {
      "duty": "Collaborate with C5 leadership and staff, and maintain relationships with partner organizations."
    },
    {
      "duty": "Transition students to postsecondary success programs to support continued persistence in college and career, as needed."
    },
    {
      "duty": "Represent C5LA at events, workshops, seminars and conferences."
    },
    {
      "duty": "Support staff in assigned project based work."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in any field (Experience in college access, persistence and success is a key requirement)."
    }
  ]
}