{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 4
    },
    {
      "skill": "Sales Management",
      "experience": 4
    },
    {
      "skill": "Performance Management",
      "experience": 4
    },
    {
      "skill": "Retail Operations",
      "experience": 5
    },
    {
      "skill": "Coaching and Training",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build and retain a high-performing team, create a consistent environment of world-class customer service, and exceed sales plan."
    },
    {
      "duty": "Lead and model a customer-first culture across all roles, providing ongoing coaching and training to enhance individual selling skills and behaviors."
    },
    {
      "duty": "Monitor inventory management, special orders, receiving processes, layaway, mark out of stock, repairs, and ensure first-quality standards for all merchandise."
    },
    {
      "duty": "Communicate daily sales goals to all team members, monitor individual team member performance, and develop action plans for improvement through weekly performance discussions using customer reviews and mystery shops."
    },
    {
      "duty": "Ensure the store is always staffed, achieve all staffing goals, and fill open positions within 30 days."
    },
    {
      "duty": "Responsible for the store payroll, ensuring it does not exceed the monthly budget, and leading the store to achieve Total Monthly Income (TMI) Goals consistently."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or degree."
    },
    {
      "credential": "Four years prior retail management experience in an apparel or specialty store environment."
    },
    {
      "credential": "Prior experience with a computerized POS system."
    }
  ]
}