{
  "meta": [
    {
      "job_title": "Program Safety Manager",
      "job_category": "Safety Management",
      "job_class": "Manager",
      "sector": "Aviation",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Aviation Safety",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Safety Management System (SMS)",
      "experience": 5
    },
    {
      "skill": "Hazard Identification",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Emergency Response Planning",
      "experience": 5
    },
    {
      "skill": "Training Program Development",
      "experience": 5
    },
    {
      "skill": "Occupational Safety Programs",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, support and improve Airport Authority’s SMS program, including development and implementation of construction safety oversight program."
    },
    {
      "duty": "Advise and support decision making and implementation of OCIP and CCIP programs."
    },
    {
      "duty": "Ensure compliance with applicable rules, regulations, organizational standards, safety, security, in all company operations."
    },
    {
      "duty": "Assist in the continuous improvement of the FEAM’s SMS, hazard identification, and safety risk assessment processes and procedures."
    },
    {
      "duty": "Develop and implement appropriate occupational safety programs to correct and prevent unsafe working conditions and reduce the frequency of work-related incidents and injuries."
    },
    {
      "duty": "Model and promote an organizational culture that fosters safety practices through effective leadership."
    },
    {
      "duty": "Investigate safety-related events such as aircraft incidents/near misses, employee injuries, and ramp safety events."
    },
    {
      "duty": "Identify and evaluates root cause(s) of identified hazards, near misses, incidents/accidents, auditing findings, and operational risks."
    },
    {
      "duty": "Assure the mitigation or elimination of identified hazards and risks."
    },
    {
      "duty": "Coordinate change management activities, risk assessments, and safety analysis."
    },
    {
      "duty": "Track trends and manages pertinent safety data using database software."
    },
    {
      "duty": "Monitor and report to management on all activities that may have an impact on safety."
    },
    {
      "duty": "Perform Management Review presentations on program safety performance."
    },
    {
      "duty": "Administer safety-related audits and inspections."
    },
    {
      "duty": "Monitor and evaluate the results of corrective actions."
    },
    {
      "duty": "Ensure that risk assessments are conducted when applicable."
    },
    {
      "duty": "Manage publication and safety promotion of periodic safety newsletters and briefings."
    },
    {
      "duty": "Develop and update Emergency Response Plans (ERP) across the organization."
    },
    {
      "duty": "Facilitate periodic emergency response drills and exercises."
    },
    {
      "duty": "Responsible for the development/revision of training program materials for safety, security, and emergency response programs."
    },
    {
      "duty": "Provide general safety and SMS training to employees."
    },
    {
      "duty": "Foster positive relationships with operational personnel, senior managers and departmental heads throughout the organization, regulatory authorities, agencies, and service providers outside the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Aviation Safety or related field. Five (5) or more years of experience in aviation safety or an equivalent combination of education and experience. Knowledge of OSHA, EPA regulations, and 14 CFR Part 145 & 121 operations and environment."
    }
  ]
}