{
  "meta": [
    {
      "job_title": "VP, Fuel Markets",
      "job_category": "Sales",
      "job_class": "Vice President",
      "sector": "Sales",
      "salary": 140000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create, oversee, and execute the strategic vision of the Xerxes fuel market department."
    },
    {
      "duty": "Drive profitable growth and change through a balanced focus on customers, people, processes, and market share."
    },
    {
      "duty": "Collaborate with VPs and ELT for annual business plan, price strategies, supply contracts."
    },
    {
      "duty": "Manage expenses, budgets, customer RFPs, AR accounts, disputes."
    },
    {
      "duty": "Analyze key data: inventory, sales, margins, forecasting."
    },
    {
      "duty": "Oversee freight rates, customer communication, collaboration with sales teams."
    },
    {
      "duty": "Manage direct and indirect Sales Managers, set growth-oriented sales plans."
    },
    {
      "duty": "Lead in-person sales meetings, manage Sales Support for customer satisfaction."
    },
    {
      "duty": "Collaborate with water team for Hydrochain product sales."
    },
    {
      "duty": "Establish direct contact with decision makers, drive process enhancements."
    },
    {
      "duty": "Ensure brand reputation through Marketing collaboration, quality collateral, and professional events."
    },
    {
      "duty": "Participate in networking and customer events, monitor market trends."
    },
    {
      "duty": "Identify opportunities for product/service expansion and address potential challenges."
    },
    {
      "duty": "Manage inventory and aging inventory through efficient strategies."
    },
    {
      "duty": "Build relationships with plant managers, provide support as needed."
    },
    {
      "duty": "Collaborate with field service and sales teams to address tank-related issues."
    },
    {
      "duty": "Foster employee development through training, performance assessments, and talent management."
    },
    {
      "duty": "Evaluate organizational competencies, identify gaps, and manage wage and salary administration."
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 11
    },
    {
      "skill": "Relationship Management",
      "experience": 11
    },
    {
      "skill": "Strategic Planning",
      "experience": 11
    },
    {
      "skill": "Business Development",
      "experience": 11
    },
    {
      "skill": "Communication Skills",
      "experience": 11
    },
    {
      "skill": "Leadership",
      "experience": 11
    },
    {
      "skill": "Negotiation",
      "experience": 11
    },
    {
      "skill": "Market Analysis",
      "experience": 11
    },
    {
      "skill": "Problem-Solving",
      "experience": 11
    },
    {
      "skill": "Time Management",
      "experience": 11
    },
    {
      "skill": "New Business Sales",
      "experience": 11
    },
    {
      "skill": "Employee Development",
      "experience": 11
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Marketing, Sales, or a related field (Master's preferred)"
    }
  ]
}