{
  "meta": [
    {
      "job_title": "Regional Sr. EH&S Manager",
      "job_category": "Safety and Environment",
      "job_class": "Senior Manager",
      "sector": "Health and Safety",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "EHS Compliance",
      "experience": 8
    },
    {
      "skill": "Staff Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Audit Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish and lead the strategic direction for all aspects of safety and environmental programs to ensure compliance with all Federal, State, and Local laws and regulations."
    },
    {
      "duty": "Oversee the safety functions across all business units and partner with department leaders to implement strategic safety initiatives."
    },
    {
      "duty": "Develop and oversee the North America Hazardous Waste program, including proper handling and removal."
    },
    {
      "duty": "Manage a team of EHS Managers and/or EHS Specialists to further advance safety culture and alignment across sites."
    },
    {
      "duty": "Act as a key advisor on EH&S matters to stakeholders including operations, human resources, claims, compliance, etc."
    },
    {
      "duty": "Responsible for incident investigation programs company-wide for serious occupational health and safety events."
    },
    {
      "duty": "Ensure timely and accurate reporting of required regulatory submissions."
    },
    {
      "duty": "Travel to ZEISS offices throughout the U.S./Canada."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. in Scientific, Engineering, Safety and Environmental or technical discipline with 8+ years of relevant experience and 5+ years of direct supervision experience. Professional certifications preferred (OHSAS18001, ISO14001, ISO 45001, ISO9001 or similar accredited EHS management systems)."
    }
  ]
}