{
  "meta": [
    {
      "job_title": "Executive Director",
      "job_category": "Non-Profit",
      "job_class": "Director",
      "sector": "Management",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Fundraising",
      "experience": 8
    },
    {
      "skill": "Financial Management",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Administrative Experience",
      "experience": 8
    },
    {
      "skill": "Event Planning",
      "experience": 8
    },
    {
      "skill": "Grant Writing",
      "experience": 8
    },
    {
      "skill": "Marketing",
      "experience": 8
    },
    {
      "skill": "Non-Profit Management",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Community Engagement",
      "experience": 8
    },
    {
      "skill": "Public Relations",
      "experience": 8
    },
    {
      "skill": "Arts Administration",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage all non-choral aspects of the organization, including fundraising, administration, and logistics."
    },
    {
      "duty": "Act as Head of Finance by creating and managing an annual budget and ensuring expenses stay within budget."
    },
    {
      "duty": "Manage corporate, foundation, and individual donor relations, fundraising events, and assisting with annual fundraising appeals."
    },
    {
      "duty": "Manage all communications for the organization, both internally and externally."
    },
    {
      "duty": "Serve as the primary point of contact for the organization for various partners and vendors."
    },
    {
      "duty": "Supervise multiple direct reports and manage all administrative, development, and marketing personnel."
    },
    {
      "duty": "Oversee season production and administrative calendar, negotiate and manage all vendor contracts."
    },
    {
      "duty": "Supervise marketing efforts, create/distribute press releases, act as lead coordinator for all earned media appearances."
    },
    {
      "duty": "Manage office management and daily operations, ticketing, day-of concert volunteers, and all digital content."
    },
    {
      "duty": "Maintain and present all digital content, manage and maintain the Neon CRM database."
    },
    {
      "duty": "Co-report (with the Artistic Director) to the Board of Directors, attend monthly Board meetings."
    },
    {
      "duty": "Negotiate and manage community performance opportunities, ensure fulfillment of strategic plan goals."
    },
    {
      "duty": "Other duties as needed to support the organization's mission and operations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree required. Previous administrative and financial management experience."
    },
    {
      "credential": "Significant Management or administrative experience in a nonprofit organization is preferred."
    },
    {
      "credential": "Previous fundraising experience, including prior successful work directly participating in or managing community funding campaigns."
    },
    {
      "credential": "Strong computer skills, including Google Office Suite and web-based applications."
    },
    {
      "credential": "Driver’s license and/or reliable transportation, ability to drive rental trucks preferred."
    }
  ]
}