{
  "meta": [
    {
      "job_title": "Loss Prevention Specialist",
      "job_category": "Retail",
      "job_class": "Specialist",
      "sector": "Loss Prevention",
      "salary": 23.5,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Loss Prevention",
      "experience": 1
    },
    {
      "skill": "Retail Experience",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Security Management",
      "experience": 1
    },
    {
      "skill": "Risk Management",
      "experience": 1
    },
    {
      "skill": "Team Management",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support sales by welcoming and engaging guests and team members at the front of store and on the sales floor; help guests find the products they are looking for, in-store and online."
    },
    {
      "duty": "Lead a physical security culture for our team members and guests by assessing and maintaining safe and secure standards throughout the store, including exterior property."
    },
    {
      "duty": "Understand and leverage escalation tools for guest issues in order to provide a safe and secure environment for our partners and guests."
    },
    {
      "duty": "Notify leadership and support documentation for all incidents."
    },
    {
      "duty": "Teach, coach and model behaviors of our shoplifting prevention policy."
    },
    {
      "duty": "Understand and appropriately use the video system."
    },
    {
      "duty": "Support merchandise protection and audit execution."
    },
    {
      "duty": "Train Pet Care Center partners on operational shortage focus area opportunities."
    },
    {
      "duty": "Execute shortage action plans set by leadership to minimize shortage in focus areas."
    },
    {
      "duty": "Model and coach safety behaviors while maintaining a clean store for guests and partners."
    },
    {
      "duty": "Provide quality customer service interactions and promote a shopping experience that meets the needs of the guest."
    },
    {
      "duty": "Demonstrate a culture of ethical conduct, safety, and compliance."
    },
    {
      "duty": "Complete and remain current on all applicable training."
    },
    {
      "duty": "Participate in the completion of animal and aquatic life related physical inventory counts."
    },
    {
      "duty": "Performs additional duties and projects as required or assigned with or without regular supervision."
    },
    {
      "duty": "CONTRIBUTE TO A SAFE AND SECURE ENVIRONMENT. You’ll be empowered through our training programs to maintain our safety protocols. Bottom line, the safety of partners, guests and pets is our #1 priority."
    },
    {
      "duty": "BE A PART OF A COLLABORATIVE CULTURE. Being a great teammate is key to creating a culture that is centered around solving for the health and wellness needs of pets."
    },
    {
      "duty": "ENGAGE IN YOUR CAREER: As you develop your skills and knowledge, you will have the opportunity to participate in developmental programs to support your continued growth throughout your career."
    },
    {
      "duty": "Contribute to a safe and secure environment. "
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent"
    },
    {
      "credential": "Completion and maintenance of the Petco Animal Care Certification program"
    }
  ]
}