{
  "meta": [
    {
      "job_title": "Maintenance Manager",
      "job_category": "Maintenance",
      "job_class": "Manager",
      "sector": "Property Management",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure the community maintains an exceptional curb appeal by following The Community Sparkle guidelines which outline keeping the grounds and buildings sanitary and sustained, and amenities properly functional at all times."
    },
    {
      "duty": "Maintain a safe, sparkling, and sanitary community, including, but not limited to the clubhouse, office, model unit, common areas, parking lot, building stairwells and entrances, etc."
    },
    {
      "duty": "Oversee and assist with general community repairs and maintenance responsibilities."
    },
    {
      "duty": "Oversee and assist with ensuring the community is free of trash, debris, and animal waste."
    },
    {
      "duty": "Oversee and assist with ensuring the landscaping is maintained and current with the seasons."
    },
    {
      "duty": "Ensure all apartments meet the Company standard for new guests ahead of move-in."
    },
    {
      "duty": "Respond to emergency's in an appropriate and timely manner in accordance with policies and procedures."
    },
    {
      "duty": "Oversee and assist with annual apartment turnovers as directed, including, but not limited to creating schedules, ordering supplies and furniture, and managing external vendors."
    },
    {
      "duty": "Be a leader of long-term efficiency amongst the facilities team by embracing the latest technology implementations that improve systems and processes."
    },
    {
      "duty": "Be a champion of exemplary guest service and teamwork."
    },
    {
      "duty": "Ensure understanding of all Company policies, procedures, and expectations."
    },
    {
      "duty": "Ensure the Guest Experience is being exceeding and satisfaction amongst the community is met."
    },
    {
      "duty": "Collaborate with internal team, especially the General Manager and meet daily to ensure all operational needs are met."
    },
    {
      "duty": "Conduct periodic inspections of vacant apartments."
    },
    {
      "duty": "Participate and attend required continuing education and in-service training sessions."
    },
    {
      "duty": "Ensure the stable and safe operation of the property at all times and ensure compliance with all company policies and procedures, as well as local, state, and federal laws and ordinances."
    },
    {
      "duty": "Produce and/or review all daily, weekly, and monthly reports, inspections and activities associated with the property. Submit required report to Corporate management as requested."
    },
    {
      "duty": "Perform other duties as assigned by supervisor."
    },
    {
      "duty": "Participate In Company University As Required."
    }
  ],
  "skills": [
    {
      "skill": "Grounds Maintenance",
      "experience": 3
    },
    {
      "skill": "Facility Repairs",
      "experience": 3
    },
    {
      "skill": "Emergency Response",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Vendor Management",
      "experience": 3
    },
    {
      "skill": "Technology Implementation",
      "experience": 3
    },
    {
      "skill": "Compliance Management",
      "experience": 3
    },
    {
      "skill": "Report Generation",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED preferred."
    },
    {
      "credential": "Three to five years of previous experience in the same field."
    },
    {
      "credential": "Two years previous experience in Student Housing industry."
    },
    {
      "credential": "Cert Pool Operator"
    },
    {
      "credential": "EPA Certification"
    }
  ]
}