{
  "meta": [
    {
      "job_title": "Product Coordinator",
      "job_category": "Retail",
      "job_class": "Coordinator",
      "sector": "Retail",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Merchandising Management",
      "experience": 7
    },
    {
      "skill": "Retail Operations",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Vendor Management",
      "experience": 7
    },
    {
      "skill": "Tableau",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 7
    },
    {
      "skill": "Microsoft Office",
      "experience": 7
    },
    {
      "skill": "Negotiation",
      "experience": 7
    },
    {
      "skill": "Analytical Skills",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support large scale, fast paced Retail Merchandising & Installation programs simultaneously at different points in the project management life cycle."
    },
    {
      "duty": "Execute standardized and scalable processes related to 3PL installation programs across multiple channel partners."
    },
    {
      "duty": "Support the development of new strategies that accelerate merchandising & install efficiencies with 3pl vendors to elevate levels of execution and deliver on company goals to increase ROI on investment in retail."
    },
    {
      "duty": "Learn extensive product knowledge to understand the why behind merchandising initiatives and programs."
    },
    {
      "duty": "Develop a strong working relationship with the Brand Execution Project Managers and external vendors to ensure excellent support with delivering results that align with the Retail Brand Execution team’s vision and purpose."
    },
    {
      "duty": "Attend weekly project coordination meetings with Project Managers to take comprehensive meeting notes that Brand Execution Team members will utilize."
    },
    {
      "duty": "Review Vendor Installation survey responses to ensure the quality work of vendor partners."
    },
    {
      "duty": "Anticipate potential high-risk issues that could affect project execution, maintaining a heightened awareness of the project status to all stakeholders for needed course correction to deliver desired results."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "An associate degree in business administration, business information technology, or a minimum of six years of related job experience without a degree. Bachelor's degree preferred."
    }
  ]
}