{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Welcome all customers with genuine, and friendly enthusiasm over the phone, virtual chats and in person, communicate clearly and concisely by adapting your style to suit the customers by problem-solving, excellent phone skills and resolving conflict."
    },
    {
      "duty": "Use all systems to manage the customer flow to deliver Five-Star Customer Service experience."
    },
    {
      "duty": "Proactively address customer concerns with confidence. Know when to escalate and partner with the leadership team."
    },
    {
      "duty": "Maintain store-standards to support a flawless shopping experience."
    },
    {
      "duty": "Respond promptly to all customer questions providing product and service information."
    },
    {
      "duty": "Engage in the inventory management procedures by processing orders, receiving, and ensuring first quality standards for all merchandise."
    },
    {
      "duty": "Support all cash wrap behaviors and processes transactions with accuracy to make every customer feel celebrated."
    },
    {
      "duty": "Assist with all sales promotions and visual updates."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Cash Handling",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or an equivalent degree or 1 -2 years prior retail experience in an apparel, service, or specialty store environment."
    }
  ]
}