{
  "meta": [
    {
      "job_title": "Care Manager",
      "job_category": "Social Work",
      "job_class": "Manager",
      "sector": "Social Services",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Care Management",
      "experience": 2
    },
    {
      "skill": "Social Work",
      "experience": 2
    },
    {
      "skill": "Crisis Intervention",
      "experience": 2
    },
    {
      "skill": "Service Coordination",
      "experience": 2
    },
    {
      "skill": "Database Management",
      "experience": 2
    },
    {
      "skill": "Trauma-Informed Care",
      "experience": 2
    },
    {
      "skill": "Elderly Care",
      "experience": 2
    },
    {
      "skill": "Jewish Culture",
      "experience": 2
    },
    {
      "skill": "Community Services",
      "experience": 2
    },
    {
      "skill": "Client Advocacy",
      "experience": 2
    },
    {
      "skill": "Documentation",
      "experience": 2
    },
    {
      "skill": "Quality Assurance",
      "experience": 2
    },
    {
      "skill": "Language Skills",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate care, provide crisis intervention, short-term and long-term support, and service coordination for Holocaust survivors."
    },
    {
      "duty": "Enter and access detailed information in database tracking systems."
    },
    {
      "duty": "Implement socialization programs and work on various projects for Holocaust survivors funded by grants."
    },
    {
      "duty": "Meet with clients virtually, at the office, and/or in the field to coordinate appropriate services and provide ongoing support."
    },
    {
      "duty": "Provide culturally and linguistically appropriate support using integrated services, including health & mental health navigation, direct financial assistance, food, and transportation to vulnerable aging Holocaust survivors."
    },
    {
      "duty": "Plan and coordinate social events, assess each client, determine best fit for client within program eligibility requirements, provide on-going care management, attend program-related meetings, and maintain documentation and client records."
    },
    {
      "duty": "Maintain confidentiality and quality in all services with and for clients, provide comprehensive assessments of each client, respond to requests for information, and complete quality assurance measures."
    },
    {
      "duty": "Ensure client records are complete, maintain client confidentiality, and save client thank you notes or emails for reporting purposes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "BSW or Bachelor’s degree in gerontology or human services field, MSW or Master's preferred."
    }
  ]
}