{
  "meta": [
    {
      "job_title": "Content Writer/Editor",
      "job_category": "Creative",
      "job_class": "Specialist",
      "sector": "Marketing",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Editorial Skills",
      "experience": 5
    },
    {
      "skill": "Storytelling",
      "experience": 5
    },
    {
      "skill": "Journalistic Writing",
      "experience": 5
    },
    {
      "skill": "Content Tailoring",
      "experience": 5
    },
    {
      "skill": "SEO Best Practices",
      "experience": 5
    },
    {
      "skill": "Digital Content Development",
      "experience": 5
    },
    {
      "skill": "Financial Services Knowledge",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Produce engaging written content tailored to a high-net worth audience on topics including macroeconomics, capital markets, investing strategies, wealth planning, banking and lending, ensuring content adheres to control, audit, legal and compliance requirements."
    },
    {
      "duty": "Interview subject matter experts, attend conferences and investment calls/webcasts; translate into clear, concise strategic content, short-form and occasional long-form articles, paid media campaigns, etc."
    },
    {
      "duty": "Enhance the effectiveness of initial drafts from subject matter expert(s), with them. This could require editing, a major rewrite, restructuring, suggested chart refinements and more."
    },
    {
      "duty": "Adapt messaging by channel - digital (web and email), social, video, infographics. Integrate search engine optimization."
    },
    {
      "duty": "Adapt previously written content for distribution to different client segments or regional audiences."
    },
    {
      "duty": "Provide and receive reviews from writing team colleagues."
    },
    {
      "duty": "Become versed in brand standards and customer segments (needs, motivation, challenges, voice) and tailor voice and messaging for audience segments."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in English, Journalism, Communications or other related degree. (Master's preferred)"
    },
    {
      "credential": "At least 5 years of experience as a professional content writer/editor, digital copywriter or journalist"
    },
    {
      "credential": "Strong knowledge of digital content development, including SEO best practices, email marketing and web analytics"
    },
    {
      "credential": "Financial services industry experience preferred but just as crucial: enthusiasm about broadening and deepening your investment knowledge"
    }
  ]
}