{
  "meta": [
    {
      "job_title": "Supply Chain Analyst",
      "job_category": "Supply Chain",
      "job_class": "Analyst",
      "sector": "Logistics/Distribution",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and execute On-Boarding, Collaboration & Compliance activities, including but not limited to: EDI enablement, Scorecard & Chargeback performance reviews, Quarterly collaboration meetings, Collaborative Performance plans and Brand Partner recognition."
    },
    {
      "duty": "Utilize Ulta Beauty and external systems to troubleshoot business and compliance issues including data extracts from systems and creating ad hoc reports for analysis."
    },
    {
      "duty": "Accountable to execute Quarterly Business Review meetings with internal stakeholders and external business partners, assess business opportunities and provide recommendations to complex issues and requests."
    },
    {
      "duty": "Provide end to end Supply Chain support for ULTA owned brands through our Wholesale channel."
    },
    {
      "duty": "Work collaboratively with the IT and DC Operations teams to seek and improve current processes with a strong focus on performance management and continuous improvement."
    },
    {
      "duty": "Collaborate with leaders (Managers, Directors, VPs) cross functionally to influence and drive targeted supply chain improvements."
    },
    {
      "duty": "Lead initiatives associated with new stores at UBC@Target and other potential future growth."
    },
    {
      "duty": "Work with external business partners and represent ULTA Supply Chain to our Wholesale partners."
    },
    {
      "duty": "Work in partnership with external retailers, ULTA DC’s, MP&I and Merchandising teams to implement new Supply Chain processes."
    },
    {
      "duty": "Manage prioritization, exceptions and expedited shipments for our Wholesale channel out of ULTA DC’s."
    },
    {
      "duty": "Support and manage EDI exceptions. Work within external third-party portals to manage ULTAs supplier performance."
    },
    {
      "duty": "Support monthly/quarterly reviews with internal and external stakeholders, when applicable."
    },
    {
      "duty": "Ensure Supply Chain SOPs and Best Practice documents remain current and up to date for multiple areas within the Supply Chain."
    },
    {
      "duty": "Develop internal reporting requirements to manage ULTA’s KPIs and SLAs."
    },
    {
      "duty": "Support and lead internal stakeholder workshops/meetings."
    },
    {
      "duty": "Participate in additional Supply Chain Strategic Initiative projects and support the overall network strategy."
    }
  ],
  "skills": [
    {
      "skill": "SAP",
      "experience": 5
    },
    {
      "skill": "Logistics Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS or BA University degree"
    }
  ]
}