{
  "meta": [
    {
      "job_title": "Facilities Manager",
      "job_category": "Maintenance",
      "job_class": "Manager",
      "sector": "Facilities",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Facilities Planning",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and oversee maintenance and operations team, and manage all maintenance and operations services, repairs, renovations, and remodeling efforts."
    },
    {
      "duty": "Plan, direct, and review improvement efforts at each site, including allocating resources and establishing priorities for maintenance projects."
    },
    {
      "duty": "Consult with various project groups, administrators, and stakeholders to advise and meet maintenance and operation service needs."
    },
    {
      "duty": "Develop organization-wide preventive maintenance program for buildings and associated equipment."
    },
    {
      "duty": "Plan, administer budgets, and ensure expenditure control, as well as maintain a detailed inventory database of tools and equipment."
    },
    {
      "duty": "Establish a safe, hazard-free environment for students, staff, and visitors, and ensure compliance with state and federal laws, regulations, and policies."
    },
    {
      "duty": "Attend workshops, professional development, and ongoing training opportunities to stay current with laws, regulations, and policies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Certified Construction Manager (CCM©) valid certificate by the Construction Management Certificate Institute ORBachelor’s degree in construction management, engineering, business, or related field (Master’s degree preferred)"
    },
    {
      "credential": "Valid California Driver’s License and insured automobile"
    }
  ]
}