{
  "meta": [
    {
      "job_title": "Client-Facing Shopify and WordPress Website Developer & Project Manager",
      "job_category": "Software Development",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Shopify Development",
      "experience": 5
    },
    {
      "skill": "WordPress Development",
      "experience": 5
    },
    {
      "skill": "HTML",
      "experience": 5
    },
    {
      "skill": "CSS",
      "experience": 5
    },
    {
      "skill": "JavaScript",
      "experience": 5
    },
    {
      "skill": "PHP",
      "experience": 5
    },
    {
      "skill": "Responsive Design",
      "experience": 5
    },
    {
      "skill": "E-Commerce Development",
      "experience": 5
    },
    {
      "skill": "SEO Optimization",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and develop visually stunning and user-friendly Shopify and WordPress websites that align with clients' brand identities and business objectives."
    },
    {
      "duty": "Gather website requirements, understand client vision, and provide expert recommendations while maintaining clear communication throughout the development process."
    },
    {
      "duty": "Customize themes, templates, and plugins to meet specific client needs and write clean, efficient, and maintainable code to implement custom functionalities and features."
    },
    {
      "duty": "Develop e-commerce websites with Shopify, including product catalogs, shopping carts, secure payment gateways, and inventory management systems."
    },
    {
      "duty": "Ensure websites are optimized for various devices and screen sizes, delivering consistent functionality and aesthetics across desktop, tablet, and mobile platforms."
    },
    {
      "duty": "Implement best practices to optimize website performance, loading speed, and SEO to enhance user experience and search engine rankings."
    },
    {
      "duty": "Conduct thorough testing and debugging of websites to ensure a seamless and error-free user experience, along with providing ongoing maintenance, updates, and technical support."
    },
    {
      "duty": "Collaborate with design teams, content creators, and other developers to ensure cohesive branding and seamless integration of design elements and functionalities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Web Development, or a related field and/or 3-5 years minimum experience."
    }
  ]
}