{
  "meta": [
    {
      "job_title": "Quality Application Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Automotive",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Collaborate closely with cross-functional teams to set and uphold rigorous quality standards for engine components and systems."
    },
    {
      "duty": "Bring extensive experience to the product development process. Provide indispensable insights to design and engineering teams to ensure that quality is woven into every facet of the engine's lifecycle."
    },
    {
      "duty": "Lead the charge in comprehensive testing and validation of engine components. Your expertise will ensure that the engines' performance, durability, and reliability are second to none."
    },
    {
      "duty": "Leverage existing connections within the automotive sector to engage effectively with suppliers. Ensuring the quality of raw materials and components is crucial – your contacts and negotiation skills will be invaluable."
    },
    {
      "duty": "Take on the responsibility of managing key accounts. You'll be the driving force in expanding our business by fostering and nurturing crucial client relationships."
    },
    {
      "duty": "Be the detective behind quality concerns. In the event of issues during development, production, or post-production, your expertise in root cause analysis will be the guiding light in identifying and rectifying problems."
    },
    {
      "duty": "Maintain meticulous documentation of quality processes, test results, and corrective actions. Your attention to detail will play a vital role in compliance and reporting."
    },
    {
      "duty": "Implement your analytical skills to drive continuous improvements. Analyze data, spot trends, and champion enhancements that elevate our engine systems' quality even further."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 60,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "A proven track record within the automotive industry. Understanding of the sector's nuances is the bedrock of your contributions."
    },
    {
      "credential": "Laser focus on engines. Intimate understanding of engine systems and manufacturing processes."
    },
    {
      "credential": "Special skill in crankshaft-related matters would be a significant advantage."
    },
    {
      "credential": "Knack for negotiation. Ability to build strong relationships for mutually beneficial outcomes."
    },
    {
      "credential": "Existing contacts within OEMs will be a powerful asset."
    },
    {
      "credential": "Excellent communication skills, coupled with an adeptness for collaboration."
    }
  ]
}