{
  "meta": [
    {
      "job_title": "Strategy and Operations Growth General Manager",
      "job_category": "Management",
      "job_class": "General Manager",
      "sector": "Sales",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategy",
      "experience": 4
    },
    {
      "skill": "Operations Management",
      "experience": 4
    },
    {
      "skill": "Business Development",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Leadership",
      "experience": 4
    },
    {
      "skill": "Problem-Solving",
      "experience": 4
    },
    {
      "skill": "Communication",
      "experience": 4
    },
    {
      "skill": "Tech Savvy",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Define a clear vision, goals, and strategy to drive growth and achieve targets in the Florida region."
    },
    {
      "duty": "Partner with merchant, consumer, driver ops, product, engineering, and analytics teams to establish goals and build strategic programs, influencing and engaging across the company."
    },
    {
      "duty": "Align and integrate the Florida region’s growth objectives with the firm's business strategy through strategic planning, data analysis, forecasting, and budgeting."
    },
    {
      "duty": "Utilize strong quantitative analysis skills, including SQL, Excel, and data analysis, to derive actionable insights and support decision-making."
    },
    {
      "duty": "Utilize SQL and Excel mastery to conduct data analysis, identify trends, and provide actionable insights to enhance decision-making and drive business results."
    },
    {
      "duty": "Apply problem-solving abilities to tackle challenges by breaking them down and reaching the most detailed solutions."
    },
    {
      "duty": "Embrace a bias for action and conduct scrappy tests to validate hypotheses and drive quick and effective solutions."
    },
    {
      "duty": "Collaborate with Product and Technology teams to identify and implement technology enhancements for better merchant experience and operational efficiency."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Business Administration (MBA)"
    }
  ]
}