{
  "meta": [
    {
      "job_title": "International Tax Specialist",
      "job_category": "Taxation",
      "job_class": "Specialist",
      "sector": "Professional Services",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "International Taxation",
      "experience": 5
    },
    {
      "skill": "US Tax Law Knowledge",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Tax Compliance",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Legislative & Regulatory Monitoring",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and execute Global Information Reporting related advisory and compliance projects."
    },
    {
      "duty": "Consult with and advise internal and external clients on U.S. back-up, nonresident alien, FATCA, and CRS reporting and withholding requirements"
    },
    {
      "duty": "Prepare and/or review tax information returns including IRS Forms 1042, 1042-S, 1099, Foreign Bank Account Reports, FATCA and CRS reports"
    },
    {
      "duty": "Support RSM teams and member firms nationally on GIR related projects and issues"
    },
    {
      "duty": "Be a driving force in the growth and expansion of GIR services throughout the firm"
    },
    {
      "duty": "Establish steps, responsibilities and timelines for GIR projects and compliance efforts"
    },
    {
      "duty": "Conduct heavy research and drafting of tax memorandums, tax protests, and other correspondence regarding tax information reporting and withholding issues"
    },
    {
      "duty": "Lead internal training sessions and client educational workshops on FATCA, CRS, and other information reporting and withholding topics upon request"
    },
    {
      "duty": "Monitor legislative and regulatory developments impacting reporting and withholding requirements and draft thought leadership regarding the impact"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Accounting, - CPA, EA, JD or MST preferred"
    }
  ]
}