{
  "meta": [
    {
      "job_title": "Medical Science Liaison- Oncology",
      "job_category": "Medical Science Liaison",
      "job_class": "Experienced",
      "sector": "Healthcare",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Oncology",
      "experience": 1
    },
    {
      "skill": "KOL Engagement",
      "experience": 3
    },
    {
      "skill": "Scientific Expertise",
      "experience": 3
    },
    {
      "skill": "Clinical Education",
      "experience": 3
    },
    {
      "skill": "Cross-functional Collaboration",
      "experience": 3
    },
    {
      "skill": "Strategic Insights",
      "experience": 3
    },
    {
      "skill": "Scientific Support",
      "experience": 3
    },
    {
      "skill": "Clinical Data",
      "experience": 3
    },
    {
      "skill": "Compliance",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish and maintain strong relationships with KOLs, healthcare professionals, and relevant stakeholders in the field of oncology."
    },
    {
      "duty": "Serve as the scientific resource for company's products, providing accurate and up-to-date information to healthcare professionals. Stay current with relevant medical literature, clinical guidelines, and industry trends."
    },
    {
      "duty": "Develop and deliver presentations, seminars, and educational programs to healthcare professionals, ensuring a deep understanding of the clinical utility and value of the company's products."
    },
    {
      "duty": "Collaborate closely with cross-functional teams including Medical Affairs, Marketing, R&D, and Commercial teams to ensure alignment of scientific and strategic objectives."
    },
    {
      "duty": "Gather insights from KOLs and the medical community to contribute to the development of medical strategies and product lifecycle plans."
    },
    {
      "duty": "Provide scientific support at medical conferences, symposia, and advisory boards. Facilitate discussions and engage in scientific exchange."
    },
    {
      "duty": "Effectively communicate clinical trial data, study results, and scientific findings to internal and external stakeholders."
    },
    {
      "duty": "Ensure all activities and interactions are conducted in compliance with company policies, industry regulations, and ethical standards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Doctoral degree (PhD, MD, PharmD etc) in a relevant scientific discipline."
    },
    {
      "credential": "1+ years of experience as a Medical Science Liaison in oncology."
    },
    {
      "credential": "Excellent interpersonal and communication skills, with the ability to effectively convey complex scientific information."
    },
    {
      "credential": "Proven ability to establish and maintain relationships with KOLs and healthcare professionals."
    },
    {
      "credential": "Strong presentation and public speaking skills."
    },
    {
      "credential": "Demonstrated strategic thinking and problem-solving abilities."
    },
    {
      "credential": "Ability to work independently and as part of a team."
    },
    {
      "credential": "Willingness to travel (approximately 70% of the time) to attend meetings, conferences, and events."
    }
  ]
}