{
  "meta": [
    {
      "job_title": "Senior Program Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 195000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Business Development",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 10
    },
    {
      "skill": "Presentation Skills",
      "experience": 10
    },
    {
      "skill": "MS Office",
      "experience": 10
    },
    {
      "skill": "Written Communication",
      "experience": 10
    },
    {
      "skill": "Team Building",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead multiple small to medium EO/IR development programs, ensuring total program performance including project execution, business goals, and customer relationships."
    },
    {
      "duty": "Participate in the engineering design processes and lead a cross-functional technical team to guide program performance, risk management, and schedules."
    },
    {
      "duty": "Interact heavily with internal and external customers regarding program issues, and inspire enthusiasm for the RVS team and solutions."
    },
    {
      "duty": "Advise management and customers through various presentations and technical proposals, ensuring accurate reflection of program health and achievability."
    },
    {
      "duty": "Engage the team and functional management in a matrixed organization to achieve results, working to ensure team members have the correct technical skills to execute the program."
    },
    {
      "duty": "Continue to evaluate needed skills and develop high-performing teams, delegating and supervising work products to ensure technical results as well as cost and schedule."
    },
    {
      "duty": "Present to RVS Leadership Team for proposal gate reviews, earned value reporting, critical program reviews, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in science, Technology, Engineering, or Mathematics (STEM) and ten (10) years of prior relevant experience OR an Advanced degree and eight (8) years of relevant experience OR in absence of a degree, fourteen (14) years of relevant experience"
    }
  ]
}