{
  "meta": [
    {
      "job_title": "Chief Financial Officer",
      "job_category": "Finance",
      "job_class": "Executive",
      "sector": "Finance",
      "salary": 250000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Financial Reporting",
      "experience": 7
    },
    {
      "skill": "Accounting",
      "experience": 7
    },
    {
      "skill": "Financial Strategy",
      "experience": 7
    },
    {
      "skill": "Budgeting",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 7
    },
    {
      "skill": "Mergers and Acquisitions",
      "experience": 5
    },
    {
      "skill": "Real Estate",
      "experience": 5
    },
    {
      "skill": "Tax Planning",
      "experience": 7
    },
    {
      "skill": "Market Analysis",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Take responsibility (either directly or via staff) for all cash management, insurance, budgeting, and financial reporting, and help drive the company’s financial strategy and hiring needs."
    },
    {
      "duty": "Coordinate development of annual operating, capital, and program budgets, as well as reporting for the same."
    },
    {
      "duty": "Overseeing day-to-day accounting, recording, reporting, and internal-control activities of the organization."
    },
    {
      "duty": "Develop and implement best practices and tools to ensure a well-controlled yet flexible organization that has strong fiscal management, project coordination, cross-team communications, and workflows."
    },
    {
      "duty": "Comply with national and local financial requirements by studying existing and new legislation and taking appropriate action."
    },
    {
      "duty": "Directs the preparation of all financial statements, including income statements, balance sheets, tax returns, and governmental reports."
    },
    {
      "duty": "Reviews planning process and suggests improvements to current methods."
    },
    {
      "duty": "Works with leadership to coordinate planning and establish priorities for the planning process."
    },
    {
      "duty": "Research revenue opportunities and economic trends, and identify areas for cost reduction and process enhancement."
    },
    {
      "duty": "Perform risk management through analysis of company liabilities and investments."
    },
    {
      "duty": "Ensure compliance with relevant regulatory entities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree (or equivalent experience) in accounting, business accounting, or finance"
    },
    {
      "credential": "Professional certification (ex: Certified Public Accountant)"
    }
  ]
}