{
  "meta": [
    {
      "job_title": "Senior IT Architect",
      "job_category": "IT",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 114000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides architecture, design, and technical ownership for applications built on Pega technology and ensures that delivered solutions meet and perform to technical and functional specifications."
    },
    {
      "duty": "Creates technical programming specifications from functional design documents. Works closely with Business System and Business Process Analysts as well as key business partners during this process."
    },
    {
      "duty": "Participates in project meetings; assists QA in testing changes; assists during User Acceptance Testing phase; prepares deployment documentation and assists with deployment where necessary."
    },
    {
      "duty": "Collaborates with other senior IT decision makers on the creation and application of technical roadmaps, standards, tooling and frameworks required to create a modern, high quality, rich application suite."
    },
    {
      "duty": "Leads onsite and offshore technical teams in development activities and enforce best practices"
    },
    {
      "duty": "Recognizes potential strategic application of IT, and initiates investigation and development of innovative methods of exploiting IT assets, to the benefit of organizations and the community. Plays a leading role in improving the interaction and understanding between the business and IT."
    },
    {
      "duty": "Ensures that solutions delivered have an excellent customer experience, are secure and scalable, comply with best practices and open standards."
    },
    {
      "duty": "Looks for ways to utilize modern technologies to solve business problems – including AI, Digital platforms, and automation."
    },
    {
      "duty": "Ensures application solution design conforms to agree upon quality attributes such as performance, fault tolerance, etc."
    },
    {
      "duty": "Ensures product backlog has appropriate technical stories and participates in their prioritization"
    },
    {
      "duty": "Plays an active role in creating and communicating new technical solutions to business partners"
    },
    {
      "duty": "Responsible for the design, implementation, and maintenance of new and existing features for the existing portfolio of applications for a business area and recommending areas where new investment is merited."
    },
    {
      "duty": "Participates in code reviews and sprint retrospectives as assigned."
    },
    {
      "duty": "Ensures agile teams are adopting best software development practices including manual and automated testing, continuous Integration techniques, automated deployments, etc."
    },
    {
      "duty": "Ensures an innovation culture in the team by continuous improvement of deliveries"
    }
  ],
  "skills": [
    {
      "skill": "Pega Technology",
      "experience": 5
    },
    {
      "skill": "Technical Architecture",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Strategic Thinking",
      "experience": 5
    },
    {
      "skill": "Customer Experience Design",
      "experience": 5
    },
    {
      "skill": "Agile Development",
      "experience": 5
    },
    {
      "skill": "Innovation",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or related field (Master's preferred)"
    }
  ]
}