{
  "meta": [
    {
      "job_title": "Airport Operations Supervisor",
      "job_category": "Operations",
      "job_class": "Supervisor",
      "sector": "Aviation",
      "salary": 64480,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Airline Operations",
      "experience": 3
    },
    {
      "skill": "Management",
      "experience": 3
    },
    {
      "skill": "Team Development",
      "experience": 3
    },
    {
      "skill": "Conflict Resolution",
      "experience": 3
    },
    {
      "skill": "Safety and Security Compliance",
      "experience": 3
    },
    {
      "skill": "Training and Coaching",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead, develop, and maintain strategic relationships with Crewmembers, internal departments, and Customers."
    },
    {
      "duty": "Oversee and support Crewmembers responsible for the execution of the Airport operation."
    },
    {
      "duty": "Monitor and execute safety and security programs at the station."
    },
    {
      "duty": "Resolve and handle escalated issues with Customers and/or Crewmembers."
    },
    {
      "duty": "Coach, train, and encourage engagement of Airports Crewmembers."
    },
    {
      "duty": "Identify operational challenges and implement improvements to maximize and ensure success of on-time performance initiatives."
    },
    {
      "duty": "Support Management in the execution of the operational strategy."
    },
    {
      "duty": "Direct and guide Airports Crewmembers through operational issues."
    },
    {
      "duty": "Ensure policies and procedures are conducted in accordance with System Airports Performance and Quality (SAPQ) and applicable federal regulations and standards."
    },
    {
      "duty": "Evaluate daily Crewmember shift schedules and assignments to ensure maximum efficiency."
    },
    {
      "duty": "Fulfill frontline duties, assist in supporting Frontline Crewmembers, and perform administrative support as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or General Education Diploma (GED)"
    }
  ]
}