{
  "meta": [
    {
      "job_title": "Retail Beauty Services Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Retail Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Employee Management",
      "experience": 5
    },
    {
      "skill": "Cosmetology",
      "experience": 5
    },
    {
      "skill": "Service Sales",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Guest Experience",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Promoting a culture of accountability to meet or exceed the store’s goals related to retail and service sales, guest loyalty, payroll, retail shrink, and omni-channel initiatives."
    },
    {
      "duty": "Leading a team of stylists, estheticians, and boutique leads to achieve sales growth in retail and services, and driving the business through a focus on performance, people, and process."
    },
    {
      "duty": "Planning and executing in-store events that deliver an unrivaled guest experience, driving brand partner collaboration and delivering on sales and payroll goals."
    },
    {
      "duty": "Attracting and building a highly engaged team that embodies the Ulta Beauty brand through effective collaboration, open and honest two-way communication, prioritization of work and coaching to drive guest loyalty."
    },
    {
      "duty": "Establishing performance metrics for the team and/or personal goals, including attendance at all required training/education programs, coaching, individual development plans, and annual performance appraisals."
    },
    {
      "duty": "Managing service and boutique supply inventory and ordering process, ensuring allocated budget is adhered to and necessary products for services are on hand."
    },
    {
      "duty": "Communicating and providing feedback to field leadership, including the Business Market Trainer and Field Business Leader, on business trends and opportunities, events, operational challenges, merchandise needs, and the competitive landscape."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree is preferred, but not required."
    }
  ]
}