{
  "meta": [
    {
      "job_title": "Wealth Strategist",
      "job_category": "Finance",
      "job_class": "Specialist",
      "sector": "Wealth Management",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Planning",
      "experience": 10
    },
    {
      "skill": "Estate Planning",
      "experience": 8
    },
    {
      "skill": "Wealth Management",
      "experience": 8
    },
    {
      "skill": "Customer Service",
      "experience": 8
    },
    {
      "skill": "Sales",
      "experience": 8
    },
    {
      "skill": "Training",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Analytical Skills",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Comprehensive wealth and transfer planning for high-net-worth clients (60%)"
    },
    {
      "duty": "Drives adoption of financial planning approach and the RBC Wealth Planning Platform"
    },
    {
      "duty": "Generates or coordinates creation of proposals focusing on client’s wealth transfer goals and objectives, including estate, charitable and business succession planning solutions, helps recruit advisors and close business."
    },
    {
      "duty": "Develops and promotes sales ideas and effective business practices, works with advisors to identify opportunities and capture money in motion."
    },
    {
      "duty": "Delivers the RBC planning client experience to clients with significant wealth and complex needs."
    },
    {
      "duty": "Consults with advisors on complex planning cases, provides estate, insurance and succession planning and trust reviews."
    },
    {
      "duty": "Conducts “point of sale” presentations with advisors to help drive holistic wealth planning and solutions, coordinates other support as needed."
    },
    {
      "duty": "Assists, trains, and motivates FAs on key financial planning concepts and product solutions to gather assets of high-net-worth clients."
    },
    {
      "duty": "Proactively identifies short and long-term business-building activities for individual FAs and teams."
    },
    {
      "duty": "Contacts top producing FAs regarding new sales, prospecting, and training ideas."
    },
    {
      "duty": "Conducts targeted training and development programs."
    },
    {
      "duty": "Contributes content and presents on various topics integral to training and development deliverables for the wealth planning team, the client strategies team and across the firm."
    },
    {
      "duty": "Contributes and develops original thought-leadership content that will be utilized by clients, media, Financial Advisors, and the firm to provide insights and a view on specific themes and planning concepts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in business or related field, advance degree preferred"
    }
  ]
}