{
  "meta": [
    {
      "job_title": "Lead Alterations Specialist",
      "job_category": "Retail",
      "job_class": "Specialist",
      "sector": "Retail",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Alteration Fitting",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Retail Experience",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and oversee all alterations fittings, sewing, steaming, pressing, and spot cleaning of garments to company standards."
    },
    {
      "duty": "Assist stylists in closing sales by consulting with customers regarding gown fit and customization."
    },
    {
      "duty": "Welcome all customers with genuine, and friendly enthusiasm over the phone and in person, communicates clearly and concisely adapting style to suit customers by problem solving, excellent phone skills and resolving conflict."
    },
    {
      "duty": "Respond promptly to all customer questions by providing product and service information."
    },
    {
      "duty": "Drive customer loyalty by making clientele calls to maximize appointments, builds and provides customer service."
    },
    {
      "duty": "Assist as Floor Manager during peak sales times to offer fit and alterations consultations."
    },
    {
      "duty": "Promote all alteration services and personalization options."
    },
    {
      "duty": "Maintain quality control guidelines and inspect all garments altered/steamed/pressed to verify pristine condition before final delivery to customer."
    },
    {
      "duty": "Train Alterations Specialists in fitting and sewing techniques."
    },
    {
      "duty": "Ensure ongoing product education for all Alterations team members."
    },
    {
      "duty": "Use all approved systems and processes to manage the customer’s flow to deliver a 5 Star Customer Experience."
    },
    {
      "duty": "Communicate daily sales goal achieved to Store Manager."
    },
    {
      "duty": "Maintain high dress code standards per her/himself per dress code."
    },
    {
      "duty": "Plan for promotional campaigns, sales events and customer engagement activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or degree. Prior sewing experience required, preferably in bridal and/or special occasion production environment. 1-2 years prior retail experience in an apparel or specialty store environment. Prior experience with computerized POS system and ability to use one."
    }
  ]
}