{
  "meta": [
    {
      "job_title": "BD Subject Matter Expert I/Proposal Writer",
      "job_category": "Business Development",
      "job_class": "Expert",
      "sector": "Management",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Proposal Writing",
      "experience": 5
    },
    {
      "skill": "Content Development",
      "experience": 5
    },
    {
      "skill": "Research Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Government Contracting",
      "experience": 5
    },
    {
      "skill": "Technical Expertise",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Capture/Proposal Training",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Research, develop, and write content for technical, management, past performance, corporate experience, and/or small business participation sections during the proposal development phase."
    },
    {
      "duty": "Conceptualize, research, gather data, and draft proposal sections incorporating the company's best practices and approaches."
    },
    {
      "duty": "Participate in the development of management and staffing approaches."
    },
    {
      "duty": "Work directly with proposal and capture managers to develop winning strategies, themes, and discriminators and incorporate these into proposal sections."
    },
    {
      "duty": "Participate in Black Hat and Blue Team Strategy sessions, Pink, Red, and Gold reviews."
    },
    {
      "duty": "Prepare written text and incorporate narrative and graphics into business proposals and other documents according to prepared outlines and specifications."
    },
    {
      "duty": "Collaborate with graphic artists to develop illustrations, charts, matrices, flow diagrams, and process flow charts for proposals."
    },
    {
      "duty": "Maintain and update a content repository for materials used and reused during the proposal development process."
    },
    {
      "duty": "Participate in reviews to verify the accuracy and consistency of proposal narratives and company data points."
    },
    {
      "duty": "Coordinate with subcontractors to ensure information meets company standards and RFP requirements."
    },
    {
      "duty": "Perform other position-related duties as assigned or requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in an associated discipline. Two (2) years’ experience in business development or related discipline can be substituted for each year of the four (4) years of college."
    },
    {
      "credential": "Eight (8) years’ experience providing technical advisor and/or writing expertise for medium to large-sized proposals or projects in management and/technical areas or ten (10) years progressive proposal development experience with at least five years of writing experience."
    },
    {
      "credential": "May require ability to obtain and maintain a US security clearance. Additional clearances may also be required from the DoD, DoE and other agencies of the federal government."
    }
  ]
}