{
  "meta": [
    {
      "job_title": "Annual Giving Officer",
      "job_category": "Fundraising",
      "job_class": "Officer",
      "sector": "Non-Profit",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Strategize, plan, and oversee execution of direct mail and digital solicitation of approximately 10,000 prospects per year."
    },
    {
      "duty": "Secure new, renewed, or increased funding from individuals through online giving, direct mail and digital campaigns, special events and direct proposals."
    },
    {
      "duty": "Liaise with the Department of Philanthropy Operations to ensure accurate entry, reporting, and stewardship activity; gift processing and reporting for the LHDCMC Foundation."
    },
    {
      "duty": "Keep up to date with industry fundraising technology, best practices, and environmental trends, utilizing a variety of media channels to reach donors in their preferred communication style and educating the team on trends and technologies that can enhance Foundation efforts and success."
    },
    {
      "duty": "Support the planning and execution of donor cultivation and donor stewardship events. Work closely with other Foundation staff members to contribute to a comprehensive MOVES management plan and develops short and long-term business plans, as appropriate."
    },
    {
      "duty": "Ensure that all patient solicitations are in keeping with HIPAA law. Participate in professional networks to maintain current knowledge of laws and techniques."
    },
    {
      "duty": "Function as a key member of the Foundation fundraising team and provide additional support as requested to ensure the success of the Foundation in its mission and goals."
    }
  ],
  "skills": [
    {
      "skill": "Fundraising",
      "experience": 3
    },
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Microsoft Word",
      "experience": 3
    },
    {
      "skill": "Adobe",
      "experience": 3
    },
    {
      "skill": "Excel",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Event Planning",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS in a related field. Fundraising experience may be substituted on a year-for-year basis for up to four years of the required education."
    }
  ]
}