{
  "meta": [
    {
      "job_title": "Grants Assistant",
      "job_category": "Nonprofit",
      "job_class": "Assistant",
      "sector": "Nonprofit",
      "salary": 27,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Administrative Support",
      "experience": 3
    },
    {
      "skill": "Grants Assistant",
      "experience": 1
    },
    {
      "skill": "Expensify",
      "experience": 1
    },
    {
      "skill": "Spanish/French/Portuguese",
      "experience": 1
    },
    {
      "skill": "Sharepoint",
      "experience": 1
    },
    {
      "skill": "Asana",
      "experience": 1
    },
    {
      "skill": "Climate and Biodiversity",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in the daily operations of the office, including receiving deliveries and maintaining inventory of office supplies."
    },
    {
      "duty": "Monitor and distribute incoming communications, such as emails, phone calls, and mail, ensuring timely and relevant responses or routing."
    },
    {
      "duty": "Collaborate with the Operations Administrative Associate to process organizational procurement."
    },
    {
      "duty": "Collate and code expense reports using the Expensify platform."
    },
    {
      "duty": "Support the grants team during the pre-award phase, assisting with assessments prior to awards being granted."
    },
    {
      "duty": "Monitor grants system to ensure active grants compliance, coordinating efforts with the grants team."
    },
    {
      "duty": "Monitor and troubleshoot day-to-day issues, promptly notifying grants team of compliance concerns."
    },
    {
      "duty": "Assist in maintaining the integrity of data through accurate input and ongoing data management tasks."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 85,
      "student_teacher": 50,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "3+ years of Administrative Support experience, 1+ year of Grants Assistant experience, Proficiency with Expensify, Working knowledge of Spanish, French, or Portuguese, Experience with Sharepoint and Asana, Familiarity with issues relating to climate and biodiversity"
    }
  ]
}