{
  "meta": [
    {
      "job_title": "Vice President of Community Health Center Performance",
      "job_category": "Executive",
      "job_class": "Vice President",
      "sector": "Healthcare",
      "salary": 250000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the development and execution of strategy to ensure success of Aledade as an enterprise-wide solution for CHCs in value-based care work."
    },
    {
      "duty": "Develop a pipeline for product success for CHCs and provide key direction to health equity-driven performance strategy and population health interventions within Aledade’s CHC portfolio."
    },
    {
      "duty": "Collaborate with internal teams to ensure seamless integration with Aledade’s portfolio and serve as key company advocate for strategy related to CHCs."
    },
    {
      "duty": "Provide key direction to health equity-driven performance strategy and population health interventions within Aledade’s CHC portfolio."
    },
    {
      "duty": "Lead a cross-functional working group to develop a practice model for CHC population health interventions and inform Aledade’s Medicaid and Medicare Advantage payer contracting strategy."
    },
    {
      "duty": "Assume responsibility for all aspects of performance of CHCs in value-based care metrics and develop an enterprise-wide strategy for improving risk stratification and care quality within CHCs."
    },
    {
      "duty": "Collaborate with Product Marketing on innovative ways to capture mindshare and enhance CHC engagement in value-based care and develop and lead an advisory committee made up of CHC leadership representatives who can provide regular feedback."
    },
    {
      "duty": "Investigate the role of Medicare-Medicaid (dual) eligible patients in CHC ACO contract success and define the tools and analytics needed to support and retain this customer type."
    },
    {
      "duty": "Develop separate onboarding materials for employed physicians/NPs/PAs with sensitivity to the training needs that our customers desire, and the time and tech constraints the employed providers have."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 160,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree with 15+ years experience in healthcare. Master’s degree or other advanced degree(s) in business, health administration and/or public policy or other relevant fields preferred."
    }
  ]
}