{
  "meta": [
    {
      "job_title": "Manager of Projects",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Business Management",
      "experience": 5
    },
    {
      "skill": "Decision Making",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee all aspects of installation, upgrade, conversion, migration, and professional services projects for premise and cloud-based implementations."
    },
    {
      "duty": "Manage a team of 10+ Project Managers."
    },
    {
      "duty": "Advise, consult, and assist internal project teams on an ongoing basis to confirm project scope and facilitate resolution of project prioritization."
    },
    {
      "duty": "Define project management goals and deliverables that support company goals in collaboration with senior management."
    },
    {
      "duty": "Meet or exceed revenue goals, margins, and client satisfaction through the successful delivery of project implementations."
    },
    {
      "duty": "Develop and maintain partnerships with third-party resources, including Business Partners and 3rd Party IT providers."
    },
    {
      "duty": "Respond to escalated project issues that may impede project delivery and coordinate solutions."
    },
    {
      "duty": "Collaborate with other department leaders to define, prioritize, and develop new strategies for process improvement."
    },
    {
      "duty": "Develop project management tools, procedures, and processes."
    },
    {
      "duty": "Monitor and analyze project metrics to identify weaknesses or problems."
    },
    {
      "duty": "Ensure ongoing process improvement to respond to changing business needs, capabilities, and clients that enable reliable delivery of integrated solutions in a dynamic environment."
    },
    {
      "duty": "Advocate for the client and provide an exceptional client experience."
    },
    {
      "duty": "Interview and on-board new team members."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Degree in Business Operations/Management and/or Information Technology is a plus.4+ years in successful operations & project leadership.IT/Project Management Certification a plus."
    }
  ]
}