{
  "meta": [
    {
      "job_title": "Food Service Assistant",
      "job_category": "Food Service",
      "job_class": "Assistant",
      "sector": "Food Service",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    },
    {
      "skill": "Patient Care",
      "experience": 1
    },
    {
      "skill": "Meal Preparation",
      "experience": 3
    },
    {
      "skill": "Menu Planning",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Food Safety",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serves therapeutically correct trays to patients, processes diet orders, collects patient menu selections, adjusts patient menus in accordance with patient’s diet order and the diet reference manual, processes menu for trayline and demonstrates outstanding customer service."
    },
    {
      "duty": "Prepares trays for new admissions and transferred patients."
    },
    {
      "duty": "Serves and collects trays; performs meal rounds after serving to monitor patient satisfaction with food and service."
    },
    {
      "duty": "Explains menu process to patients utilizing “Nutrition Scripts”; assures receipt of each patient’s menu selection via CBORD room service appropriately guiding patients in making selections in accordance with their diet."
    },
    {
      "duty": "Monitors patients with changes in intake and reports nutritional concerns to the dietitian/technician."
    },
    {
      "duty": "Delivers meals utilizing the current meal delivery system."
    },
    {
      "duty": "Assembles and serves nourishments/snack baskets and fills water cups, as assigned."
    },
    {
      "duty": "Inventories, obtains, stores, and rotates supplies and nourishments within established timelines using the par system."
    },
    {
      "duty": "Communicates food service/nutrition related problems to manager, technicians and dietitians as encountered."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High school graduate or equivalent"
    }
  ]
}