{
  "meta": [
    {
      "job_title": "Partner Relations Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Client Engagement",
      "experience": 5
    },
    {
      "skill": "Sales Presentations",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Remote Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Client Success Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive revenue growth and contract renewals for a book of accounts across North America working with all contacts associated with the account including educators, career services, and decision-makers."
    },
    {
      "duty": "Develop account success plans at the account and educator level; deeply understanding the goals of the account and the individual educators using the Riipen platform to drive the best possible experience."
    },
    {
      "duty": "Coordinate with partners at academic institutions to design a detailed rollout plan for top-down and organic bottom-up faculty adoption with targets and timelines customized for the academic partners' goals utilizing all Riipen customer-facing teams."
    },
    {
      "duty": "Conduct regular check-ins and follow-ups with decision-makers and educators at institutions in your book of accounts."
    },
    {
      "duty": "Host webinars, platform demos, meetings and workshops to spread Riipen brand awareness at partner institutions."
    },
    {
      "duty": "Consult on experiential learning assignment design and development with educators."
    },
    {
      "duty": "Create proposals and presentations to drive renewal and expansion discussions."
    },
    {
      "duty": "Partner with career services teams to help them engage their own employer and alumni networks in project-based learning."
    },
    {
      "duty": "Work closely with our Customer Success team to ensure that your accounts are receiving exceptional customer service."
    },
    {
      "duty": "Work closely with Employer Partnerships to ensure we are acquiring good-fit projects for academic institutions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Education, Business, Marketing, or a related discipline"
    }
  ]
}