{
  "meta": [
    {
      "job_title": "Merchandising Specialist",
      "job_category": "Retail",
      "job_class": "Specialist",
      "sector": "Merchandising",
      "salary": 38000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Merchandising",
      "experience": 3
    },
    {
      "skill": "Retail Sales",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 4
    },
    {
      "skill": "Cash Handling",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Visual Merchandising",
      "experience": 3
    },
    {
      "skill": "Point of Sale (POS) System",
      "experience": 3
    },
    {
      "skill": "Safety Procedures",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Efficiently execute merchandising to ensure consistency with product sets and signage displays in the store and across multiple stores in a Market or District."
    },
    {
      "duty": "Assist in the receiving of merchandise, stock and price accurately, and provide guest service as necessary."
    },
    {
      "duty": "Perform all aspects of point-of-sale service, including cash sales, credit and check sales, returns, and exchanges."
    },
    {
      "duty": "Assist with the unloading, pricing, and stocking of merchandise according to operational guidelines."
    },
    {
      "duty": "Participate in the completion of quarterly and annual physical inventory counts."
    },
    {
      "duty": "Travel to designated store group to complete projects such as Category Reviews, Action Memos, Recalls, Resets, etc."
    },
    {
      "duty": "Analyze on-site/actual conditions, identify necessary corrections, recommend alterations, and troubleshoot resolution."
    },
    {
      "duty": "Communicate with leadership upon completion of day regarding any remaining unfinished projects, set changes, and screen correction information."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or its equivalent (GED) preferred, with basic math proficiency and above average communication skills."
    }
  ]
}