{
  "meta": [
    {
      "job_title": "Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Retail Business Knowledge",
      "experience": 5
    },
    {
      "skill": "Marketing Tools Utilization",
      "experience": 5
    },
    {
      "skill": "Customer Needs Analysis",
      "experience": 5
    },
    {
      "skill": "Bilingual Skills (Spanish)",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop relationships with current customers and potential customers within specific territory."
    },
    {
      "duty": "Assist customers by providing knowledge and training company products to their store personnel, to ensure personnel is able to present product and negotiate well with consumers."
    },
    {
      "duty": "Understand our products, our market competition and how to position products to overcome these factors."
    },
    {
      "duty": "Manage displays, samples, and selling tools for customer availability."
    },
    {
      "duty": "Understand retail business financials to consult with dealers on retail pricing, advertising, promotions and ROI."
    },
    {
      "duty": "Quote prices, discuss credit terms and prepare sales contracts for customer orders."
    },
    {
      "duty": "Estimate date of delivery to customer, based on knowledge of company’s delivery schedules."
    },
    {
      "duty": "Review and analyze various sales reports to identify sales potential with current customers and potential new customers."
    },
    {
      "duty": "Utilize any and all marketing tools such as catalogs, brochures and vendor collateral to broaden reach in territory and promote company products."
    },
    {
      "duty": "Research and analyze customer needs and demands based on market information."
    },
    {
      "duty": "Investigate and resolve customer claims/problems with deliveries, returns and credits."
    },
    {
      "duty": "Attend trade shows throughout the year as required."
    },
    {
      "duty": "Travel 40% - 80% locally, occasionally nationally and/or internationally."
    },
    {
      "duty": "Perform additional duties as required and or requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree required"
    }
  ]
}