{
  "meta": [
    {
      "job_title": "Director, Engineering Rapid Growth",
      "job_category": "Engineering",
      "job_class": "Director",
      "sector": "Engineering",
      "salary": 169000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Industrial Engineering",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Cross-functional Collaboration",
      "experience": 10
    },
    {
      "skill": "Operations Management",
      "experience": 10
    },
    {
      "skill": "Business Strategy",
      "experience": 10
    },
    {
      "skill": "Multi-tasking",
      "experience": 10
    },
    {
      "skill": "Influencing",
      "experience": 10
    },
    {
      "skill": "Restaurant Industry",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify, design, and develop end-to-end kitchen capacity and labor utilization strategy to streamline processes, create seamless restaurant execution, and enhance employee/customer experience while positively impacting margins and other business metrics."
    },
    {
      "duty": "Drive cross functional collaboration and partnerships across Operations, Marketing, and Food Innovation Technology to enable and operationalize the long-term menu strategy & growth platforms."
    },
    {
      "duty": "Enable Taco Bell to hit our ambitious target of improved peak transactional throughput across the entire restaurant system."
    },
    {
      "duty": "Lead strategy to operationalize major menu innovation & future growth platforms including:"
    },
    {
      "duty": "Define and evolve minimal operating guidelines for executing existing menu mix and transaction levels"
    },
    {
      "duty": "Drive cross-functional partnerships to build creative solutions that deliver the most effective AND efficient solutions to challenges"
    },
    {
      "duty": "Spearhead 3rd party initiative to build a dynamic capacity model for the system that proactively identifies & addresses operational constraints across customer access points, and back of house employee experience (on-the-line storage (dry, cold, hot), spacing and equipment utilization, and preparation & storage prior to the line, etc.)"
    },
    {
      "duty": "Establish partnerships for experimentation with internal and external stakeholders, including Operations leadership, franchise partners, etc., and develop technical platform mechanisms that free-up labor to focus on service and maximize productivity."
    },
    {
      "duty": "Leverage balanced holistic thinking and integrated approaches with the ability to move fast to drive concrete operational and financial impact in-restaurant."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "MBA or master’s degree in industrial engineering preferred. 10 + years minimum of leadership experience driving end-to end capacity and labor utilization or similar field. Proven track record of leading measurable productivity improvements and setting the operational foundation to enable growth. Experience in the restaurant or retail industry preferred. A minimum of 3+ years directly leading, engaging and inspiring a team – able to leverage the team’s expert knowledge and integrate with new ways of working. Ability to quickly develop trust-based cross-functional partnerships and influence at various levels of an organization. Proven ability to multi-task and prioritize time in a fast-paced, deadline driven environment."
    }
  ]
}