{
  "meta": [
    {
      "job_title": "Loan Underwriter",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Statement Analysis",
      "experience": 5
    },
    {
      "skill": "Credit Analysis",
      "experience": 5
    },
    {
      "skill": "Loan Origination Software",
      "experience": 5
    },
    {
      "skill": "Mortgage Underwriting Systems",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Ethical Standards",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review loan applications and supporting documentation for manufactured housing loans, including income verification, credit reports, and property valuations."
    },
    {
      "duty": "Assess the creditworthiness of borrowers by analyzing financial statements, tax returns, employment history, and other relevant information."
    },
    {
      "duty": "Evaluate loan-to-value ratios, debt-to-income ratios, and other key financial indicators to determine loan feasibility."
    },
    {
      "duty": "Analyze manufactured housing market trends and property valuations to determine appropriate loan amounts and loan terms."
    },
    {
      "duty": "Ensure compliance with lending regulations, internal policies, and underwriting guidelines."
    },
    {
      "duty": "Collaborate with loan officers, processors, and other team members to gather necessary information and address any application deficiencies or documentation gaps."
    },
    {
      "duty": "Conduct thorough risk assessments to identify potential red flags or fraudulent activities."
    },
    {
      "duty": "Prepare loan underwriting summaries, including recommended loan structures, risk mitigation strategies, and rationales for decision-making."
    },
    {
      "duty": "Communicate lending decisions and provide clear explanations to loan officers, processors, and other stakeholders."
    },
    {
      "duty": "Stay updated on industry best practices, regulatory changes, and market trends related to manufactured housing financing."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Previous experience as a loan underwriter or in a similar role, preferably with expertise in manufactured housing loans."
    }
  ]
}