{
  "meta": [
    {
      "job_title": "Community Initiatives Manager",
      "job_category": "Community Initiatives",
      "job_class": "Manager",
      "sector": "Community Initiatives",
      "salary": 70000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and lead outreach activities and educational opportunities in partnership with the Executive Director, Chapter Presidents, and Board of Directors."
    },
    {
      "duty": "Serve as District Lobby Days staff lead, organizing events, volunteers, and programming."
    },
    {
      "duty": "Develop and build a comprehensive volunteer engagement platform through the chapters and meet outreach and volunteer engagement goals."
    },
    {
      "duty": "Serve as staff lead to the annual fundraiser volunteer committee, providing material support and assistance in implementing committee plans."
    },
    {
      "duty": "Collaborate with the marketing and communications team to increase visibility and promote programs and events."
    },
    {
      "duty": "Work within budget to ensure that the outreach initiatives and development events are fiscally responsible."
    },
    {
      "duty": "Work with Ambassadors and Chapter leadership teams to ensure effective marketing, outreach, and legislative support and serve as a Liaison to the Executive Director."
    },
    {
      "duty": "Assess opportunities for new chapters and dissolve unproductive chapters while maintaining legislative/constituent support in those areas that may not have the resources to qualify as a \"THLN Chapter.\""
    },
    {
      "duty": "Develop an annual plan with each chapter: set financial goals, determine fundraising programs, and develop a tactical plan for accomplishing goals."
    },
    {
      "duty": "Maintain the Ambassador Handbook and Chapter Handbook."
    },
    {
      "duty": "Perform other duties as assigned by the Executive Director."
    }
  ],
  "skills": [
    {
      "skill": "Community Initiatives Management",
      "experience": 5
    },
    {
      "skill": "Volunteer Management",
      "experience": 5
    },
    {
      "skill": "Event Coordination",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Marketing and Outreach",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required. Five to seven years of experience in community initiatives may be accepted in lieu of a degree."
    }
  ]
}