{
  "meta": [
    {
      "job_title": "Safety and Environmental Supervisor",
      "job_category": "Safety",
      "job_class": "Supervisor",
      "sector": "Manufacturing",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Environmental Regulations",
      "experience": 5
    },
    {
      "skill": "Equipment Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Process Optimization",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Technical Proficiency (PI, DCS, Excel, PowerPoint, Word)",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage safety, housekeeping, environmental, and training aspects of the hourly workforce in the board machine area."
    },
    {
      "duty": "Work closely with supervisors to manage crew's performance, write work requests, and lead productivity teams."
    },
    {
      "duty": "Assist in the design/installation/operator training/startup of new equipment, covering daily/weekend calls, and acting as a relief foreman."
    },
    {
      "duty": "Drive safety improvements, address safety concerns, and reduce area exposure risks in the Board Mill department."
    },
    {
      "duty": "Troubleshoot equipment and processes, identify problems, repair, and optimize systems."
    },
    {
      "duty": "Investigate alternative equipment and process designs, manage area overtime, and oversee operator training."
    },
    {
      "duty": "Develop capital and expense budgets, track, analyze, optimize, and report on Key Performance Indicators for the Board Mill."
    },
    {
      "duty": "Manage and direct railroad on daily switch requirements, inventory shipping dunnage supplies, and report track roll/bale inventory levels."
    },
    {
      "duty": "Be proficient in the use of PI and DCS systems, as well as Excel, Gannt charting, PowerPoint, and Word."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Prefer candidate with a college degree. Prefer degree in chemical/electrical/mechanical engineering field and minimum of 5 years of work experience related to paper making. Knowledge of coatings or coating application in addition to paper making experience would be a plus. Good oral and written communication skills are required."
    }
  ]
}