{
  "meta": [
    {
      "job_title": "Inside Sales Manager for New Markets (U.S/EMEA/LatAm)",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Experience",
      "experience": 2
    },
    {
      "skill": "Team Management",
      "experience": 1
    },
    {
      "skill": "Lead Generation",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 3
    },
    {
      "skill": "Business Development",
      "experience": 3
    },
    {
      "skill": "CRM Management",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 4
    },
    {
      "skill": "Bachelor's Degree",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage a team of Inside Sales Representatives to meet and exceed company sales objectives in conjunction with sales direction and marketing."
    },
    {
      "duty": "Lead the outbound attack strategy for the U.S region."
    },
    {
      "duty": "Research accounts, identify key players, and ensure a full pipeline for all ISRs."
    },
    {
      "duty": "Coordinate prospect attack campaigns to target white space opportunities."
    },
    {
      "duty": "Set, track, monitor, and enforce key inside sales metrics including meetings set, SQL to FSQL ratio, email sequence, and outbound phone call activity."
    },
    {
      "duty": "Join sales calls with regional sellers to assist in the first meeting pitch and offer support where necessary."
    },
    {
      "duty": "Use lead generation tools to find the right prospects based on a specific attack criteria, and update the CRM system."
    },
    {
      "duty": "Collaborate with BD team, Sales Ops, Marketing, Product Management, and other departments to improve processes that affect sales performance."
    },
    {
      "duty": "Interview, select, hire, train and assign staff. Provide direction and mentoring, develop and communicate performance metrics to assess the effectiveness of staff."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "2-3 years of sales experience working against and exceeding an assigned sales quota in an advertising, marketing, or SaaS-related role"
    },
    {
      "credential": "1-2 years experience managing a sales team"
    },
    {
      "credential": "Experienced with getting results in the U.S region"
    },
    {
      "credential": "Self-motivated, able to adapt to an ambiguous, fast-paced sales environment"
    },
    {
      "credential": "Bachelor’s Degree required"
    },
    {
      "credential": "Professional knowledge of terminology, trends and concepts of e-commerce and digital marketing (Nice to have)"
    },
    {
      "credential": "Multi-lingual capabilities (German, Spanish, French etc.) (Nice to have)"
    },
    {
      "credential": "Experience in advertising sales, software sales (Nice to have)"
    }
  ]
}