{
  "meta": [
    {
      "job_title": "Customer Service Specialist",
      "job_category": "Customer Service",
      "job_class": "Specialist",
      "sector": "Retail",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Retail Sales",
      "experience": 3
    },
    {
      "skill": "Point of Sale (POS) Systems",
      "experience": 3
    },
    {
      "skill": "Product Knowledge",
      "experience": 3
    },
    {
      "skill": "Teamwork",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Conflict Resolution",
      "experience": 3
    },
    {
      "skill": "Cash Handling",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide exceptional customer service and product knowledge to guests, ensuring their needs are met and addressing any inquiries or concerns."
    },
    {
      "duty": "Perform point-of-sale transactions and handle cash, credit, and check sales accurately and efficiently."
    },
    {
      "duty": "Stay updated on new products, promotions, and pet-related events in the community to engage with customers and provide relevant information."
    },
    {
      "duty": "Promote teamwork, inclusion, and collaboration within the workplace to create a positive culture for both customers and team members."
    },
    {
      "duty": "Assist in informing guests about adoption events and the company's philosophy on pet adoption."
    },
    {
      "duty": "Maintain familiarity with current promotions, special services, and seasonal training to provide comprehensive assistance to customers."
    },
    {
      "duty": "Evaluate guest inquiries and refer to the appropriate leader as needed, ensuring all needs are addressed."
    },
    {
      "duty": "Uphold safety protocols and contribute to maintaining a safe environment for partners, guests, and pets."
    },
    {
      "duty": "Engage in developmental programs to support continuous growth and development throughout the career."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED is generally preferred."
    },
    {
      "credential": "Minimum of 2 years of experience in providing public information related to animal nutrition, care, and wellness/treatment knowledge areas is required."
    },
    {
      "credential": "Minimum of one year in a retail environment is highly preferred."
    },
    {
      "credential": "Basic computer skills and proficiency in using PETCO PetNet and the POLARIS system."
    },
    {
      "credential": "Certification in Companion Animal Departments, Nutrition, and PIJAC (California only) is required."
    },
    {
      "credential": "Thorough understanding of various aspects of Pet Services, including grooming salon programs, dog training class offerings, and vaccination schedules."
    },
    {
      "credential": "Previous PETCO experience is preferred."
    }
  ]
}