{
  "meta": [
    {
      "job_title": "Custodian",
      "job_category": "Custodial Services",
      "job_class": "Entry-Level",
      "sector": "Facilities Management",
      "salary": 28000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "General Maintenance",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Facility Cleaning",
      "experience": 3
    },
    {
      "skill": "Safety Compliance",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform general clean operations in assigned areas including kitchen facilities, gym facilities, meeting areas, and office space."
    },
    {
      "duty": "Perform other janitorial duties such as dusting windowsills and moldings; light fixtures, glass doors and panels; vacuuming and removing spots from carpets; wet mopping and buffing flooring; cleaning and disinfecting drinking fountains; and washing solid areas of partitions, doors, and walls."
    },
    {
      "duty": "Sweep, mop, and vacuum all area floors, restrooms and break areas."
    },
    {
      "duty": "Clean rest room facilities and replenish supplies."
    },
    {
      "duty": "Perform general cleaning, light floor care and special event set ups."
    },
    {
      "duty": "Collect and remove trash and recyclables."
    },
    {
      "duty": "Prepare list of supplies for daily use and restock as needed."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED Required. 0 – 3 years of directly related or closely related experience."
    },
    {
      "credential": "Must be able to operate vacuum, buffer, carpet extractors, blowers and equipment normally associated with custodial trades."
    },
    {
      "credential": "Must handle cleaning chemicals with caution and follow manufactures label instructions."
    },
    {
      "credential": "Must comply with the association safety program and meet safety requirements and standards."
    },
    {
      "credential": "Must be able to sit, stand, walk, kneel, reach with hands and arms, stoop, crawl, talk, hear, push, pull, grasp, use hands and fingers, have clear vision and lift up to 30 pounds."
    }
  ]
}