{
  "meta": [
    {
      "job_title": "Financial Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages, directs, and supervises the financial management system of Nevadaworks."
    },
    {
      "duty": "Responsible for financial compliance and reporting, including financial and budget analysis for the Chief Executive Officer."
    },
    {
      "duty": "Provides administrative support for the Nevadaworks Board and fulfills related work as directed."
    },
    {
      "duty": "Manages agency accounting, cash management, payroll, internal controls, inventory control, and general procurement activities."
    },
    {
      "duty": "Develops and maintains the internal computerized accounting system and is responsible for hiring, training, supervising, and evaluating assigned staff."
    },
    {
      "duty": "Performs analysis of financial reports and data, reconciles accounts, prepares journal entries, and balances general ledger accounts."
    },
    {
      "duty": "Schedules and coordinates audits with independent auditors, prepares supporting work papers, and provides assistance to auditors, as well as reviewing audit reports and discussing findings with agency management."
    },
    {
      "duty": "Manages the Nevadaworks operations and grant budgets, monitors subrecipient and contractor financial systems, and records and reports for compliance with grant and budgetary requirements."
    },
    {
      "duty": "Develops and implements financial policies and procedures, as well as interprets and disseminates laws, regulations, and memoranda affecting financial management of Nevadaworks programs and contracts."
    },
    {
      "duty": "Coordinates Nevadaworks benefit administration, prepares personnel action forms, maintains personnel files, and serves as a staff resource for personnel issues."
    },
    {
      "duty": "Reports to the Chief Executive Officer and represents Nevadaworks on various community and State committees and boards as assigned by the CEO."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, or a related field (Master's preferred)"
    }
  ]
}