{
  "meta": [
    {
      "job_title": "Senior Technical Product Manager",
      "job_category": "Product Management",
      "job_class": "Manager",
      "sector": "Technology",
      "salary": 140000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a comprehensive strategy for enhancing and maintaining our internal tools ecosystem, aligning with company goals and objectives."
    },
    {
      "duty": "Lead the evaluation, selection, and integration of 3rd party tools and manage existing tools such as Snowflake, NetSuite, and Braze, ensuring seamless data flow, optimal functionality, and alignment with business processes."
    },
    {
      "duty": "Collaborate with internal stakeholders from different departments to gather, document, and prioritize requirements for internal tools and 3rd party integrations."
    },
    {
      "duty": "Leverage your expertise in data systems to ensure effective data governance, accuracy, and accessibility across integrated platforms."
    },
    {
      "duty": "Work closely with the marketing & technology teams to identify opportunities for optimizing and expanding our martech stack through strategic integrations."
    },
    {
      "duty": "Partner with engineering, data analytics, operations, and other relevant teams to define integration specifications, troubleshoot issues, and ensure successful implementation."
    },
    {
      "duty": "Manage relationships with 3rd party vendors, negotiate contracts, and stay updated on product roadmaps to anticipate future enhancements."
    },
    {
      "duty": "Develop and communicate roadmaps for internal tools and integration projects, keeping stakeholders informed about progress, milestones, and potential challenges."
    },
    {
      "duty": "Monitor the performance of integrated systems, proactively identify areas for improvement, and drive continuous optimization efforts."
    },
    {
      "duty": "Provide guidance and mentorship to junior members of the product management team, fostering a culture of learning and growth."
    }
  ],
  "skills": [
    {
      "skill": "Product Management",
      "experience": 5
    },
    {
      "skill": "Data Systems",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Marketing Technology",
      "experience": 3
    },
    {
      "skill": "Cross-Functional Collaboration",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Computer Science, Engineering, or a related field. (Master's preferred)"
    }
  ]
}