{
  "meta": [
    {
      "job_title": "Warehouse Associate",
      "job_category": "Warehouse",
      "job_class": "Associate",
      "sector": "Logistics",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Number Matching",
      "experience": 1
    },
    {
      "skill": "Product Staging",
      "experience": 1
    },
    {
      "skill": "Loading/Unloading",
      "experience": 2
    },
    {
      "skill": "Forklift Operation",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Quality Control",
      "experience": 2
    },
    {
      "skill": "Safety Compliance",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Accurately match numbers & letters"
    },
    {
      "duty": "Accurately stage and sort products for loading"
    },
    {
      "duty": "Loads and unloads trailers"
    },
    {
      "duty": "Opens and closes dock doors"
    },
    {
      "duty": "Maintain a clean and safe work area"
    },
    {
      "duty": "Sorts and places parts in racks or other designated areas"
    },
    {
      "duty": "Pulling of manual dock chain"
    },
    {
      "duty": "Stacks cardboard boxes and pallets"
    },
    {
      "duty": "Move materials within the warehouse"
    },
    {
      "duty": "Complies with all safety requirements"
    },
    {
      "duty": "Package or kit finished product for shipping"
    },
    {
      "duty": "Quality control"
    },
    {
      "duty": "Ensure damaged products are identified and removed when received"
    },
    {
      "duty": "Complete daily logs"
    },
    {
      "duty": "Communicate with associates from other shifts"
    },
    {
      "duty": "Attach identifying tags to containers, or mark them with identifying information"
    },
    {
      "duty": "Read work orders or receive oral instructions to determine work assignments and material and equipment needs"
    },
    {
      "duty": "Record numbers of units handled and moved, using daily production sheets or work tickets"
    },
    {
      "duty": "Assemble product containers and crates, using hand tools and precut lumber"
    },
    {
      "duty": "Pack containers and re-pack damaged containers"
    },
    {
      "duty": "Sorts and stores perishable goods in refrigerated rooms"
    },
    {
      "duty": "Fills requisitions, work orders, or requests for materials, tools, or other stock items and distributes items to production workers or assembly line"
    },
    {
      "duty": "Assembles customer orders from stock and places orders on pallets or shelves, or conveys orders to packing station or shipping department"
    },
    {
      "duty": "Weighs or counts items for distribution within plant to ensure conformance to company standards"
    },
    {
      "duty": "Uses computer to enter records"
    },
    {
      "duty": "Prepares parcels for mailing"
    },
    {
      "duty": "Maintains inventory records"
    },
    {
      "duty": "Operate forklifts, pallet jacks and a variety of warehouse mechanical equipment (where applicable)"
    },
    {
      "duty": "Operate forklifts or pallet jacks to transport stored items from warehouse to plant or to pick up items from several locations for shipment (where applicable)"
    },
    {
      "duty": "Other projects and tasks as assigned by supervisor"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "No prior warehouse experience required, but preferred. High school diploma or equivalent preferred. Willingness to work the required schedule, work at the specific location required. Complete a Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening required. This position is designated as safety sensitive by the company, and the ability to work in a constant state of alertness and in a safe manner is required"
    }
  ]
}