{
  "meta": [
    {
      "job_title": "Assistant Project Manager",
      "job_category": "Project Management",
      "job_class": "Assistant",
      "sector": "Construction",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Assist with coordination between Architect, Landscape Architect, Structural Engineer and internal Product Development team for the timely design and processing of plans through design review and construction document approval.  Responsible for revisions made to existing plans and distribution of revised documents to field and purchasing staff.  Responsible for submitting plans for review and tracking/monitoring the plan approval process with local jurisdictions.  Review construction documents to ensure proper compliance with Lennar construction practices and product selection.  Assist in the generation of required supplemental documents. This includes, but is not limited to Typical Plot Plans, Lot Fits, Electrical Minis, Flooring Minis, Sales Offices, Construction Offices and Model home Complexes.  Prepare documents and consolidate for Design Review presentation to local jurisdictions.  Assist with special projects as assigned by department head.  Perform all other duties as assigned."
    },
    {
      "duty": "Two (2) years in home-building related experience required  High school diploma or GED required; college or business school preferred  Proficiency in AutoCAD and Photoshop required  Excellent written, oral, organizational and math skills  Must possess professional attitude to represent the company in a positive manner  Intermediate skill in Microsoft Word for Windows and Excel  Valid, unrestricted Motor Vehicle License  Maintain regular attendance and punctuality relative to daily work schedule is required  Follow directions from a supervisor  Ability to handle priorities under pressure  Interact well with co-workers  Understand and follow posted and distributed work rules and procedures  Accept constructive feedback  Team Player  Physical Requirements :  Position requires attendance at meetings outside division office and trips to models/communities. Position requires local travel for submittal and retrieval of documents. Position requires the ability to occasionally bend, stoop, reach, lift, move and carry office materials and supplies weighing 25 pounds or less. Finger dexterity is required to operate a computer keyboard and calculator. Required to operate a motor vehicle.  FLSA Status:  Non-Exempt"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED required; college or business school preferred"
    }
  ]
}