{
  "meta": [
    {
      "job_title": "Customer Service Supervisor",
      "job_category": "Customer Service",
      "job_class": "Supervisor",
      "sector": "Sales",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Supervisory Leadership",
      "experience": 5
    },
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Team Development",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "CRM Management",
      "experience": 5
    },
    {
      "skill": "Customer Relations Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Excel",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, manage, and coordinate internal sales and service initiatives and projects."
    },
    {
      "duty": "Hire, train, and develop sales and service personnel, along with performance evaluations."
    },
    {
      "duty": "Champion the development of leadership competencies that drive individual and team goals."
    },
    {
      "duty": "Ensure maintenance of customer relations at a high level and handle complex and escalated customer service issues."
    },
    {
      "duty": "Utilize key metrics to evaluate and recommend best practices for operations."
    },
    {
      "duty": "Process orders and related transactions via Safe Fleet ERP system (Syteline) in a timely manner without sacrificing accuracy."
    },
    {
      "duty": "Provide customers with sales information regarding various features and benefits of the products offered."
    },
    {
      "duty": "Follow up on customer inquiries that cannot be resolved immediately and respond to customer requirements, providing updates related to due dates or product availability."
    },
    {
      "duty": "Conduct an annual pricing review in conjunction with finance and leadership teams."
    },
    {
      "duty": "Act as a liaison between customer service and operations, participating in Sales and Operational Planning meetings to provide accurate information to Operations, Finance, and Business Unit Leaders."
    },
    {
      "duty": "Identify and implement strategies to improve quality of service, productivity, and profitability, proposing solutions to help customers run their business more effectively."
    },
    {
      "duty": "Carry out supervisory responsibilities in accordance with the organization's policies, procedures, and applicable laws."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience"
    }
  ]
}