{
  "meta": [
    {
      "job_title": "Production Associate",
      "job_category": "Manufacturing",
      "job_class": "Associate",
      "sector": "Manufacturing",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Electrical Technology",
      "experience": 5
    },
    {
      "skill": "Wire Harness Industry",
      "experience": 5
    },
    {
      "skill": "Reading and Comprehension",
      "experience": 5
    },
    {
      "skill": "Arithmetic Skills",
      "experience": 5
    },
    {
      "skill": "Metric Measurements",
      "experience": 5
    },
    {
      "skill": "Computer Use",
      "experience": 5
    },
    {
      "skill": "Print Reading",
      "experience": 5
    },
    {
      "skill": "Schematic Analysis",
      "experience": 5
    },
    {
      "skill": "Electrical Testing",
      "experience": 5
    },
    {
      "skill": "Basic Hand Tools",
      "experience": 5
    },
    {
      "skill": "Soldering",
      "experience": 5
    },
    {
      "skill": "Micrometer Use",
      "experience": 5
    },
    {
      "skill": "Crimping Tools",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Follow work instructions to prepare materials for the production process and produce finished products for customers."
    },
    {
      "duty": "Learn all aspects of manufacturing process including computer use, wire processing, equipment operation, molding, hand tool use, soldering, product testing, reading and using work instructions, product inspection, assembly, building, labeling, and packing."
    },
    {
      "duty": "Read and interpret drawings, diagrams, blueprints, specifications, and work instructions."
    },
    {
      "duty": "Verify dimensions and placement of parts for conformance to drawing specifications using tools and assembly aids."
    },
    {
      "duty": "Assemble electrical or electronic systems and supporting assemblies by installing components, subassemblies, and wiring using fastening devices or soldering equipment."
    },
    {
      "duty": "Build products such as power panels and large power units, populate or modify/replace components, and solve problems while preventing and correcting defects."
    },
    {
      "duty": "Inspect wiring installations, assemblies, and circuits, and test products to ensure conformance to specifications."
    },
    {
      "duty": "Build sub-assemblies and finished products with supervision, assemble/build kitted product independently, test product with supervision, and perform builds of all sizes and complexity of custom builds in addition to independent electrical testing."
    },
    {
      "duty": "Train others and demonstrate advanced working knowledge and use of electrical standards and required levels of IPC training and certifications."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Associates degree in electrical technology or equivalent, High School Diploma / GED / or equivalent"
    }
  ]
}