{
  "meta": [
    {
      "job_title": "Data Center Project Engineer",
      "job_category": "Engineering",
      "job_class": "Project Engineer",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish communication and coordination across a data center region’s general contractors, stakeholders, and internal teams."
    },
    {
      "duty": "Develop and maintain a tracking system for design changes, RFI’s (requests for information), and change orders and dashboard and track this information for regional leadership review."
    },
    {
      "duty": "Requesting and reviewing MOPs (Method of Procedure) for proper detail, necessity, and risk."
    },
    {
      "duty": "Onboarding new vendors for badging and orientation."
    },
    {
      "duty": "Updating project management software with milestone dates, correspondence, and documents."
    },
    {
      "duty": "Monitor delivery of owner furnished material to site."
    },
    {
      "duty": "Compiling and storing construction data from vendors."
    },
    {
      "duty": "Managing checklist including various checklists including substantial completion checks, safety, and quality."
    },
    {
      "duty": "Help to ensure monthly Billing and Pay Applications are correct."
    },
    {
      "duty": "Help to manage and implement new processes as required."
    },
    {
      "duty": "Provide daily support to the onsite construction managers in dealing with the many moving parts of a construction project."
    },
    {
      "duty": "Help manage the AWS change order process for all inflight activities and work daily with the general contractors Superintendents and Project Engineers to help keep the project on schedule."
    },
    {
      "duty": "Reduce cost, shorten the duration of delivery, and minimize defects in Data Center Builds."
    },
    {
      "duty": "Bring the job in at or below budget, on schedule, and with Zero Defects at Power Facilities Hand-Off."
    },
    {
      "duty": "Continuously deliver innovative, cost-effective, just in time Data Center capacity for global customers."
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 4
    },
    {
      "skill": "Project Management Software",
      "experience": 4
    },
    {
      "skill": "Construction Data Management",
      "experience": 4
    },
    {
      "skill": "Communication Coordination",
      "experience": 4
    },
    {
      "skill": "Method of Procedure (MOP)",
      "experience": 4
    },
    {
      "skill": "Vendor Onboarding",
      "experience": 4
    },
    {
      "skill": "Document Management",
      "experience": 4
    },
    {
      "skill": "Change Management",
      "experience": 4
    },
    {
      "skill": "Risk Management",
      "experience": 4
    },
    {
      "skill": "Vendor Management",
      "experience": 4
    },
    {
      "skill": "Billing and Pay Applications Management",
      "experience": 4
    },
    {
      "skill": "New Process Implementation",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 110,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "A four-year degree in a technical field such as engineering, construction management, or a trade school OR 4+ years of related construction experience in lieu of a degree."
    }
  ]
}