{
  "meta": [
    {
      "job_title": "Operations Analyst",
      "job_category": "Operations",
      "job_class": "Analyst",
      "sector": "Family Office Services",
      "salary": 48000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Complete various types of daily and monthly client account reconciliation services, across custodial and alternative investment accounts, using proprietary software technology, to ensure that data is accurate, and client service expectations are met."
    },
    {
      "duty": "Work closely with the Implementation and Global Access teams to understand the client’s portfolio and fund structure, as well as to ensure all required deliverables are complete."
    },
    {
      "duty": "Troubleshoot complex exceptions, complete new account setup and rebuild, provide data management for alternative assets, and review client reporting, to validate accuracy."
    },
    {
      "duty": "Collect and maintain security pricing details, in various formats from third party vendors, as well as broker quotes."
    },
    {
      "duty": "Manage the documentation of processes and procedures relating to individual client needs."
    },
    {
      "duty": "Communicate with appropriate internal teams or client teams to resolve open issues and questions, reaching out to internal technology support and vendor support, when needed, to resolve any production issues, or system support queries."
    }
  ],
  "skills": [
    {
      "skill": "Microsoft Excel",
      "experience": 3
    },
    {
      "skill": "Accounting Principles",
      "experience": 3
    },
    {
      "skill": "Investment Terminology",
      "experience": 3
    },
    {
      "skill": "Data Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Troubleshooting",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 110,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS in Accounting, Finance, Economics, Mathematics, or equivalent work experience."
    }
  ]
}