{
  "meta": [
    {
      "job_title": "Senior Vice President of Supply Chain & Manufacturing",
      "job_category": "Supply Chain",
      "job_class": "Vice President",
      "sector": "Supply Chain",
      "salary": 250000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Strategy",
      "experience": 10
    },
    {
      "skill": "International Sourcing",
      "experience": 10
    },
    {
      "skill": "Logistics Management",
      "experience": 10
    },
    {
      "skill": "Contract Manufacturing",
      "experience": 10
    },
    {
      "skill": "New Product Development",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Sales",
      "experience": 10
    },
    {
      "skill": "Financial Acumen",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Global Supply Chain Dynamics",
      "experience": 10
    },
    {
      "skill": "Cross-functional Team Leadership",
      "experience": 10
    },
    {
      "skill": "AI/ML/DL Technologies",
      "experience": 10
    },
    {
      "skill": "IoT (Internet of Things)",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead all aspects of Supply Chain for the asset-light company, including procurement, international sourcing, logistics and third-party inventory management, contract manufacturing, and new product development for the private label business in partnership with Marketing."
    },
    {
      "duty": "Work closely with and sell C-level leadership at suppliers and PE firms on the opportunities that Direct Supply brings to them via technology."
    },
    {
      "duty": "Design, develop, and implement innovative supply chain solutions with the team and focus on building future talent and capabilities for the company."
    },
    {
      "duty": "Build the corporate supply chain strategy to drive profitable growth while creating value for customers and supplier partners."
    },
    {
      "duty": "Lead and inspire the Supply Chain teams to deliver results and drive toward a shared vision across products, services, and platform businesses."
    },
    {
      "duty": "Collaborate with line of business executives on supply chain strategies that deliver business results."
    },
    {
      "duty": "Lead international contract manufacturing and the design and development of new products and offerings."
    },
    {
      "duty": "Build and execute comprehensive Supply Chain strategies that create innovative solutions and deliver growth in new and existing markets."
    },
    {
      "duty": "Own and foster key top to top supplier relationships that drive mutual growth objectives."
    },
    {
      "duty": "Apply macro trends and emerging technologies to solve complex customer problems leveraging AI/ML/DL/GEN.ai and IoT."
    },
    {
      "duty": "Lead cross-functional business teams to achieve strategic objectives."
    },
    {
      "duty": "Embrace and leverage technology (AI, Multi-sided Platforms, Cloud Computing, IOT) to deliver growth and improved profits across the supply chain."
    },
    {
      "duty": "Champion and foster legendary levels of service and high levels of quality throughout the supply chain and within the Supply Chain teams."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Supply Chain, Engineering or related field (Master’s Degree preferred)"
    }
  ]
}