{
  "meta": [
    {
      "job_title": "Director, InvestmentsDFW Market Lead",
      "job_category": "Real Estate",
      "job_class": "Director",
      "sector": "Management",
      "salary": 175000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Real Estate Valuation",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct all aspects of acquisitions, including sourcing, underwriting, fundraising, and dispositions within the Dallas-Fort Worth MSA."
    },
    {
      "duty": "Source and structure deals, identify investors, and lead transactions."
    },
    {
      "duty": "Oversee market research and site sourcing for acquisition opportunities. Manage analysis, underwriting, and make investment recommendations to internal investment committee."
    },
    {
      "duty": "Manage all due diligence, feasibility, and acquisition processes. Lead the creation of financial models, feasibility studies, due diligence, market analysis and related underwriting for potential property acquisitions."
    },
    {
      "duty": "Work with Founders and Investment Principal(s) to structure, secure, and manage debt and equity relationships for new acquisitions. Oversee investor communication and reporting for acquired projects."
    },
    {
      "duty": "Work with Asset Management team for the execution of business plans, ensuring optimization of assets and portfolio."
    },
    {
      "duty": "Negotiate all documents associated with the acquisition capital stack."
    },
    {
      "duty": "Create proposals, presentations, and financial reports for all real estate opportunities."
    },
    {
      "duty": "Partner with internal teams for client and investor meetings."
    },
    {
      "duty": "Drive enhancements and improvements in processes, procedures and use of systems to create operational efficiencies."
    },
    {
      "duty": "Cultivate strong relationships with external commercial brokers and prospective property sellers to gain access to off-market transactions as they become available."
    },
    {
      "duty": "Be involved in all aspects of the real estate transaction process."
    },
    {
      "duty": "Proxy for capital raising team at internal meetings and on conference calls."
    },
    {
      "duty": "Reports to Investments Principal(s) and Founders."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 50,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "BS/BA in Real Estate, Finance, or related field required"
    }
  ]
}