{
  "meta": [
    {
      "job_title": "Government Account Director",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Management",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a comprehensive government relations strategy to promote Sentient's products, especially ViDAR, within the U.S. DoD and other federal agencies."
    },
    {
      "duty": "Serve as the primary point of contact and representative for Sentient, building and maintaining strong relationships with key government officials, decision-makers, and influencers."
    },
    {
      "duty": "Collaborate with internal cross-functional teams, including business development, marketing, product development, and legal, to align government relations efforts with business goals and initiatives."
    },
    {
      "duty": "Monitor and analyze policy, regulatory, and procurement developments within the U.S. defense and security sectors, providing insights and recommendations to internal stakeholders."
    },
    {
      "duty": "Identify and develop new business opportunities by understanding customer needs and requirements and then coordinate and align the in-country business development team to prosecute the opportunities effectively."
    },
    {
      "duty": "Lead and coordinate advocacy efforts, including organizing meetings, briefings, demonstrations, and other engagement activities to showcase Sentient’s capabilities and support the in-country business development team."
    },
    {
      "duty": "Stay informed about industry trends, competitive landscape, and emerging technologies to ensure Sentient remains at the forefront of innovation and solutions for government clients."
    },
    {
      "duty": "Represent Sentient at industry conferences, events, and tradeshows, actively participating in relevant forums to promote the company's brand and thought leadership."
    },
    {
      "duty": "Prepare and deliver compelling presentations, proposals, and materials tailored to respective audiences to articulate the benefits and advantages of Sentient' products."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ]
}