{
  "meta": [
    {
      "job_title": "Director of Corporate Communications",
      "job_category": "Marketing",
      "job_class": "Director",
      "sector": "Communications",
      "salary": 170000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Marketing Communications",
      "experience": 5
    },
    {
      "skill": "Corporate Branding",
      "experience": 5
    },
    {
      "skill": "Employee Engagement",
      "experience": 5
    },
    {
      "skill": "Crisis Management",
      "experience": 5
    },
    {
      "skill": "Internal Communication",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Media Relations",
      "experience": 5
    },
    {
      "skill": "Public Relations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leading internal/external Corporate Communications including creating and distributing communications for quarterly Executive messaging, corporate newsletters, social media content, and other necessary company-wide communication."
    },
    {
      "duty": "Communicating on Environmental, Social Responsibility and Governance efforts (ESG), including promoting the Company’s significant environmental efforts, and leading corporate philanthropy and community engagement efforts."
    },
    {
      "duty": "Maintaining corporate website design and operation."
    },
    {
      "duty": "Designing and facilitating employee communication meetings that serve as a platform for executives to drive key messages into the organization."
    },
    {
      "duty": "Working closely with Human Resources supporting communication for our Employee Resource Groups (African Descent, Women’s Network, Pride, and Wellness), Centers of Expertise, inclusion & diversity leadership, and corporate advocacy communications."
    },
    {
      "duty": "Lead communications work supporting employee survey activity, drive employee engagement initiatives around Inclusion and Diversity, internship programs and all other areas of employee engagement."
    },
    {
      "duty": "Ensure employees are nominated for awards and recognition internally and externally, and support all efforts to provide proper recognition."
    },
    {
      "duty": "Collaborating with & supporting our business units (CooperVision and CooperSurgical) with their respective internal/external communication efforts to ensure alignment of messaging."
    },
    {
      "duty": "Developing and maintaining crisis management communication and protocols at a corporate level working closely with all stakeholders (divisions, HR, IR, Risk Management, EHS etc.). Provide guidance and support to Division level crisis teams as needed."
    },
    {
      "duty": "Over time, become responsible for providing leadership and direction to our global OneCooper efforts. Work closely with leaders throughout the company optimizing the OneCooper program (driving partnerships/teamwork, etc.)."
    },
    {
      "duty": "Identify opportunities for collaboration between business units to enhance the effectiveness of our business structure and processes."
    },
    {
      "duty": "Leading OneCooper meetings including an annual OneCooper Executive meeting."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree, preferably with a major or minor in Communications or similar. Advance degree or certifications preferred."
    }
  ]
}