{
  "meta": [
    {
      "job_title": "Manufacturing Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Manufacturing",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Manufacturing Process Design",
      "experience": 5
    },
    {
      "skill": "Product Launch",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Equipment Layout",
      "experience": 5
    },
    {
      "skill": "Manufacturing Systems Maintenance",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Material Flow Analysis",
      "experience": 5
    },
    {
      "skill": "TAKT and OEE Understanding",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Preventive Maintenance",
      "experience": 5
    },
    {
      "skill": "Capital Appropriation Requests",
      "experience": 5
    },
    {
      "skill": "Customer Site Work",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Carry out process improvements, problem resolution, project management and help with employee training."
    },
    {
      "duty": "Improve manufacturing processes and methods for cost-reduction, quality improvement and efficiency."
    },
    {
      "duty": "Prepare and present plans for above and coordinate deployment."
    },
    {
      "duty": "Perform research, design and development of manufacturing processes including production flow, assembly methods and production equipment."
    },
    {
      "duty": "Coordinate the manufacturing launch of new/revised products including establishing goals and evaluating results."
    },
    {
      "duty": "Participate in analysis of designs to determine areas of improvement."
    },
    {
      "duty": "Maintain plant documentation for designated product lines to include but not limited to PFMEA, Process Flow Diagrams and ODS forms."
    },
    {
      "duty": "Establish/maintain lineside racking in manufacturing areas."
    },
    {
      "duty": "Understand automation interfaces with robotics and vision systems that are used for manufacturing and Poke-Yoke Systems."
    },
    {
      "duty": "Attend and participate in SDT Meetings working with Program and Launch Managers to go over open issues lists and upcoming changes to assigned programs."
    },
    {
      "duty": "Prepare/maintain electronic floor layout drawings for current/future business and Continuous Improvement projects."
    },
    {
      "duty": "Lead equipment installation and relocation projects within the facility, including but not limited to air, power and floor space requirements."
    },
    {
      "duty": "Ability to work in a team environment and mentor other engineers in the department."
    },
    {
      "duty": "Perform process and material flow analysis."
    },
    {
      "duty": "Develop manufacturing process techniques, and equipment to improve productivity."
    },
    {
      "duty": "Improve manufacturing efficiency by analyzing and planning work flow, space requirements, and equipment layout."
    },
    {
      "duty": "Keep equipment operational by establishing and coordinating preventive maintenance and repair services."
    },
    {
      "duty": "Work closely with maintenance, engineering and operations team to identify and stock critical equipment spares."
    },
    {
      "duty": "Understand TAKT, equipment utilization and OEE; partners with Operations and Process Engineering to identify detractors and improve OEE."
    },
    {
      "duty": "Execute Capital Appropriation Requests with payback assessments for equipment."
    },
    {
      "duty": "Participate in design and build reviews for new equipment and drive improvement to machine design using lessons learned from previous launches"
    },
    {
      "duty": "Provide and support engineering assistance in quality problem solving activities."
    },
    {
      "duty": "Maintain reliable and safe manufacturing systems while improving production rates, efficiencies, yields, costs and changeover times."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Level Degree in Science, Engineering, Mechanical, Industrial, or Manufacturing or similar"
    }
  ]
}