{
  "meta": [
    {
      "job_title": "Client Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Customer Service",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Client Servicing",
      "experience": 1
    },
    {
      "skill": "Computer Applications",
      "experience": 1
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 1
    },
    {
      "skill": "Problem Solving",
      "experience": 1
    },
    {
      "skill": "Written and Verbal Communications",
      "experience": 1
    },
    {
      "skill": "Banking Solutions",
      "experience": 1
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 1
    },
    {
      "skill": "Time Management",
      "experience": 1
    },
    {
      "skill": "Attention to Detail",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide industry leading, personalized service to all clients by building rapport and providing timely solutions and/or alternatives."
    },
    {
      "duty": "Assist clients with inquiries and/or problem resolution in a professional and composed manner."
    },
    {
      "duty": "Provide banking solutions for clients expressed and unexpressed needs."
    },
    {
      "duty": "Inform and educate clients on self-service options through various Truist technologies to improve their individual banking experience."
    },
    {
      "duty": "Follow established policies, procedures, guidelines, regulations and laws to protect both our clients and Truist from any unnecessary risk."
    },
    {
      "duty": "Continued training in multiple lines of business to be able to work in multiple skill sets simultaneously."
    },
    {
      "duty": "Follow a daily set schedule that will require having efficient time management skills as well as a careful attention to detail."
    },
    {
      "duty": "May support Consumer, Small Business and Private Wealth Clients with products including: Digital/e-Services, Credit and Debit Cards, Mortgages, Loans, Demand Deposit, Time Deposit and Retirement accounts."
    },
    {
      "duty": "Other duties may be performed, both major and minor, which are not mentioned below. Specific activities may change from time to time."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma, or equivalent education and related training or experience"
    }
  ]
}