{
  "meta": [
    {
      "job_title": "Home Care Clinical Manager",
      "job_category": "Healthcare",
      "job_class": "Clinical Manager",
      "sector": "Healthcare",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Home Health Services",
      "experience": 5
    },
    {
      "skill": "Supervisory experience",
      "experience": 5
    },
    {
      "skill": "Clinical Staff Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate and oversee direct and indirect patient services for Home Health (certified) and Home Support (private duty) agencies."
    },
    {
      "duty": "Supervising the clinical staff and working with other departments to maintain high levels of customer service, communication, and care management."
    },
    {
      "duty": "Interpret operational indicators to detect census changes and increases or decreases in volume, which could impact staffing levels, revenues, or expenses, and maintain staff efficiency levels."
    },
    {
      "duty": "Monitor the quality of care provided by department staff and the quality and timeliness of documentation through record review, consultation, and joint home visits with employees."
    },
    {
      "duty": "Conduct case conferences with the clinicians and evaluate each case by reviewing the services provided, documentation, and discussing pertinent patient care and goals. Participate in quarterly record reviews and communicate findings and recommendations to Home Health Administrator and appropriate Home Health personnel. Participates in quality performance activities."
    },
    {
      "duty": "Assist in the planning, implementation, and evaluation of in-service and continuing education programs. Assure compliance with local, State, and Federal laws regarding licensure and certification of Home Health personnel and maintain compliance with the accrediting body if applicable."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Registered Nurse, Physical Therapist, Occupational Therapist, or Speech-Language Pathologists with current licensure in good standing to practice in the State (as required by State regulations). A minimum of 1 year of experience in Home Health or a related position. OASIS certification is preferred. BSN degree is preferred. Ability to effectively deal with multidisciplinary health care providers. Supervisory experience is strongly preferred."
    }
  ]
}