{
  "meta": [
    {
      "job_title": "Procurement Buyer II",
      "job_category": "Procurement",
      "job_class": "Buyer",
      "sector": "Manufacturing",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Procurement",
      "experience": 5
    },
    {
      "skill": "Manufacturing Resources Planning (MRP)",
      "experience": 5
    },
    {
      "skill": "Demand Planning",
      "experience": 5
    },
    {
      "skill": "Capacity Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Strategic Sourcing",
      "experience": 5
    },
    {
      "skill": "New Product Introduction",
      "experience": 5
    },
    {
      "skill": "Continuous Improvement",
      "experience": 5
    },
    {
      "skill": "Quality Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for purchase order placement, delivery assurance and other procurement related activities."
    },
    {
      "duty": "Builds and maintains relationships with select suppliers that support the Medford, NY facility."
    },
    {
      "duty": "Directs and manages all schedules, and purchase orders with supply base."
    },
    {
      "duty": "Ensures product is delivered on time, meets quality standards, and at the right cost."
    },
    {
      "duty": "Carries out processes and standards in support of Procurement, including RFPs, negotiations, cost accountability, program execution."
    },
    {
      "duty": "Prepares purchase orders and payment approvals to ensure the procurement process goes smoothly."
    },
    {
      "duty": "Responds to client inquiries about order status, changes, or cancellations to ensure customer satisfaction."
    },
    {
      "duty": "Contacts suppliers to schedule or expedite deliveries to ensure resolution of problems such as shortages and missed or late deliveries."
    },
    {
      "duty": "Compiles records of items purchased, costs, deliveries, product performance, and inventories, analyzes data and ensures account needs are met."
    },
    {
      "duty": "Monitors contract performance to ensure compliance with contractual obligations."
    },
    {
      "duty": "And other related duties as needed per direction from leadership."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Supply Chain Management, Business, or a related field (Master's preferred)."
    }
  ]
}