{
  "meta": [
    {
      "job_title": "Labor/Employment Defense Attorney",
      "job_category": "Legal",
      "job_class": "Attorney",
      "sector": "Legal",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Labor and Employment Law",
      "experience": 5
    },
    {
      "skill": "Litigation",
      "experience": 5
    },
    {
      "skill": "Legal Research",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Tech-Savvy",
      "experience": 5
    },
    {
      "skill": "Mentorship",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide expert legal counsel and representation to clients in labor and employment defense cases, including but not limited to wrongful termination, discrimination, harassment, wage and hour disputes, and employment contract matters."
    },
    {
      "duty": "Conduct thorough legal research, draft legal documents, pleadings, and motions, and present well-reasoned arguments in court proceedings."
    },
    {
      "duty": "Collaborate closely with clients to understand their objectives and provide strategic legal advice tailored to their specific situations."
    },
    {
      "duty": "Manage a caseload efficiently, meet deadlines, and maintain organized and accurate case files."
    },
    {
      "duty": "Participate in negotiations, settlements, and alternative dispute resolution proceedings with opposing parties and regulatory agencies."
    },
    {
      "duty": "Stay updated on changes in labor and employment laws and regulations in California, and ensure compliance in all legal matters."
    },
    {
      "duty": "Provide guidance and mentorship to junior attorneys, paralegals, and legal support staff."
    },
    {
      "duty": "Engage in business development efforts, including building and maintaining client relationships, attending networking events, and contributing to marketing initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Juris Doctor (J.D.) degree from an accredited law school"
    },
    {
      "credential": "Active membership and good standing with the California State Bar"
    }
  ]
}