{
  "meta": [
    {
      "job_title": "Claims Operations Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the operation of the Contract Implementation Analyst and Claims Liaison teams"
    },
    {
      "duty": "Oversee the claims operation function, including contracting and configuration"
    },
    {
      "duty": "Monitor staff performance to identify any process or quality gaps and develop/implement business solutions to correct issues"
    },
    {
      "duty": "Provide management with necessary data to expedite resolution of claims issues and support in policy decisions related to claims operations"
    },
    {
      "duty": "Serve as the subject matter expert in resolution of claims and configuration issues"
    },
    {
      "duty": "Manage the health plan’s workflow to assure timely, accurate submission and implementation of contracts"
    },
    {
      "duty": "Act as health plan interface on software product upgrades/implementations that affect contract implementation"
    },
    {
      "duty": "Promote change through establishment and sharing of best practices"
    },
    {
      "duty": "Interface with all organizational levels to mobilize commitment and ensure accurate configuration, contract implementation, and claims operations"
    }
  ],
  "skills": [
    {
      "skill": "Provider Relations/Services",
      "experience": 5
    },
    {
      "skill": "Provider Contracting",
      "experience": 5
    },
    {
      "skill": "Claims Administration",
      "experience": 5
    },
    {
      "skill": "Medicare and Medicaid Claims",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in related field or equivalent experience. 5+ years of provider relations/services, provider contracting and/or claims administration experience in a managed care environment. Experience with Medicare and Medicaid claims and contracting preferred."
    }
  ]
}