{
  "meta": [
    {
      "job_title": "Clinical Director",
      "job_category": "Healthcare",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and review special management programs and presents these programs to the multidisciplinary team, treatment committee, and/or group living staff."
    },
    {
      "duty": "Review and approve individual treatment plans and progress reports for all youth, especially those with mental health issues and receiving psychotropic medication."
    },
    {
      "duty": "Work closely with Case Management and the Clinical Team regarding the mental health needs of students, assisting in the behavior management of students with mental illness or mental issues."
    },
    {
      "duty": "Develop treatment program schedules and calendars with the approval of the Program Director. Coordinates scheduling of on-site therapeutic services (groups)."
    },
    {
      "duty": "Coordinate contracted services (psychological, psychiatric, specialized treatment, and community programs)."
    },
    {
      "duty": "Assure the continuity of care for students by making appropriate mental health referrals and providing necessary information and documentation for transition to receiving units, facilities, or agencies."
    },
    {
      "duty": "Monitor, evaluate, and correct the daily performance of all program staff. Provides ongoing clinical supervision to the therapeutic personnel regarding treatment and gender-specific issues."
    },
    {
      "duty": "Provide individual, group, and family services along with the documentation of these services."
    },
    {
      "duty": "Oversee and evaluate individual, group, family, and case management services provided by the therapeutic personnel."
    },
    {
      "duty": "Review and analyze current program elements, provides suggestions, and direction to the Site Management Committee and/or Program Director to ensure the highest standards are maintained to prevent illegal, unethical, or improper conduct and to ensure the program remains in compliance with agency licensing and Rite of Passage policies and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Masters Degree in Social Work or Human Services. Doctoral degree in Clinical Psychology (Psy.D. or Ph.D.) preferred. Current State licensure - LCSW, LMFT, or LPC along with CACIII preferred. Five years of clinical and administrative experience in a hospital or residential setting preferred. Demonstrated ability to manage multiple people and projects."
    }
  ]
}