{
  "meta": [
    {
      "job_title": "Shareholder Engagement and M&A Capital Markets Associate",
      "job_category": "Finance",
      "job_class": "Associate",
      "sector": "Investment Banking",
      "salary": 125000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Investment Banking",
      "experience": 5
    },
    {
      "skill": "Corporate Finance",
      "experience": 5
    },
    {
      "skill": "Market Knowledge",
      "experience": 5
    },
    {
      "skill": "Client Interaction",
      "experience": 5
    },
    {
      "skill": "Excel and PowerPoint",
      "experience": 5
    },
    {
      "skill": "Mergers and Acquisitions",
      "experience": 5
    },
    {
      "skill": "Report Generation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create, maintain, and review complex materials and analyses relating to shareholder activism, corporate governance, and trading activity."
    },
    {
      "duty": "Manage day-to-day execution of advisory mandates, interacting with senior deal team members, client management teams, transaction counterparties, and other advisors."
    },
    {
      "duty": "Work closely with the Global and North American heads of the practice to establish ongoing processes and procedures."
    },
    {
      "duty": "Develop proprietary knowledge and insights into trading activity and capital markets monitoring for clients."
    },
    {
      "duty": "Coordinate with the Digital Investment Bank to advance the development of new and insightful tools to further drive strategic client dialogue."
    },
    {
      "duty": "Leverage the bank's resources on behalf of the client, including industry knowledge from partners in industry coverage groups and expertise from product partners in debt and equity capital markets and corporate finance advisory."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree from a leading university; MBA is required for candidates not directly promoted from Analyst to Associate within a leading Investment Bank."
    }
  ]
}