{
  "meta": [
    {
      "job_title": "Senior Accountant",
      "job_category": "Accounting",
      "job_class": "Accountant",
      "sector": "Finance & Accounting",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Planning",
      "experience": 8
    },
    {
      "skill": "Budgeting",
      "experience": 8
    },
    {
      "skill": "Financial Analysis",
      "experience": 8
    },
    {
      "skill": "GAAP Compliance",
      "experience": 8
    },
    {
      "skill": "Accounting Competencies",
      "experience": 8
    },
    {
      "skill": "Cost Methodologies",
      "experience": 8
    },
    {
      "skill": "Nonprofit Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Uniform Guidance and OMB Circulars",
      "experience": 8
    },
    {
      "skill": "Excel",
      "experience": 8
    },
    {
      "skill": "Word",
      "experience": 8
    },
    {
      "skill": "Outlook",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver monthly financial reporting, analytics, and insight on performance metrics, benchmarking progress against targets, initiatives, and strategies."
    },
    {
      "duty": "Conduct analytical reviews for departmental and programmatic activities to support complex financial and budgetary forecasting; evaluates alternatives and makes recommendations."
    },
    {
      "duty": "Assist with analysis used for decision-making and recommendations to management and programs."
    },
    {
      "duty": "Analyze financial & operational results to understand and report underlying causes for performance and variance."
    },
    {
      "duty": "Assist with the agency budgeting and forecasts scenario planning based on changing assumptions in revenue, personnel, and other direct project costs."
    },
    {
      "duty": "Perform budget to actual variance analysis to identify causes, adjustments needed, trends, personnel reclassifications, potential budget shortfalls or cost overruns, and opportunities for cost savings."
    },
    {
      "duty": "Assist with weekly cash flow management reports and projections."
    },
    {
      "duty": "Prepare monthly, quarterly, annual, and ad-hoc financial statements with actual and projected financial positions."
    },
    {
      "duty": "Ensure the integrity of key processes by understanding systems, flow of transactions, internal controls, and recommending efficiency and effectiveness improvements."
    },
    {
      "duty": "Work with the Finance & Accounting team to identify areas or opportunities for improvement."
    },
    {
      "duty": "Support organizational and management practices as applied to the analysis, evaluation, development, and implementation of programs, policies, and procedures."
    },
    {
      "duty": "Perform variance analyses and account reconciliations as needed."
    },
    {
      "duty": "Assist with month-end closing, year-end closing and reconciliations, and preparation for the external audit and prepare necessary audit schedules as needed."
    },
    {
      "duty": "Ad Hoc requests and one-off projects and other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 255,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting or Finance is required"
    },
    {
      "credential": "Minimum 8+ years accounting experience with progressive and relevant and analytical budgeting, analysis, and reporting experience"
    },
    {
      "credential": "Minimum 5+ years in the nonprofit industry"
    },
    {
      "credential": "Knowledge and understanding of cost methodologies, budgeting concepts, practices, and procedures, and accounting competencies, including an understanding of revenue recognition"
    },
    {
      "credential": "Understanding of GAAP compliance and Uniform Guidance and OMB Circulars"
    },
    {
      "credential": "Excellent written and verbal communication and interpersonal skills"
    },
    {
      "credential": "Strong analytical, organizational, and time management skills"
    },
    {
      "credential": "Work well in a team approach environment"
    },
    {
      "credential": "Demonstrably strong judgment and decision-making skills"
    },
    {
      "credential": "Ability to multi-task and prioritize workflow"
    },
    {
      "credential": "Advanced in Excel and proficient Word and Outlook"
    },
    {
      "credential": "Desire to work in a fun, friendly, collaborative, and professional environment"
    },
    {
      "credential": "Passion for working in a non-profit, human services organization dedicated to helping individuals in need"
    },
    {
      "credential": "Experience with Financial Edge not required but preferred"
    }
  ]
}