{
  "meta": [
    {
      "job_title": "Sales and Service Coordinator",
      "job_category": "Sales",
      "job_class": "Coordinator",
      "sector": "Sales",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build and maintain professional rapport with clients, vendor and teammates by providing superior internal and external service support. Work as a supportive member of the sales and service teams."
    },
    {
      "duty": "Process new and renewal business within timelines and quality standards, including updating and maintaining information in the client management system."
    },
    {
      "duty": "Escalate issues of increased complexity, according to department standards, to the applicable internal contact."
    },
    {
      "duty": "Provide clients with timely information including plan information, rates, contributions, and carrier contacts."
    },
    {
      "duty": "Set up policy notebooks for delivery to client; assemble proposals and other presentations for client and prospect meetings."
    },
    {
      "duty": "Address and resolve client questions and issues."
    },
    {
      "duty": "Assist in preparation of new and renewal proposals; stewardship reports; service plans; comparisons, and demonstrates creativity in presentation style."
    },
    {
      "duty": "Support service and production team in reaching overall agency revenue and retention goals."
    },
    {
      "duty": "Maintain daily client processing functions such as endorsements, policies, audits, pending cancellations, ID cards."
    },
    {
      "duty": "Assist with all aspects of marketing, as needed."
    },
    {
      "duty": "Take report and monitor claims (if applicable)."
    },
    {
      "duty": "Document member and client communications in the client management services tool according to department standards."
    },
    {
      "duty": "Prepare presentations, spreadsheets, direct bill, accounting discrepancies and other communications based on the needs of the internal team and clients."
    },
    {
      "duty": "Assist clients with claims resolution."
    },
    {
      "duty": "Participate in company sponsored seminars, training workshops and webinars to enhance industry knowledge and education."
    },
    {
      "duty": "Other duties and responsibilities assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "skills": [
    {
      "skill": "Client Management",
      "experience": 5
    },
    {
      "skill": "Sales Support",
      "experience": 5
    },
    {
      "skill": "Marketing Assistance",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent"
    }
  ]
}