{
  "meta": [
    {
      "job_title": "Construction Safety Director",
      "job_category": "Construction",
      "job_class": "Director",
      "sector": "Construction",
      "salary": 125000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop annual safety business plan identifying specific goals, objectives and budget required to maintain and improve the company safety programs and performance."
    },
    {
      "duty": "Build and maintain positive working relationships with project staff, superintendents, foremen and craftsmen who are responsible for working productively and safely."
    },
    {
      "duty": "Conducts regular audits of each project site to access performance with company and OSHA standards."
    },
    {
      "duty": "Supervises all assigned safety personnel including both company employees and contract personnel. Schedules weekly/daily activities, provides evaluations and feedback to individuals and job site supervision."
    },
    {
      "duty": "Responsible for safety training and education for all levels of personnel within the company. Working with dispatcher, maintains safety training records and assure all personnel receive training/retraining per company standards."
    },
    {
      "duty": "Support the Human Resources Manager and the General Superintendent with the management of Workers Compensation cases. Collaborate with Human Resources Manager to maintain and update the OSHA 300 log."
    },
    {
      "duty": "Primary liaison with Cal OSHA for both enforcement and compliance. Communicates regularly with Voluntary Protection Program Representative and actively works to assure compliance and continuing participation in the program."
    },
    {
      "duty": "Performs accident or near miss investigations to analyze incidents to determine root cause and provide guidance to management on effective future controls. When a citation could be issued responds accordingly to reduce the company's exposure to fines or citations."
    },
    {
      "duty": "Schedules and chairs the quarterly Safety Committee and Accident review meetings."
    },
    {
      "duty": "Responsible for updating the company safety manual to comply with OSHA regulations. Keeps current any additional owner required safety manuals or services specific to working on these sites. Project prequalification requests and yearly qualifications regarding safety shall be updated and reviewed by the Safety Director."
    },
    {
      "duty": "Responsible for procuring OSHA permits. Secures and distributes Yearly Permits for the Company. Working with project superintendents, applies for project specific required permits."
    },
    {
      "duty": "Responsible for the development and implementation of emergency response plans."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree from two-year college or technical school; preferred Bachelor's degree from a four-year college/university or combination of education and equivalent experience, in a related field."
    },
    {
      "credential": "Construction Health and Safety Technician (CHST) minimum requirement."
    },
    {
      "credential": "Certified Safety Professional (CSP) certification desirable."
    },
    {
      "credential": "OSHA 500 certification a plus."
    },
    {
      "credential": "Valid CDL with a clean MVR."
    },
    {
      "credential": "OSHA 10 and OSHA 30"
    },
    {
      "credential": "Thorough knowledge of construction and general industry safety orders."
    },
    {
      "credential": "Outstanding oral and written communication skills."
    },
    {
      "credential": "Authorized OSHA 10 and 30-hour construction outreach instructor also desirable."
    },
    {
      "credential": "Bilingual Spanish skills a plus."
    }
  ]
}