{
  "meta": [
    {
      "job_title": "Strategy Business Manager",
      "job_category": "Management",
      "job_class": "Business Manager",
      "sector": "Management",
      "salary": 161500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Analysis",
      "experience": 7
    },
    {
      "skill": "Financial Planning",
      "experience": 7
    },
    {
      "skill": "Leadership Communications",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Data Synthesis",
      "experience": 7
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 7
    },
    {
      "skill": "Microsoft Office",
      "experience": 7
    },
    {
      "skill": "Productivity Tools",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the prioritization and analysis of key strategic questions that will influence the Deposits product roadmap."
    },
    {
      "duty": "Serve as Business Manager for the Deposits and Cash Management Business and support the General Manager of Deposits and Cash Management."
    },
    {
      "duty": "Structure and organize Business Reviews and leadership communications. Coordinate priority initiatives and ensure appropriate tracking and reporting."
    },
    {
      "duty": "Develop recommendations and defined business initiatives to be transitioned to the Product team."
    },
    {
      "duty": "Engage in special projects and strategic initiatives as appropriate. Assist with the development of Deposit and Cash Management strategic vision and success criteria."
    },
    {
      "duty": "Provide inputs for financial and operational planning, identify and track metrics to ensure achievement of priorities."
    },
    {
      "duty": "Prepare and guide executive presentations for Leadership at various forums, committees, business reviews and management meetings. Ensure organization of complex information in a strategic and compelling way."
    },
    {
      "duty": "Establish overall meeting cadence and management routines within Deposits and Cash Management. Build strong connections to key stakeholders across the firm to ensure clarity of objectives and alignment to overall strategic focus."
    },
    {
      "duty": "Coordinate key planning, team building, communication, and celebration events where appropriate."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Finance, Economics, or other related area (Master's preferred)"
    }
  ]
}