{
  "meta": [
    {
      "job_title": "Health Benefits Account Manager",
      "job_category": "Insurance",
      "job_class": "Account Manager",
      "sector": "Insurance",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Insurance Knowledge",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Account Management",
      "experience": 4
    },
    {
      "skill": "Health Insurance",
      "experience": 3
    },
    {
      "skill": "Medicare Insurance",
      "experience": 3
    },
    {
      "skill": "Verbal Communication",
      "experience": 4
    },
    {
      "skill": "Written Communication",
      "experience": 4
    },
    {
      "skill": "Critical Thinking",
      "experience": 4
    },
    {
      "skill": "Decision Making",
      "experience": 4
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    },
    {
      "skill": "Attention to Detail",
      "experience": 4
    },
    {
      "skill": "Data Entry",
      "experience": 4
    },
    {
      "skill": "Insurance Policy Analysis",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide quality professional service to group health insurance accounts."
    },
    {
      "duty": "Keep informed on current insurance markets, market trends and industry changes."
    },
    {
      "duty": "Participate in meetings, seminars, and classes for skill and knowledge development."
    },
    {
      "duty": "Be available to attend client meetings off-site as well as potentially travel out of state for multiple days."
    },
    {
      "duty": "Assist other team members as needed."
    },
    {
      "duty": "Facilitate minor claims resolution."
    },
    {
      "duty": "Facilitate enrollment and billing resolution."
    },
    {
      "duty": "Oversee accurate and timely policy and benefit plan implementation from beginning to end."
    },
    {
      "duty": "Process and submit enrollments, change requests, and terminations."
    },
    {
      "duty": "Review applications for accuracy."
    },
    {
      "duty": "Track and manage all activities on accounts."
    },
    {
      "duty": "Input and maintain all activities, documentation and client information in agency systems in a timely and accurate manner."
    },
    {
      "duty": "Provide clear direction to other team members assisting on assigned accounts."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Associate’s degree or equivalent from two-year college. High school diploma or equivalent is required. Prefer a minimum of three years of related experience in the health insurance industry."
    },
    {
      "credential": "Knowledge of individual health insurance and Medicare insurance as it relates to the enrollments, customer service, and related information."
    },
    {
      "credential": "Maintain a current California Health Insurance License."
    },
    {
      "credential": "High degree of critical thinking and decision-making skills. High degree of initiative and attention to detail. High degree of organization. Ability to perform duties in a high-pressured, high-volume, fast-paced environment. Self-motivated and ability to work independently with limited supervision or within a group or team. Complete knowledge of carriers, industry standard forms, and markets. Familiarity with general office procedures, including the use and ability to operate general office equipment. Familiarity and ability to accurately input data and operate PC in Windows Environment, with emphasis on Word, Outlook, and Excel."
    }
  ]
}