{
  "meta": [
    {
      "job_title": "HR Communications Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Human Resources",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HR Communications Strategy",
      "experience": 5
    },
    {
      "skill": "Internal HR Communications",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Brand Management",
      "experience": 5
    },
    {
      "skill": "Relationship Development",
      "experience": 5
    },
    {
      "skill": "Message Development",
      "experience": 5
    },
    {
      "skill": "Logistics Coordination",
      "experience": 5
    },
    {
      "skill": "Content Management",
      "experience": 5
    },
    {
      "skill": "Employee Engagement",
      "experience": 5
    },
    {
      "skill": "Video Production",
      "experience": 5
    },
    {
      "skill": "Knowledge Management",
      "experience": 5
    },
    {
      "skill": "Project Coordination",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute HR communications strategy to ensure consistency and cohesive messages across the organization."
    },
    {
      "duty": "Partner directly with key cross-functional partners to craft inspiring, engaging, and effective messages reinforcing our operating principles as they connect to upcoming changes and initiatives."
    },
    {
      "duty": "Drive exceptional internal HR communications practices."
    },
    {
      "duty": "Coordinate and attend all HR related events, informational booths and etc across all corporate hubs."
    },
    {
      "duty": "Support planning efforts and attend all HR meetings, including assisting with rehearsals, message development, and logistics."
    },
    {
      "duty": "Identify creative ways to communicate key HR initiatives."
    },
    {
      "duty": "Manage initiatives in HR Communications calendar."
    },
    {
      "duty": "Counsel internal partners on most effective communications strategies and tactics."
    },
    {
      "duty": "Uphold brand guidelines on all HR Comms."
    },
    {
      "duty": "Ability to quickly and cogently digest information across varied topics quickly and effectively, meeting tight deadlines across multiple projects."
    },
    {
      "duty": "Partner effectively with internal HR teams. Develop relationships with key HR stakeholders including FC HR, Talent Management, Talent Acquisition, HRIS, HRSS, HR Operations, Benefits among other business units."
    },
    {
      "duty": "Support other duties as assigned to support the HR Communications team."
    },
    {
      "duty": "Coordinate, attend and assist with all HR Video/Filming sessions."
    },
    {
      "duty": "Responsible for organizing and maintaining all HR Knowledge Base Articles up-to-date as needed, as well as uploading new content when requested."
    },
    {
      "duty": "Lead the Moments that Matter (MTM) program and coordinate with various teams across the organization as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Communications, Marketing, or Business (Master's preferred)"
    }
  ]
}