{
  "meta": [
    {
      "job_title": "Field Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction IQ",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Blueprint Reading",
      "experience": 4
    },
    {
      "skill": "Building Codes",
      "experience": 4
    },
    {
      "skill": "Time Management",
      "experience": 4
    },
    {
      "skill": "Attention to Detail",
      "experience": 4
    },
    {
      "skill": "Communication",
      "experience": 4
    },
    {
      "skill": "Budgeting",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise and coordinate on-site construction activities for assigned projects."
    },
    {
      "duty": "Monitor the completion of each construction phase through coordination, scheduling, and inspection of each home."
    },
    {
      "duty": "Ensure quality craftsmanship and customer satisfaction in accordance with Company goals and objectives."
    },
    {
      "duty": "Assist in budgeting time requirements to complete each phase of construction and meet deadlines by scheduling subcontractor work and deliveries."
    },
    {
      "duty": "Review, on a daily basis, the production of homes via inspections during various construction phases to ensure quality control."
    },
    {
      "duty": "Conduct pre-construction and pre-settlement meetings with home buyers; resolve customer service issues and production problems during the construction phase."
    },
    {
      "duty": "Assist in the control of production costs through review and approval of time sheets, production and service invoices, delivery, and inspection sheets."
    },
    {
      "duty": "Serve as the primary contact for trade partners, customers, and internal associates for each home being overseen."
    },
    {
      "duty": "Quickly and proficiently use real data to evaluate a problem and solve it within the organization’s policies and procedures."
    },
    {
      "duty": "Approach each day in a systematic and orderly way."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "2+ years of professional construction project management experience"
    },
    {
      "credential": "Bachelor’s degree in construction or related field (Preferred, not required)"
    },
    {
      "credential": "Current Driver’s License"
    }
  ]
}