{
  "meta": [
    {
      "job_title": "DocuSign App Support Administrator",
      "job_category": "IT",
      "job_class": "Administrator",
      "sector": "Software Engineering",
      "salary": 29000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "DocuSign Management",
      "experience": 2
    },
    {
      "skill": "Troubleshooting",
      "experience": 2
    },
    {
      "skill": "Training",
      "experience": 2
    },
    {
      "skill": "Reporting",
      "experience": 2
    },
    {
      "skill": "Vendor Management",
      "experience": 2
    },
    {
      "skill": "Technical Assistance",
      "experience": 2
    },
    {
      "skill": "Documentation",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Attention to Detail",
      "experience": 2
    },
    {
      "skill": "Multi-tasking",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage user entitlements and access levels on the Bank documentation management platform (DocuSign)"
    },
    {
      "duty": "Assist end users in troubleshooting process flows and identifying errors and solutions, with the assistance of the vendor or internal resources."
    },
    {
      "duty": "Manage DocuSign account, interacts with vendor and establishes all internal utilization level settings. Manages vendor relationships to ensure the platform is operating efficiently and without problems."
    },
    {
      "duty": "Provides training and technical assistance to in-house departmental users to help ensure smooth workflow and develop employees' skills. Prepares user notes and other custom documentation regarding system utilization, bottlenecks, and recommendations."
    },
    {
      "duty": "Coordinates applications access privileges for departmental staff, adds/removes users from account as necessary, manages permission profiles to meet business requirements. Manages and facilitates escalations to DocuSign enterprise support."
    },
    {
      "duty": "Generates ad-hoc reports as necessary using DocuSign web application."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or general education degree (GED) required."
    },
    {
      "credential": "Minimum 2 years of documentation review with within a financial institution."
    },
    {
      "credential": "Experience working with DocuSign"
    }
  ]
}