{
  "meta": [
    {
      "job_title": "Senior Graphic Designer",
      "job_category": "Design",
      "job_class": "Senior",
      "sector": "Marketing",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Digital Design",
      "experience": 5
    },
    {
      "skill": "Branding",
      "experience": 5
    },
    {
      "skill": "Typography",
      "experience": 5
    },
    {
      "skill": "Illustration",
      "experience": 5
    },
    {
      "skill": "Motion Design",
      "experience": 4
    },
    {
      "skill": "Photography/Videography",
      "experience": 4
    },
    {
      "skill": "Social Media Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Define and execute the brand’s visual identity for marketing campaigns and initiatives across digital, apparel, print, and video."
    },
    {
      "duty": "Design engaging and brand-consistent assets for use in digital experiences that will drive social buzz."
    },
    {
      "duty": "Be at the heart of youth culture trends, understand what speaks to Gen-Z, and translate it to creative."
    },
    {
      "duty": "Ensure assets look and feel consistent across all touchpoints (OTT, OOH, social, digital, e-com, wearables, retail, events, etc)."
    },
    {
      "duty": "Collaborate with brand/marketing to ensure culturally relevant, disruptive & defining brand moments."
    },
    {
      "duty": "Set the bar for elevated design on the team with strong skills across digital asset creation."
    },
    {
      "duty": "Conceptualize, mock-up, and execute designs with ease, understanding contemporary apparel trends."
    },
    {
      "duty": "Manage the 'day to day' asset creation, ensuring deadlines are met, and quality and expectations are achieved."
    },
    {
      "duty": "Brainstorm and bring ideas that support big picture endeavors as well as timely organic trends."
    },
    {
      "duty": "Contribute to a creative work environment and support the Creative Director on multiple projects."
    },
    {
      "duty": "Assist in photoshoot concepting, scheduling, and image retouching."
    },
    {
      "duty": "Communicate and give professional feedback to freelancers and outside collaborators."
    },
    {
      "duty": "Consistently research, identify, and share current industry design trends and competitive reviews as they relate to the brand."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Graphic Design, Visual Arts, or a related field (Master’s preferred)"
    }
  ]
}