{
  "meta": [
    {
      "job_title": "Freelance Writer",
      "job_category": "Writing",
      "job_class": "Writer",
      "sector": "Creative",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "SEO Writing",
      "experience": 3
    },
    {
      "skill": "WordPress",
      "experience": 3
    },
    {
      "skill": "Content Editing",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Time Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Produce high-quality, well-researched articles on various topics related to technology, gaming, and lifestyle, with a focus on engaging and informing the audience."
    },
    {
      "duty": "Adapt writing style to cover a broad range of subjects and ensure content is SEO-optimized and meets editorial guidelines."
    },
    {
      "duty": "Self-publish work on WordPress and collaborate with the editor to maintain factual accuracy, cleanliness of copy, and uphold quality."
    },
    {
      "duty": "Receive topics from the editorial team and generate a minimum of 25 well-researched and engaging articles per month, covering a variety of topics."
    },
    {
      "duty": "Review and edit own work for grammar, spelling, clarity, and adherence to editorial guidelines before submitting articles for review."
    },
    {
      "duty": "Provide credible references for all content created and collaborate with the editorial team to refine and improve content as needed."
    },
    {
      "duty": "Consistently meet assigned deadlines, effectively manage workload, and provide regular updates on project progress."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Journalism, English, Communication, or related field"
    }
  ]
}