{
  "meta": [
    {
      "job_title": "Business Systems Analyst",
      "job_category": "Information Technology",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Client Relationship Management",
      "experience": 4
    },
    {
      "skill": "ERP Implementation",
      "experience": 3
    },
    {
      "skill": "Business Process Analysis",
      "experience": 4
    },
    {
      "skill": "Software Training",
      "experience": 3
    },
    {
      "skill": "SaaS Experience",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Be a full-cycle ERP Business System Analyst for the North American market, providing our clients with a top-notch end-user implementation experience."
    },
    {
      "duty": "Manage client relationships while implementing Odoo SaaS solutions."
    },
    {
      "duty": "Analyze all aspects of clients' business operations to map their processes to Odoo's solutions."
    },
    {
      "duty": "Quantify the resources required for a task/project related to an Enterprise Resource Platform implementation."
    },
    {
      "duty": "Project manage ERP implementations to create systems that are then used by clients that want a product they love. Integration involves Sales, CRM, E-commerce, supply chain, manufacturing, inventory, POS, accounting, and more."
    },
    {
      "duty": "Collaborate with Odoo's developers to execute clients' business requirements."
    },
    {
      "duty": "Collaborate with clients' implementation managers on User Acceptance Testing and End User Training."
    },
    {
      "duty": "Occasionally advise the sales team during pre-sale regarding complex implementations."
    },
    {
      "duty": "Work with clients to train their end users on the Odoo platform."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree preferred or an equivalent combination of education and experience."
    }
  ]
}