{
  "meta": [
    {
      "job_title": "Acquisition Support Specialist",
      "job_category": "Acquisition",
      "job_class": "Specialist",
      "sector": "Defense",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Acquisition Documentation",
      "experience": 5
    },
    {
      "skill": "Standard Procurement System (SPS)",
      "experience": 5
    },
    {
      "skill": "Microsoft Word, Excel, and PowerPoint",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Navy/DOD Services Programs Experience",
      "experience": 5
    },
    {
      "skill": "Active SECRET US Government Clearance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in the development, review, and processing of acquisition documentation, generation of correspondence and briefings, coordination of actions and support of program meetings."
    },
    {
      "duty": "Work with program technical staff to translate program requirements into executable acquisition product including Procurement Requests, Acquisition Plans, and Acquisition Strategies."
    },
    {
      "duty": "Develop Procurement Requests utilizing the Standard Procurement System (SPS) including Statements of Work (SOWs), contract Sections B through L, generate Contract Data Requirements Lists (CDRLs) utilizing an excel CDRL generation tool."
    },
    {
      "duty": "Develop and monitor execution of Technical Instructions (TI’s)."
    },
    {
      "duty": "Plan and execute Acquisition team meetings from agenda and presentation development to recording of minutes and action item tracking through completion."
    },
    {
      "duty": "Work with program financial staff to develop/justify/defend program/task budgets and timely execution of funds."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree and 3-10 years of job-related experience.\nMust be able to be Standard Procurement System (SPS) trained and proficient within three (3) months of hire date.\nProficient in the use of Microsoft Word, Excel, and PowerPoint.\nGood written communication, organizational skills and the ability to perform detail-oriented work.\nMust have an Active SECRET US Government Clearance."
    },
    {
      "credential": "Contract Management support experience with Navy or other DOD services programs.\nCurrent user of the Standard Procurement System (SPS).\nCurrent Secret US Government Clearance."
    }
  ]
}