{
  "meta": [
    {
      "job_title": "General Manager Aviation",
      "job_category": "General Manager",
      "job_class": "Manager",
      "sector": "Aviation",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Snow Removal/Construction Experience",
      "experience": 2
    },
    {
      "skill": "People Management",
      "experience": 2
    },
    {
      "skill": "Account Management/Customer Service",
      "experience": 2
    },
    {
      "skill": "Scheduling/Dispatch",
      "experience": 2
    },
    {
      "skill": "Leadership",
      "experience": 2
    },
    {
      "skill": "Business Acumen",
      "experience": 2
    },
    {
      "skill": "Office Applications",
      "experience": 3
    },
    {
      "skill": "Safety Guidelines",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluates overall contract service delivery requirements, schedules for deficiencies, develops effective plans and creates recommendations for improvements."
    },
    {
      "duty": "Works closely with the Fleet Department to assess equipment needs according to active contract requirements, creates Fleet work orders for equipment maintenance and repairs."
    },
    {
      "duty": "Develops, implements, and monitors all aspects of the snow removal / operator program, including safety, recruitment, orientation, training, support, and recognition of operators."
    },
    {
      "duty": "Partners with Outworx support departments to ensure compliance and positive employee experiences."
    },
    {
      "duty": "Provides appropriate job information for all snow removal / equipment and personnel dispatched."
    },
    {
      "duty": "Solves problems for clients by understanding and exceeding their expectations."
    },
    {
      "duty": "Illustrates the value of products and services we offer to create growth opportunities."
    },
    {
      "duty": "Attend Base conferences, meetings and social functions while representing the Outworx brand."
    },
    {
      "duty": "Works with Sales to develop a networking and prospecting plan."
    },
    {
      "duty": "Collaborates with Sales on new business opportunities to help bring to contract close."
    },
    {
      "duty": "Replies promptly to customer inquiries for scheduling work, estimate appointment requests."
    },
    {
      "duty": "Maintains communication with key customers on a regular basis."
    },
    {
      "duty": "Ensures compliance of vendors and contractors providing snow removal service."
    },
    {
      "duty": "Reviews, analyzes, modifies, and implements efficient and effective department budgets, P&L statement, processes, policies, and procedures."
    },
    {
      "duty": "Maintains a working knowledge of all operating systems pertaining to the work area."
    },
    {
      "duty": "Keeps up to date on overall activities of the team, identifying problem areas and taking corrective actions."
    },
    {
      "duty": "Provides the work group clear and informative direction through timely feedback."
    },
    {
      "duty": "Enforces established safety guidelines; promotes a safe workplace."
    },
    {
      "duty": "Maintains accurate records and metrics, audits, as necessary."
    },
    {
      "duty": "Responds to external customer questions and resolve problems."
    },
    {
      "duty": "Performs other related duties as assigned by management."
    },
    {
      "duty": "Periodic travel either locally or nationally."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent work experience in business or related discipline."
    },
    {
      "credential": "At least 2 years Snow Removal / Construction Experience or equivalent."
    },
    {
      "credential": "At least 2 years in a people management role."
    },
    {
      "credential": "Previous Account Management/Customer Service experience is a plus."
    },
    {
      "credential": "Scheduling/Dispatch experience."
    },
    {
      "credential": "Demonstrated ability to manage priorities and workflow."
    },
    {
      "credential": "Proven leadership and business acumen skills."
    },
    {
      "credential": "Proven ability to handle multiple projects and meet deadlines."
    },
    {
      "credential": "Advanced understanding of basic office applications including Microsoft Office (Word, Excel, PowerPoint, Outlook)."
    },
    {
      "credential": "Versatility, flexibility, and a willingness to work within constantly changing priorities with enthusiasm."
    },
    {
      "credential": "Commitment to excellence and high standards."
    },
    {
      "credential": "Regularly required to stand; walk; sit; and talk, hear and see."
    },
    {
      "credential": "Long hours during snow removal operations with 24/7 availability."
    },
    {
      "credential": "Regularly/occasionally lift and/or move up to 40 pounds."
    }
  ]
}