{
  "meta": [
    {
      "job_title": "Healthcare Account Care Specialist",
      "job_category": "Healthcare",
      "job_class": "Customer Service",
      "sector": "Healthcare",
      "salary": 53000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Background",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Medical Billing and Coding",
      "experience": 3
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 3
    },
    {
      "skill": "Regulatory Knowledge",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "CRM Software Proficiency",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Engage in professional and empathetic inbound calls with doctors, patients, medical professionals, and healthcare providers to address inquiries, concerns, and issues related to medical billing, coding, denials, and healthcare escalations."
    },
    {
      "duty": "Provide clear and accurate information regarding medical billing and coding procedures, insurance claims, denial resolutions, and reimbursement processes."
    },
    {
      "duty": "Collaborate with internal teams to identify trends and work together to develop strategies for reducing denials and improving revenue cycle management."
    },
    {
      "duty": "Offer exceptional customer service by actively listening to providers' concerns and providing appropriate solutions while maintaining a high level of professionalism and empathy."
    },
    {
      "duty": "Document all interactions accurately and thoroughly within our customer relationship management (CRM) system."
    },
    {
      "duty": "Stay up-to-date with industry regulations, policies, and guidelines related to medical billing, coding, and healthcare escalations."
    },
    {
      "duty": "Participate in training sessions and continuous learning opportunities to enhance your knowledge and skills in the healthcare industry."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 80,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent (Bachelor's degree in a related field is a plus)"
    }
  ]
}