{
  "meta": [
    {
      "job_title": "Quality Assurance Auditor",
      "job_category": "Quality Assurance",
      "job_class": "Auditor",
      "sector": "Science",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Analytical Chemistry",
      "experience": 5
    },
    {
      "skill": "Laboratory Procedure",
      "experience": 5
    },
    {
      "skill": "Record Keeping",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Computer System Validation",
      "experience": 3
    },
    {
      "skill": "Electronic Data Capture",
      "experience": 3
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in performance of all Quality Assurance functions as outlined in the GLPs and PSL SOPs."
    },
    {
      "duty": "Assist the Quality Assurance Director as needed during inspections by EPA, FDA or clients."
    },
    {
      "duty": "Prepare records and assemble copies of documents requested by inspectors when advance notice is given and Sponsor and/or Laboratory Director approval is obtained."
    },
    {
      "duty": "Conduct in-process study inspections and general facility inspections in the chemistry laboratories as directed."
    },
    {
      "duty": "Audit raw data and proofread report and tables against raw data for accuracy and for typing corrections."
    },
    {
      "duty": "Amend and update Standard Operating Procedures as required using word processing system."
    },
    {
      "duty": "File all QAU-related paperwork as directed."
    },
    {
      "duty": "Select intervals for inspection for any regulatory test under the auditor's responsibility or as directed by QA Director, Laboratory Director, or President."
    },
    {
      "duty": "Perform such inspections in accordance with the test schedule."
    },
    {
      "duty": "When the time for conduct of intervals requiring inspection falls outside of normal working hours, this will be brought to the attention of the Study Director or QA Director in order that a suitable arrangement may be made."
    },
    {
      "duty": "Ability to safely wear a respirator required."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "B.S. degree in biology or related field and/or AALAS certification at the Technician level is also preferred."
    },
    {
      "credential": "Experience in other quality standards such as cGMP or GCP will also be considered."
    },
    {
      "credential": "Experience in computer system validation and electronic data capture is desirable but is not required."
    }
  ]
}