{
  "meta": [
    {
      "job_title": "Senior Counsel, Employment",
      "job_category": "Legal",
      "job_class": "Counsel",
      "sector": "Legal",
      "salary": 175000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Labor Employment Law",
      "experience": 5
    },
    {
      "skill": "Legal Counseling",
      "experience": 5
    },
    {
      "skill": "Litigation Management",
      "experience": 5
    },
    {
      "skill": "Contract Drafting",
      "experience": 5
    },
    {
      "skill": "Insurance Evaluation",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "International Law",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide legal advice on labor and employment matters, including terminations, separations, leave laws, background checks, onboarding, wage and hour, reasonable accommodations, policies, WARN Act, health & safety, internal investigations, and labor relations."
    },
    {
      "duty": "Oversee applicable outside counsels engaged to work on matters within purview and area of responsibilities, including billing and invoice analysis to ensure budgets and forecasts are accurate."
    },
    {
      "duty": "Draft and negotiate contracts, including employment agreements, independent contractor agreements, separation agreements, and other commercial contracts."
    },
    {
      "duty": "Serve as a trusted advisor to our People Team and global business stakeholders."
    },
    {
      "duty": "Provide support, counseling, and leadership around litigation projects to minimize the impact of litigation on the business, including initial internal discovery, investigations, subpoena requests, and assignment of projects to and coordination of outside counsel to achieve positive results and maximum efficiency and efficacy."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Admitted to practice law in California. Minimum of 5 years as a practicing attorney specializing in employment law and/or employment litigation experience. In-house experience at similar organizations is preferred. Experience with multi-state and international is a plus. Exceptional results orientation, with a high degree of personal initiative and leadership. Excellent project management skills and the ability to juggle multiple tasks in a fast-moving environment and re-prioritize with ease. Excellent data and analytical skills and a strong detail focus. Occasional domestic or international travel."
    }
  ]
}