{
  "meta": [
    {
      "job_title": "Business Analyst Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Business Analytics",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Business Strategy",
      "experience": 7
    },
    {
      "skill": "SQL",
      "experience": 6
    },
    {
      "skill": "Tableau",
      "experience": 6
    },
    {
      "skill": "People Management",
      "experience": 6
    },
    {
      "skill": "Statistical Analysis",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Excel",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of analysts, navigating PXT reporting and analysis owning substantial parts of team operations, strategy, and special analytics project management."
    },
    {
      "duty": "Designing analytical approach and deliver findings using data, visualizations, and effective storytelling techniques."
    },
    {
      "duty": "Creating new tools and business processes that simplify, standardize, and enable operational excellence."
    },
    {
      "duty": "Conducting research studies to test business hypotheses with statistical conclusions."
    },
    {
      "duty": "Translating findings into succinct, actionable business insights, often in coordination with partners to help you tell a holistic story."
    },
    {
      "duty": "Applying a breadth of tools and analytical techniques to answer a wide-range of high-impact people-related business questions."
    },
    {
      "duty": "Solving ambiguous problems by formulating and facilitating solutions that realize the needs and provide for the requirements arising in the organization."
    },
    {
      "duty": "Exhibiting excellence in execution by effectively leveraging program management skills, communicating with stakeholders to define and provide deliverables and timelines, all the while balancing and prioritizing across multiple and sometimes shifting priorities."
    },
    {
      "duty": "Capturing the right metrics to influence stakeholders and measure success. Occasional travel to internal meetings and fact-finding sessions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in quantitative field, (statistics, engineering, I/O psychology, mathematics, economics, Analytics)"
    }
  ]
}