{
  "meta": [
    {
      "job_title": "Clinical Research Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Clinical Trial Management",
      "experience": 5
    },
    {
      "skill": "IRB Compliance",
      "experience": 5
    },
    {
      "skill": "Patient Recruitment",
      "experience": 5
    },
    {
      "skill": "Data Collection and Analysis",
      "experience": 5
    },
    {
      "skill": "Regulatory Documentation",
      "experience": 5
    },
    {
      "skill": "Subject Interaction",
      "experience": 5
    },
    {
      "skill": "Clinical Research Ethics",
      "experience": 5
    },
    {
      "skill": "Protocol Management",
      "experience": 5
    },
    {
      "skill": "Medical Terminology",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide research support for IRB and IACUC approved research protocols."
    },
    {
      "duty": "Support the Department Head of the CID, Directorate for Professional Education, NMCP."
    },
    {
      "duty": "Support the Department Head of CID and is accountable for research matters to the PIs of each research protocol in accordance with federal and local regulatory guidelines."
    },
    {
      "duty": "Maintain and document contact with study subjects and research personnel from government agencies, granting agencies, industry sponsors."
    },
    {
      "duty": "Assist with maintaining adequate inventory of study supplies, including drugs, and devices, and preparation of other study materials."
    },
    {
      "duty": "Observe universal precautions and OSHA standards when processing or handling specimens."
    },
    {
      "duty": "Prepare reports and other correspondence regarding the research protocol for the IRB, granting agencies, industry sponsors and other organizations as required by regulation and/or the protocol."
    },
    {
      "duty": "Actively participate in CID departmental and command-wide research educational and training programs by providing instruction and presentation materials to assist research staff, as needed."
    },
    {
      "duty": "Collaborate with PI, study personnel and CID grants writer to source research funding for future protocols."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree from an accredited college or university"
    },
    {
      "credential": "Certified Clinical Trial Investigator (CCTI)"
    },
    {
      "credential": "Certified Clinical Research Coordinator (CCRC)"
    },
    {
      "credential": "Certified Clinical Research Professional (CCRP) from the Association of Clinical Research Professionals (ACRP) or the Society of Clinical Research Associates (SoCRA)"
    }
  ]
}