{
  "meta": [
    {
      "job_title": "Senior Community Manager",
      "job_category": "Community Management",
      "job_class": "Manager",
      "sector": "Property Management",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead, direct, and control all facets of community to ensure quality services and a high degree of customer satisfaction by to Bell Apartment Living standards and policies, while working within budgetary guidelines."
    },
    {
      "duty": "Recruit, hire, manage and provide performance feedback to employees on all assigned properties to ensure community performance and adequate staffing."
    },
    {
      "duty": "Motivate associates through recognition programs, training, and team building."
    },
    {
      "duty": "Train staff members on proper leasing techniques and resident service."
    },
    {
      "duty": "Conduct regular performance appraisals and address any associate concerns or employee relations issues for all assigned properties."
    },
    {
      "duty": "Maintain complete and accurate associate files and a high level of associate satisfaction, as measured by periodic surveys."
    },
    {
      "duty": "Develop and administer budgets for property."
    },
    {
      "duty": "Evaluate unit prices in accordance with the market and budgeted goals for property."
    },
    {
      "duty": "Develop an annual marketing plan and conduct marketing reviews on a monthly basis for property."
    },
    {
      "duty": "Obtain bids for all contract services and oversee routine capital projects for property."
    },
    {
      "duty": "Ensure that the onsite staff provides the highest level of service to residents on property."
    },
    {
      "duty": "Responsible for 35% of leasing activities on property."
    },
    {
      "duty": "Regular attendance and punctuality."
    }
  ],
  "skills": [
    {
      "skill": "Property Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Marketing Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS in Business, Sales, or related field, relevant experience or a combination."
    }
  ]
}