{
  "meta": [
    {
      "job_title": "Director of HR Operations",
      "job_category": "Human Resources",
      "job_class": "Director",
      "sector": "HR",
      "salary": 135000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic HR Management",
      "experience": 8
    },
    {
      "skill": "Talent Acquisition",
      "experience": 8
    },
    {
      "skill": "Compliance Management",
      "experience": 8
    },
    {
      "skill": "HR Technology Management",
      "experience": 8
    },
    {
      "skill": "Change Management",
      "experience": 8
    },
    {
      "skill": "Vendor Relationship Management",
      "experience": 8
    },
    {
      "skill": "Data Auditing",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement HR operations strategies aligned with the company's overall goals and objectives."
    },
    {
      "duty": "Collaborate with the executive team to provide insights and recommendations on HR-related matters that impact the business."
    },
    {
      "duty": "Continually drive HR initiatives at a fast pace to keep up with business demand."
    },
    {
      "duty": "Design, review, and update HR policies, procedures, and guidelines to ensure compliance with employment laws and industry best practices."
    },
    {
      "duty": "Maintain a comprehensive understanding of relevant regulations and lead efforts to adapt policies accordingly."
    },
    {
      "duty": "Evaluate, implement, and manage HR technology systems, tools, and processes that streamline HR operations, including HRIS, payroll, time and attendance, and benefits administration."
    },
    {
      "duty": "Oversee the onboarding, offboarding, and exit interview process, analyze trends, and provide recommendations for improvement."
    },
    {
      "duty": "Oversee the day-to-day management of the HRIS (currently ADP), including system configuration, data integrity, security, and user support."
    },
    {
      "duty": "Develop and deliver training programs and materials to educate the leadership team and end-users on HRIS functionality, processes, and best practices."
    },
    {
      "duty": "Manage vendor relationships and contracts, ensuring service level agreements are met and issues are resolved promptly."
    },
    {
      "duty": "Lead change management initiatives related to HR processes, systems, and policies. Support the organization in adapting to changes and maintaining a positive employee experience during transitions."
    },
    {
      "duty": "Conduct regular audits to ensure data accuracy and compliance, implementing corrective actions as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 30,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Human Resources, Business Administration, or a related field; Master's degree preferred."
    }
  ]
}