{
  "meta": [
    {
      "job_title": "Senior Grants/Financial Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Data Management",
      "experience": 5
    },
    {
      "skill": "Financial Accounting",
      "experience": 5
    },
    {
      "skill": "Cost Principles",
      "experience": 5
    },
    {
      "skill": "Grant Compliance",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Automation Skills",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage all restricted grants and projects by leading the budgeting, forecasting, tracking, and reporting efforts."
    },
    {
      "duty": "Work collaboratively with the Grants Manager and other Department Managers to build actionable budgets and forecasts."
    },
    {
      "duty": "Track revenue and spend to measure progress against budgets and produce reports for various stakeholders."
    },
    {
      "duty": "Ensure the allocation of expenses against grant budgets in compliance with grant terms and maintain reports in the organization's accounting system."
    },
    {
      "duty": "Prepare financial reports and budget modifications with Conservancy Managers and Finance Director."
    },
    {
      "duty": "Perform accounting and financial functions, including preparing monthly reports and budget and expense analysis."
    },
    {
      "duty": "Monitor grant-related financial activities and journal entries, including revenue and indirect expense allocations."
    },
    {
      "duty": "Allocate direct and indirect expenses to various grants in the accounting system and assist with grant closeout procedures."
    },
    {
      "duty": "Enhance the process to perform monthly journal entries to allocate costs across expense accounts and be the go-to person for questions regarding the organization’s budgets and grants."
    },
    {
      "duty": "Provide budgets and grant-related financial analysis as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree (BA/BS) in accounting, finance, business, or equivalent from a four-year college or technical school; or five years related experience and/or training; or equivalent combination of education and experience. Knowledge of accounting principles is required."
    }
  ]
}