{
  "meta": [
    {
      "job_title": "Li-ion Battery Electrochemical Modeling Lead Engineer",
      "job_category": "Engineering",
      "job_class": "Engineering Lead",
      "sector": "Software Engineering",
      "salary": 250000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Physics-based Modeling",
      "experience": 10
    },
    {
      "skill": "Battery Materials Knowledge",
      "experience": 10
    },
    {
      "skill": "Cell Aging Mechanism Identification",
      "experience": 10
    },
    {
      "skill": "Experimental Techniques",
      "experience": 10
    },
    {
      "skill": "Numerical Methods",
      "experience": 10
    },
    {
      "skill": "Simulation Tools",
      "experience": 10
    },
    {
      "skill": "Programming",
      "experience": 10
    },
    {
      "skill": "PDEs and ODEs",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead technical efforts to develop and implement advanced electrochemical models for Li-ion batteries."
    },
    {
      "duty": "Collaborate with multi-functional teams to integrate models into battery design and development processes."
    },
    {
      "duty": "Develop and maintain simulation tools for predicting battery performance, aging, and failure modes."
    },
    {
      "duty": "Conduct research and stay up to date on new technologies and approaches for battery modeling and simulation."
    },
    {
      "duty": "Use simulation results to guide design decisions and optimize battery performance, reliability, and safety."
    },
    {
      "duty": "Develop and implement test plans to validate model accuracy and improve model fidelity."
    },
    {
      "duty": "Communicate technical concepts and results to internal and external partners."
    },
    {
      "duty": "Mathematical modeling of the electrochemical behavior of lithium-ion cells using reduced order models such as single particle model, P2D model as well as 3D detailed Comsol and coupled multi-physics models."
    },
    {
      "duty": "Work on modeling capabilities development to enable simulation-driven design guidance in the early cell architecture phase."
    },
    {
      "duty": "Support battery modeling work for all product lines: iPhone, Watch, Mac, iPad, Audio."
    },
    {
      "duty": "Work with Cell Engineering, Cell design, and BMU teams to provide support for all NPI programs."
    },
    {
      "duty": "Conduct literature review to identify topics of interest for internal research and development."
    },
    {
      "duty": "Collaborate with universities and external labs to develop new techniques and explore new research areas to drive future technologies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. +10 years of relevant industry experience in physics-based modeling of thermo-electrochemical and mechanical performance/safety characterization of lithium cells. Ph.D. in Material Science, Electrochemistry, Chemical Engineering, or related, strongly preferred."
    }
  ]
}