{
  "meta": [
    {
      "job_title": "Director, Salesforce/MuleSoft Engineering",
      "job_category": "Engineering",
      "job_class": "Director",
      "sector": "Software Engineering",
      "salary": 185000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Software Engineering",
      "experience": 12
    },
    {
      "skill": "Mentoring",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Agile Methodology",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Technical Architecture",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Enterprise Architecture",
      "experience": 5
    },
    {
      "skill": "Cybersecurity",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the delivery of secure and sound Core Banking Engineering solutions to the business and members."
    },
    {
      "duty": "Provide direction, prioritization, and organization of the Applications Core Banking Engineering team's work based on enterprise priorities and timelines."
    },
    {
      "duty": "Mentor and develop staff using a supportive and collaborative approach."
    },
    {
      "duty": "Deliver projects on time, within budget, and to specifications."
    },
    {
      "duty": "Develop professional roadmaps for employees that foster leadership development and technical skills."
    },
    {
      "duty": "Collaborate with Cyber Security, Infrastructure, Compliance, and other departments within the credit union to meet strategic goals."
    },
    {
      "duty": "Respond to and implement action plans for audits from internal or external auditors."
    },
    {
      "duty": "Maintain expert knowledge of credit union/banking technologies and recommend changes to benefit the credit union, members, and staff."
    },
    {
      "duty": "Work with IT management for forecasting, budget projections, budget preparation, and project expenses management."
    },
    {
      "duty": "Ensure the department conforms to Enterprise Risk, Internal Audit, and NCUA guidance on project management and software development."
    },
    {
      "duty": "Help safeguard PenFed's computer and IT systems by monitoring staff adherence to all security policies and related training."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Business or a related field is required. Advance Degree or equivalent is preferred."
    }
  ]
}