{
  "meta": [
    {
      "job_title": "Regional Human Resource Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 128000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Human Resources",
      "experience": 8
    },
    {
      "skill": "Talent Management",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Employee Relations",
      "experience": 8
    },
    {
      "skill": "Operational Execution",
      "experience": 8
    },
    {
      "skill": "Employment Law",
      "experience": 8
    },
    {
      "skill": "Team Building",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Change Management",
      "experience": 8
    },
    {
      "skill": "Risk Management",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive talent planning, development, and engagement while maximizing associate productivity through the optimization of talent."
    },
    {
      "duty": "Strategize, plan, and prioritize to provide optimal support to the portfolio of stores."
    },
    {
      "duty": "Lead ownership and implementation of HR initiatives, acting as a subject matter expert in company policies, programs, and operational processes."
    },
    {
      "duty": "Provide objective, quality guidance and oversight on employee relations issues."
    },
    {
      "duty": "Identify opportunities and collaborate with business partners to drive continuous improvement."
    },
    {
      "duty": "Act as a proactive, solution-oriented business partner at all levels, providing guidance and quality decision-making that adheres to core principles."
    },
    {
      "duty": "Partner to develop and drive regional engagement strategy and promote a culture of safe and secure stores."
    },
    {
      "duty": "Uses data to set priorities, translate goals into action plans, and consistently pushes self and others for results."
    },
    {
      "duty": "Acquire and retain the right talent, train, coach, and provide feedback to develop team and position them for growth."
    },
    {
      "duty": "Acts with customers in mind, understands and teaches how operational execution directly affects the customer experience, and is dedicated to meeting the expectations and requirements of internal and external customers."
    },
    {
      "duty": "Makes the company vision sharable by everyone, inspires and motivates entire units, is forward-looking, and talks beyond today."
    },
    {
      "duty": "Sees ahead clearly, can anticipate future consequences and trends, has broad knowledge and perspective, and can create effective and advanced strategies and plans."
    },
    {
      "duty": "Can effectively cope with and lead through change, decide and act without having the total picture when necessary, and can comfortably handle risk and uncertainty."
    },
    {
      "duty": "Ensures compliance with all policies, procedures, and laws."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors/Associates Degree preferred or High School graduate/Equivalent, HR certification preferred"
    }
  ]
}