{
  "meta": [
    {
      "job_title": "Electrical Equipment Systems Supervisor",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Electrical Engineering",
      "experience": 7
    },
    {
      "skill": "Substation Equipment Maintenance",
      "experience": 7
    },
    {
      "skill": "NERC Compliance",
      "experience": 7
    },
    {
      "skill": "Technical Writing",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Environmental Regulations",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise substation equipment reliability needs and environmental compliance activities for commercial operations."
    },
    {
      "duty": "Establish and monitor system-wide substation NERC compliance testing policy."
    },
    {
      "duty": "Coordinate special testing services for power stations equipment and system protection."
    },
    {
      "duty": "Provide technical analysis of testing results for dissolved gas in oil analysis, relays, and major electrical equipment."
    },
    {
      "duty": "Determine levels of spare substation equipment transformers, breakers, regulators, bushings, coupling capacitors, relays, and lighting arrestors."
    },
    {
      "duty": "Coordinate review and evaluation of project authorization and operating one-line diagrams."
    },
    {
      "duty": "Authorize routine and emergency movement of major substation equipment, transformers, circuit breakers, and regulators."
    },
    {
      "duty": "Work with contract service providers on transformer assemblies and processing."
    },
    {
      "duty": "Prepare bids, evaluate proposals, and review completed work."
    },
    {
      "duty": "Ensure compliance with environmental regulations governing commercial operations."
    },
    {
      "duty": "Support PJM committees for substation or system protection activities."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Electrical Engineering or a related field (Master's preferred)"
    },
    {
      "credential": "Completion of the Electrical Equipment Training Program"
    }
  ]
}