{
  "meta": [
    {
      "job_title": "Lead Technician",
      "job_category": "Engineering",
      "job_class": "Technician",
      "sector": "Energy",
      "salary": 74000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Performs routine preventative and predictive maintenance as assigned Support repair and preventative maintenance on all plant equipment Operates the plant equipment in accordance with standard operating procedures during routine and upset situations Study and qualify on all systems within a Geothermal and Solar Power Plant. Responsible to support LOTO on equipment and systems that an official qualification has been completed. Safe operation of plant heavy equipment i.e. man lift, forklift Timely completion of position related special projects as deemed appropriate and assigned by the Site Manager. Responsible for housekeeping of those areas assigned to the maintenance department Work within SAP PM for time confirmations, material consumptions, service entry sheets, notification creation."
    },
    {
      "duty": "Understanding of thermodynamic and basic electrical principles A valid driver’s license operable in all 50 states and Canada and a clean driving record. A clean driving records means: In the last 3 years, no driving-related suspension, revocation or cancellation, no disqualifying offenses, no more than 2 moving violations and no reckless driving incidents. In the last 5 years, no major driving offenses including DUI/DWI, refusal to test, leaving the scene, driving a commercial vehicle without a CDL, or at-fault fatal accident. Up to 25% of domestic travel."
    },
    {
      "duty": "High School Diploma or GED Understanding of thermodynamic and basic electrical principles Mechanically inclined with ability to operate equipment Successful completion of plant operations qualifications program"
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High School Diploma or GED Understanding of thermodynamic and basic electrical principles Mechanically inclined with the ability to operate equipment Successful completion of plant operations qualifications program"
    }
  ]
}