{
  "meta": [
    {
      "job_title": "Field Service Engineer Manager",
      "job_category": "Field Service Engineering",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Technical Support",
      "experience": 10
    },
    {
      "skill": "Program Management",
      "experience": 10
    },
    {
      "skill": "Training and Development",
      "experience": 10
    },
    {
      "skill": "Troubleshooting",
      "experience": 10
    },
    {
      "skill": "Quality Management",
      "experience": 10
    },
    {
      "skill": "Customer Handling",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Trend Analysis",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and manage a team of nationwide field engineers, providing support for retail enrollment locations, technology equipment, software, and staff."
    },
    {
      "duty": "Provide expert technical support and analysis to retail locations staff and field engineers and technicians."
    },
    {
      "duty": "Develop and update training programs to provide field support regarding technical, programmatic, and operational aspects of services enabled with technology in the field."
    },
    {
      "duty": "Ensure quality management of field operations to assure retail site staff and field engineers are meeting all service levels and performance objectives."
    },
    {
      "duty": "Review system and network configurations to ensure successful implementation of services into production."
    },
    {
      "duty": "Stay up to date on the latest Government and industry trends and technology developments."
    },
    {
      "duty": "Lead, mentor, and coordinate with members of multi-functional field teams deployed across the nation."
    },
    {
      "duty": "Recommend products, technologies, partners, etc. that will better position the company for growth."
    },
    {
      "duty": "Be proficient in the use of online tools necessary for end-to-end lifecycle management of technology, program reporting, personnel management, and project management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's (or equivalent) with 10-12 years of experience, or a Master's with 8-10 years of experience, with 4 years or more of supervisory experience"
    }
  ]
}