{
  "meta": [
    {
      "job_title": "Sr. Project Manager",
      "job_category": "Project Management",
      "job_class": "Senior Manager",
      "sector": "Management",
      "salary": 105000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    },
    {
      "skill": "Scrum",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 7
    },
    {
      "skill": "IT Project Management",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Problem-Solving",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Negotiation",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Change Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and lead one or more large, complex IT projects under the direction of the client, IT Team Lead, and stakeholders."
    },
    {
      "duty": "Collaborate with project team members to ensure compliance with IT business processes, standards, and methodologies."
    },
    {
      "duty": "Create and refine the product backlog, plan sprints, and track work assignments in Azure DevOps within a hybrid Agile environment."
    },
    {
      "duty": "Develop and maintain Project Charter, Project Plan, and Project Schedule with a Work Breakdown Structure (WBS) and associated costs for the complete project life cycle."
    },
    {
      "duty": "Coordinate and facilitate meetings with project team members and stakeholders."
    },
    {
      "duty": "Lead Agency designated project teams to develop, maintain, support, and enhance custom software applications following approved project governance structure."
    },
    {
      "duty": "Capture, track, and disseminate information related to project issues and risks with contingency and mitigation plans defined by teams and the project charter."
    },
    {
      "duty": "Report and communicate project status to project team members and stakeholders."
    },
    {
      "duty": "Coordinate completion of work with team members and other Agency vendors to implement system improvements and/or new systems."
    },
    {
      "duty": "Develop and update plans to design, test, and pilot required systems. Develop and execute software test plans as needed."
    },
    {
      "duty": "Develop and update a training plan, including developing training material(s). Identify and manage technical and non-technical issues and risks that could impact the project."
    },
    {
      "duty": "Coordinate with the designated Lead Applications Development Supervisor to promote production deployments using the Agency’s change control process. Adapt to changes in daily work plans based on customer support needs. Adhere to all security policies and procedures in the use of the Agency network and resources."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in IT, Project Management, Business, or a related field (Master's preferred)"
    }
  ]
}