{
  "meta": [
    {
      "job_title": "Architectural Project Manager",
      "job_category": "Architecture",
      "job_class": "Project Manager",
      "sector": "Architecture",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "AutoCAD/Revit",
      "experience": 8
    },
    {
      "skill": "Budget Management",
      "experience": 8
    },
    {
      "skill": "Client Management",
      "experience": 8
    },
    {
      "skill": "Architectural Principles",
      "experience": 8
    },
    {
      "skill": "Zoning and Building Codes",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Written and Oral Communication",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage multiple small to midsize architectural projects from initiation to completion, ensuring efficient and cost-effective execution."
    },
    {
      "duty": "Coordinate all project efforts, administrative and technical, to meet project goals and client satisfaction."
    },
    {
      "duty": "Prepare strategic plans to achieve project success, including scope of work, budgets, and schedules."
    },
    {
      "duty": "Estimate fees, determine scope of work, and prepare proposals and contracts for architectural projects."
    },
    {
      "duty": "Supervise a small staff of designers and technicians, providing guidance and fostering collaboration."
    },
    {
      "duty": "Apply diverse knowledge of architectural principles and practices in a broad array of assignments and related fields."
    },
    {
      "duty": "Communicate effectively with clients, municipal officials, and contractors to ensure project success and compliance with regulations."
    },
    {
      "duty": "Hold responsibility for finished plans, specifications, and approval of materials and construction for architectural projects."
    },
    {
      "duty": "Take initiative to learn new architectural skills and stay updated with industry trends and best practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Architecture from an accredited program (Licensure preferred)"
    }
  ]
}