{
  "meta": [
    {
      "job_title": "Loan Data Quality Specialist",
      "job_category": "Mortgage",
      "job_class": "Specialist",
      "sector": "Underwriting & Compliance",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Verification",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "Mortgage Lending Regulations",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Docusign",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review loan packets to ensure that they are complete and accurate."
    },
    {
      "duty": "Check loan documents and data for consistency and completeness."
    },
    {
      "duty": "Verify loan data entered into the system to ensure that it is accurate."
    },
    {
      "duty": "Review loan files for compliance, regulatory, and internal policies and procedures."
    },
    {
      "duty": "Identify and resolve data discrepancies or inaccuracies in loan packets, which may involve communicating with borrowers, lenders, and other parties."
    },
    {
      "duty": "Assist in identifying and resolving issues related to loan data and documentation."
    },
    {
      "duty": "Collaborate with underwriters, closers, and other stakeholders to ensure timely and accurate completion of review process."
    },
    {
      "duty": "Passionate about creating better consumer outcomes and solving the affordable housing crisis."
    },
    {
      "duty": "Team player that is process & detail oriented."
    },
    {
      "duty": "Self-motivated to surpass challenges and strive for improvement."
    },
    {
      "duty": "Enthusiasm to rally others to company objectives."
    },
    {
      "duty": "Delivering the value of tech transparency to an inefficient but growing market."
    },
    {
      "duty": "Improving the lives of over 22 million Americans who live in manufactured homes today."
    },
    {
      "duty": "Expanding access to new homeownership at a time of intense housing insecurity."
    },
    {
      "duty": "Empowering a growing team and ensuring they play their part in providing our homeowners with the incredible experience they deserve."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree or extended relevant work experience."
    }
  ]
}