{
  "meta": [
    {
      "job_title": "Director of Guest Experience",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Entertainment",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute all Guest Experience plans for events."
    },
    {
      "duty": "Support the overall business objectives of Enterprise Center & Stifel Theatre."
    },
    {
      "duty": "Enforce a vibrant guest-focused culture and maintain the safety of all guests, staff, clients, and performers in the venues."
    },
    {
      "duty": "Mentor and model safety techniques for GE managers."
    },
    {
      "duty": "Direct GE staff in managing large crowds under constantly changing event environments."
    },
    {
      "duty": "Support the Guest Experience department through leadership, training, support, and guidance."
    },
    {
      "duty": "Oversee staff & NPO recruiting, onboarding, training, and recognition programs."
    },
    {
      "duty": "Manage expenses within annual approved GE budget and facilitate a strong working relationship with the People & Culture department."
    },
    {
      "duty": "Plan and lead weekly/monthly GE meetings to ensure smooth coordination of events and procedures."
    },
    {
      "duty": "Equip & empower the GE managers to lead, coach, mentor, and manage GE staff."
    },
    {
      "duty": "Ensure compliance and administration of union labor contract and negotiate future contracts."
    },
    {
      "duty": "Enforce venue rules, regulations, policies, and procedures as necessary."
    },
    {
      "duty": "Ensure compliance with the American with Disabilities Act (ADA) during events."
    },
    {
      "duty": "Pro-actively prevent negative guest experiences and resolve any escalated guest complaints/concerns."
    },
    {
      "duty": "Responsible for resolving staff-related issues and working in conjunction with various stakeholders."
    },
    {
      "duty": "Position requires ability to work a flexible schedule, including evenings, weekends, and holidays."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "4 yr. college degree in sports and entertainment and 3 years related management experience or 5+ years of senior level leadership and management experience or GE subject matter expert with minimum of 7 years related work experience in sports/entertainment. Proficient in Word, Excel, Power Point, ISS 24/7, Paycor, etc. Bachelor's degree in Marketing, Business, or a related field (Master's preferred)."
    }
  ]
}