{
  "meta": [
    {
      "job_title": "Commercial Sales Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Sales",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Consultative Sales",
      "experience": 5
    },
    {
      "skill": "Sales Cycle Management",
      "experience": 5
    },
    {
      "skill": "CRM Tools",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop new business through prospecting activities and generating account growth with quality meetings."
    },
    {
      "duty": "Secure new business to achieve individual sales and customer satisfaction goals."
    },
    {
      "duty": "Actively network and represent the company at professional group events to discuss and position products for specification in building plans."
    },
    {
      "duty": "Engage in a consultative sales approach to recommend solutions that influence customer buying needs."
    },
    {
      "duty": "Ensure accurate quotes and orders in accordance with company processes."
    },
    {
      "duty": "Respond to customer concerns and coordinate resources to resolve issues while striving for first-time resolution."
    },
    {
      "duty": "Maintain expertise on products/services, stay abreast of the competitive landscape, and educate customers on installation guidelines."
    },
    {
      "duty": "Thank clients and act as their central point of contact for ongoing needs."
    },
    {
      "duty": "Collaborate with internal teams to ensure successful after-sale service requirements and installations."
    },
    {
      "duty": "Interact with Account Receivable department to address potential billing/payment issues."
    },
    {
      "duty": "Use Strong salesforce systems tools capabilities to manage all customer interactions and proactively communicate with customers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from four-year college or university; or two to four years related experience, including commercial sales and technical product expertise, or equivalent combination of education and experience/expertise."
    }
  ]
}