{
  "meta": [
    {
      "job_title": "Victim Advocate",
      "job_category": "Social Services",
      "job_class": "Advocate",
      "sector": "Social Services",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Crisis Intervention",
      "experience": 5
    },
    {
      "skill": "Safety Planning",
      "experience": 5
    },
    {
      "skill": "Community Resources",
      "experience": 5
    },
    {
      "skill": "Advocacy",
      "experience": 5
    },
    {
      "skill": "Case Management",
      "experience": 5
    },
    {
      "skill": "Public Speaking",
      "experience": 5
    },
    {
      "skill": "Report Writing",
      "experience": 5
    },
    {
      "skill": "Child Advocacy",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Screen, evaluate, and provide comprehensive assistance to victims of spouse/intimate partner abuse and non-offending parents or caregivers of child abuse."
    },
    {
      "duty": "Coordinate with FAP case manager, law enforcement, and/or sponsoring command to develop and implement plans for victim safety."
    },
    {
      "duty": "Conduct support groups for Child Abuse and Domestic Abuse victims and evaluate their needs, establishing individualized safety plans and making referrals to other helping agencies."
    },
    {
      "duty": "Advocate for the interests and safety of the victim in legal and investigative settings, reporting all suspected child abuse or neglect cases to proper authorities."
    },
    {
      "duty": "Maintain a cooperative working relationship with medical treatment facilities, Military Police, NCIS, and Unit Commanders."
    },
    {
      "duty": "Assist in the establishment and implementation of local policies and directives pertaining to the Family Advocacy Victim Advocate Program."
    },
    {
      "duty": "Coordinate and conduct education and awareness programs related to child abuse prevention, domestic violence prevention, and teen dating violence awareness."
    },
    {
      "duty": "Network with civilian resources and provide education and training to civilian providers of services on military resources and regulations."
    },
    {
      "duty": "Conduct education classes for Family Support Groups and the community on the prevention of domestic abuse."
    },
    {
      "duty": "Maintain victim advocacy notes and provide input to determine program effectiveness."
    },
    {
      "duty": "Perform other assigned duties related to victim advocacy."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Baccalaureate degree in counseling, education, psychology, or related behavioral sciences. Basic Advocate Credential with the designation as a Comprehensive Intervention Specialist, as approved by NACP/NOVA."
    }
  ]
}