{
  "meta": [
    {
      "job_title": "Lumir Care Coach",
      "job_category": "Healthcare",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Telehealth Practices",
      "experience": 5
    },
    {
      "skill": "Compliance",
      "experience": 5
    },
    {
      "skill": "Digital Health Technologies",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Medical Cannabis Knowledge",
      "experience": 5
    },
    {
      "skill": "Healthcare Regulations",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Research",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide advice, guidance, and care to the public and patients via phone, videoconference, and written interactions."
    },
    {
      "duty": "Specialize in supported, end-to-end medical cannabis-centric care for a range of patients."
    },
    {
      "duty": "Work with International peers within the Lumir Clinic network to drive patient outcomes and experience globally."
    },
    {
      "duty": "Foster an inclusive and responsive care and wellness provider approach to patient care and education."
    },
    {
      "duty": "Undergo necessary training or certifications related to medical cannabis education and demonstrate commitment to lifelong learning."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Active Registered Nurse (RN) license in at least one 'Compact' state."
    },
    {
      "credential": "In-depth knowledge of medical cannabis, including its therapeutic applications and potential side effects."
    },
    {
      "credential": "Familiarity with state-specific medical cannabis programs, regulations, and compliance requirements, or the demonstrated ability to research and interpret legislation and regulation in a timely manner."
    },
    {
      "credential": "Familiarity and demonstrated competence with telehealth platforms, electronic health record systems, and other relevant healthcare technologies."
    },
    {
      "credential": "Exceptional communication and interpersonal skills, with the ability to interact effectively with patients, healthcare providers, and stakeholders."
    }
  ]
}