{
  "meta": [
    {
      "job_title": "Director of Technical Program Management",
      "job_category": "Engineering",
      "job_class": "Director",
      "sector": "Software Engineering",
      "salary": 160000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Project Management",
      "experience": 10
    },
    {
      "skill": "Program Management",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "Resource Planning",
      "experience": 10
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Change Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage a portfolio of technical and cross-functional programs & projects, ensuring high-quality delivery within budget and timelines."
    },
    {
      "duty": "Develop and implement an effective project management methodology and governance approach."
    },
    {
      "duty": "Collaborate with CTO, Engineering, and business unit leaders to manage project and portfolio budgeting, resource allocation, and reallocations."
    },
    {
      "duty": "Prioritize projects based on changing needs, constraints, risk exposure, and interdependencies."
    },
    {
      "duty": "Monitor the delivery of business objectives and client experience for project delivery."
    },
    {
      "duty": "Work with business unit leaders to develop project and portfolio resourcing strategies."
    },
    {
      "duty": "Ensure adoption and implementation of project management methodology and oversee coaching."
    },
    {
      "duty": "Engage with business leaders to analyze the organization’s ability to absorb change and adopt projects post-deployment."
    },
    {
      "duty": "Communicate the status of projects and portfolio to all stakeholders."
    },
    {
      "duty": "Manage relationships between business and technology teams, ensuring high-quality project completion."
    },
    {
      "duty": "Collaborate cross-departmentally to maintain consistency, standards, and interdependencies across projects."
    },
    {
      "duty": "Leverage change management, project management, and similar disciplines to align key constituents and achieve desired results."
    },
    {
      "duty": "Build, lead, and motivate high-performance teams, setting clear objectives and recognizing outstanding performance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 180,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or master's degree in computer science, business, or a related discipline"
    }
  ]
}