{
  "meta": [
    {
      "job_title": "Estimator",
      "job_category": "Construction",
      "job_class": "Lead",
      "sector": "Construction",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Estimation",
      "experience": 5
    },
    {
      "skill": "Procurement Operations",
      "experience": 5
    },
    {
      "skill": "Architectural Plans Review",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Construction Blueprint Interpretation",
      "experience": 5
    },
    {
      "skill": "Excel Proficiency",
      "experience": 5
    },
    {
      "skill": "Meticulousness",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Meticulously review architectural plans, final selections, and associated drawings to ensure accuracy and comprehensiveness."
    },
    {
      "duty": "Cultivate the final estimate for each home project, reflecting our dedication to precision and quality."
    },
    {
      "duty": "Formulate purchase orders for trades and vendors for each home, exemplifying our meticulous approach to procurement."
    },
    {
      "duty": "Transmit purchase orders, selections, and plans to trades post thorough review and endorsement."
    },
    {
      "duty": "Source and collect project bids/estimates from valued trades and vendors, fostering strong partnerships."
    },
    {
      "duty": "Sustain the trade/vendor database, a key foundation of our operations."
    },
    {
      "duty": "Curate the pricing database, upholding our commitment to transparency and accuracy."
    },
    {
      "duty": "Skillfully assess special requests for build jobs from the Design team, showcasing adaptability and ingenuity."
    },
    {
      "duty": "Collaborate with the CFO on diverse purchasing initiatives as necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "A minimum of five years in the field of estimation, homebuilding preferred."
    },
    {
      "credential": "Proficiency in comprehending and interpreting construction plans and blueprints."
    },
    {
      "credential": "Outstanding communication aptitude, facilitating seamless interaction with trade contractors and vendors."
    },
    {
      "credential": "Robust computer proficiency, particularly in Excel, to support data-driven decision-making."
    },
    {
      "credential": "Preferred experience in estimating software (Buildertrend preferred but not required), demonstrating adaptability to advanced tools."
    },
    {
      "credential": "keywords: Architectural Estimator, Location: Eagle, ID"
    }
  ]
}