{
  "meta": [
    {
      "job_title": "Multi-Purpose Clerk",
      "job_category": "Retail",
      "job_class": "Clerk",
      "sector": "Retail",
      "salary": 19000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Product Knowledge",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Cash Handling",
      "experience": 1
    },
    {
      "skill": "Sanitation Procedures",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Promoting sales, responding to customer inquiries, and placing special orders within assigned department."
    },
    {
      "duty": "Practicing safe food handling procedures and maintaining a clean work area."
    },
    {
      "duty": "Receiving, inspecting, and stocking products; rotating and merchandising product to maintain freshness and appeal."
    },
    {
      "duty": "Operating the checkstand, memorizing PLU codes, and performing Point-Of-Sale (POS) and inventory activities."
    },
    {
      "duty": "Receiving, inspecting, and stocking products; maintaining floral area; keeping areas and equipment clean within the produce department."
    },
    {
      "duty": "Receiving, inspecting, and stocking products; labeling products for display; providing customer service at the seafood counter; keeping areas and equipment clean within the meat/seafood department."
    },
    {
      "duty": "Receiving, inspecting, and stocking products; preparing, labeling, and packaging products for display; taking special orders; keeping areas and equipment clean within the bakery/deli department."
    },
    {
      "duty": "Maintaining cleanliness and sanitation throughout the store; operating janitorial equipment; emptying trash; performing other assigned duties."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma (or G.E.D.) or additional job experience"
    }
  ]
}