{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Consulting",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Remote Work Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage multiple projects for edBridge Partners’ clients, ensuring high-quality service aligned with their missions."
    },
    {
      "duty": "Plan and execute project-specific work plans to ensure timely and accurate completion of all project tasks."
    },
    {
      "duty": "Create project plans, including deliverables, activities, timelines, and budgets."
    },
    {
      "duty": "Facilitate regular project meetings and prepare meeting notes, action items, and schedules."
    },
    {
      "duty": "Lead communication with stakeholders and team members through the completion of projects."
    },
    {
      "duty": "Provide scheduled and on-demand status reports and updates to senior leadership."
    },
    {
      "duty": "Advise leadership team when contracts are to be renewed or amended."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree and a minimum of seven years of applicable experience, or an equivalent blend of education and professional background."
    },
    {
      "credential": "At least four years of project management experience managing medium to large complex projects and related project management skills."
    },
    {
      "credential": "Experience with one or more Project Management software platforms - MS Project, Asana, Smartsheet, Jira, Basecamp, etc."
    },
    {
      "credential": "Excellent interpersonal and communication skills, with demonstrated experience in developing and delivering formal and informal presentations and leading client meetings."
    },
    {
      "credential": "Ability to work independently with little supervision and willingness to do the work that needs to be done as part of a small team."
    },
    {
      "credential": "Experience in education is a plus."
    },
    {
      "credential": "Master’s Degree in any discipline is a plus."
    },
    {
      "credential": "PMP or equivalent professional project management certification is a plus."
    },
    {
      "credential": "Familiarity with educational research, data operations, and analytical decision-making is a plus."
    },
    {
      "credential": "Skilled in the use of Microsoft Office, Google Suite, and common remote business tools like Zoom, Teams, Doodle, SurveyMonkey and others."
    }
  ]
}