{
  "meta": [
    {
      "job_title": "Fulfillment Operations Engineering Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Engineering",
      "salary": 160000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Most Certified",
      "experience": 5
    },
    {
      "skill": "Lean Six Sigma",
      "experience": 5
    },
    {
      "skill": "AutoCAD",
      "experience": 5
    },
    {
      "skill": "Operations Research",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and develop multiple projects simultaneously, identifying process improvements, establishing capital forecasts, and delivering on both previously-defined projects and the opportunities you identify."
    },
    {
      "duty": "Work with operations to improve external customer service and satisfaction, internal team member satisfaction, continuity of operations, and produce efficiency improvements and cost savings through your efforts."
    },
    {
      "duty": "Discover and evaluate next-level automation technology, and new logistic innovations for the fulfillment network, the execution of complex capital projects, ensuring timelines are met and overall costs are within budget."
    },
    {
      "duty": "Partner with Operations to develop preferred methods/Standard Operating Procedures for the warehouse."
    },
    {
      "duty": "Increase inventory storage capabilities by improving existing storage utilization and introducing new storage systems."
    },
    {
      "duty": "Establish and nurture vendor relationships, and hold vendors accountable for achieving agreed upon timelines and cost estimates."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree in Industrial Engineering or Operations Research or related discipline (Master's preferred)"
    },
    {
      "credential": "Maynard Operational Sequence Technique (MOST) Certified"
    }
  ]
}