{
  "meta": [
    {
      "job_title": "Director of Finance and Human Resources",
      "job_category": "Finance and HR",
      "job_class": "Director",
      "sector": "Management",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Management",
      "experience": 7
    },
    {
      "skill": "Human Resources Management",
      "experience": 7
    },
    {
      "skill": "Strategic Leadership",
      "experience": 7
    },
    {
      "skill": "Internal Controls",
      "experience": 7
    },
    {
      "skill": "Employee Relations",
      "experience": 7
    },
    {
      "skill": "Budgeting and Planning",
      "experience": 7
    },
    {
      "skill": "Auditing",
      "experience": 7
    },
    {
      "skill": "Policy Development",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Compliance Management",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee all finance and accounting functions, including maintaining best practice internal controls and safeguards for revenue and costs."
    },
    {
      "duty": "Lead all day-to-day finance operations, including accounting, accounts payable, accounts receivable, payroll, and grants administration."
    },
    {
      "duty": "Manage employee relations, inclusive of conflict resolution and performance management."
    },
    {
      "duty": "Implement and improve administrative processes to enhance organizational efficiency."
    },
    {
      "duty": "Leverage strengths of the current team members, clarify roles and responsibilities, and develop training programs to maximize individual and organizational goals."
    },
    {
      "duty": "Develop and implement strategies aligned with the organization's mission and objectives, including competitive and cost-effective compensation and benefits programs."
    },
    {
      "duty": "Foster a positive organizational culture that values diversity, equity, and inclusion."
    },
    {
      "duty": "Forecast and manage organizational cash flow in partnership with the senior leadership team, while ensuring compliance with legal, regulatory, and reporting requirements."
    },
    {
      "duty": "Provide leadership in strengthening internal communications with staff at all levels throughout the organization, creating and promoting a positive and supportive work environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Finance, Human Resources, or a related field (Master's preferred)"
    }
  ]
}