{
  "meta": [
    {
      "job_title": "Quality Assurance Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Quality Assurance",
      "experience": 7
    },
    {
      "skill": "Quality Control",
      "experience": 7
    },
    {
      "skill": "Audits",
      "experience": 7
    },
    {
      "skill": "Product Development",
      "experience": 7
    },
    {
      "skill": "Manufacturing Processes",
      "experience": 7
    },
    {
      "skill": "Risk Analysis",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Microsoft Excel",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate and provide quality assurance input and solutions throughout the Product Development and Life Cycle process."
    },
    {
      "duty": "Develop and maintain standard protocols for all private brand products, and assist vendors in understanding protocols and standards."
    },
    {
      "duty": "Apply test methods to test private brand products at various stages of development, and report results to improve the products."
    },
    {
      "duty": "Conduct research and use risk analysis tools (e.g., FMEA) during design reviews to minimize quality and safety issues."
    },
    {
      "duty": "Resolve issues during product lifecycle to minimize delays in testing and get approval required to release purchase orders for shipping."
    },
    {
      "duty": "Collaborate with cross-functional teams and vendors on all product, testing, and manufacturing issues."
    },
    {
      "duty": "Review QA processes, audit reports, and applicable government certifications for factories, and assure compliance with protocols."
    },
    {
      "duty": "Monitor and analyze feedback to determine cause, develop solutions, and ensure corrective actions are implemented."
    },
    {
      "duty": "Identify patterns of unsatisfactory vendor performance to facilitate and implement correction action plan."
    },
    {
      "duty": "Collaborate with QA Team for review of new suppliers or changes in facilities and conduct supplier approval process."
    },
    {
      "duty": "Conduct in-store visits for QA sample review and collection as needed."
    },
    {
      "duty": "Ensure test equipment used for internal testing is properly maintained and that all product complaints, issues, and concerns are documented."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent, preferably in Quality Assurance, Engineering or a related technical field (Master's preferred). HACCP Certification, SQF Practitioner, ASQ certification (Auditor, CQE, CQA, CRE) preferred."
    }
  ]
}