{
  "meta": [
    {
      "job_title": "Companion Diagnostic Lead",
      "job_category": "Biotechnology",
      "job_class": "Lead",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Lead the development and implementation of companion diagnostic strategies aligned with therapeutic products and clinical programs."
    },
    {
      "duty": "Collaborate with internal stakeholders, including R&D, Regulatory Affairs, Clinical Development, and CRO, to develop and execute CDx development plans."
    },
    {
      "duty": "Act as the primary point of contact for FDA and EMA regulatory interactions related to companion diagnostic development and submission activities."
    },
    {
      "duty": "Prepare and compile high-quality regulatory submissions, including Investigational Device Exemption (IDE), Pre-Submission (Q-Sub), 510(k), Pre-Market Approval (PMA), In Vitro Diagnostic Device (IVDD), and In Vitro Diagnostic Medical Device (IVDR) applications."
    },
    {
      "duty": "Conduct thorough gap analyses to ensure compliance with relevant FDA and IVDR guidelines, regulations, and requirements for CDx development and submissions."
    },
    {
      "duty": "Maintain a strong knowledge of current FDA and IVDR regulations, guidelines, and evolving trends related to companion diagnostics and in vitro diagnostic devices."
    },
    {
      "duty": "Oversee and manage external vendors and CROs involved in CDx development and validation studies."
    },
    {
      "duty": "Ensure timely and successful execution of CDx development projects, meeting regulatory timelines and quality standards."
    },
    {
      "duty": "Participate in cross-functional teams to assess the CDx needs of ongoing and future clinical programs."
    },
    {
      "duty": "Provide expert guidance and training to team members on regulatory requirements for companion diagnostics."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in life sciences, engineering, or a related field. Advanced degree (MSc, Ph.D.) is preferred."
    }
  ]
}