{
  "meta": [
    {
      "job_title": "Cashier",
      "job_category": "Retail",
      "job_class": "Entry-level",
      "sector": "Sales",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Processes Member purchases in a courteous and friendly manner, including verifying, renewing, upgrading and offering several types of membership products, scanning merchandise, and accepting various forms of payments."
    },
    {
      "duty": "Provides excellent member service in an efficient and productive manner."
    },
    {
      "duty": "Maintains the overall cleanliness of the front-line department."
    },
    {
      "duty": "Carry out job functions and responsibilities as assigned."
    },
    {
      "duty": "Support the application of club policies, procedures and compliance."
    },
    {
      "duty": "Acts with honesty and integrity and lead with the member in mind to address all concerns and to escalate any concerns, as appropriate."
    },
    {
      "duty": "Ensure a safe and positive environment for our members and each other."
    },
    {
      "duty": "Deliver service excellence through all points of contact."
    },
    {
      "duty": "Resolve and deescalate to address every member concern."
    },
    {
      "duty": "Ensure a safe and positive environment and experience for the members."
    },
    {
      "duty": "Greet, Anticipate, Appreciate (GAA)"
    },
    {
      "duty": "Work as a team to deliver GOLD club standards daily."
    },
    {
      "duty": "Understand how to access and read production and/or financial performance reporting for your department."
    },
    {
      "duty": "See the connection between consistent execution and the positive impact it can have on the business."
    },
    {
      "duty": "Exhibits clear understanding of all BJ’s Membership options, Including the importance of renewals, upgrading to our BJ’s Perks programs."
    },
    {
      "duty": "Offer all appropriate membership products such as membership renewal, EASY renewal option, My BJs Perks programs and awards redemption."
    },
    {
      "duty": "Provides a high level of customer service to Members."
    },
    {
      "duty": "Checks Members out in a timely and efficient manner."
    },
    {
      "duty": "Scans all club merchandise through a point-of-sale system to ensure accurate inventory counts and accurate purchase totals for Members."
    },
    {
      "duty": "Fills shopping carts when necessary and assists at self-checkout stations."
    },
    {
      "duty": "Collects payments via cash, check, or other charge payments from members."
    },
    {
      "duty": "Issues receipts or change due to Members."
    },
    {
      "duty": "Stays up to date on all merchandise promotions, advertisements, and product information."
    },
    {
      "duty": "Discounts purchases by scanning and redeeming coupons."
    },
    {
      "duty": "Maintains the cleanliness of the frontline area."
    },
    {
      "duty": "Assists in general club housekeeping when necessary."
    },
    {
      "duty": "Returns re-sellable merchandise to the sales floor area."
    },
    {
      "duty": "Manages self-checkout and scan and pan lanes."
    },
    {
      "duty": "Assists Members with operations and technical difficulties."
    },
    {
      "duty": "Required to meet cashier productivity expectations."
    },
    {
      "duty": "Maintains all club policies and procedures."
    },
    {
      "duty": "Performs other duties as assigned, including working in other departments as needed."
    },
    {
      "duty": "Regular, predictable, full attendance is an essential function of this job."
    }
  ],
  "skills": [
    {
      "skill": "Cashiering",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": []
}