{
  "meta": [
    {
      "job_title": "Customer Service Specialist",
      "job_category": "Customer Service",
      "job_class": "Specialist",
      "sector": "Retail",
      "salary": 32000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide optimal guest experience services. Assist guests in the proper selection of merchandise in accordance with their identified needs. Demonstrate a high level of interest in the welfare, health, and proper handling of all animals. Perform cashiering duties. Perform related duties in support of the store attaining its assigned sales goal. Ensure merchandise is properly stocked and priced. Adhere to established operational guidelines and store policies and procedures. Evaluate guest inquiries and as needed refers to Guest Experience Leader and/or Leader on Duty."
    },
    {
      "duty": "Ensures the health and well-being of live animals by providing the correct care in accordance with the established Petco standards, policies and procedures including the completion of the hourly animal health check and wellness cards. Interacts professionally and effectively through verbal and written communication with all professional contacts with an emphasis on company interests. Provides prompt and courteous service to all Petco guests by determining their needs and sharing product knowledge to suggest the appropriate merchandise, and by effectively employing suggestive selling techniques to increase individual sales."
    },
    {
      "duty": "Performs all aspects of point-of-sale service, e.g. cash sales, credit and check sales, returns and exchanges. Performs the daily balance of cash drawer as necessary. Assists in stocking and facing merchandise according to established standards. Completes cash register transactions as well as guest carry-out service consisting of merchandise weighing up to but not exceeding 50 pounds per trip. Adheres to loss prevention policies. Assists in the loading, unloading and stocking of merchandise according to established procedures, in order to ensure that the store is well stocked and that inventory counts are accurate."
    },
    {
      "duty": "Ensures that store animals, birds, reptiles and fish receive the highest quality care, maintained in habits that are clean, safe, and secure, and that all reasonable and required steps are taken to maintain their good health. Alerts store leaders immediately if any animal, reptile, bird or fish is in need of medical attention or other special care. Performs routine housekeeping tasks as required to maintain the professional image and appearance of the store, to include sweeping/mopping the floors, dusting, washing the windows, facing the merchandise on the shelves, restroom maintenance, etc."
    },
    {
      "duty": "Assists store leadership in the opening/closing of the store as needed, to include the accurate completion of required paperwork. Participates in the completion of quarterly and annual physical inventory counts. Adheres to and promotes established safety procedures and maintenance of clean, safe and healthy environment for store partners, guests and animals. Performs special projects as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Point of Sale (POS) System",
      "experience": 3
    },
    {
      "skill": "Product Knowledge",
      "experience": 3
    },
    {
      "skill": "Animal Care",
      "experience": 3
    },
    {
      "skill": "Sales Techniques",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent"
    }
  ]
}