{
  "meta": [
    {
      "job_title": "Team Member",
      "job_category": "Retail",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Retail Sales",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Merchandising",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Retail Operations",
      "experience": 2
    },
    {
      "skill": "Safety Procedures",
      "experience": 2
    },
    {
      "skill": "Loss Prevention",
      "experience": 2
    },
    {
      "skill": "Team Collaboration",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Greet everyone (teammates and customers) and proactively approach athletes to understand their needs and support their shopping experience."
    },
    {
      "duty": "Ensure that all merchandise and product received at the store is processed in accordance with established programs and procedures; the backroom is organized and maintained so that merchandise is easily accessible in partnership with the Freight Flow/Operations Lead."
    },
    {
      "duty": "Uphold company merchandising and presentation standards."
    },
    {
      "duty": "Assist with the unloading of trucks, processing of freight, execution of transfers, RTVS, claims, freight processing, etc."
    },
    {
      "duty": "Fulfill the company-defined customer experience by completing all processes according to our service level standards."
    },
    {
      "duty": "Adhere to established policies and procedures related to safety, loss prevention and standard operating procedures. Maintains confidentiality of all Company information."
    },
    {
      "duty": "Create an inclusive store environment where everyone (teammates and customers) feels welcome, safe, and is treated with respect."
    },
    {
      "duty": "Take an all-hands-on-deck approach to support the team across the store."
    },
    {
      "duty": "Perform other tasks as assigned by management."
    }
  ]
}