{
  "meta": [
    {
      "job_title": "Site Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Facilities Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plans and develops work schedules to ensure adequate service."
    },
    {
      "duty": "Prepares schedules for service personnel and assigns personnel to routes."
    },
    {
      "duty": "Inspects and evaluates the physical condition of the establishment for program compliance, i.e., safety, quality, and service."
    },
    {
      "duty": "Audits and maintains inventories, supplies, and equipment."
    },
    {
      "duty": "Investigates new and promotes improved equipment and methods."
    },
    {
      "duty": "Reviews customer requests for service to ascertain the cause for the service request, type of malfunction, and address with the manager."
    },
    {
      "duty": "Implements organization policies and goals."
    },
    {
      "duty": "Analyzes & facilitates budget requests to identify areas in which reductions can be made."
    },
    {
      "duty": "Assists in promoting services performed to develop new markets, increase market share, and obtain a competitive position in the industry."
    },
    {
      "duty": "Inspects plant and evaluates the use of space and facilities."
    },
    {
      "duty": "Assists with plans, budgets, and schedules modifications, including cost estimates, bid sheets, and contracts."
    },
    {
      "duty": "Ensures that the site meets budget goals on a sustaining basis."
    },
    {
      "duty": "Assists in developing long-range plans, conceptual designs, and capital outlay requirements for program/process improvements."
    },
    {
      "duty": "Coordinates program specifications, requirements for proposals and contracts, and associated documents."
    },
    {
      "duty": "Compiles data for preparing estimates."
    },
    {
      "duty": "Maintains and reports on the financial part of the business, such as labor hours, overhead, supplies, expenses, billing, forecasting, and any changes to these areas."
    },
    {
      "duty": "Maintains a safe work environment for self and employees."
    },
    {
      "duty": "Ensures compliance with local, state, and federal regulations, such as FLSA, OSHA, ADA, etc."
    },
    {
      "duty": "Directs supervisory management engaged in support of facilities programs."
    },
    {
      "duty": "Acts as liaison between the company, customers, clients, employees, and subcontractors."
    },
    {
      "duty": "Maintains contract and contractor status databases."
    },
    {
      "duty": "Reviews all correspondence concerning contractors and responds as appropriate."
    },
    {
      "duty": "Establishes and maintains contact with contractors to ensure the smooth working of the contract process."
    },
    {
      "duty": "Conducts and attends meetings to communicate top-down and bottom-up consistently with customers, clients, and employees."
    },
    {
      "duty": "Assists with human resource concerns and issues."
    }
  ],
  "skills": [
    {
      "skill": "Operations Experience",
      "experience": 5
    },
    {
      "skill": "Facilities Management",
      "experience": 5
    },
    {
      "skill": "Bilingual (English/Spanish)",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Human Resource Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Operations, Facilities Management, Business, or a related field (Master's preferred)"
    }
  ]
}