{
  "meta": [
    {
      "job_title": "Director of Development and Fundraising",
      "job_category": "Development and Fundraising",
      "job_class": "Director",
      "sector": "Non-Profit",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Fundraising",
      "experience": 5
    },
    {
      "skill": "Donor Relations",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Campaign Management",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with the executive team to develop and implement fundraising strategies aligned with the organization's goals and funding needs."
    },
    {
      "duty": "Identify and cultivate relationships with individual donors, corporate partners, foundations, and other potential funding sources."
    },
    {
      "duty": "Create compelling fundraising campaigns and initiatives to engage donors and supporters."
    },
    {
      "duty": "Provide feedback and share opportunities and recommendations with our grant-writing team."
    },
    {
      "duty": "Manage and maintain a portfolio of donors, ensuring regular communication, stewardship, and cultivation efforts."
    },
    {
      "duty": "Collaborate with the marketing and communications team to create impactful messaging and materials for fundraising campaigns."
    },
    {
      "duty": "Plan and execute fundraising events."
    },
    {
      "duty": "Monitor and report on fundraising progress, analyzing outcomes and identifying areas for improvement."
    },
    {
      "duty": "Keep up-to-date with fundraising trends, best practices, and industry developments."
    },
    {
      "duty": "Represent the organization at networking events, conferences, and donor meetings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or Higher in a related field (Master's preferred)"
    }
  ]
}