{
  "meta": [
    {
      "job_title": "Production Planner",
      "job_category": "Manufacturing",
      "job_class": "Planner",
      "sector": "Manufacturing",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Function as the focal point in creating a production schedule for projects using the best combination of ERP and other tools, ensuring accuracy and timeliness of the production process."
    },
    {
      "duty": "Provide a means to track and manage daily manufacturing workload, provide feedback to project manager on in-house vs. subcontracted manufacturing hours, and provide regular reporting on manufacturing status."
    },
    {
      "duty": "Interface with engineers, production, and project managers on a daily basis to be familiar with the status of all parts and assemblies in your assigned projects."
    },
    {
      "duty": "Research and assign manufacturing times and due dates on parts as needed."
    },
    {
      "duty": "Monitor quality, service, and delivery issues, and take corrective actions as needed."
    },
    {
      "duty": "Understand technical systems as assigned and manage the critical aspects of the design and schedule."
    },
    {
      "duty": "Stay current and familiar with the status of all parts and assemblies within your assigned projects while balancing conflicting demands on time and resources."
    },
    {
      "duty": "Provide continual improvement of the planning and reporting processes."
    },
    {
      "duty": "Participate in project review meetings."
    }
  ],
  "skills": [
    {
      "skill": "Engineered-to-Order Products",
      "experience": 5
    },
    {
      "skill": "Precision Machinery or Robotics",
      "experience": 5
    },
    {
      "skill": "Interpretation of Engineering Drawings",
      "experience": 5
    },
    {
      "skill": "Electromechanical Components",
      "experience": 5
    },
    {
      "skill": "ERP/MRP Knowledge",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "ISO Quality Plan",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering, Manufacturing, or a related field (Master's or APICS/ASCM certification preferred)"
    },
    {
      "credential": "Ability to obtain or have a U.S. Government security clearance"
    }
  ]
}