{
  "meta": [
    {
      "job_title": "Substance Abuse and Suicide Prevention Program Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Health and Wellness",
      "salary": 47000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Oversee the Substance Abuse and Suicide Prevention Programs within the assigned state."
    },
    {
      "duty": "Establish and maintain positive relationships with State Points of Contact (POCs)."
    },
    {
      "duty": "Provide direct supervision, management, and oversight of the Prevention Coordinator(s) (PC) and Suicide Prevention Program Coordinator (SPC)."
    },
    {
      "duty": "Establish and implement program goals, objectives, and standard operating procedures congruent with national directives."
    },
    {
      "duty": "Coordinate and conduct Substance Abuse Prevention (SAP) Training for ARNG Units that meet or supersede the requirements in AR 600-85 and AR 350-53."
    },
    {
      "duty": "Coordinate Suicide Prevention (SP) and Bystander Training for ARNG leaders and units that meet or supersede the requirements in AR 600-63, DA-PAM 600-24, and ALARACT 057-2014."
    },
    {
      "duty": "Provide delivery and review of Unit Risk Inventory (URI) and Reintegration Unit Risk Inventory (RURI) reports to the corresponding state level POCs."
    },
    {
      "duty": "Create and provide Unit commanders with the Risk Mitigation Plan (RMP) which includes recommended training based on URI results."
    },
    {
      "duty": "Manage DAMIS accuracy and timeliness for SAP training and case management."
    },
    {
      "duty": "Ensure CIMS accuracy and timeliness for Suicide Prevention."
    },
    {
      "duty": "Manage the Substance Abuse referred Soldier cases from initial referral to final disposition status."
    },
    {
      "duty": "Serve as a member of the Commander’s Readiness and Resiliency Council (CR2C) and the Adjutant General’s Alcohol and Drug Intervention Council (ADIC)."
    },
    {
      "duty": "Establish and maintain relationships with community-based providers."
    },
    {
      "duty": "Establish and keep current a state resource catalog."
    },
    {
      "duty": "Provide required weekly/monthly reports to the RM."
    },
    {
      "duty": "Create and Provide Monthly Status reports for both SAP and SP."
    },
    {
      "duty": "Attend and provide an information briefing for Substance Abuse and Suicide—Interim Progress Reviews."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors degree in a Social Science or related field, and 3 – 5 years of practical experience in the Substance Abuse Prevention, Suicide Prevention or Resiliency field."
    }
  ]
}