{
  "meta": [
    {
      "job_title": "Compensation Analyst",
      "job_category": "Human Resources",
      "job_class": "Analyst",
      "sector": "Human Resources",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Compensation Administration",
      "experience": 2
    },
    {
      "skill": "Employee Stock Purchase Plan (ESPP) Administration",
      "experience": 2
    },
    {
      "skill": "Corporate Compensation",
      "experience": 2
    },
    {
      "skill": "Microsoft Excel",
      "experience": 2
    },
    {
      "skill": "Project Management",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 2
    },
    {
      "skill": "Internal Revenue Code Compliance",
      "experience": 2
    },
    {
      "skill": "Process Improvement",
      "experience": 2
    },
    {
      "skill": "Market Pricing",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support end-to-end administration of the company’s Employee Stock Purchase Plan (ESPP) and specific company compensation programs, policies, and procedures."
    },
    {
      "duty": "Work directly with third party administrators (TPA) as needed and support Corporate Compensation and external vendors to ensure customer satisfaction and cost savings across Constellation."
    },
    {
      "duty": "Understand the end-to-end process and may create/design new processes."
    },
    {
      "duty": "Support the administration of the company’s ESPP and compensation programs, primarily long-term incentive (LTI), deferred short-term incentive (STI) and annual incentive."
    },
    {
      "duty": "Investigate and respond to employee inquiries related to ESPP, LTI, and deferred STI."
    },
    {
      "duty": "Support the management of TPAs as necessary and monitors compliance with contractual performance standards."
    },
    {
      "duty": "Support administration of compensation-related planning tools."
    },
    {
      "duty": "Coordinate with Payroll Tax, TPA, Corporate Governance, and others as needed to ensure company legal and tax compliance."
    },
    {
      "duty": "Identify, develop, and implement process improvements to ensure service levels and customer satisfaction is met."
    },
    {
      "duty": "Participate in job audits, analyses, governmental reporting, and surveys."
    },
    {
      "duty": "Identify controls to ensure compliance with applicable requirements and self-audits and monitors operations to ensure controls are operating as designed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business administration, HR, accounting, or related field or equivalent."
    },
    {
      "credential": "Professional certification(s) as CCP, PHR, SPHR"
    }
  ]
}