{
  "meta": [
    {
      "job_title": "Campus Security Assistant",
      "job_category": "Security",
      "job_class": "Assistant",
      "sector": "Security",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitor access of residents and guests to the large residences on campus."
    },
    {
      "duty": "Enforce the Guest and other University policies and verify guest passes for accuracy."
    },
    {
      "duty": "Confiscate misused, damaged, or altered forms of identification."
    },
    {
      "duty": "Notify the proper authorities in the event of an emergency such as fire, crime, or medical problems."
    },
    {
      "duty": "Communicate incidents and concerns, using the phone or radio equipment, to other departmental representatives."
    },
    {
      "duty": "Write complete, concise, and accurate Incident and Fire Alarm Reports."
    },
    {
      "duty": "Remain alert to surroundings at all times."
    },
    {
      "duty": "Act as a front line representative of the University, providing information, direction, and assistance to residents, guests, and staff."
    },
    {
      "duty": "Monitor the video displays for improper activities."
    },
    {
      "duty": "Report any equipment related malfunctions to the supervisor on duty or to the Residential Safety Office."
    },
    {
      "duty": "Attend at least two training sessions per year."
    },
    {
      "duty": "Consult and review the Operations Manual on a regular basis."
    }
  ],
  "skills": [
    {
      "skill": "Security Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Emergency Response",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent."
    },
    {
      "credential": "One to three years of experience as a security assistant or related experience working with the public."
    }
  ]
}