{
  "meta": [
    {
      "job_title": "Plant Manager",
      "job_category": "Food Manufacturing",
      "job_class": "Manager",
      "sector": "Manufacturing",
      "salary": 180000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Demonstrate leadership through participation in core leadership processes such as development of division and manufacturing facility operating, capital and expense budgets, leader standard work, employee onboarding, succession planning and horizon planning"
    },
    {
      "duty": "Lead the establishment of Key Performance Indicators to measure performance of the division and manufacturing facilities"
    },
    {
      "duty": "Lead effective stakeholder collaboration to standardize common functions in areas of quality, safety, maintenance, sustainability, environmental, SAP, Safe Quality Foods (SQF), Hazard Analysis and Critical Control Point (HACCP), Auditing, and Abatement activities"
    },
    {
      "duty": "Empower teams to improve equipment reliability using industry standard tools such as Total Productive Maintenance (TPM), Preventive Maintenance and Predictive Maintenance"
    },
    {
      "duty": "Partner with key stakeholder(s) to ensure an effective Capital and Expense Project Management process"
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "Stakeholder Collaboration",
      "experience": 10
    },
    {
      "skill": "Equipment Reliability",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree (work experience may be substituted for the required education on a year-for-year basis). Strong technical experience with a background in maintenance or engineering is highly preferred. 5-10 years as a plant manager in a food manufacturing facilities"
    }
  ]
}