{
  "meta": [
    {
      "job_title": "Lead NetSuite Developer",
      "job_category": "Software Engineering",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 135000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "NetSuite Development",
      "experience": 7
    },
    {
      "skill": "SuiteScript",
      "experience": 7
    },
    {
      "skill": "SuiteFlow",
      "experience": 7
    },
    {
      "skill": "SuiteBuilder",
      "experience": 7
    },
    {
      "skill": "SuiteCloud Platform",
      "experience": 7
    },
    {
      "skill": "JavaScript",
      "experience": 7
    },
    {
      "skill": "HTML",
      "experience": 7
    },
    {
      "skill": "CSS",
      "experience": 7
    },
    {
      "skill": "SQL",
      "experience": 7
    },
    {
      "skill": "System Integration",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Problem-Solving",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage the end-to-end development lifecycle of NetSuite projects, solution design, development, testing, deployment, and post-implementation support."
    },
    {
      "duty": "Collaborate with cross-functional teams to understand internal requirements and translate them into scalable NetSuite solutions."
    },
    {
      "duty": "Customize and configure NetSuite modules, workflows, forms, reports, and scripts to meet specific business needs."
    },
    {
      "duty": "Develop and maintain integrations between NetSuite and other systems."
    },
    {
      "duty": "Conduct thorough testing and debugging of NetSuite customizations and integrations to ensure high quality and reliability."
    },
    {
      "duty": "Provide technical guidance and mentorship to junior developers, fostering a collaborative and growth-oriented environment."
    },
    {
      "duty": "Stay up-to-date with the latest NetSuite features, releases, and industry best practices, actively researching and proposing innovative solutions to improve system performance and efficiency."
    },
    {
      "duty": "Work closely with ERP Team and Business Analyst to gather feedback, address concerns, and provide ongoing support to ensure optimal user adoption and satisfaction."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or a related field."
    }
  ]
}