{
  "meta": [
    {
      "job_title": "Assistant Account Executive",
      "job_category": "Advertising",
      "job_class": "Account Executive",
      "sector": "Marketing",
      "salary": 58000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Advertising Campaign Management",
      "experience": 2
    },
    {
      "skill": "Client Interaction",
      "experience": 2
    },
    {
      "skill": "Advertising Coordination",
      "experience": 2
    },
    {
      "skill": "Project Management",
      "experience": 2
    },
    {
      "skill": "MS Office Suite",
      "experience": 2
    },
    {
      "skill": "Verbal Communication",
      "experience": 2
    },
    {
      "skill": "Multiple Project Management",
      "experience": 2
    },
    {
      "skill": "Self-Starter",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate the planning and execution of advertising activities, including tagging and traffic responsibilities, for clients on strict time deadlines."
    },
    {
      "duty": "Guide day-to-day development of advertising activities within approved plans."
    },
    {
      "duty": "Ensure that progressive stages are approved with adequate time to handle multiple tasks and deadlines meet aggressive schedules."
    },
    {
      "duty": "Provide effective and efficient use of agency resources and processes to ensure projects are delivered as promised in terms of content, time, and budget."
    },
    {
      "duty": "Act as the liaison to the Regional HQ office in California on facilities and IT issues."
    },
    {
      "duty": "Understand the expectations of, and communicate effectively with, all agency team members."
    },
    {
      "duty": "Effectively monitor the work of other agency departments against agreed upon timetables."
    },
    {
      "duty": "Prepare accurate and timely internal communication: conference reports, job starters, assignment summaries."
    },
    {
      "duty": "Contribute to the development of project and/or annual client planning documents, as required."
    },
    {
      "duty": "Adherence to financial and operating procedures; prepares client job requests, routes, finalize and distribute billing for accuracy and completeness."
    },
    {
      "duty": "Prepare client meeting materials that are clear and concise, examples include but not limited to content development, creative presentation, and delivery, as necessary."
    },
    {
      "duty": "Prepare and distribute monthly client communications such as dealer newsletters."
    },
    {
      "duty": "Organize and schedule quarterly dealer meetings."
    },
    {
      "duty": "Anticipate, and proactively make the Account Management aware of all potential issues."
    },
    {
      "duty": "Maintain confidentiality while working closely with client teams regarding all aspects of campaigns and projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 75,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Marketing, Advertising, Communications, or relevant, equivalent experience."
    }
  ]
}