{
  "meta": [
    {
      "job_title": "Executive Assistant",
      "job_category": "Administrative",
      "job_class": "Assistant",
      "sector": "Administration",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Administrative Support",
      "experience": 5
    },
    {
      "skill": "Calendar Management",
      "experience": 5
    },
    {
      "skill": "Travel Coordination",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain complex calendars for leadership, schedule all meetings and conference calls, screen e-mails and phone calls, request meetings, solution meeting conflicts and prioritize diligently."
    },
    {
      "duty": "Manage the coordination and logistics of both internal and external meetings across leadership team; arrange and coordinate all aspects of domestic and international travel."
    },
    {
      "duty": "Organize and support components for offsite conferences and external events, including catering, transportation, lodging and vendor management; Process invoices and T&E expense claims for leadership team."
    },
    {
      "duty": "Assist with staff on-boarding and off-boarding across Payments Marketing, which includes requesting equipment setup and system access."
    },
    {
      "duty": "Produce consistent high-quality emails and communications to all levels of the organization; maintain current org charts and executive bios; assist in spreadsheet and presentation development, including printing and binding."
    },
    {
      "duty": "Manage day to day activities with minimal oversight, and advise early on issues, delays or challenges; Collaborate with other admins and build strong partnerships with wider team to enhance operational culture; Manage and own distribution lists for leadership team; lead and coordinate ad hoc projects as requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "At least 5+ years of admin experience, ideally supporting a Managing Director (or equivalent)"
    }
  ]
}