{
  "meta": [
    {
      "job_title": "Senior Device Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 125000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Engineering",
      "experience": 5
    },
    {
      "skill": "Biomedical Engineering",
      "experience": 5
    },
    {
      "skill": "Chemical Engineering",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Product Development",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Clinical Trial Operations",
      "experience": 3
    },
    {
      "skill": "Manufacturing Scale-up",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "MS Office and Google Workspace",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct or manage R&D testing to confirm design or process changes are suitable and acceptable."
    },
    {
      "duty": "Support medical device Verification and Validation (V&V) activities by writing technical documents, conducting testing, and managing service providers."
    },
    {
      "duty": "Take a proactive role in managing relations with contract manufacturing organizations involved in the production of the dry eye treatment."
    },
    {
      "duty": "Maintain comprehensive design control and quality assurance documentation in compliance with regulatory requirements."
    },
    {
      "duty": "Provide general support for regulatory activities and contribute to the development of strategies to obtain necessary approvals and clearances for the product's commercialization."
    },
    {
      "duty": "Support clinical operations and data integrity by developing research findings into actions to support project objectives."
    },
    {
      "duty": "Explore complex technical or marketing challenges by interacting with company experts, project stakeholders, or independent consultants."
    },
    {
      "duty": "Act as a capable problem-solver, identifying and addressing challenges that may arise during the commercialization process and collaborating with cross-functional teams to find innovative solutions."
    },
    {
      "duty": "Present data, research topics, or product information to the team or external partners."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in mechanical, biomedical, or chemical engineering (or related field) (Master's preferred)"
    }
  ]
}