{
  "meta": [
    {
      "job_title": "Temporary Technical Designer",
      "job_category": "Technical Design",
      "job_class": "Designer",
      "sector": "Apparel",
      "salary": 35,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Sketching",
      "experience": 7
    },
    {
      "skill": "CAD Design",
      "experience": 7
    },
    {
      "skill": "Garment Construction",
      "experience": 7
    },
    {
      "skill": "Patternmaking",
      "experience": 7
    },
    {
      "skill": "Fit Evaluation",
      "experience": 7
    },
    {
      "skill": "Material Sourcing",
      "experience": 7
    },
    {
      "skill": "Industry Trend Analysis",
      "experience": 7
    },
    {
      "skill": "Communication",
      "experience": 7
    },
    {
      "skill": "Problem-Solving",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate closely with the design team to understand the creative vision and technical requirements for women’s products."
    },
    {
      "duty": "Create accurate and detailed technical sketches, CADs, and specifications for garments, including measurements, construction details, and materials."
    },
    {
      "duty": "Evaluate and analyze garment samples for fit, construction, and overall quality, providing feedback and recommendations for improvements as needed."
    },
    {
      "duty": "Conduct fittings on live models and mannequins, making necessary adjustments to achieve the desired fit and aesthetic."
    },
    {
      "duty": "Communicate effectively with cross-functional teams, including designers, patternmakers, production managers, and suppliers, to ensure seamless product development."
    },
    {
      "duty": "Research and source suitable materials and trims that align with design concepts, performance requirements, and cost targets."
    },
    {
      "duty": "Collaborate with patternmakers to develop and refine garment patterns, ensuring they align with the design’s intention and manufacturing feasibility."
    },
    {
      "duty": "Stay current with industry trends, technological advancements, and best practices in technical design to enhance product quality and innovation."
    },
    {
      "duty": "Participate in meetings and presentations to provide technical insights, address challenges, and propose solutions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Fashion Design, Apparel Manufacturing, or a related field is required"
    }
  ]
}