{
  "meta": [
    {
      "job_title": "Medical Device Process Development Engineer (Packaging)",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Medical Device",
      "salary": 58000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Process Development",
      "experience": 3
    },
    {
      "skill": "Design for Manufacturing",
      "experience": 3
    },
    {
      "skill": "Process Validation",
      "experience": 3
    },
    {
      "skill": "Equipment Setup",
      "experience": 3
    },
    {
      "skill": "Statistics",
      "experience": 3
    },
    {
      "skill": "Lean Manufacturing Principles",
      "experience": 3
    },
    {
      "skill": "Packaging Design",
      "experience": 3
    },
    {
      "skill": "Quality Standards (ISO13485/FDA)",
      "experience": 3
    },
    {
      "skill": "Analytic Skills",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and optimize processes required to manufacture new medical devices."
    },
    {
      "duty": "Identify and evaluate innovative processing options based on product attributes, including evaluation based on technical and economic feasibility."
    },
    {
      "duty": "Execute cost-effective systems to enhance processing speed and quality, ensuring compliance with government regulations and industry standards."
    },
    {
      "duty": "Collaborate with R&D, Operations, and Production engineering to ensure effective completion of activities associated with transfer to manufacturing."
    },
    {
      "duty": "Compare costs and benefits when choosing product in-house or supplier selection."
    },
    {
      "duty": "Define, identify, and procure new equipment for manufacturing processes."
    },
    {
      "duty": "Adhere to Quality Management System and regulatory requirements, maintaining all training and seeking out opportunities for continuous development and growth."
    },
    {
      "duty": "Effectively work and interact with others throughout various levels of the global organization, strictly adhering to safety requirements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 30,
      "student_teacher": 60,
      "introvert_extrovert": 20
    }
  ],
  "education_certification": [
    {
      "credential": "PhD, MS, or Bachelor's degree in Engineering, or Engineering Technology with experience in process development, process validation, and lean manufacturing principles. Minimum of three years experience working in Class II/III medical device manufacturing or GMP regulated environment."
    }
  ]
}