{
  "meta": [
    {
      "job_title": "Chief of Staff",
      "job_category": "Executive",
      "job_class": "Chief",
      "sector": "Management",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Management",
      "experience": 5
    },
    {
      "skill": "Public Policy Development",
      "experience": 5
    },
    {
      "skill": "Government Structure Expertise",
      "experience": 5
    },
    {
      "skill": "Community Relationship Management",
      "experience": 5
    },
    {
      "skill": "Advocacy and Coalition Building",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage information flow and examine internal and external opportunities to ensure the CEO and COO’s involvement in project or decision-making processes takes place at key times to maximize their time, input, and authority."
    },
    {
      "duty": "Collaborate with members of the Strategic Leadership Team to determine, recommend, and prioritize business strategies."
    },
    {
      "duty": "Develop strong collaborations and partnerships with stakeholders, including key individuals, agencies, organizations, and government leaders to effectively promote policies or legislation necessary for the success of organizational strategies."
    },
    {
      "duty": "Represent the CEO and COO in external meetings with stakeholders as needed."
    },
    {
      "duty": "Draft and prepare testimonies, speeches or other remarks for the CEO, COO and supports other staff with the preparation of their remarks."
    },
    {
      "duty": "Produce written material for internal and external use, including reports, updates, issue briefs, position letters, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Public Policy, or related field (Master's preferred)"
    }
  ]
}