{
  "meta": [
    {
      "job_title": "Dental Territory Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Consultative Selling",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Customer Education",
      "experience": 5
    },
    {
      "skill": "CRM System Management",
      "experience": 5
    },
    {
      "skill": "Digital Technology Implementation",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Use insights and a consultative selling approach to teach customers about their industry and their customers; challenge them to modernize and grow their business; assist them in implementing digital technology and refine office processes."
    },
    {
      "duty": "Achieve quarterly and yearly territory sales targets."
    },
    {
      "duty": "Manage a defined geography of accounts (General Dentists) to grow the business; onboard new high potential accounts."
    },
    {
      "duty": "Plan and execute a Territory plan, based on understanding the potential in each account in the defined geography."
    },
    {
      "duty": "Create & execute account plans for highest potential accounts, based on deep understanding of the account’s business, goals, challenges and opportunities."
    },
    {
      "duty": "Utilize data/analytics to help customer’s drive decision making."
    },
    {
      "duty": "Educate customers on products to ensure the practice is clinically comfortable with Invisalign and iTero products and services."
    },
    {
      "duty": "Communicate cross-functionally to develop an in-depth understanding of the business needs to clearly articulate fit with Align product, digital platform, and solution capabilities."
    },
    {
      "duty": "Orchestrate additional internal Company resources to optimize the customer experience and provide ongoing promotion of Align solutions."
    },
    {
      "duty": "Be creative, self-disciplined and capable of identifying and completing critical tasks independently with a high sense of urgency."
    },
    {
      "duty": "Be agile and capable of engaging customers in a virtual selling environment."
    },
    {
      "duty": "Listen, understand, and analyze customer needs to tailor products and services to deliver a best in class customer experience."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree and/or equivalent experience requiredMinimum of 4 years of experience required. Experience can be outside business-to-business (B2B) sales experience or industry experience selling a medical device, capital equipment, dental, orthodontic, or other relevant combination of sales (inside or outside) and industry experience. Proven track record of achieving sales goalsValid driver’s licenseBusiness & Marketing knowledge: Ability & comfort having business discussions (Cash Flow Analysis, ROI, P&L) and asking the right business questionsComfort with having clinical discussions regarding both Invisalign and iTero productsProficiency with Microsoft Office applications. Experience with a CRM system, Salesforce preferred, and virtual communication platforms"
    }
  ]
}