{
  "meta": [
    {
      "job_title": "Cell Therapy Associate",
      "job_category": "Science and Research",
      "job_class": "Associate",
      "sector": "Pharmaceuticals",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cell Culture Techniques",
      "experience": 3
    },
    {
      "skill": "Aseptic Techniques",
      "experience": 3
    },
    {
      "skill": "GMP Knowledge",
      "experience": 3
    },
    {
      "skill": "Documentation Practices",
      "experience": 3
    },
    {
      "skill": "Biobanking",
      "experience": 3
    },
    {
      "skill": "Good Manufacturing Practices (GMPs)",
      "experience": 3
    },
    {
      "skill": "Training",
      "experience": 3
    },
    {
      "skill": "Technical Writing",
      "experience": 3
    },
    {
      "skill": "Quality Assurance",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manufacture cell therapy products per manufacturing batch records and in compliance with current regulations and quality standards."
    },
    {
      "duty": "Perform operations in a cleanroom environment, applying controls to assure aseptic processing including gowning, cleaning, and isolation procedures."
    },
    {
      "duty": "Document each task involving manufacturing procedures, line clearance, maintenance, and cleaning procedures per Good Documentation Practices (GDPs) upon completion."
    },
    {
      "duty": "Accurately account for biobanking and dispensation of seed material and finished product."
    },
    {
      "duty": "Prepare documentation of non-conformance, deviations, and CAPAs."
    },
    {
      "duty": "Train junior associates on technical and facility cleaning procedures, analyze manufacturing data for trending, perform review of executed records, work with others to assist in transfer of new procedures into manufacturing."
    },
    {
      "duty": "Collaborate with Development to transfer new procedures into Manufacturing."
    },
    {
      "duty": "May provide direction to junior staff and act as lead when necessary."
    },
    {
      "duty": "Utilize and perform maintenance on equipment per standard operating procedures."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree with some GMP experience or knowledge and some undergraduate research or an industry internship in the lab."
    }
  ]
}