{
  "meta": [
    {
      "job_title": "Civil Design Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "CAD/GIS",
      "experience": 3
    },
    {
      "skill": "Data analysis",
      "experience": 3
    },
    {
      "skill": "Technical writing",
      "experience": 3
    },
    {
      "skill": "Construction standards",
      "experience": 3
    },
    {
      "skill": "Swift acquisition of technical knowledge",
      "experience": 3
    },
    {
      "skill": "Computer-aided drafting",
      "experience": 3
    },
    {
      "skill": "Quality assurance",
      "experience": 3
    },
    {
      "skill": "Quality control",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform fundamental design and modeling tasks, and provide assistance in preparing permit applications, CAD, or GIS work."
    },
    {
      "duty": "Evaluate, choose, and apply appropriate engineering techniques to assigned tasks."
    },
    {
      "duty": "Contribute to data research, collection, and compilation efforts."
    },
    {
      "duty": "Analyze and correlate scientific and engineering data, identifying inconsistencies in results through a series of interconnected detailed steps or processes."
    },
    {
      "duty": "Support in the preparation of reports, studies, and technical memoranda."
    },
    {
      "duty": "Engage in ongoing professional development."
    },
    {
      "duty": "Assume responsibility for the quality of submitted work."
    },
    {
      "duty": "Review, assess, and validate the accuracy and feasibility of designs, data, reports, and other documents before advancing them for further review."
    },
    {
      "duty": "Uphold proper quality assurance and quality control on projects, adhering to the Clients Quality Program to ensure alignment with Company, industry, and client standards and expectations."
    },
    {
      "duty": "Meet project deadlines and communicate any encountered difficulties during assignments to the Supervising Engineer or Project Manager."
    },
    {
      "duty": "Submit work for timely quality control review, ensuring comprehensive presentation."
    },
    {
      "duty": "Manage personal contributions to projects to ensure the generation of high-quality outcomes within the prescribed timeline."
    },
    {
      "duty": "Provide pertinent information to the marketing team and other stakeholders within the Company, as requested."
    },
    {
      "duty": "Potentially interact directly with clients."
    },
    {
      "duty": "Present a polished and positive representation of the Client."
    },
    {
      "duty": "Holding a valid Driver's License with an acceptable Motor Vehicle Report (MVR)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Possession of a Bachelor of Science (BS) degree in Engineering from an accredited college or university."
    },
    {
      "credential": "Holding a valid Driver's License with an acceptable Motor Vehicle Report (MVR)."
    }
  ]
}