{
  "meta": [
    {
      "job_title": "Firefighter",
      "job_category": "Emergency Services",
      "job_class": "Firefighter",
      "sector": "Fire & Emergency Services",
      "salary": 57000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs all activities associated with structural firefighting."
    },
    {
      "duty": "Performs all activities associated with rescue operations."
    },
    {
      "duty": "Performs all activities associated with Airfield Rescue and Firefighting (ARFF)."
    },
    {
      "duty": "Performs all activities associated with providing medical care to the sick/ injured in accordance with standard practices and protocols."
    },
    {
      "duty": "Completes all recurring proficiency training as required."
    },
    {
      "duty": "Performs preventive maintenance on fire station facilities and apparatus."
    },
    {
      "duty": "Performs inspection and routine maintenance on specialized tools and equipment."
    },
    {
      "duty": "Participates in periodic service testing of vehicles and equipment."
    },
    {
      "duty": "Ability to work at heights, within hazardous environments and under hazardous conditions."
    },
    {
      "duty": "Ability to work in enclosed spaces while wearing a full facemask, non-claustrophobic."
    },
    {
      "duty": "Ability to work well with others as part of a team."
    },
    {
      "duty": "Ability to function under duress."
    },
    {
      "duty": "Must pass an annual performance fitness evaluation consisting of essential job tasks."
    },
    {
      "duty": "Must function effectively while wearing respiratory protection -- face mask with self-contained breathing apparatus (SCBA)."
    },
    {
      "duty": "Must meet the medical requirements outlined in NFPA 1582, Comprehensive Occupational Medical Program for Fire Departments, Chapter 6."
    },
    {
      "duty": "Must participate in mandatory on-duty exercise and fitness training program."
    },
    {
      "duty": "Must participate in an annual fitness assessment consisting of the following components: aerobic capacity, body composition, muscular strength, muscular endurance, and flexibility."
    },
    {
      "duty": "Must participate in an annual respiratory protection training evaluation in accordance with requirements of NFPA 1404, Standard for Fire Service Respiratory Protection Training."
    },
    {
      "duty": "Must complete strenuous fireground tasks as assigned during an emergency or in a training environment."
    },
    {
      "duty": "Lifting, pushing, pulling over 50 lbs. (two-men assist) Working positions required walking, standing, crawling, kneeling, sitting, cramped and work requiring repeated or frequent stair climbing."
    },
    {
      "duty": "Require customer contact, extended workday, confined work area, field assignment, and inclement weather."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 30,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent."
    },
    {
      "credential": "21 years of age"
    },
    {
      "credential": "Current Driver’s License"
    },
    {
      "credential": "Professional Certifications (IFSAC or ProBoard affiliate):Fire Fighter IFire Fighter IIAirport FirefighterHazMat - Operations"
    },
    {
      "credential": "Current National Registry of Emergency Medical Technician - Basic (NREMT-B) license or higher."
    },
    {
      "credential": "Current CPR/AED card-- American Heart Association (AHA) or American Red Cross (ARC) affiliate."
    },
    {
      "credential": "PC skills: Microsoft Office: Word, Excel, Outlook, and Power Point"
    }
  ]
}