{
  "meta": [
    {
      "job_title": "Pet Care Specialist",
      "job_category": "Petcare",
      "job_class": "Specialist",
      "sector": "Petcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Guest Experience",
      "experience": 3
    },
    {
      "skill": "Animal Health",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Cashiering",
      "experience": 3
    },
    {
      "skill": "Point-of-Sale Service",
      "experience": 3
    },
    {
      "skill": "Loss Prevention",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Animal Care",
      "experience": 3
    },
    {
      "skill": "Housekeeping",
      "experience": 3
    },
    {
      "skill": "Safety Procedures",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide optimal guest experience services, assist guests in selecting merchandise, and demonstrate a high level of interest in the welfare, health, and proper handling of all animals."
    },
    {
      "duty": "Perform cashiering duties and related duties in support of the store's sales goal."
    },
    {
      "duty": "Ensure merchandise is properly stocked and priced, and adhere to operational guidelines and store policies."
    },
    {
      "duty": "Interact professionally and effectively with all professional contacts, providing prompt and courteous service to guests."
    },
    {
      "duty": "Assist in stocking and facing merchandise, complete cash register transactions, and perform housekeeping tasks to maintain the store's professional image."
    },
    {
      "duty": "Adhere to and promote established safety procedures and maintain a clean, safe, and healthy environment for store partners, guests, and animals."
    },
    {
      "duty": "Assist in the loading, unloading, and stocking of merchandise according to established procedures and participate in the completion of quarterly and annual physical inventory counts."
    },
    {
      "duty": "Ensure the health and well-being of live animals by providing correct care in accordance with Petco standards, policies, and procedures."
    },
    {
      "duty": "Assist store leadership in the opening/closing of the store as needed, including the accurate completion of required paperwork."
    },
    {
      "duty": "Perform routine housekeeping tasks and special projects as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent"
    }
  ]
}