{
  "meta": [
    {
      "job_title": "Certified Nursing Assistant",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides direct and indirect patient care under the direction of a RN or physician."
    },
    {
      "duty": "Assists patients with activities of daily living, provides for personal care, emotional support and performs more complex clinical skills under the direction of a RN."
    },
    {
      "duty": "Provide secretarial functions as needed for unit to function."
    },
    {
      "duty": "Performs patient care responsibilities considering needs specific to the standard of care for patient's age."
    },
    {
      "duty": "Provides care appropriate to condition and patient's age, including pediatric, geriatric and the general patient population."
    },
    {
      "duty": "Assists with patient admissions, discharge and transfers."
    },
    {
      "duty": "Provides morning and evening care which includes bathing, hygiene, dressing, changing bed linen, and other general care."
    },
    {
      "duty": "Provides general nursing care, assists in use of special equipment, and prepares patients for meals."
    },
    {
      "duty": "Takes and records vital signs, reports patient conditions, and assists in patient care procedures."
    },
    {
      "duty": "Answers patients' calls, anticipates needs, and transports patients for tests/procedures."
    },
    {
      "duty": "Demonstrates the ability to perform procedures within the CNA II's scope of practice per state law."
    },
    {
      "duty": "Skilled on computer and updating patient information appropriately, knowledgeable of sterile techniques and infection control procedures."
    },
    {
      "duty": "Participates in patient care conferences and attends in-service education programs."
    },
    {
      "duty": "Treats patients and families with respect and dignity, maintains a good working relationship within the department and with other departments."
    },
    {
      "duty": "Manages and operates equipment safely and correctly, performs bedside report on patients at shift change."
    },
    {
      "duty": "Regulatory Requirements: High School graduate or equivalent, Current CNA certification in the state of Nebraska, Current BLS certificate, One year of experience as a CNA in an acute care hospital preferred."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High School graduate or equivalent, Current CNA certification in the state of Nebraska, Current BLS certificate, One year of experience as a CNA in an acute care hospital preferred."
    }
  ]
}