{
  "meta": [
    {
      "job_title": "Seasonal Cook",
      "job_category": "Culinary",
      "job_class": "Cook",
      "sector": "Culinary",
      "salary": 26.0,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Menu Planning",
      "experience": 4
    },
    {
      "skill": "Food Preparation",
      "experience": 4
    },
    {
      "skill": "Kitchen Equipment Operation",
      "experience": 4
    },
    {
      "skill": "Food Safety and Sanitation",
      "experience": 4
    },
    {
      "skill": "Nutrition Knowledge",
      "experience": 3
    },
    {
      "skill": "Culinary Program Participation",
      "experience": 3
    },
    {
      "skill": "Recipe Comprehension",
      "experience": 4
    },
    {
      "skill": "Math Skills",
      "experience": 4
    },
    {
      "skill": "Inventory Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review menus and customer orders, properly measures and portions all food items."
    },
    {
      "duty": "Plan menus and estimate required food quantities, labor, and overhead costs."
    },
    {
      "duty": "Lead the work of kitchen assistants in preparing, cooking, and storing food, as well as in maintaining kitchen and storage facilities in sanitary condition."
    },
    {
      "duty": "Utilize kitchen equipment to prepare food items and ensure proper food temperatures are maintained."
    },
    {
      "duty": "Ensure freshness and quality of all menu items and packages all products to proper specifications."
    },
    {
      "duty": "Perform opening, closing, and side work duties as instructed and according to proper guidelines."
    },
    {
      "duty": "Keep workstation, coolers, and equipment clean, organized, sanitized, and sufficiently stocked."
    },
    {
      "duty": "Follow and uphold all health codes and sanitation regulations."
    },
    {
      "duty": "Use waste control guidelines and record all waste on spoilage sheet."
    },
    {
      "duty": "Complete end of day inventory and other opening/closing duties in accordance with company checklists and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 10,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "3 to 4 years cooking experience in upscale establishments required."
    },
    {
      "credential": "Degree/experience with nutrition preferred."
    },
    {
      "credential": "Participation in a culinary program preferred."
    },
    {
      "credential": "Ability to read and comprehend prep sheets and recipes."
    },
    {
      "credential": "Basic math skills; ability to understand, calculate and follow recipe measurements and proportions."
    },
    {
      "credential": "Reliable transportation to workplace."
    },
    {
      "credential": "Manual dexterity sufficient for food preparation and cooking."
    },
    {
      "credential": "Physical ability to handle or operate dangerous kitchen equipment."
    },
    {
      "credential": "Standing and walking for entire shift length."
    },
    {
      "credential": "Frequently required to reach, twist, bend, and squat."
    },
    {
      "credential": "Kitchen environment awareness and ability to work in hot and damp conditions."
    }
  ]
}