{
  "meta": [
    {
      "job_title": "Vice President of Service Delivery",
      "job_category": "Operations",
      "job_class": "Vice President",
      "sector": "Management",
      "salary": 250000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Operations Management",
      "experience": 15
    },
    {
      "skill": "Team Leadership",
      "experience": 15
    },
    {
      "skill": "Logistics Management",
      "experience": 15
    },
    {
      "skill": "Budget Management",
      "experience": 15
    },
    {
      "skill": "Project Management",
      "experience": 15
    },
    {
      "skill": "Data Management",
      "experience": 15
    },
    {
      "skill": "Customer Service",
      "experience": 15
    },
    {
      "skill": "Strategic Planning",
      "experience": 15
    },
    {
      "skill": "Executive Relationship Management",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Operate and manage all aspects of the order fulfillment Design, Partner Managment, Dispatch, Install and Project Management functions to ensure the effective coordination of all activities necessary to the delivery of services."
    },
    {
      "duty": "Manage a distributed Operations team dedicated to the efficient delivery of customer services."
    },
    {
      "duty": "Create and effectively deliver design and implementation services for more complex network solutions."
    },
    {
      "duty": "Manage the Logistics function to ensure that all necessary materials are available when needed to facilitate the most efficient delivery of services."
    },
    {
      "duty": "Provide effective, honest, and clear feedback on performance of direct reports and ensure that they do the same with their subordinates."
    },
    {
      "duty": "Coordinate the filtering and qualification process for all proposed Solutions opportunities to ensure that they fit with the strategic direction of the company."
    },
    {
      "duty": "Participate in the development and management of budgets related to the Service Delivery."
    },
    {
      "duty": "Gather and provide to Product Management and/or Marketing, any information, suggestions, or other feedback that could lead to the refinement of existing products or development of new products based on customer information and solution design."
    },
    {
      "duty": "Ensure that technology and systems are effectively utilized to facilitate the delivery of services, with an emphasis on automation whenever possible."
    },
    {
      "duty": "Ensure that the proper data management practices are in place necessary for the accurate billing of the customer, the efficient operation of the company and the efficient management of the Service Delivery function."
    },
    {
      "duty": "Participate in the sales cycle with Strategic Account Executives and Sales Directors or VPs, as needed or desired to assist in closing new business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or advanced degree preferable or relevant experience."
    }
  ]
}