{
  "meta": [
    {
      "job_title": "Safety and Security Officer",
      "job_category": "Security",
      "job_class": "Officer",
      "sector": "Security",
      "salary": 34000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Enforce all authorized laws, rules, and regulations to protect life and property against theft, misappropriation, vandalism, fire, flood, or similar disaster."
    },
    {
      "duty": "Provide vehicle transportation support function under the direction of the supervisor in compliance with government, corporate, and management directives."
    },
    {
      "duty": "Investigate vehicular accidents at the center and issue visitor passes and temporary vehicle permits."
    },
    {
      "duty": "Maintain harmonious relationships with local law enforcement agencies and provide escort service as directed."
    },
    {
      "duty": "Participate in the disciplinary process as established at the center, including zero tolerance for violence and drugs."
    },
    {
      "duty": "Maintain accountability of staff, students, and property, adhering to safety practices in all areas of responsibility."
    },
    {
      "duty": "Cultivate and maintain a climate on the center that is free of harassment, intimidation, bullying, and disrespect to provide a safe place for staff and students to work and learn."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School graduate or equivalent (Prefer 1 year of experience in a security department, law enforcement agency, or experience with security duties)."
    },
    {
      "credential": "Valid driver’s license with acceptable driving record preferred (Prefer Commercial Driver’s License (CDL))"
    },
    {
      "credential": "Prefer knowledge of riot and crowd control techniques and law enforcement procedures."
    },
    {
      "credential": "Must maintain CPR/FA Certification. Ability to obtain a bus driver's license."
    },
    {
      "credential": "Excellent communication skills, both oral and written. Position requires an ability to operate office equipment and drive an automobile."
    }
  ]
}