{
  "meta": [
    {
      "job_title": "Principal Research Scientist",
      "job_category": "Research and Development",
      "job_class": "Scientist",
      "sector": "Healthcare",
      "salary": 150000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive research strategies to lead state-of-the-art and innovative cardiovascular research within the Center for Cardiovascular Analytics, Research and Data Science (CARDS)."
    },
    {
      "duty": "Partner with the larger Providence system and collaborate with external investigators to independently conduct scientific research in support of ongoing transformation or innovation efforts in cardiovascular research."
    },
    {
      "duty": "Act as an independent investigator or co-investigator on health services research projects, develop partnerships, and acquire grant or sponsor funding to support projects."
    },
    {
      "duty": "Manage projects to ensure completion on time and budget and ensure compliance with regulatory requirements governing research."
    },
    {
      "duty": "Disseminate results internally to leadership and other Providence researchers and externally through participation in scientific meetings and peer-reviewed publications."
    },
    {
      "duty": "Collaborate with clinical, operational, and research leaders within the Heart Institute and the Providence Research Network Hub."
    },
    {
      "duty": "Lead research and research teams that leverage technologies in support of improved evaluation and treatment of various cardiovascular conditions."
    },
    {
      "duty": "Provide leadership, training, and strategic insight for an established cardiovascular research center."
    },
    {
      "duty": "Develop methods, techniques, and evaluation criteria for solving research problems and answering research questions."
    },
    {
      "duty": "Manage project budgets to accomplish stated objectives and keep projects within scope of available resources."
    },
    {
      "duty": "Responsible for obtaining internal or external funding to implement research project or study in conjunction with Medical Director and CARDS Director and serve as principal investigator on grant applications."
    },
    {
      "duty": "Mentor research staff members."
    }
  ],
  "skills": [
    {
      "skill": "Scientific Research",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Health Services Research",
      "experience": 10
    },
    {
      "skill": "Grant Writing",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Publication",
      "experience": 10
    },
    {
      "skill": "Mentoring",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "PhD, ScD, DrPH in Health Services, Data Science, Public Health, Epidemiology, Laboratory Science or related medical field"
    }
  ]
}