{
  "meta": [
    {
      "job_title": "Aquatic Life Specialist",
      "job_category": "Animal Care",
      "job_class": "Specialist",
      "sector": "Veterinary",
      "salary": 37000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide a great experience by engaging with guests utilizing your acquired skills and training."
    },
    {
      "duty": "Assist guests in the proper selection of merchandise in accordance with their identified needs."
    },
    {
      "duty": "Demonstrate a high level of interest in the welfare, health, and proper handling of all animals."
    },
    {
      "duty": "Ensure that proper aquatic care and husbandry is being provided to our aquatic life in the store."
    },
    {
      "duty": "Act as the primary resource in their assigned store regarding all aquatic life education and care."
    },
    {
      "duty": "Responsible for the achievement of the store's budgeted sales goals by driving sales in the aquatic life areas."
    },
    {
      "duty": "Independently prioritize and accomplish multiple tasks within established timeframes such as caring for aquatic life, maintaining proper water quality, setting up and maintaining displays and merchandise kits for sale, and placing aquatic life orders."
    },
    {
      "duty": "Perform all aspects of point-of-sale service, e.g. cash sales, credit and check sales, returns and exchanges."
    },
    {
      "duty": "Complete cash register transactions as well as guest carry-out service consisting of merchandise weighing up to but not exceeding 50 pounds per trip."
    },
    {
      "duty": "Maintain honesty and integrity in the work area."
    },
    {
      "duty": "Move merchandise up to 50 pounds."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 60,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Animal Science, Veterinary Science, or a related field"
    }
  ]
}