{
  "meta": [
    {
      "job_title": "Principal Product Development Project Management Specialist",
      "job_category": "Project Management",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 135000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Medical Device Development",
      "experience": 7
    },
    {
      "skill": "ISO 13485 Standards",
      "experience": 7
    },
    {
      "skill": "PMP Certification",
      "experience": 7
    },
    {
      "skill": "Cross-functional Team Management",
      "experience": 7
    },
    {
      "skill": "Budget Management",
      "experience": 7
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads cross functional teams to manage projects for product development and ongoing lifecycle management."
    },
    {
      "duty": "Oversees the operational aspects of ongoing projects and serves as a liaison between project management and planning, project team, and line management."
    },
    {
      "duty": "Manages the development and implementation process of the company’s products and services involving departmental or cross-functional teams."
    },
    {
      "duty": "Monitors project status, budgets, schedules, and prepares status reports."
    },
    {
      "duty": "Assesses project issues and develops resolutions to meet productivity, quality, and client-satisfaction goals and objectives."
    },
    {
      "duty": "Develops mechanisms for monitoring project progress, and intervenes and problem solves with project managers, line managers, and clients."
    },
    {
      "duty": "Gathers requirements, works on requirements planning, requirements elicitation, and requirements management to ensure they meet demands of project’s key stakeholders."
    },
    {
      "duty": "Communicates with stakeholders to ensure the end products or processes will solve the business problems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Project Management, Engineering, or a related field (Master's preferred)"
    },
    {
      "credential": "PMP Certification or other formal Project Management training and experience"
    }
  ]
}