{
  "meta": [
    {
      "job_title": "Delivery Assurance Specialist",
      "job_category": "Logistics",
      "job_class": "Specialist",
      "sector": "Supply Chain",
      "salary": 58000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Manufacturing Industry Experience",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Aerospace Management",
      "experience": 5
    },
    {
      "skill": "Supplier Management",
      "experience": 5
    },
    {
      "skill": "Multi-tasking",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Track, monitor, validate, expedite, and report real-time part delivery status between Prime Aerospace customers and their supplier base."
    },
    {
      "duty": "Communicate potential shipping delays, identify root causes with suppliers, and establish recovery plans."
    },
    {
      "duty": "Support manufacturing shops to expedite 'On Time' part deliveries to major aerospace production companies."
    },
    {
      "duty": "Create daily status reports and communicate the results with customers and prime aerospace manufacturers."
    },
    {
      "duty": "Develop strong relationships with suppliers and monitor the flow of critical/hot parts through the supplier's manufacturing shop."
    },
    {
      "duty": "Assume responsibility for cutting purchase orders on behalf of the customer, reporting and tracking detailed milestones, and more."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Five years' experience working in the manufacturing industry with a strong knowledge of the manufacturing process."
    },
    {
      "credential": "Knowledge of complex machines and processes (grind, deburr, heat treat, lathe, rough machine, finish machine, thread roll, cad plating, chrome plating, prime, passivate, anodize) REQUIRED FOR CONSIDERATION OF THIS POSITION."
    },
    {
      "credential": "Proficient with Microsoft Office Products (understanding of Excel 2010 basic principles are mandatory)"
    },
    {
      "credential": "Proven communication skills and detail oriented."
    },
    {
      "credential": "Reliable transportation - must have current/active driver's license and reliable vehicle for driving to suppliers."
    },
    {
      "credential": "Aerospace background REQUIRED."
    },
    {
      "credential": "Expediting/Supplier Management experience REQUIRED."
    },
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}