{
  "meta": [
    {
      "job_title": "Customer Service Advisor",
      "job_category": "Customer Service",
      "job_class": "Advisor",
      "sector": "Retail",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide guests with exceptional customer service by being the subject matter expert on all products, nutrition, services, in-store promotions, local community events and other areas of animal care and wellness. The Guest Advisor may be a \n'key holder' and Leader on Duty (LOD) on a limited basis as needed."
    },
    {
      "duty": "Act as a personal shopper/information center for customers as they enter the store and be 100% focused on customer service. Provide quick and courteous service to all PETCO customers and their pets by determining their needs and sharing product knowledge to suggest the appropriate merchandise and services to satisfy them. Performs all aspects of point-of-sale service, e.g. cash sales, credit and check sales, returns and exchanges. Performs the daily balance of cash drawer as necessary. Completes cash register transactions as well as guest carry-out service consisting of merchandise weighing up to but not exceeding 50 pounds per trip. Be knowledgeable about pet-related events/resources and related costs within the community including dog parks, dog or cat shows, pet-friendly hotels, etc. Express passion about animal welfare and maintain integrity in the work area. Be familiar with all new products and services in order to be able to engage with customers regarding new product and services features and benefits. Politely and professionally respond to inquiries regarding products, services and pricing via the telephone. Bend, kneel, lift (up to 50 pounds, as necessary) and stand for long periods of time."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Point-of-Sale Management",
      "experience": 5
    },
    {
      "skill": "Cash Handling",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Event Knowledge",
      "experience": 5
    },
    {
      "skill": "Animal Welfare",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Physical Stamina",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent"
    }
  ]
}