{
  "meta": [
    {
      "job_title": "Security Officer",
      "job_category": "Security",
      "job_class": "Officer",
      "sector": "Security",
      "salary": 33000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Enforce all authorized laws, rules, and regulations to protect life and property against theft, misappropriation, vandalism, fire, flood, or similar disaster."
    },
    {
      "duty": "Perform alarm and patrol duties in assigned areas to ensure safety and security."
    },
    {
      "duty": "Provide vehicle transportation support function in compliance with government, corporate, and management directives."
    },
    {
      "duty": "Aid and assist visitors, students, and staff, and perform building security and safety checks."
    },
    {
      "duty": "Receive complaints, makes appropriate preliminary investigations, and maintains harmonious relationships with local law enforcement agencies."
    },
    {
      "duty": "Provide escort service, investigate vehicular accidents at the center, and issue visitor passes and temporary vehicle permits."
    },
    {
      "duty": "Prepare written accident reports, maintain security log and enforce center pass policy."
    },
    {
      "duty": "Attend required in-service training sessions and participate in the disciplinary process at the center, including zero tolerance for violence and drugs."
    },
    {
      "duty": "Assist in Reception functions, act as a switchboard operator, and adhere to the organization's Quality Assurance Plan."
    },
    {
      "duty": "Maintain accountability of staff, students, and property, and adhere to safety practices in all areas of responsibility."
    },
    {
      "duty": "Cultivate and maintain a climate on the center that is free of harassment, intimidation, bullying, and disrespect."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 20,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High School graduate or equivalent. Prefer 1 year of experience in a security department, law enforcement agency, or experience with security duties. Valid driver’s license with acceptable driving record preferred. Prefer Commercial Driver’s License (CDL). Prefer knowledge of riot and crowd control techniques, law enforcement procedures, and CPR/FA Certification. Ability to obtain a bus driver's license."
    }
  ]
}