{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Recruiting",
      "experience": 5
    },
    {
      "skill": "Delegation",
      "experience": 5
    },
    {
      "skill": "Planning",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Cash-handling",
      "experience": 5
    },
    {
      "skill": "Retail Experience",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Advocating",
      "experience": 5
    },
    {
      "skill": "Safety and Security",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Store Manager with oversight of station store operations, including hiring, supervising, and working with the staff to accomplish daily tasks, bookkeeping, and merchandising."
    },
    {
      "duty": "Maintain high standards and provide fast and friendly service to customers, including executing the food program effectively."
    },
    {
      "duty": "Lead a team of employees and management, recruiting, interviewing, and hiring staff, and delegating and following up on tasks."
    },
    {
      "duty": "Resolving routine customer concerns, maintaining the overall store facility's condition, and ensuring product areas are stocked, rotated, and displayed effectively."
    },
    {
      "duty": "Ensuring all shift sales are completed in accordance with company policies and keeping accurate cash, sales, payroll, and inventory control records."
    },
    {
      "duty": "Assisting the Store Manager in maintaining a safe environment for employees and customers, and preparing or assisting in the preparation of periodic sales, product, and operating reports."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent plus 6 months to 1 year of retail and management work experience preferred."
    },
    {
      "credential": "Knowledge of basic business and customer service principles"
    }
  ]
}