{
  "meta": [
    {
      "job_title": "Home Health Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide admission, case management, and follow-up skilled nursing visits for home health patients."
    },
    {
      "duty": "Administer on-going care and case management for each patient, provide necessary follow-up as directed by the Clinical Manager."
    },
    {
      "duty": "Confer with physician in developing the initial plan of treatment based on physician's orders and initial patient assessment."
    },
    {
      "duty": "Coordinate appropriate care, encompassing various healthcare personnel (such as Physical Therapists, Occupational Therapists, Home Health Aides, and external providers)."
    },
    {
      "duty": "Report patient care/condition/progress to patient's physician and Clinical Manager on a continuous basis."
    },
    {
      "duty": "Coordinate/oversee/supervise the work of Home Health Aides, Certified Home Health Aides, and Personal Care Workers and provides written personal care instructions/care plan that reflect current plan of care."
    },
    {
      "duty": "Discharge patients after consultation with the physician and Clinical Manager, preparing and completing needed clinical documentation."
    },
    {
      "duty": "Prepare appropriate medical documentation on all patients, including any case conferences, patient contacts, medication order changes, re-certifications, progress updates, and care plan changes."
    }
  ],
  "skills": [
    {
      "skill": "Skilled Nursing",
      "experience": 3
    },
    {
      "skill": "Case Management",
      "experience": 3
    },
    {
      "skill": "Patient Assessment",
      "experience": 3
    },
    {
      "skill": "Healthcare Coordination",
      "experience": 3
    },
    {
      "skill": "Clinical Documentation",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "Diploma, Associate, or Bachelor Degree in Nursing"
    },
    {
      "credential": "Current and unrestricted Registered Nurse licensure"
    },
    {
      "credential": "Current CPR certification"
    },
    {
      "credential": "Valid driver’s license, auto insurance and reliable transportation."
    }
  ]
}