{
  "meta": [
    {
      "job_title": "Home Health LVN",
      "job_category": "Healthcare",
      "job_class": "LVN",
      "sector": "Healthcare",
      "salary": 52000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Provide professional nursing services under the direction of a RN in compliance with the state's Nurse Practice Act, any applicable licensure/certification requirement, applicable healthcare standards, governmental laws and regulations, and CenterWell Home Health policies and procedures."
    },
    {
      "duty": "Provide skilled nursing interventions in the treatment of the patient/clients illness, rehabilitative needs and preventative care."
    },
    {
      "duty": "Utilize a holistic approach in the provision of problem specific therapeutic interventions, teaching and training activities in accordance with the plan of care."
    },
    {
      "duty": "Confer with the RN Supervisor regarding needed changes in the Plan of Treatment. Accept verbal orders from physician were permitted by state law/regulations/Nurse Practice Act and communicate these orders to the RN Supervisor."
    },
    {
      "duty": "Maintain contact with patients, physicians, clinical manager(s), other members of the healthcare team in a timely manner regarding patient/family needs and status changes. Participate in care coordination activities and discharge planning as appropriate."
    },
    {
      "duty": "Prepare, submit and maintain documentation as required by the Company and/or facility. Visit/shift notes documented on day services are rendered."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Graduate of an accredited Licensed Practical Nursing Program or accredited School of Vocational Nursing. Current nursing license in the practicing state. Valid drivers license, auto insurance and reliable transportation. Current CPR certification. Two years experience as an LPN/LVN"
    }
  ]
}