{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Recruiting",
      "experience": 3
    },
    {
      "skill": "Delegation",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Cash Handling",
      "experience": 3
    },
    {
      "skill": "Retail Experience",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "High School/College Education",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Store Manager with oversight of the Station Store operations, including hiring, supervising, and working with the staff to accomplish daily tasks, bookkeeping, and merchandising."
    },
    {
      "duty": "Maintain high standards and provide fast and friendly service to customers, while supervising and executing the food program."
    },
    {
      "duty": "Lead a team of employees and management, including recruiting, interviewing, hiring, delegation, follow-up, teaching, motivating, planning, organizing, communicating, problem-solving, advocating, and empathizing."
    },
    {
      "duty": "Ensure all shift sales are completed in accordance with company policies and maintain accurate cash, sales, payroll, and inventory control records."
    },
    {
      "duty": "Oversee the activities of store employees, provide feedback to help employees improve performance, implement non-discriminatory related management skills, and maintain a safe environment for employees and customers."
    },
    {
      "duty": "Prepare periodic sales, product, and operating reports as directed by the Store Manager, and attend job-related meetings."
    },
    {
      "duty": "Provide regular and predictable onsite attendance and perform all duties with minimal supervision."
    },
    {
      "duty": "Assist in maintaining proper inventory levels and shift audits, and complete daily store reports and other duties as assigned by the Store Manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent, plus 6 months to 1 year of retail and management work experience preferred."
    }
  ]
}