{
  "meta": [
    {
      "job_title": "Azure Platform Architect with ACC Experience",
      "job_category": "Software Engineering",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Azure Architecture",
      "experience": 5
    },
    {
      "skill": "Cloud Infrastructure Design",
      "experience": 5
    },
    {
      "skill": "Azure Services",
      "experience": 5
    },
    {
      "skill": "Infrastructure-as-Code",
      "experience": 5
    },
    {
      "skill": "Microservices Architecture",
      "experience": 5
    },
    {
      "skill": "Containerization Technologies",
      "experience": 5
    },
    {
      "skill": "Security & Compliance",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "iPaaS & adjacencies",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and architect scalable, secure, and high-performance solutions on the Azure platform."
    },
    {
      "duty": "Collaborate with stakeholders to understand business requirements and translate them into technical solutions."
    },
    {
      "duty": "Implement Azure architecture best practices, standards, and guidelines to ensure consistency and maintainability across projects."
    },
    {
      "duty": "Evaluate and recommend appropriate Azure services and technologies based on project objectives, scalability, performance, and cost considerations."
    },
    {
      "duty": "Ensure compliance with security and data privacy regulations, implementing appropriate measures and controls in the Azure architecture."
    },
    {
      "duty": "Stay updated with the latest Azure services, features, and industry trends, exploring opportunities to leverage new technologies and enhance the Azure platform."
    },
    {
      "duty": "Provide technical leadership and guidance to development teams and stakeholders, ensuring adherence to Azure architectural standards and best practices."
    },
    {
      "duty": "Conduct architectural reviews and assessments of existing and proposed Azure solutions, providing recommendations for improvements and optimizations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Computer Science, Engineering, or a related field."
    },
    {
      "credential": "Azure Solutions Architect Expert or Azure DevOps Engineer Expert certifications are a plus."
    }
  ]
}