{
  "meta": [
    {
      "job_title": "Home Health Physical Therapist Assistant",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Administer the physical therapy treatment plan as developed by the Physical Therapist."
    },
    {
      "duty": "Administer non-complex active and passive manual therapeutic exercises, therapeutic massage, traction heat, light, cold, water, and electrical modalities to patients."
    },
    {
      "duty": "Accurately documents daily, weekly, or monthly records of clients’. Submits clinical paperwork to the office on time each week."
    },
    {
      "duty": "Attend educational meetings and coordinates and contributes to department in-services."
    },
    {
      "duty": "Notify physical therapist or Executive Director of any equipment failures, lack of supplies, staff or client changes, and any other departmental schedule clients and performs varied office tasks."
    },
    {
      "duty": "Apply concepts of infection control and universal precautions in performing patient care activities."
    },
    {
      "duty": "Accept clinical assignments that are consistent with education and competence to care for patients."
    },
    {
      "duty": "Promote compliance with all fiscal intermediaries and/or other third-party payors, through education, coaching, and other assistance as necessary."
    },
    {
      "duty": "Meets mandatory continuing education requirements of Kindred at Home and licensing board. Maintains clinical competency in Physical Therapy practice and theory."
    },
    {
      "duty": "Ability to work a flexible schedule and travel locally."
    },
    {
      "duty": "Able to maintain confidentiality."
    },
    {
      "duty": "Maintains current licensure certifications and meets mandatory continuing education requirements."
    },
    {
      "duty": "Must read, write, and speak fluent English."
    },
    {
      "duty": "Must have good and regular attendance."
    },
    {
      "duty": "Performs other related duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Physical Therapy Treatment",
      "experience": 2
    },
    {
      "skill": "Clinical Documentation",
      "experience": 2
    },
    {
      "skill": "Educational Coordination",
      "experience": 2
    },
    {
      "skill": "Infection Control",
      "experience": 2
    },
    {
      "skill": "Continuing Education",
      "experience": 2
    },
    {
      "skill": "Flexible Schedule",
      "experience": 2
    },
    {
      "skill": "Confidentiality Maintenance",
      "experience": 2
    },
    {
      "skill": "Licensure Certifications",
      "experience": 2
    },
    {
      "skill": "Fluent English",
      "experience": 2
    },
    {
      "skill": "Good Attendance",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree in Physical Therapy from an American Physical Therapy Association."
    },
    {
      "credential": "Current state license to practice Physical Therapy."
    },
    {
      "credential": "Valid driver’s license, auto insurance and reliable transportation."
    },
    {
      "credential": "Proof of current CPR certification."
    },
    {
      "credential": "Minimum two years experience as a Physical Therapy Assistant."
    },
    {
      "credential": "Comprehensive knowledge of the physical, emotional, social, and biological changes that occur in the geriatric population."
    },
    {
      "credential": "Self-directed, enthusiastic, and accepts constructive feedback."
    },
    {
      "credential": "Demonstrates good verbal and written communication and organization skills."
    },
    {
      "credential": "Communicates and demonstrates a professional image/attitude for patients, families, clients, coworkers, and others."
    },
    {
      "credential": "Meets mandatory continuing education requirements of Kindred at Home and licensing board."
    },
    {
      "credential": "Maintains clinical competency in Physical Therapy practice and theory."
    },
    {
      "credential": "Ability to work a flexible schedule and travel locally."
    },
    {
      "credential": "Able to maintain confidentiality."
    },
    {
      "credential": "Maintains current licensure certifications and meets mandatory continuing education requirements."
    },
    {
      "credential": "Must read, write, and speak fluent English."
    },
    {
      "credential": "Must have good and regular attendance."
    }
  ]
}