{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Assistant Manager",
      "sector": "Retail",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Recruiting",
      "experience": 3
    },
    {
      "skill": "Staff Management",
      "experience": 4
    },
    {
      "skill": "Planning and Organizing",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Cash Management",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Merchandising",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Store Manager in overseeing station store operations including staff supervision, daily tasks, bookkeeping, and merchandising."
    },
    {
      "duty": "Maintain high standards and provide fast and friendly service to customers, ensuring customer satisfaction."
    },
    {
      "duty": "Execute the food program and set an example for the staff in terms of customer care and urgency."
    },
    {
      "duty": "Lead a team of employees, handling recruiting, interviewing, hiring, delegation, follow-up, teaching, motivating, and planning."
    },
    {
      "duty": "Ensure facility maintenance, cleanliness, and product display to enhance customer experience and drive sales."
    },
    {
      "duty": "Manage sales, financial controls, staff activities, security controls, and administrative duties as directed by the Store Manager."
    },
    {
      "duty": "Maintain accurate records of cash, sales, payroll, and inventory, troubleshoot daily close-out and shift sales analysis, and provide regular onsite attendance."
    },
    {
      "duty": "Prepare and transmit periodic sales, product, and operating reports, attend job-related meetings, and complete daily store reports."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 110,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent plus 6 months to 1 year of retail and management work experience preferred. Knowledge of basic business and customer service principles required."
    }
  ]
}