{
  "meta": [
    {
      "job_title": "Engineering Project Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Engineering",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for leading all engineering efforts for a project or projects on time and budget."
    },
    {
      "duty": "Ensure design compliance with all project requirements."
    },
    {
      "duty": "Review customer specifications and requirements, and lead a project team to develop designs to best support them, including cost as a key design variable."
    },
    {
      "duty": "Provide budget, cost, and schedule input for design assignments."
    },
    {
      "duty": "Communicate clearly (written and oral) with manufacturing, supply chain, program management, and the customer as required."
    },
    {
      "duty": "Participate heavily in preparation of the more complex and significant proposals."
    },
    {
      "duty": "Interact with technical management, other professionals, technicians, and support personnel to coordinate, recommend, and confer regarding technical activities and progress."
    },
    {
      "duty": "Lead project team(s) as assigned."
    },
    {
      "duty": "Support, communicate, reinforce and defend the mission, values and culture of the organization."
    },
    {
      "duty": "Attend appropriate engineering, customer or business meetings."
    },
    {
      "duty": "Mentor and coach less experienced engineers."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Engineering Design",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Proposal Writing",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Technical Coordination",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent combination of education and experience. Mastery of technologies and domain knowledge. Expected to have knowledge and experience in multiple engineering disciplines enough to lead engineers on the project team."
    }
  ]
}