{
  "meta": [
    {
      "job_title": "Scientist II",
      "job_category": "Life Sciences",
      "job_class": "Scientist",
      "sector": "BioSpecimen Management",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute assigned project activities using established procedures and applying scientific knowledge and accumulated experience to complete projects involving manipulating human cell lines, microorganism and/or other biological material."
    },
    {
      "duty": "Perform standard microbiological techniques to culture diverse bacterial isolates under aerobic and anaerobic conditions for banking and delivery to clients."
    },
    {
      "duty": "Maintain and optimize the growth of diverse microbes under various conditions and make recommendations to resolve problems encountered while performing procedures."
    },
    {
      "duty": "Summarize experimental results, and review conclusions with supervisor/project leader, may communicate the results of experiments in the form of reports and presentations."
    },
    {
      "duty": "Accountable for electronic records management and use of validated systems ensuring information is recorded in a timely manner, accurately and consistently."
    },
    {
      "duty": "Participate in routine lab maintenance, lab safety, and implementation of safety guidelines and procedures."
    },
    {
      "duty": "Responsible for maintaining an effective scientific knowledge base and effectively using broad scientific concepts to resolve problems of moderate scope and complexity."
    },
    {
      "duty": "Analyze alternative approaches to solve problems or develop new perspectives on existing solutions."
    }
  ],
  "skills": [
    {
      "skill": "Aseptic Techniques",
      "experience": 5
    },
    {
      "skill": "Bacterial Culture",
      "experience": 5
    },
    {
      "skill": "Microbial Taxonomy",
      "experience": 5
    },
    {
      "skill": "Biorepository Management",
      "experience": 5
    },
    {
      "skill": "Data Management",
      "experience": 5
    },
    {
      "skill": "Laboratory Safety",
      "experience": 5
    },
    {
      "skill": "Scientific Communication",
      "experience": 5
    },
    {
      "skill": "LIMS Software",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Molecular Biology, Cellular Biology, or Microbiology or related field and 4 years of relevant experience. Master’s Degree in Molecular Biology, Cellular Biology, or Microbiology or related field and 2 years of relevant experience."
    }
  ]
}