{
  "meta": [
    {
      "job_title": "Maintenance Automation Specialist",
      "job_category": "Industrial Maintenance",
      "job_class": "Specialist",
      "sector": "Engineering",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Equipment Maintenance",
      "experience": 5
    },
    {
      "skill": "Facility Maintenance",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Electrical Wiring",
      "experience": 5
    },
    {
      "skill": "Computerized Maintenance Management Systems (CMMS)",
      "experience": 5
    },
    {
      "skill": "Pneumatic Systems",
      "experience": 5
    },
    {
      "skill": "Hydraulic Systems",
      "experience": 5
    },
    {
      "skill": "PLC Systems",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct all repairs and preventative maintenance on facility and production equipment."
    },
    {
      "duty": "Coordinate and oversee the installation, maintenance, and replacement of automation systems, troubleshooting component parts, motion sensors, control components, photo sensors, PLC’s, and other automation-related equipment."
    },
    {
      "duty": "Service and maintain production-related equipment, including motors, conveyors, vibratory fillers, tub washer, flow wrapper, cookers, chillers, vertical and horizontal Form/Fill/Seal, modified atmosphere packaging equipment, etc."
    },
    {
      "duty": "Responsible for keeping the facility in good working order, coordinating work orders related to facility improvements and repairs, overseeing contractors conducting facility repairs, and maintaining records of equipment related to compliance requirements."
    },
    {
      "duty": "Ensure the maintenance shop is audit ready, organize shop tools and spare parts, and communicate proactively with the Maintenance Manager when spare parts need to be ordered."
    },
    {
      "duty": "Work under pressure when emergencies occur, prioritize work orders to minimize impact to production and employees, and support the efforts of the company to maintain food safety systems and quality programs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "General high school degree (or equivalent, e.g. GED) required. Minimum five years of industrial maintenance experience in a manufacturing environment, electrical or programming experience preferred, PIT and scissor lift OSHA certification required, computer skills with the ability to input/export information into a CMMS, and the ability to work off shifts as well as weekends upon request."
    }
  ]
}