{
  "meta": [
    {
      "job_title": "Speech Therapist 2",
      "job_category": "Healthcare",
      "job_class": "Therapist",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify functional speech defects and establish a plan of care to improve patient's function."
    },
    {
      "duty": "Evaluate, direct and provide speech/language pathology service to patients in the home or facility."
    },
    {
      "duty": "Participate in the development and periodic review of the Plan of Treatment and Plan of Care."
    },
    {
      "duty": "Utilize professional skills and judgment in assessing and treating disorders of speech, voice, language, hearing and swallowing."
    },
    {
      "duty": "Administer and interpret diagnostic tests and applications of therapeutic treatments including audio logic screening."
    },
    {
      "duty": "Observe, record and report changes in the patient's condition and response to treatment to supervisor and/or the physician."
    },
    {
      "duty": "Provide instruction and training to patients in use of alternative communication systems when appropriate."
    },
    {
      "duty": "Provide counsel and instruction to patients, families and healthcare staff."
    },
    {
      "duty": "Maintain and submit documentation as required by the Company and/or facility."
    },
    {
      "duty": "Prepare and submit timely written reports of evaluations, visits, summaries, care plans, care coordination activities and progress reports as required by Company policy."
    },
    {
      "duty": "Participate in care coordination activities and discharge planning."
    },
    {
      "duty": "Maintain the highest standards of professional conduct in relation to confidential information."
    },
    {
      "duty": "Attend, participate in and/or conduct internal staff development programs, obtain continuing education as required by Company policy, regulation."
    }
  ],
  "skills": [
    {
      "skill": "Speech Pathology",
      "experience": 1
    },
    {
      "skill": "Patient Care",
      "experience": 2
    },
    {
      "skill": "Diagnostic Testing",
      "experience": 2
    },
    {
      "skill": "Therapeutic Treatments",
      "experience": 3
    },
    {
      "skill": "Documentation",
      "experience": 3
    },
    {
      "skill": "Care Coordination",
      "experience": 3
    },
    {
      "skill": "Professional Conduct",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "Certification of Clinical Competence in Speech Language Pathology or Audiology granted by ASHA. Minimum of six months experience as a speech therapist / speech language pathologist. Current and unrestricted license. Current CPR certification. Bachelor's degree in Speech Language Pathology or Audiology (Master's preferred). Home Health experience a plus."
    }
  ]
}