{
  "meta": [
    {
      "job_title": "Home Health Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide admission, case management, and follow-up skilled nursing visits for home health patients."
    },
    {
      "duty": "Administer on-going care and case management for each patient, provide necessary follow-up as directed by the Clinical Manager."
    },
    {
      "duty": "Confer with physician in developing the initial plan of treatment based on physician's orders and initial patient assessment. Provide hands-on care, management, and evaluation of the care plan and teaching of the patient in accordance with physician orders, under Clinical Manager's supervision."
    },
    {
      "duty": "Revise plan in consultation with the physician based on ongoing assessments and as required by policy/regulation."
    },
    {
      "duty": "Coordinate appropriate care, encompassing various healthcare personnel (such as Physical Therapists, Occupational Therapists, Home Health Aides, and external providers)."
    },
    {
      "duty": "Report patient care/condition/progress to patient's physician and Clinical Manager on a continuous basis."
    },
    {
      "duty": "Implement patient care plan in conjunction with the patient and family to assist them in achieving optimal resolution of needs/problems."
    },
    {
      "duty": "Coordinate/oversee/supervise the work of Home Health Aides, Certified Home Health Aides, and Personal Care Workers and provide written personal care instructions/care plan that reflects the current plan of care. Monitor the appropriate completion of documentation by home health aides/personal care workers as part of the supervisory/leadership responsibility."
    },
    {
      "duty": "Discharge patients after consultation with the physician and Clinical Manager, preparing and completing needed clinical documentation."
    },
    {
      "duty": "Prepare appropriate medical documentation on all patients, including any case conferences, patient contacts, medication order changes, re-certifications, progress updates, and care plan changes. Prepare visit/shift reports, updates/summarizes patient records, and confers with other health care disciplines in providing optimum patient care."
    }
  ],
  "skills": [
    {
      "skill": "Skilled Nursing",
      "experience": 5
    },
    {
      "skill": "Case Management",
      "experience": 5
    },
    {
      "skill": "Patient Assessment",
      "experience": 5
    },
    {
      "skill": "Team Coordination",
      "experience": 5
    },
    {
      "skill": "Documentation Management",
      "experience": 5
    },
    {
      "skill": "Medical Records Management",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Nursing, Associate or Diploma in Nursing (Bachelor's preferred)"
    },
    {
      "credential": "Current and unrestricted Registered Nurse licensure"
    },
    {
      "credential": "Current CPR certification"
    },
    {
      "credential": "Strong organizational and communication skills"
    },
    {
      "credential": "Valid driver’s license, auto insurance, and reliable transportation"
    }
  ]
}