{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Recruiting and Hiring",
      "experience": 3
    },
    {
      "skill": "Delegation",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Retail Experience",
      "experience": 5
    },
    {
      "skill": "Cash Handling",
      "experience": 4
    },
    {
      "skill": "Merchandising",
      "experience": 4
    },
    {
      "skill": "High School/College Degree",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Store Manager with oversight of the Station Store operations including hiring, supervising, and working with the staff to accomplish daily tasks, bookkeeping, and merchandising."
    },
    {
      "duty": "Maintain high standards and provide fast, friendly service to customers. Take care of the food program and set an example for the staff."
    },
    {
      "duty": "Lead a team of employees/management, recruit, interview, and hire, delegate and follow-up, and teach and motivate others."
    },
    {
      "duty": "Plan and organize tasks, communicate plans and ideas, handle cash and bookkeeping, and solve problems."
    },
    {
      "duty": "Advocate and empathize, and ensure safety and security standards are met."
    },
    {
      "duty": "Maintain customer satisfaction, facility condition, merchandising, sales controls, financial controls, staffing controls, security controls, and administrative controls."
    },
    {
      "duty": "Prepare or assist in preparing periodic sales, product, and operating reports, and attend job-related meetings."
    },
    {
      "duty": "Perform all duties with minimal supervision, and complete daily store reports and other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent plus 6 months to 1 year of retail and management work experience preferred."
    }
  ]
}