{
  "meta": [
    {
      "job_title": "Project Coordinator",
      "job_category": "Administration",
      "job_class": "Coordinator",
      "sector": "Construction",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Inventory Management",
      "experience": 4
    },
    {
      "skill": "Program Management",
      "experience": 4
    },
    {
      "skill": "Microsoft PowerPoint",
      "experience": 4
    },
    {
      "skill": "Microsoft Excel",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages all material ordering in Client procurement system for assigned programs."
    },
    {
      "duty": "Acts as the single point of contact for the Non-Merchandise Supply Chain team for all program related inquiries."
    },
    {
      "duty": "Responsible for tracking and presenting all material related issues in weekly stakeholder meetings."
    },
    {
      "duty": "Assembles and distributes reports for internal and external customers."
    },
    {
      "duty": "May attend functions and meetings to gather and furnish information."
    },
    {
      "duty": "Maintains confidentiality with sensitive or proprietary information on behalf of project team."
    },
    {
      "duty": "Builds effective relationships with customers, design team, subcontractors, suppliers, and user groups."
    },
    {
      "duty": "Actively participates in industry, client, and community relations to enhance company image."
    },
    {
      "duty": "Exhibits commitment to quality by evaluating project-related processes and making necessary changes, using customer input to make improvements, and meeting/exceeding internal and external customer expectations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum high school diploma or equivalent; or 2-4 years related experience and/or training; or equivalent combination of education and experience. Experience in multi-site projects and inventory management preferred."
    }
  ]
}