{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 6
    },
    {
      "skill": "Recruiting",
      "experience": 6
    },
    {
      "skill": "Customer Service",
      "experience": 6
    },
    {
      "skill": "Merchandising",
      "experience": 6
    },
    {
      "skill": "Cash-Handling",
      "experience": 6
    },
    {
      "skill": "Operations Management",
      "experience": 6
    },
    {
      "skill": "Inventory Management",
      "experience": 6
    },
    {
      "skill": "Retail Experience",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Store Manager with oversight of the Station Store operations, including hiring, supervising, and working with staff to accomplish daily tasks, bookkeeping, and merchandising."
    },
    {
      "duty": "Maintain high standards and provide fast and friendly service to customers, as well as execute the food program."
    },
    {
      "duty": "Lead a team of employees/management, recruit, interview, and hire staff, delegate tasks, and follow up on performance."
    },
    {
      "duty": "Monitor and ensure that product areas are stocked, rotated, and displayed to ensure freshness, appeal, and easy customer access."
    },
    {
      "duty": "Ensure all shift sales are completed in accordance with company policies and maintain accurate cash, sales, payroll, and inventory control records."
    },
    {
      "duty": "Oversee the activities of store employees, perform shift supervision, and assume Store Manager responsibilities when needed."
    },
    {
      "duty": "Assist the Store Manager in maintaining a safe environment for employees and customers and protecting company assets."
    },
    {
      "duty": "Prepare or assist in the preparation of periodic sales, product, and operating reports as directed by the Store Manager."
    },
    {
      "duty": "Maintain proper inventory levels and perform duties associated with shift change, such as counting the cash drawer and completing end-of-shift/shift change reports."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent plus 6 months to 1 year of retail and management work experience preferred."
    }
  ]
}