{
  "meta": [
    {
      "job_title": "Computer Security Systems Specialist Level 3",
      "job_category": "Security",
      "job_class": "Specialist",
      "sector": "Technology",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Information Security",
      "experience": 7
    },
    {
      "skill": "Incident Response",
      "experience": 7
    },
    {
      "skill": "Network Security",
      "experience": 7
    },
    {
      "skill": "Technical Writing",
      "experience": 7
    },
    {
      "skill": "Critical Thinking",
      "experience": 7
    },
    {
      "skill": "Analytics",
      "experience": 7
    },
    {
      "skill": "Teamwork",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "CISSP Certification",
      "experience": 7
    },
    {
      "skill": "Network+ Certification",
      "experience": 7
    },
    {
      "skill": "CEH Certification",
      "experience": 7
    },
    {
      "skill": "SANS FOR578 Certification",
      "experience": 7
    },
    {
      "skill": "SANS FOR508 Certification",
      "experience": 7
    },
    {
      "skill": "Splunk Core Certified Advanced Power User",
      "experience": 7
    },
    {
      "skill": "Splunk Administrator",
      "experience": 7
    },
    {
      "skill": "Splunk SOAR Administrator",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide SME level technical support in CSOC operations and activities."
    },
    {
      "duty": "Provide SME level technical support in forensic investigation and follow-up on forensic data call activities."
    },
    {
      "duty": "Provide daily/weekly updates on CSOC operations and developments."
    },
    {
      "duty": "Analyze and report on CSOC tool performance and efficiency to maximize security and minimize false positives within the CSOC technology landscape."
    },
    {
      "duty": "Collaborate with stakeholders from internal departments, clients, and industry partners to design and implement effective operational processes."
    },
    {
      "duty": "Ensure the CSOC technology landscape is up to date, innovative, and reliable in analyzing and reporting cyber risks."
    },
    {
      "duty": "Manage the technical optimization of CSOC technologies and ensure the utilization efficiencies that ensure optimal return on investment."
    },
    {
      "duty": "Review escalated log reviews in accordance M-21-31 and M-22-09 and provide mitigation strategy."
    },
    {
      "duty": "Starting in OY1, if the option year is exercised, build and manage the security analyst and security engineer (contractor) team, to ensure and maintain a rich knowledge base of current and changing threats."
    },
    {
      "duty": "Foster security innovation and control enhancement through continuous improvement and automation of CSOC technology offering."
    },
    {
      "duty": "Perform forensic analysis of highly complex digital media devices and mediums to identify hidden contents and connections related to an incident."
    },
    {
      "duty": "Reverse engineer the coding of any malicious software for conducting an in-depth forensic analysis for the security of the company's software/computer systems or hardware."
    },
    {
      "duty": "Generate detailed technical reports to include information about the chosen digital media analysis (DMA) methodology, findings, and detailed recommendations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in computer science, information technology or related field (Master's preferred)"
    },
    {
      "credential": "CISSP, Network+, CEH, SANS FOR578: Cyber Threat Intelligence, SANS FOR508: Advanced Incident Response, Threat Hunting, and Digital Forensics, Splunk Core Certified Advanced Power User, Splunk Administrator, and Splunk SOAR administrator certifications"
    }
  ]
}