{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Nursing",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the delivery of nursing care within the assigned unit scope of practice following hospital policies and procedures, nursing process guidelines, standards of care, and standards of practice."
    },
    {
      "duty": "Assesses each assigned patient, documents and evaluates their response to plan of care, and takes appropriate corrective action."
    },
    {
      "duty": "Plans and implements the patient’s plan of care/standard of care and provides patient teaching using the plan of care/standard of care."
    },
    {
      "duty": "Oversees all ancillary personnel for technical tasks."
    },
    {
      "duty": "Seeks to improve quality of service by continuously developing individual and unit competencies within scope of practice."
    },
    {
      "duty": "Integrates into practice the research of best practice benchmarking and clinical pathways, participates and cooperates with ongoing studies and clinical trials promotion and dissemination of research through professional forums including presentations and publications."
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an accredited school of nursing."
    },
    {
      "credential": "Experience in specialty area will be considered."
    },
    {
      "credential": "Experience specific to the unit/position may be required to maintain overall competency level of unit, as required by regulatory agency."
    },
    {
      "credential": "Current State of Michigan Registered Nurse license."
    },
    {
      "credential": "BLS certification as Healthcare Provider."
    },
    {
      "credential": "ACLS certification as Healthcare Provider in the Cardiac Cath Lab."
    },
    {
      "credential": "ACLS required within 6 months for RNs in Critical Care, Emergency, Endoscopy, 2 East (Orthopedics), Cardiac Cath Lab, Cardiac Rehab, 3 West, 3 Chi, PACU, Same Day Surgery (Penn campus only), Telemetry Floats.; NRP required within 6 months for RNs in Labor and Delivery; PALS required within 6 months for RNs in 5 South (Pediatrics) and PACU; PALS and TNCC within one year for Emergency Department. Oncology Nursing Certification required within 6 months in Radiation Oncology units or within two years in Oncology Services units. Oncology Nurse Society (ONS) or equivalent Chemotherapy/Biotherapy administration course required within 6 months of hire in Oncology Services units. In secure units must comply and be eligible against all MDOC rules and regulations."
    },
    {
      "credential": "One year of professional nursing experience in area of practice."
    }
  ]
}