{
  "meta": [
    {
      "job_title": "Personal Banker III/IV",
      "job_category": "Banking",
      "job_class": "Banking",
      "sector": "Finance",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Relationship Management",
      "experience": 3
    },
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Banking",
      "experience": 3
    },
    {
      "skill": "Retail",
      "experience": 3
    },
    {
      "skill": "Cash Handling",
      "experience": 2
    },
    {
      "skill": "Compliance",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Financial Services",
      "experience": 3
    },
    {
      "skill": "Community Reinvestment Act (CRA) Activities",
      "experience": 2
    },
    {
      "skill": "Financial Literacy Initiatives",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build, develop and deepen customer relationships through active market business development, needs-based questioning to identify deposit, credit and investment solutions to help customers achieve their financial goals."
    },
    {
      "duty": "Support the transactional needs of the banking center on occasion and at manager discretion and also referring identified opportunities to the appropriate line of business."
    },
    {
      "duty": "Meet or exceed individual sales and activity objectives - measured by an individual scorecard."
    },
    {
      "duty": "Establish preset appointments to identify customer needs via in-person meetings, teleconsulting activities and outbound community involvement."
    },
    {
      "duty": "Educate customers on other bank channels including online and mobile banking, interactive (Video) tellers and full-service ATMs that provide convenience and value to customers."
    },
    {
      "duty": "Originate new consumer and business depository accounts and execute a defined new customer onboarding plan."
    },
    {
      "duty": "Uncover small business opportunities and make quality referrals to proper business partners and team members."
    },
    {
      "duty": "Demonstrate compliance with all bank regulations that apply to your position and stay current on regulation changes."
    },
    {
      "duty": "Create a positive impact within the communities you serve by investing time in Community Reinvestment Act (CRA) activities and financial literacy initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED required. Bachelor’s degree, Associates degree or equivalent work experience preferred. S.A.F.E. registration at the time of employment is required."
    }
  ]
}