{
  "meta": [
    {
      "job_title": "Admissions Representative",
      "job_category": "Admissions",
      "job_class": "Representative",
      "sector": "Education",
      "salary": 45000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Recruit qualified students for the college’s academic programs in a compliant, appropriate, and professional manner."
    },
    {
      "duty": "Provide basic information, routine guidance, and assistance to potential students on matters related to enrollment and the admissions process."
    },
    {
      "duty": "Evaluate and resolve student inquiries, issues, and problems, and ensure appropriate action is taken to the satisfaction of the student, Unitek College, and/or relevant regulatory agencies."
    },
    {
      "duty": "Uphold enrollment standards by complying with related governmental regulations and standards of accreditation, and by enrolling only students who meet eligibility requirements as published in the college’s catalog."
    },
    {
      "duty": "Take inquiry calls from potential students, return web inquiries and calls promptly, and make outbound phone calls to interested potential students."
    },
    {
      "duty": "Schedule and conduct student interviews, explain program offerings, and match the college’s benefits and advantages to the student’s needs."
    },
    {
      "duty": "Provide routine advice, guidance, and assistance to students using established procedures and policies on available programs and eligibility requirements."
    },
    {
      "duty": "Accurately account for all inquiries and admissions activity, complete daily activity reports, and ensure that all required reports are current and accurate."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Telemarketing",
      "experience": 2
    },
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Interviewing",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 100,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred"
    }
  ]
}