{
  "meta": [
    {
      "job_title": "Enterprise Resource Management (ERM) Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 200000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Global Experience",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Ethics and Integrity",
      "experience": 10
    },
    {
      "skill": "Decision Making",
      "experience": 10
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 10
    },
    {
      "skill": "Multi-lingual Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office (Word, Excel, PowerPoint)",
      "experience": 10
    },
    {
      "skill": "Analytical Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and Implement MCG’s global Enterprise Resource Management (ERM) system in cooperation with the ERM team in the Americas and other regions."
    },
    {
      "duty": "Direct and manage the overall ERM operations in the region, coordinating various General Affairs activities and office administration and procedures."
    },
    {
      "duty": "Establish, implement, and maintain ERM systems and procedures for global risk management system access."
    },
    {
      "duty": "Maintain an effective relationship with compliance, supply chain, and digital units to cover global risk profiles."
    },
    {
      "duty": "Ensure alignment of all businesses with the ERM process and integrate all departments into one risk management system."
    },
    {
      "duty": "Hold Regional ERM Committee meetings and conduct risk communication and monitoring throughout the region."
    },
    {
      "duty": "Collect and analyze ERM information on a global and regional basis, keeping close communication with the ERM department in the headquarters office."
    },
    {
      "duty": "Implement and operate crisis and emergency control processes in the regions, and develop office policies and standards to guide office operation."
    },
    {
      "duty": "Support business and functional activities based on overall business needs, priorities, and initiatives, and manage financial and headcount budgets for general affairs activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business or related field. MBA degree a plus."
    }
  ]
}