{
  "meta": [
    {
      "job_title": "Convention Services/Catering Manager",
      "job_category": "Hospitality",
      "job_class": "Manager",
      "sector": "Hospitality",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Catering Sales",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Client Servicing",
      "experience": 5
    },
    {
      "skill": "Hospitality Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Attainment of catering/food and beverage sales goals tied to the overall performance of the hotel."
    },
    {
      "duty": "Effectively servicing clients/groups and maintaining the contracted food and beverage minimum."
    },
    {
      "duty": "Proactively conduct solicitation calls, tours, and entertain clients specific to needs respective to the assigned property."
    },
    {
      "duty": "Monitor and evaluate trends within the market segment."
    },
    {
      "duty": "Approach all encounters with guests and employees in an attentive, friendly, courteous, and service-oriented manner."
    },
    {
      "duty": "Adheres to Aimbridge Hospitality’s established regulations, company standards, catering/meeting standards, and related catering sales metrics."
    },
    {
      "duty": "Develop a full working knowledge of the operations and policies of the hotel and applicable departments."
    },
    {
      "duty": "Maintain strong visibility in the local community and industry organizations as applicable."
    },
    {
      "duty": "Assist in implementing and/or participating in special promotions relating to direct sales segments."
    },
    {
      "duty": "Attend daily/weekly/monthly meetings and any other functions required by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent required; previous convention/event and catering sales experience preferred. Must have a valid driver’s license for the applicable state."
    }
  ]
}