{
  "meta": [
    {
      "job_title": "Associate Product Manager, Innovative Pharmacy Programs",
      "job_category": "Pharmacy",
      "job_class": "Manager",
      "sector": "Pharmacy",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Product Management",
      "experience": 1
    },
    {
      "skill": "Pharmaceutical Claims Adjudication",
      "experience": 1
    },
    {
      "skill": "Health Insurance",
      "experience": 1
    },
    {
      "skill": "Health Biomedical",
      "experience": 1
    },
    {
      "skill": "Project Management",
      "experience": 1
    },
    {
      "skill": "Compliance Program",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage operations for both existing products and new product development for assigned specialty and strategic products."
    },
    {
      "duty": "Collaborate on the development of related products in a way designed to foster team work and maintain an outstanding customer service culture."
    },
    {
      "duty": "Develop a keen understanding of Navitus products in the marketplace in order to work collaboratively to expand product offerings, refine current product positioning and develop key messages for both existing and potential clients."
    },
    {
      "duty": "Monitor the products performance, position and utility for clients and their members."
    },
    {
      "duty": "Apply project management techniques to effectively manage project scope, resources, and timeline for assigned initiatives."
    },
    {
      "duty": "Work with Account Management and Sales to better understand product performance."
    },
    {
      "duty": "Analyze, document and report any issues with claims associated with assigned products."
    },
    {
      "duty": "Assure appropriate testing has been conducted for any system/app enhancement or break-fix."
    },
    {
      "duty": "Ensure products meet all regulatory requirements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree is preferred. Minimum 1 year product management/development, pharmaceutical claims adjudication system, pharmacy, or health insurance is required. Experience in the health, biomedical, or pharmaceutical fields is preferred. Participate in, adhere to, and support compliance program objectives. The ability to consistently interact cooperatively and respectfully with other employees."
    }
  ]
}