{
  "meta": [
    {
      "job_title": "Enterprise Account Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Management",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for meeting or exceeding 100% of sales quotas by selling the Intelerad suite of products and solutions to new client’s within the defined geographic territory."
    },
    {
      "duty": "Create a territory plan and manage sales process from cold call to close, by prioritizing selling time to generate sales volume, achieve account penetration and complete territory coverage."
    },
    {
      "duty": "Own cold call strategy, funnel (pipeline) development and management, territory development and close deals within assigned geography."
    },
    {
      "duty": "Develop, implement, and maintain an annual business plan supporting attainment of quota, updating business plan on a regular basis."
    },
    {
      "duty": "Maintain identified business to support a balanced sales funnel and accurate profile of prospects."
    },
    {
      "duty": "Develop and maintain a high level of product knowledge of IT, Intelerad and competitive products."
    },
    {
      "duty": "Develop and maintain consultative sales relationships with all key-buying influences in each client, including multiple levels within the client's organization."
    },
    {
      "duty": "Maintain accurate and timely forecasts of monthly, quarterly, and annual revenue numbers for assigned territory."
    },
    {
      "duty": "Provides constant feedback to Sales management on the territory environment."
    },
    {
      "duty": "Works in a team selling environment with other sales specialists."
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Forecasting",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Team Selling",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience"
    }
  ]
}