{
  "meta": [
    {
      "job_title": "Paralegal",
      "job_category": "Legal",
      "job_class": "Paralegal",
      "sector": "Legal",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Legal Research",
      "experience": 3
    },
    {
      "skill": "Writing",
      "experience": 3
    },
    {
      "skill": "Investigation",
      "experience": 3
    },
    {
      "skill": "Drafting Legal Documents",
      "experience": 3
    },
    {
      "skill": "Case Preparation",
      "experience": 3
    },
    {
      "skill": "Client Communication",
      "experience": 3
    },
    {
      "skill": "Bilingual (Spanish/English)",
      "experience": 3
    },
    {
      "skill": "Attention to Detail",
      "experience": 3
    },
    {
      "skill": "Multi-tasking",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct legal research and writing for attorney and case preparation."
    },
    {
      "duty": "Investigate the facts of cases for case preparation and interview witnesses and clients in preparation for trial."
    },
    {
      "duty": "Draft legal documents for attorney review and assists in the preparation of cases for submission to the Immigration Courts, USCIS, and the National Visa Center."
    },
    {
      "duty": "Monitor the status of pending cases at USCIS and National Visa Center, and call Immigration Courts for information regarding pending motions, court hearings, etc."
    },
    {
      "duty": "Assist with the law firm’s case acceptance process, meeting with clients to collect information and documents required for case submission."
    },
    {
      "duty": "Provide clients with case specific questionnaires and follow-up with clients on the status of questionnaires."
    },
    {
      "duty": "Assist Legal Secretary and Receptionist with administrative tasks as needed, including file maintenance, translation, interpretation, and other related duties."
    },
    {
      "duty": "Review files for upcoming applications, update addresses, determine any outstanding balances, and provide translation and interpretation for non-English speaking clients."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree is required. Two or more years’ experience working in a law firm is required."
    }
  ]
}