{
  "meta": [
    {
      "job_title": "Mobile Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Customer Service",
      "salary": 38000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Tech Troubleshooting",
      "experience": 1
    },
    {
      "skill": "Effective Communication",
      "experience": 1
    },
    {
      "skill": "Patience",
      "experience": 1
    },
    {
      "skill": "Multitasking",
      "experience": 1
    },
    {
      "skill": "Problem Solving",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Troubleshoot and resolve mobile customer technology and service issues, including repair, billing, and accounts."
    },
    {
      "duty": "Repair a variety of services and equipment, using patience and effective communication skills to uncover customer needs, answer questions, and leave a positive impression on customer interactions."
    },
    {
      "duty": "Provide over-the-phone support on a wide range of mobile products and services, including accounts and billing, diagnostics, enhancements, and repairs."
    },
    {
      "duty": "Use advanced diagnostic tools to address technical inquiries and get services running smoothly, talking customers through fixes."
    },
    {
      "duty": "Create documents that ensure customers’ service histories are available for future Representatives."
    },
    {
      "duty": "Stay on top of the latest technology and provide troubleshooting for customer-facing systems."
    },
    {
      "duty": "Receive fully paid training and stay up-to-date with training updates on new products, services, and upgrades."
    },
    {
      "duty": "Create satisfying customer experiences by understanding products and customers’ sense of urgency."
    },
    {
      "duty": "Engage in a deliberate path to success with well-established career paths for advancement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED (Preferred: 6 months or more of customer service experience)"
    }
  ]
}