{
  "meta": [
    {
      "job_title": "Dean of College",
      "job_category": "Education",
      "job_class": "Dean",
      "sector": "Education",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage all school-based college staff, college office budget, and school leadership team meetings."
    },
    {
      "duty": "Execute and monitor systems for efficient college application process and codify all college application procedures."
    },
    {
      "duty": "Maintain systems for managing alumni counseling office and managing alumni rituals and traditions."
    },
    {
      "duty": "Build and maintain systems for managing summer programs and integrate benchmarks calendar with the school curriculum."
    },
    {
      "duty": "Oversee & manage the comprehensive 9 through 13 Foundations of Leadership curriculum and track progress of all college initiatives."
    },
    {
      "duty": "Manage and maintain a relationship with the College Board and evaluate SAT prep programs."
    },
    {
      "duty": "Ensure coordination and support of college initiatives in the school, execute targeted strategic college visits, and plan and execute Senior Signing Day."
    },
    {
      "duty": "Designate owners for each metric in the College and Alumni Report Card and track progress to reaching both monthly and end of year goals."
    }
  ],
  "skills": [
    {
      "skill": "College Advising Experience",
      "experience": 3
    },
    {
      "skill": "Management Experience",
      "experience": 3
    },
    {
      "skill": "Teaching Experience",
      "experience": 3
    },
    {
      "skill": "Marketing Strategy",
      "experience": 3
    },
    {
      "skill": "Online Presence Management",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree; master’s degree preferred. At least 3 years of teaching experience with a record of high student achievement."
    }
  ]
}