{
  "meta": [
    {
      "job_title": "Senior Estimating Leader",
      "job_category": "Construction",
      "job_class": "Project Management",
      "sector": "Construction",
      "salary": 125000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Preconstruction Management",
      "experience": 10
    },
    {
      "skill": "Estimating",
      "experience": 10
    },
    {
      "skill": "Value Engineering",
      "experience": 10
    },
    {
      "skill": "Contract Management",
      "experience": 10
    },
    {
      "skill": "Project Scheduling",
      "experience": 10
    },
    {
      "skill": "Subcontractor Management",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "Microsoft Office",
      "experience": 10
    },
    {
      "skill": "Timberline Estimating Software",
      "experience": 10
    },
    {
      "skill": "Building Information Modeling Software",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the entire preconstruction process from start to finish, including estimating, scheduling, and bidding."
    },
    {
      "duty": "Participate in presentations to secure new projects and maintain knowledge of key contract terms."
    },
    {
      "duty": "Prepare detailed estimates and lead the value engineering process to align project scope to clients' budgets."
    },
    {
      "duty": "Analyze cost models during design development and create subcontractor/material supplier bid lists."
    },
    {
      "duty": "Coordinate and lead a team of preconstruction associates on larger projects and keep current on changes and trends in construction methods and materials."
    },
    {
      "duty": "Identify and qualify new material suppliers and subcontractors, participate in preconstruction strategy meetings, and assure detailed preconstruction and preliminary construction schedules."
    },
    {
      "duty": "Visit ongoing projects to verify estimates versus project status, meet with the project operations team, and understand bid/GMP process for project financial success."
    },
    {
      "duty": "Effectively communicate with owners, design professionals, and company associates, carrying oneself professionally in all meetings and interactions."
    },
    {
      "duty": "Must be proficient in Microsoft Office suite of software, Timberline Estimating software, On-Screen Take-Off software, and an understanding of Building Information Modeling software."
    },
    {
      "duty": "5-10 years of experience in a preconstruction position successfully completing design build or construction management at risk projects with a Bachelor’s degree in a construction or architecture related degree."
    },
    {
      "duty": "LEED AP certification preferred, OSHA 30-hour certification preferred."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a construction or architecture related degree (Master's preferred)"
    }
  ]
}