{
  "meta": [
    {
      "job_title": "IT Quality Assurance (QA) Director",
      "job_category": "Information Technology",
      "job_class": "Director",
      "sector": "IT",
      "salary": 200000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "IT Internal Auditing",
      "experience": 15
    },
    {
      "skill": "Internal Controls Practices",
      "experience": 15
    },
    {
      "skill": "IT Risk Management",
      "experience": 15
    },
    {
      "skill": "Banking Regulation",
      "experience": 15
    },
    {
      "skill": "Analytical Skills",
      "experience": 15
    },
    {
      "skill": "Communication Skills",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the QA team's efforts in various fronts to increase the depth and breadth of IT QA coverage to ultimately drive the quality of internal audit function."
    },
    {
      "duty": "Conducting quality assurance over audit deliverables (e.g., risk assessment audit planning memo, workpaper reviews, reports) during or after audits selected for IT QA review."
    },
    {
      "duty": "Communicate with IAD staff about the QA results in a constructive way for future improvements. Report QA results objectively to IAD management and Head Office Quality Assurance Group."
    },
    {
      "duty": "Perform IT QA review of follow up validation for various issue types, such as internal audit issue, regulatory findings and management self-identified issues."
    },
    {
      "duty": "Develop training materials for the department and provide training for new hires and/or existing staff."
    },
    {
      "duty": "Participate in preparing presentation decks to internal or external stakeholders, such as Audit Committee, Executive Management, Regulators, or Head Office."
    },
    {
      "duty": "Enhance the overall audit methodology, such as procedures and templates documented in its audit manual."
    },
    {
      "duty": "Lead or participate in various projects to enhance internal audit activities."
    },
    {
      "duty": "Active participation in the creation and implementation of various new frameworks within the department, such as staff skill assessment, training program, risk assessments, annual audit plan, and enhanced continuous auditing."
    },
    {
      "duty": "Bring in industry leading practices in IT, integrate them with the department's process through pragmatic solutions, lead or assist the department's special projects to enhance various aspects of its execution in departmental operations and audits."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor degree in IT related majors is required and a Master Degree is preferred. CISA, CISSP or other IT related professional licenses or certificates are strongly preferred."
    }
  ]
}