{
  "meta": [
    {
      "job_title": "Specialist Sales Technology",
      "job_category": "Technology",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technology Solutions Definition",
      "experience": 5
    },
    {
      "skill": "Agile Development",
      "experience": 5
    },
    {
      "skill": "User Testing",
      "experience": 5
    },
    {
      "skill": "Vendor Evaluation",
      "experience": 5
    },
    {
      "skill": "Product Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communications",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Define and execute world-class technology solutions for front line sales professionals and independent business partners."
    },
    {
      "duty": "Prototype, test, evaluate, and select hardware, and configure and customize software solutions."
    },
    {
      "duty": "Understand and prioritize functionality, evaluate vendors, and write epics and user stories for Agile process."
    },
    {
      "duty": "Test and deploy solutions across sales team, collecting and prioritizing feedback and issues for resolution."
    },
    {
      "duty": "Provide technical support for sales technology and applications, and participate in field tests of new releases and solutions."
    },
    {
      "duty": "Solicit and collect user feedback, communicate product market needs, and evaluate integration opportunities with new systems and technologies."
    },
    {
      "duty": "Provide reports and presentations for senior management to evaluate performance against key performance indicators."
    },
    {
      "duty": "Lead and mentor team members, and input to design of dashboards and reports for better serving the user base."
    },
    {
      "duty": "Consolidate feedback, prioritize defects, and use analytics to improve user experience and behavior."
    },
    {
      "duty": "Manage and balance occasional travel related work schedule."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Business, Computer Technology, or related field. A combination of education, training and experience that results in demonstrated competency to perform the work may be substituted."
    }
  ]
}