{
  "meta": [
    {
      "job_title": "Customer Architect",
      "job_category": "Technology",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 200000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technical Solutions",
      "experience": 7
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 7
    },
    {
      "skill": "Cloud Computing",
      "experience": 5
    },
    {
      "skill": "Enterprise Solutions",
      "experience": 5
    },
    {
      "skill": "IT Domain Knowledge",
      "experience": 7
    },
    {
      "skill": "Presentation Skills",
      "experience": 7
    },
    {
      "skill": "Technical Consultation",
      "experience": 7
    },
    {
      "skill": "Sales Support",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Define and communicate technical success criteria for customers by crafting detailed Technical Success Plans tailored to specific customer goals and metrics."
    },
    {
      "duty": "Collaborate with account team and Solutions Architect to provide ongoing technical coverage and support, while focusing on identifying new deals."
    },
    {
      "duty": "Ensure successful technical customer journey from onboarding to adoption, continuously driving the consumption of Elastic solutions."
    },
    {
      "duty": "Liaise between customers and support to ensure optimized support resolution experience and smooth adoption curve for the customer."
    },
    {
      "duty": "Develop a comprehensive understanding of the customer's business needs and translate these into technical requirements for Elastic solutions."
    },
    {
      "duty": "Foster ongoing customer relationships to increase their utilization of Elastic solutions, further driving annual recurring revenue (ARR)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Engineering, Information Systems, or a related field (Master's preferred)"
    },
    {
      "credential": "Validated experience in similar role such as Solutions Architect, Technical Consultant, or Presales Engineer, with hands-on experience with Elastic solutions or equivalent technologies"
    }
  ]
}