{
  "meta": [
    {
      "job_title": "Analytics Data & Solutions Architect II - Streaming",
      "job_category": "Data Analytics",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 180000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "Apache Kafka",
      "experience": 5
    },
    {
      "skill": "Apache Flink",
      "experience": 5
    },
    {
      "skill": "Kinesis Data Analytics",
      "experience": 5
    },
    {
      "skill": "Data Profiling",
      "experience": 5
    },
    {
      "skill": "Data Validation",
      "experience": 5
    },
    {
      "skill": "Data Science",
      "experience": 5
    },
    {
      "skill": "Data Modeling",
      "experience": 5
    },
    {
      "skill": "Hadoop",
      "experience": 5
    },
    {
      "skill": "AWS",
      "experience": 5
    },
    {
      "skill": "Data Architecture",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide vision, direction, and hands-on technical expertise in designing and building analytics solutions that support scalable data solutions in a real-time environment."
    },
    {
      "duty": "Collaborate with source data owners, data engineers, data scientists, and other stakeholders to implement high-velocity data pipelines."
    },
    {
      "duty": "Define strategies to operationalize analytics supporting capabilities in discovery, analysis, and reporting across business segments."
    },
    {
      "duty": "Analyze, shape, and prioritize data and analytics technologies to business capabilities aligning to current requirements along with future needs without significant rework."
    },
    {
      "duty": "Perform hands-on solution design, solution architectures, architecture roadmaps, prototyping, proof-of-concepts, and development tasks as required in support of projects and products as requested."
    },
    {
      "duty": "Develop SQL queries to extensively research, understand, and relate distributed data repositories across the enterprise."
    },
    {
      "duty": "Develop and document data models, ensuring that data is defined and searchable, and collaborate with various users across the organization to capture output/process changes and revise data models."
    },
    {
      "duty": "Support Data Science team in the approach to implement advanced analytical models and supporting data pipelines, as well as developing the strategies and approaches for Analytics as a Service."
    },
    {
      "duty": "Ensure accurate documentation of data assets, identify critical gaps in the information domain through a combination of workshops, interviews, and internal analysis of various documentation."
    },
    {
      "duty": "Partners effectively with MDM (Master Data Management), Data SMEs, and other stakeholders (Sponsors, Product solutions architects etc.) to design solutions, including identifying and filling critical gaps."
    },
    {
      "duty": "Plan, design, and monitor security, usability, and stability of the analytics platform to help ensure that it complies with enterprise standards and that it performs adequately as additional analytics solutions are implemented."
    },
    {
      "duty": "Act as a liaison between Technical team, Functional team, Business Functions, and System Integrators to drive architecture solutions."
    },
    {
      "duty": "Document and proficiently explain complex architectures to technical and functional peers and -as needed--to other levels of the organization."
    },
    {
      "duty": "Ability to support translation of business needs into solution architecture requirements, application of multiple technical solutions to business problems, and estimation of the financial impact of solution architecture alternatives."
    },
    {
      "duty": "Work with other product team(s) to define data dictionary, data lineage, and relationship metrics."
    },
    {
      "duty": "Stay current on the latest technologies, trends, and strategies."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Information Technology, Computer Science, Computer Engineering, Data Science, Statistics, Mathematics or a related field, or equivalent work experience"
    }
  ]
}