{
  "meta": [
    {
      "job_title": "Broadband Installation Technician",
      "job_category": "Information Technology",
      "job_class": "Technician",
      "sector": "Technology",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Broadband Installation",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Troubleshooting",
      "experience": 2
    },
    {
      "skill": "Technical Skills",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform installations and changes of service, while adhering to applicable codes, requirements, guidelines, company procedures, and safe work practices to provide an outstanding customer experience."
    },
    {
      "duty": "Update customer account to ensure an accurate record of products and services is captured for a positive ongoing customer relationship."
    },
    {
      "duty": "Troubleshoot and problem solve customer inquiries and concerns to ensure products and services are working properly and drive a positive customer experience."
    },
    {
      "duty": "Communicate, engage, and provide education on products and services to customers."
    },
    {
      "duty": "Persist and finish projects despite obstacles with little supervision, preventing mistakes and enhancing the customer relationship."
    },
    {
      "duty": "Display active listening skills, perceive emotional awareness in difficult situations, and empathize with customers to enhance an overall positive experience."
    },
    {
      "duty": "Use installation tools and hand tools, perform jobs from high places, manipulate connectors, fasteners, wire, use hand tools, lift and carry loads, work in confined spaces, work near power lines and electricity, and drive company vehicle in performance of duties in a safe and responsible manner."
    },
    {
      "duty": "Train in safety, company-specific training, installations, and other areas as necessary."
    },
    {
      "duty": "Maintain proper equipment to perform required duties."
    },
    {
      "duty": "Works in areas with exposure to moderate noise level, dogs or other animals, construction areas, or the public in general."
    },
    {
      "duty": "Regular, consistent, and punctual attendance. Must be able to work nights and weekends, variable schedule(s), and overtime as necessary."
    },
    {
      "duty": "Other duties and responsibilities as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma / GED"
    }
  ]
}