{
  "meta": [
    {
      "job_title": "Human Resources Specialist 3 (Awards and Personnel Programs)",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Public Trust Clearance",
      "experience": 8
    },
    {
      "skill": "Human Resources Practices",
      "experience": 8
    },
    {
      "skill": "Personnel Inquiries",
      "experience": 8
    },
    {
      "skill": "Position Classification Appeals",
      "experience": 8
    },
    {
      "skill": "Drug-Free Workplace Programs",
      "experience": 8
    },
    {
      "skill": "MS Word, Excel, and Outlook",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide administrative and coordination support to the Agency Drug-Free Workplace Program in accordance with mandatory guidelines for federal drug testing programs."
    },
    {
      "duty": "Respond to general NASA employment inquiries."
    },
    {
      "duty": "Review and process the Agency’s position classification appeals."
    },
    {
      "duty": "Provide support to the Agency Honor Awards program."
    },
    {
      "duty": "Develop the Agency Honor Award Nomination Call Letter."
    },
    {
      "duty": "Partner with NASA Centers and Mission Support Enterprise Offices (MSEO) to ensure timely submission of awards through the NASA Automated Awards System (NAAS)."
    },
    {
      "duty": "Support NASA Administrator Suite (A-Suite) and the NASA Advisory Council with preparing and processing Agency Honor Awards."
    },
    {
      "duty": "Establish and supporting a Senior Review Panel for Distinguished Service Medal andDistinguished Public Service Medal."
    },
    {
      "duty": "Reference the IAB charter and past practices for panel membership."
    },
    {
      "duty": "Create a timeline and scheduling the panel(s)."
    },
    {
      "duty": "Monitor submissions in NAAS to ensure DSM/DPSM nominations are submitted in a timely manner to meet NASA and NSSC deadlines."
    },
    {
      "duty": "Contact Centers/MSEO awards officers that do not have timely submissions and resolve any issues."
    },
    {
      "duty": "Identify and collate nominations to prepare review packages and submit them to IAB panel for review."
    },
    {
      "duty": "Provide panel members with instructions, roles, responsibilities, and FAQs."
    },
    {
      "duty": "Provide IAB Panel Familiarization Training to all interested Panel Members."
    },
    {
      "duty": "Ensure panel members are provided the necessary guidance to complete the reviews by the established deadline."
    },
    {
      "duty": "Provide awards program manager and each Center/MSEO Awards Officers with panel results."
    },
    {
      "duty": "Work with the Center/MSEO awards officer on rejected nominations; either return to the Center to change the category or reject the nomination in NAAS."
    },
    {
      "duty": "Record results in NAAS for rejected or approved nominations."
    },
    {
      "duty": "Ensure all contents of purple packages (Packages originating from the NASA HQ A-Suite) are amended as necessary for context of this revised process. E.g., Seeking A-Suite approval of DSM/DPSM and notifying A-Suite of all other nominations approved."
    },
    {
      "duty": "Alter demographics reporting to include sub-reports for DSM/DPSM in addition to the usual reporting of all medals."
    },
    {
      "duty": "Coordinate and execute the Annual Honor Awards Ceremony - on-site or virtually."
    },
    {
      "duty": "Coordinate on-site Ceremony events include collaboration with on-site staff to coordinate the actual ceremony logistics."
    },
    {
      "duty": "Administer the Agency External Honor Awards program."
    },
    {
      "duty": "Maintain and routinely distribute the central listing of the Agency-recognized external awards."
    },
    {
      "duty": "Review, prepare, submit, and track all packages for External Awards requiring NASA Administrator’s approval or signature."
    },
    {
      "duty": "Notify the Awards Officers of employees selected for awards/recognition."
    },
    {
      "duty": "Update and maintain the Agency Awards Calendar (AAC) with input from OCHCO andCenter Awards Offices."
    },
    {
      "duty": "Provide awards records management, maintenance, and reporting (including cross Center/Mission Support Enterprise / Agency-level reports)."
    },
    {
      "duty": "Update and maintain all Agency approved electronic award certificate templates in compliance with NASA Communication Material Review standards and requirements."
    },
    {
      "duty": "Prepare and deliver Agency approved recognition items (e.g., certificates, medals, plaques, length of service pins and letters) to Awards Officers."
    },
    {
      "duty": "Support the purchase and maintenance of an appropriate inventory of NASA-determined and approved Agency-level award items."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma is required."
    }
  ]
}