{
  "meta": [
    {
      "job_title": "Patient Care Associate",
      "job_category": "Healthcare",
      "job_class": "Associate",
      "sector": "Clinical Care",
      "salary": 25,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Provide patient care and support activities promoting patient focused care within the Specialty Service."
    },
    {
      "duty": "Assist registered nurse in patient care activities, such as assisting patients with activities of daily living, collecting specimens, and performing procedures."
    },
    {
      "duty": "Maintain a safe, clean environment and perform clinical procedures such as specimen collection, venipuncture, and EKG."
    },
    {
      "duty": "Assist patients with activities of daily living, feeding, bathing, toileting, and ambulation."
    },
    {
      "duty": "Assist with dietary functions, delivering patient trays, and reporting variation in eating patterns to RN/Dietitian."
    },
    {
      "duty": "Perform patient observations and maintain isolation status for patients as directed by an RN."
    },
    {
      "duty": "Perform rounding on patients with emphasis on caring for toileting needs, comfort, and pain awareness."
    },
    {
      "duty": "Maintain supplies and care of equipment, participate in performance improvement activities, and observe compliance policies."
    },
    {
      "duty": "Participate in the development of other staff members, maintain patient/employee confidentiality, and meet regulatory, licensure, and annual health assessment requirements."
    },
    {
      "duty": "Demonstrate professional, courteous, and respectful attitude in dealing with patients, families, and colleagues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma (graduate or equivalent) and Certificate of completion of a medical assistant/patient care assistant program/equivalent with skills in venipuncture and EKG. American Heart Association Heartsaver. BLS Certification accepted."
    }
  ]
}