{
  "meta": [
    {
      "job_title": "Commercial Lines Account Manager",
      "job_category": "Insurance",
      "job_class": "Manager",
      "sector": "Insurance",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Insurance Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages a book of insurance business, while acting with a high degree of independent discretion, autonomy, and decision-making."
    },
    {
      "duty": "Provides professional, courteous service to clients, carrier representatives, underwriters, business partners, and HUB colleagues."
    },
    {
      "duty": "Works closely with Risk Consultants and other HUB personnel on all aspects of client service, marketing, and renewal while adhering to HUB Broker Standards."
    },
    {
      "duty": "Oversees the preparation and implementation of all transactions, paperwork, and internal processing for assigned accounts."
    },
    {
      "duty": "Acquires understanding of clients’ insurance objectives and critically analyzes and compares insurance plans to determine suitability."
    },
    {
      "duty": "Acts as liaison between clients and insurance carriers to resolve escalated complex service issues that require policy interpretation and experience based judgment."
    },
    {
      "duty": "Troubleshoots billing issues."
    },
    {
      "duty": "Responsible for overall retention of accounts in assigned book of business."
    },
    {
      "duty": "Supports, mentors, and trains Account Administrators, as necessary."
    },
    {
      "duty": "Attends industry related continuing education training and courses."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred but not required. P&C License required or able to obtain within 120 days from hire. Advanced professional designation preferred or in progress (e.g. CISR, AAI, ARM, CIC, CPCU)"
    }
  ]
}