{
  "meta": [
    {
      "job_title": "Executive Assistant",
      "job_category": "Administrative",
      "job_class": "Assistant",
      "sector": "Management",
      "salary": 65000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide executive level support to the SVP SCM NAM and their department to ensure efficient management and running of the function on a day-to-day level."
    },
    {
      "duty": "Organize various types of correspondence independently, to ensure timely and accurate response."
    },
    {
      "duty": "Format, type and edit a variety of material, including correspondence, memos, minutes, reports, and confidential material."
    },
    {
      "duty": "Provide leaders with any materials needed throughout the day (ex. print documents, provide links, reroute emails, meals when applicable)."
    },
    {
      "duty": "Maintain and update department files, records, (organizational) charts, subscriptions, and publications."
    },
    {
      "duty": "Receive and screen telephone calls, monitor mail entry, and administer the department-owned e-mail accounts as well as keep email distribution lists up-to-date."
    },
    {
      "duty": "Create and post announcements via internal sites/comms channels."
    },
    {
      "duty": "Create/assist with presentations (e.g. in PowerPoint) to key stakeholders and partners."
    },
    {
      "duty": "Coordinate and execute all travel arrangements for team members including flight and hotel booking, visa securing, car reservations, and airport pick-up arrangements and immediately providing solutions to problems requiring knowledge of department policies and procedures."
    },
    {
      "duty": "Key contact point for information management (e.g. ensure content of the intranet is up to date)."
    },
    {
      "duty": "Proactively/independently carry out special projects and assignments."
    },
    {
      "duty": "Take over administrative and coordinative tasks of department members as requested."
    },
    {
      "duty": "Handle assigned operational tasks of respective department under supervision."
    },
    {
      "duty": "Check and correct problems in existing systems and processes that are not immediately evident."
    },
    {
      "duty": "Manage leaders’ agendas on a daily basis and proactively by looking ahead and reviewing the upcoming 3-4 weeks."
    },
    {
      "duty": "Act as a gatekeeper for time by ensuring space between meetings, scheduling blocks for breaks, and adjusting conflicting meetings."
    },
    {
      "duty": "Organize meetings with leaders’ first lines, key business partners, and stakeholders across regions and markets."
    },
    {
      "duty": "Schedule preparation time for major initiatives, critical meetings, and reviews."
    },
    {
      "duty": "Ensure leaders are aware of any abrupt changes, upcoming deadlines, and when actions or decisions are needed from them."
    },
    {
      "duty": "Become familiar with leaders’ priorities and KPIs to fully understand which meetings are urgent and of high importance (*Have full understanding of priorities and KPIs)."
    },
    {
      "duty": "When necessary, assign delegates from leaders’ first lines to attend meetings on their behalf."
    },
    {
      "duty": "For requests coming in, provide leaders with as much context as possible (ex. decisions needed, approvals, pre-reads)."
    },
    {
      "duty": "Ensure leaders are aware of and prepared for upcoming initiatives by staying on top of deadlines and planning ahead (ex. Performance Standard Reviews, TLU, Calibration)."
    },
    {
      "duty": "Collaborate with leadership teams to curate agendas for team meetings based on urgent topics, booking rooms, ordering catering, planning team building exercises, and making any dining reservations."
    },
    {
      "duty": "Orchestrate meetings by presenting decks, keeping people on track/on time, and ensuring that attendees are prepared to share material when applicable."
    },
    {
      "duty": "Organize townhalls and huddles with the help of the team."
    },
    {
      "duty": "Drive end-to-end delivery of ad-hoc projects and ensure follow-through."
    },
    {
      "duty": "Assist HR with People Workshops such as TLU, Leadership Assimilation, and Calibrations."
    },
    {
      "duty": "Order office supplies."
    },
    {
      "duty": "Administration of investment request workflow."
    },
    {
      "duty": "Coordination and administration of video conferences."
    },
    {
      "duty": "Supporting office setups and moves within HQ."
    },
    {
      "duty": "Maintain vacation overview for the team."
    },
    {
      "duty": "Proof-reading of documents/presentations."
    },
    {
      "duty": "Attend meetings and take notes/capture meeting minutes."
    },
    {
      "duty": "Manage expenses and approvals, including travel expense reports."
    },
    {
      "duty": "Act as the main point of contact for leaders supporting with ad-hoc requests coming from leaders and first line teams."
    },
    {
      "duty": "Manage documentation and information archiving (ex. Teams, SharePoint, etc.)."
    },
    {
      "duty": "Manage distribution lists and communication groups."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Executive Support",
      "experience": 6
    },
    {
      "skill": "Calendar Management",
      "experience": 6
    },
    {
      "skill": "Project Coordination",
      "experience": 6
    },
    {
      "skill": "Microsoft Office",
      "experience": 6
    },
    {
      "skill": "Organizational Skills",
      "experience": 6
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum 6 years of experience supporting senior leaders. Experienced in executive assistant level role and fully qualified/trained. Combined theoretical and practical knowledge incl. company policies and practices. Bachelor's degree in Marketing, Business, or a related field (Master's preferred)."
    }
  ]
}