{
  "meta": [
    {
      "job_title": "Project Engineer 2",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Civil Infrastructure",
      "salary": 87500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 2
    },
    {
      "skill": "Subcontract Administration",
      "experience": 3
    },
    {
      "skill": "Change Management",
      "experience": 2
    },
    {
      "skill": "Document Control",
      "experience": 2
    },
    {
      "skill": "Quality Management",
      "experience": 2
    },
    {
      "skill": "Construction Equipment Knowledge",
      "experience": 2
    },
    {
      "skill": "Basic Engineering Principles",
      "experience": 2
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintaining contract with select trade partners and responsible for some subcontract administration, including defining work scope, answering inquiries, and supervising progress."
    },
    {
      "duty": "Participating in change management and change order process, including pricing, processing, and assessing cost and schedule impact before reviewing."
    },
    {
      "duty": "Maintaining and performing project document control and procedures (coordinating RFIs, shop drawing and submittal process, maintaining as-built drawings, etc.)"
    },
    {
      "duty": "Collaborating with the project team lead in supervising design with timely response to the submittal schedule."
    },
    {
      "duty": "Participating in the reviews of trade partners’ submittals for compliance with scope, design documentation prior to forwarding to design for review."
    },
    {
      "duty": "Coordinating with project manager and superintendent in managing and reporting overall project or select scope performance as per site HSE, cost management, schedule, and quality."
    },
    {
      "duty": "Preparing and supervising progress claims and estimates."
    },
    {
      "duty": "Coordinating inventory and tracking of materials and equipment and expediting material orders."
    },
    {
      "duty": "Assisting with site inspections from the design team to resolve constructability and site coordination issues and reviews and sign-offs on functionality, AHJ (Authority Having Jurisdiction) requirements, and code compliance."
    },
    {
      "duty": "Ensuring that resolution is achieved and accepted by all partners."
    },
    {
      "duty": "Involved in and participates in overall project closeout, including document archival, maintenance and warranty manuals, deficiencies, and warranty work."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Associates or bachelor’s degree in construction management, engineering, or architecture preferred, or equivalent experience."
    }
  ]
}