{
  "meta": [
    {
      "job_title": "Nurse",
      "job_category": "Nursing",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Obtains a comprehensive admission history, performs physical assessment per unit policy and demonstrates integrated assessment abilities."
    },
    {
      "duty": "Differentiates variations of normal and abnormal assessment findings and analyzes prioritizes abnormal findings."
    },
    {
      "duty": "Initiates appropriate response and anticipates actual or potential problems or health concerns in the hospital and/or home setting."
    },
    {
      "duty": "Demonstrates ongoing assessment of patient’s psychosocial, physiological and educational process per unit policy."
    },
    {
      "duty": "Anticipates, recognizes and documents subtle changes in patient’s physical and mental status and integrates analysis of diagnostic information in patient assessment and care."
    },
    {
      "duty": "Analyzes ongoing assessments to determine patient’s and/or significant other’s learning and discharge needs."
    },
    {
      "duty": "Integrates assessment data and formulates an individualized nursing diagnosis according to the Department of Nursing’s policies and procedures."
    },
    {
      "duty": "Formulates an individualized plan of care based on standards of care and practice and hospital/unit policies."
    },
    {
      "duty": "Identifies and focuses on the physical, emotional, spiritual, cultural, learning and discharge planning needs of the patient and significant other(s) and develops, interprets and correlates realistic goals and orders which will maintain or improve patient health status."
    },
    {
      "duty": "Discusses and disseminates information concerning patient plan of care with members of the interdisciplinary health care team and participates in ongoing discharge planning."
    },
    {
      "duty": "Modifies individualized plan of care based on ongoing assessment and changes in patient status and appropriately coordinates holistic care and anticipates and manages changing situations."
    },
    {
      "duty": "Administers prescribed treatments and medications promptly according to hospital policies and procedures."
    },
    {
      "duty": "Guides and provides functional supervision of ancillary staff while maintaining accountability for patient care and assists and guides peers with patient care decisions."
    },
    {
      "duty": "Utilizes opportunities during the delivery of patient care to teach the patient information necessary to attain the optimal level of self-care and reinforces teaching done by other members of the interdisciplinary health care team."
    },
    {
      "duty": "Evaluates patient’s responses to care and comprehension of education and monitors response to intervention and progress towards goals."
    },
    {
      "duty": "Evaluates the effectiveness of patient care provided by ancillary nursing personnel."
    },
    {
      "duty": "Documents all aspects of the nursing process in a legible, concise, clear and timely manner utilizing appropriate hospital forms or technology and terminology."
    },
    {
      "duty": "Acts as a patient advocate and respects the rights and confidentiality of patients and promotes communication and relays information in a clear manner and understands and acts within the guidelines for addressing ethical concerns."
    },
    {
      "duty": "Demonstrates sound judgment with the Nursing Process based upon critical thinking skills and a problem-solving approach and organizes, prioritizes and demonstrates accountability for nursing care."
    },
    {
      "duty": "Recognizes own limitations, seeks assistance, and takes corrective action as needed."
    },
    {
      "duty": "Performs other related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BLS certification required."
    }
  ]
}