{
  "meta": [
    {
      "job_title": "IAS Senior Manager, Loan Operations",
      "job_category": "Loan Operations",
      "job_class": "Manager",
      "sector": "Banking",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Commercial Lending",
      "experience": 3
    },
    {
      "skill": "Loan Documentation",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Problem-solving Skills",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and support highly complex, cross-functional, multi-operational business solutions within loan operations."
    },
    {
      "duty": "Manage budgets, including reallocating funds as priorities shift and develop financial and resource plans."
    },
    {
      "duty": "Develop career progression material and lead a team focused on loan processing, quality review, collateral management, loan servicing, and records management."
    },
    {
      "duty": "Ensure optimized processes and controls within loan operations and monitor performance metrics for efficiency and timely completion of workload."
    },
    {
      "duty": "Serve as an internal escalation point for troubleshooting complex loan operational issues and contribute to the development of business strategies and goals."
    },
    {
      "duty": "Communicate departmental leadership vision/strategy and manage people and technology to follow that direction."
    },
    {
      "duty": "Define, deliver, and support strategic plans for implementing information technologies and bring industry leading best practices to the attention of the leadership team."
    },
    {
      "duty": "Develop and leverage partnerships with internal stakeholders to meet business needs and understand and comply with bank policy, laws, regulations, and the bank's BSA/AML Program."
    },
    {
      "duty": "Carry out supervisory responsibilities in accordance with the organization’s policies and applicable laws."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or equivalent related work or military experience 6 years of relevant experience 3 years of previous supervisory and/or management experience"
    }
  ]
}