{
  "meta": [
    {
      "job_title": "HR Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Administer personnel policy concerning all HR activities for the assigned Micro Fulfillment site."
    },
    {
      "duty": "Provide HR support for employee engagement, performance management, and recruitment."
    },
    {
      "duty": "Develop and propose improvements to HR policies, programs, and procedures to ensure compliance with employment laws."
    },
    {
      "duty": "Maintain relationships with Employee Relations to investigate employee concerns and provide coaching to employees and management."
    },
    {
      "duty": "Facilitate positive employee experiences and maintain a team environment with open communication."
    },
    {
      "duty": "Review and manage HR data to support people processes and workforce planning."
    },
    {
      "duty": "Partner with Talent Acquisition and HR Business Partners to craft recruitment strategies and drive candidate flow."
    },
    {
      "duty": "Provide coaching to business leaders to improve engagement and ensure a consistent team member experience."
    },
    {
      "duty": "Engage with business support teams to manage workforce planning activities and guide operations in strategic talent management."
    },
    {
      "duty": "Support the implementation of HR programs, resources, and tools to optimize the workplace environment."
    },
    {
      "duty": "Work closely with operations, communications, and HR leadership to ensure content and messaging reach team members effectively."
    },
    {
      "duty": "Provide analysis of local market and talent needs to guide development of HR programs and processes."
    }
  ],
  "skills": [
    {
      "skill": "Employee Relations",
      "experience": 3
    },
    {
      "skill": "Recruitment and Selection",
      "experience": 3
    },
    {
      "skill": "Performance Management",
      "experience": 3
    },
    {
      "skill": "Compensation Management",
      "experience": 3
    },
    {
      "skill": "Benefit Administration",
      "experience": 3
    },
    {
      "skill": "Compliance Management",
      "experience": 3
    },
    {
      "skill": "Talent Acquisition",
      "experience": 3
    },
    {
      "skill": "HR Information Systems",
      "experience": 3
    },
    {
      "skill": "Training and Development",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor degree in Human Resources or related field"
    }
  ]
}