{
  "meta": [
    {
      "job_title": "Vice President of Marketing Operations",
      "job_category": "Marketing",
      "job_class": "Executive",
      "sector": "Marketing",
      "salary": 150000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide leadership and insights, supporting strategic planning, as well as being a hands-on member of the team."
    },
    {
      "duty": "Develop and grow marketing infrastructure and capability to support go-to-market and sales development efforts."
    },
    {
      "duty": "Work with go-to-market team to create and execute demand generation and lead nurturing programs, including the creation and execution of: Account Based Marketing (ABM) campaigns to create demand and align with our sales teams (including the maturation of ABM capabilities through technology assessment and selection). Multi-channel acquisition programs that seamlessly integrate events, email, website, paid advertising, and social to drive demand across partners, capabilities, and industries."
    },
    {
      "duty": "Coordinate with internal resource teams around analytics, SEO, and personalization."
    },
    {
      "duty": "Measure marketing department effectiveness, including ROI, campaign effectiveness, and customer acquisition through analytics and report creation and distribution."
    },
    {
      "duty": "Collaborate closely with business development to ensure that leads and resulting opportunities are qualified, actionable, and reported accurately."
    },
    {
      "duty": "Optimize lead flow, data hygiene, and lead scoring, with Salesforce Sales Cloud and Salesforce Marketing Cloud (Pardot)."
    },
    {
      "duty": "Facilitate development of outward-facing collateral and content marketing, working with Bounteous subject matter experts, leadership, and external contributors."
    },
    {
      "duty": "Understand industry best practices and apply to process creation, adding recommendations as necessary."
    }
  ],
  "skills": [
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Marketing Infrastructure Development",
      "experience": 10
    },
    {
      "skill": "Demand Generation",
      "experience": 10
    },
    {
      "skill": "Lead Nurturing",
      "experience": 10
    },
    {
      "skill": "Account Based Marketing (ABM)",
      "experience": 10
    },
    {
      "skill": "Multi-channel Acquisition",
      "experience": 10
    },
    {
      "skill": "Analytics",
      "experience": 10
    },
    {
      "skill": "SEO",
      "experience": 10
    },
    {
      "skill": "Content Marketing",
      "experience": 10
    },
    {
      "skill": "Process Improvement",
      "experience": 10
    },
    {
      "skill": "Team Building",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}