{
  "meta": [
    {
      "job_title": "Retail Salesperson",
      "job_category": "Retail",
      "job_class": "Salesperson",
      "sector": "Sales",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Introduce tire products and automobile repair/maintenance services to customers in person and/or with other store associates to help maximize total sales, store profits, and customer satisfaction, loyalty, and retention."
    },
    {
      "duty": "Selling and Sales Promotion: Personally handles customer needs in areas of sales, service, complaints, adjustments, etc. Contacts customers, particularly in service department, to assess needs for tires and car service to close sales opportunities. Checks tickets, making sure all tires on every vehicle are inspected and customers needing tires are asked to buy. Solicits and promotes customer use of CFNA Credit Card as frequently as possible. Introduces new products to achieve appropriate sales. Keeps tire selling area and tire displays clean and properly set up at all times. Ensures that correct tires are on display, with correct display materials."
    },
    {
      "duty": "Recording: Enter customer invoices, credit tickets, etc. Operates P.O.S. terminal. Maintains monthly and perpetual inventory accuracy. On a limited basis, performs operating functions as necessary, accepts payments, furnishes information, takes orders, etc."
    },
    {
      "duty": "Information Coordination: Assists manager during store meetings with all teammates to cover current advertising and promotion. Shops competition and keeps other teammates informed on what competition is advertising."
    },
    {
      "duty": "Miscellaneous Functions: Opens and/or closes the store as required and directed, which includes cash control and asset protection. Attends all store, area, and special meetings as required by store or area management. As needed, helps to unload merchandise shipments, changes and balances tires in the service department (after appropriate training), constructs store displays, and performs other duties that are necessary to meet customer relationship requirements. Practices courtesy, honesty, and good judgment with all customers and store teammates. Other duties and tasks as assigned by store or area manager."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Complaint Handling",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ]
}