{
  "meta": [
    {
      "job_title": "Senior Process Engineer",
      "job_category": "Engineering",
      "job_class": "Senior",
      "sector": "Manufacturing",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Process Engineering",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Chemical Engineering",
      "experience": 5
    },
    {
      "skill": "Analytical Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Statistical Process Control",
      "experience": 5
    },
    {
      "skill": "Mechanical Integrity",
      "experience": 5
    },
    {
      "skill": "Process Safety Management (PSM)",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Initiate activities, procedures, and projects to improve product quality, optimize production capacity, ensure equipment reliability, provide capital improvements, integrate new technology and practices, and optimize overall performance."
    },
    {
      "duty": "Manage/lead projects, work on-site at the Pampa Development and Manufacturing Center, and pilot plant in Pampa, TX."
    },
    {
      "duty": "Plan, organize, and lead commercial production and research operations, and provide leadership and expertise regarding continuous improvements in manufacturing process capability, capacity, and productivity."
    },
    {
      "duty": "Develop and implement process changes and equipment care procedures to ensure plant safety and reliability, focusing on specific products/line/units, plant process/equipment Reliability, and/or Process Safety Management."
    },
    {
      "duty": "Recommend and implement changes to improve plant performance, optimize product volume, yields and quality, and minimize operating costs while maximizing unit safety and reliability."
    },
    {
      "duty": "Lead new product and process development teams, oversee development of plant wide Standard Operating Procedures, and provide leadership and technical expertise to solve complex operating problems."
    },
    {
      "duty": "Conduct “end-of-life” assessments, assist with equipment repairs, provide information and guidance to original equipment manufacturers, and ensure compliance with all standards, regulations, and industry best practices."
    },
    {
      "duty": "Communicate with regional and corporate counterparts to facilitate continuous improvement and ongoing organizational learning."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Post-secondary Chemical or Mechanical Engineering degree (Bachelor’s/University) and generally 5+ years’ experience and 3 years of production experience in a demanding specialty chemical industry, with carbon black production experience preferred. Familiarity with topics such as Process Safety Management (PSM), safe work permitting, lockout/tagout, emergency response, and hazard recognition."
    }
  ]
}