{
  "meta": [
    {
      "job_title": "Rail Coordinator",
      "job_category": "Transportation",
      "job_class": "Coordinator",
      "sector": "Logistics",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for transport, storage, and blending for respective commodities across Upstream, Midstream and Downstream."
    },
    {
      "duty": "Tasks include transportation nominations, system balancing and optimization, blending, documentation, credit, risk and inventory management."
    },
    {
      "duty": "Lead day-to-day scheduling and operations, including activities such as fleet management, optimization, blending, storage and inventory management."
    },
    {
      "duty": "Manage coordination of rail, terminal and/or refinery logistics; monitors and executes commodity movement."
    },
    {
      "duty": "Collaborate on optimization initiatives, trading strategies and sharing of best practice learnings."
    },
    {
      "duty": "Engage with third-party customers (railroads, service providers) and external industry experts to maintain strong relationships, understand competitor landscape and regulatory expectations."
    },
    {
      "duty": "Assists commercial groups in evaluating the economics and viability of business opportunities; incorporates logistical/operational factors and market intelligence into decision making."
    },
    {
      "duty": "Maintains a strong focus toward incident-free operations."
    }
  ],
  "skills": [
    {
      "skill": "Transportation Management",
      "experience": 3
    },
    {
      "skill": "Logistics Coordination",
      "experience": 3
    },
    {
      "skill": "Operations Scheduling",
      "experience": 3
    },
    {
      "skill": "Supply Chain Optimization",
      "experience": 3
    },
    {
      "skill": "Risk Management",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 3
    },
    {
      "skill": "Market Intelligence",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Energy, Manufacturing, Transportation, Supply Chain, Finance, or a related field"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ]
}