{
  "meta": [
    {
      "job_title": "Digital Assurance & Transparency - Sustainability Trust - Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 135000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sustainability and Non-financial Reporting",
      "experience": 5
    },
    {
      "skill": "Information Technology",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Client Interaction",
      "experience": 5
    },
    {
      "skill": "Thought Leadership",
      "experience": 5
    },
    {
      "skill": "Business Process Transformation",
      "experience": 5
    },
    {
      "skill": "External Audits",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution."
    },
    {
      "duty": "Help clients meet evolving stakeholder expectations for transparency on environmental, social, and governance topics."
    },
    {
      "duty": "Work with clients to understand and navigate reporting standards (e.g. SASB, GRI, TCFD), develop processes, controls, and technology to support reporting, and provide independent assurance over Environmental, Social, and Corporate Governance Data (ESG) disclosures."
    },
    {
      "duty": "Lead the planning and execution of projects, owning the interaction with clients on projects to move projects forward."
    },
    {
      "duty": "Contribute to thought leadership and sharing best practices on sustainability processes and controls."
    },
    {
      "duty": "Respect the work-life quality of team members, providing candid, meaningful feedback in a timely manner."
    },
    {
      "duty": "Monitoring workloads of the team while meeting client expectations, and keeping leadership informed of progress."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 255,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Accounting, Accounting and Finance, Accounting and Technology, Business Administration/Management, Economics, Economics and Finance, Economics and Finance and Technology, Journalism, Environmental Law, Environmental Science, Mathematics, Engineering, Computer and Information Science, Computer and Information Science and Accounting, Finance, Management Information Systems, Management Information Systems and Accounting, Sustainable Resource Management"
    }
  ]
}