{
  "meta": [
    {
      "job_title": "Supervisor of Pathology Support",
      "job_category": "Healthcare",
      "job_class": "Supervisor",
      "sector": "Health and Medicine",
      "salary": 72500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 1
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 1
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Team Management",
      "experience": 3
    },
    {
      "skill": "Data Collection and Maintenance",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 3
    },
    {
      "skill": "Conflict Resolution",
      "experience": 3
    },
    {
      "skill": "Training and Mentoring",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Medical Industry Knowledge",
      "experience": 3
    },
    {
      "skill": "Administrative Procedures",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "GSuite",
      "experience": 3
    },
    {
      "skill": "Bi-lingual",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide daily direction to the Pathology Support Coordinators team and monitor productivity and service levels in the procurement of patient tissues."
    },
    {
      "duty": "Perform random quality checks for all Pathology Support Coordinators to maintain highest standards of accuracy and quality."
    },
    {
      "duty": "Provide real-time and continual feedback/training regarding processes, accuracy, and professionalism."
    },
    {
      "duty": "Evaluate and provide to management opportunities for improvement in operations, efficiency, processes, training, team work, and morale to improve the experience for customers and the team."
    },
    {
      "duty": "Provide weekly performance metrics, feedback, and coaching for all Pathology Support Coordinators related to service level agreements (SLAs)."
    },
    {
      "duty": "Handle day-to-day issues with the Pathology Support Coordinators team related to and other issues providing appropriate coaching, counseling, direction, and resolution."
    },
    {
      "duty": "Assist Manager of Pathology Assistants with daily operation of Pathology Support Coordinators including development, analyses, implementation of staffing, training, scheduling, and reward/recognition programs."
    },
    {
      "duty": "Deal directly with internal and external customers via telephone and electronic channels to research and resolve escalated issues and communicate clearly while doing root-cause analysis of the issues."
    },
    {
      "duty": "Identify issues that may require a CAPA and work with the PA manager to log. Participate in CAPA reviews to determine opportunities for individual and team training to maintain adherence to processes and policy."
    },
    {
      "duty": "Perform special project tasks and assist the project team as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent.Minimum of 3 years customer service experience and 1 year of experience in a leadership role.Customer Service in healthcare field or equivalent preferred"
    }
  ]
}