{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Management",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Sales Forecasting",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Visual Merchandising",
      "experience": 3
    },
    {
      "skill": "Recruiting",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support store operations, including sales forecasting, scheduling, and payroll to achieve effective daily zone chart."
    },
    {
      "duty": "Guide the team to prioritize customer service and styling recommendations to drive metrics and achieve store goals."
    },
    {
      "duty": "Collaborate with key partners for effective execution of shipment processing, restocking, and product placement while maintaining visual and display standards."
    },
    {
      "duty": "Engage employees at all levels to encourage open dialogue, reinforce follow through, and ensure the store team is heard and supported."
    },
    {
      "duty": "Participate in recruiting, hiring, and retaining top talent to build a bench for the store; facilitate thoughtful onboarding for new hires."
    },
    {
      "duty": "Deliver a seamless omni-channel shopping and event experience through the understanding and utilization of MPOS, POS, and customer service applications."
    },
    {
      "duty": "Create selling initiatives that enhance customer experience, encouraging the team to build lasting relationships through personalized service, product recommendations, and connecting with customers in an authentic way."
    },
    {
      "duty": "Participate as the manager-on-duty by driving engagement in each zone through communication, adaptability, and fostering a collaborative selling environment."
    },
    {
      "duty": "Adhere to the store's safety standards, inventory accuracy, reduction of product loss, and uphold all company policies and procedures to support store profitability."
    },
    {
      "duty": "Facilitate the sharing of product knowledge, current trends, visual priorities, and brand messaging through daily meetings with the team."
    },
    {
      "duty": "Protect time with direct reports, set goals, and deliver feedback for team's personal growth."
    },
    {
      "duty": "Share feedback with the Store Manager and provide insight related to the customer experience regarding product and presentation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Retail Management or Business Administration (preferred)"
    }
  ]
}