{
  "meta": [
    {
      "job_title": "Director of Sales",
      "job_category": "Sales",
      "job_class": "Director",
      "sector": "Sales",
      "salary": 77500,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate all group transient and catering sales solicitations and bookings to maximize overall revenue."
    },
    {
      "duty": "Develop recommend implement and manage the division's annual budget and the advertising public relations marketing and sales plans and programs for the hotel to maximize rate occupancy and food & beverage opportunities thus ensuring the hotel meets/exceeds management and owner revenue/profit goals and expectations."
    },
    {
      "duty": "Proactively conduct outside sales calls conduct sales tours and entertain clients."
    },
    {
      "duty": "Understand the content reflected in contracts and how to negotiate terms therein."
    },
    {
      "duty": "Develop and maintain market awareness to ensure ability to predict revenue opportunities and set proactive strategies."
    },
    {
      "duty": "Monitor production of all top accounts and evaluate trends within your market."
    },
    {
      "duty": "Adheres to Aimbridge Hospitality’s established regulations company standards sales standards and sales metrics related."
    },
    {
      "duty": "Comply with attainment of individual goals as well as team goals and budgeted metrics."
    },
    {
      "duty": "Train all members of the hotel staff on how to recognize and capitalize on all sales opportunities to increase hotel occupancy and revenue."
    },
    {
      "duty": "Develop a full working knowledge of the operations and policies of the hotel including Sales Food and Beverage Front Office and Reservations."
    },
    {
      "duty": "Maintain strong visibility in local community and industry organizations."
    },
    {
      "duty": "Attend and/or conduct daily/weekly/monthly meetings and any other functions required by management providing training on a rotational basis."
    },
    {
      "duty": "Maintains professional working relationship and promote open lines of communication relationships to achieve initiatives with respective marketing partner(s) and other internal departments (i.e. Second Wave Aimbridge Digital or Branded field marketing)."
    },
    {
      "duty": "Travel on a weekly basis as required."
    },
    {
      "duty": "Act as directed on behalf of the General Manager in his/her absence; performing any other duties as requested by management."
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Sales, Business, or a related field (Master's preferred)"
    }
  ]
}