{
  "meta": [
    {
      "job_title": "Nurse Educator",
      "job_category": "Education",
      "job_class": "Academic",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides leadership for all academic programs; Works with the Program Coordinator and the Dean of Academics and to facilitate appropriate program development, implementation, evaluation and assessment; Ensures systematic review of programs to ensure quality and current course content, best practice and achievement of regulatory standards; Performs other duties as assigned by the President, Program Coordinator and/or the Dean of Academics; Serves on committees as assigned/approved; Reports to the relevant program coordinator."
    },
    {
      "duty": "Participates in interviewing and makes recommendations for hiring of faculty; Arranges for coverage of classes during absences and emergency leaves; Promotes rapport within the department, campus, and community; Posts and keeps a minimum of three office hours per week that are convenient to students who seek assistance with counseling, academic advising, and coursework; Maintains punctuality in meeting assigned classes and clinical responsibilities; Models professional behavior and standards of practice while in the workplace; Functions as a change agent and leader by promoting innovative practices in educational environments; Participates in professional development opportunities that increase one’s effectiveness in the role; Participates in a minimum of 23 continuing education hours per year:For nursing \n"
    },
    {
      "duty": "Makes recommendations regarding equipment, software purchases, and equipment maintenance contracts."
    },
    {
      "duty": "Participates in budget planning process; Attends and participates in faculty meetings; Participates in accreditation reviews and reports; Participates in developing programs, evaluating and revising student policies, organizational framework and revising curricular offerings; Participates in recruitment, orientation, and coordination of students and faculty; Participates in the orientation and advisement of students."
    },
    {
      "duty": "Attends and participates in at least one of the program committees; Serves as a member of the assigned program Advisory Committee; Participates in organization-wide committees when requested."
    },
    {
      "duty": "Serves as an advisor for students; Provides guidance in the students’ academic and personal development; Develops remediation plans with students; Schedules regular meetings with students who are at risk to be unsuccessful in a course or the program; Assists students in identifying and utilizing resources that may contribute to their success."
    },
    {
      "duty": "Implements syllabi, including all course requirements and assignments, for all students; Submits suggestions for changes in syllabi, course or program to the Curriculum Chair and the Program Coordinator; Designs and implements new curriculum; Participates in the evaluation of curriculum; Ensures curricula reflects institutional philosophy, mission, current healthcare trends and community needs."
    },
    {
      "duty": "Maintains control of the classroom; Develops assigned course and clinical syllabi to reflect the college philosophy, theoretical constructs, course description, and objectives and curriculum; Utilizes a variety of teaching methods to accommodate the learning styles of the students; Provides for opportunities for active student involvement through practice and application; Demonstrates a command of the subject matter; Demonstrates considerations for diverse cultural backgrounds; Models and encourages a collaborative faculty-student relationship; Provides or utilizes course materials (handouts, interactive notes, technology) that enhance student learning and follows the course syllabus; Models professional behavior and standards of practice; Performs additional responsibilities for faculty performing clinical supervision in an affiliating agency including;Participates in clinical orientation as required by the institution;Completes validations as required by contract with clinical agencies, orients students to clinical facilities;Participates in the development and implementation of clinical assignments for students at the clinical setting;Supervises students in patient care area in collaboration with staff;Conducts pre and post conferences with students;Schedules make-up clinical as needed;Maintains ongoing weekly evaluation of individual student progress in the clinical area;Provides timely ongoing verbal and written feedback to students;"
    },
    {
      "duty": "Provides the evaluation of students in both didactic and clinical courses; Participates in peer evaluations when requested; Participates in the evaluation of their peers and Program Coordinator when requested; Reviews student evaluation summaries of assigned courses and utilizes the feedback for planning and implementing future courses; Participates in program planning in response to student/program evaluation feedback and employer satisfaction surveys."
    },
    {
      "duty": "Full time, Part Time and Per Diem faculty have the responsibility of classroom/clinical/lab/sim responsibilities as assigned. Full Time Faculty will have a teaching load of no more than 24 academic credits in a given academic year. Part Time and Per Diem faculty will have a teaching load of no more than 12 academic credits in a given academic year; Load may be divided between theory and clinical instruction if needed.Faculty are also required to have 2-4 office hours per week, attend all course/faculty meetings, and participate in graduation/pinning, and special events. Faculty also have professional responsibilities that are critical to maintaining competence as well as are integral to the functioning of the college/parent institution, such as participating in committee work, service to the institution etc."
    },
    {
      "duty": "Participate as assigned on program specific advisory boards involving the major stakeholders served by the college; Participates in publicizing and disseminating information about the program."
    },
    {
      "duty": "2 years of full time clinical teaching experience preferred"
    },
    {
      "duty": "Certified Nurse educator certification for nursing preferred"
    },
    {
      "duty": "Master’s degree from a regionally accredited institution of higher learning recognized by the US Department of Education"
    },
    {
      "duty": "Must hold the appropriate terminal degree for the program of which they will be teaching in"
    },
    {
      "duty": "Two years of teaching in a college or university required"
    },
    {
      "duty": "Professional license applicable for program of study (ie. RN, RT, Surgical Tech, etc.) required. Non-Clinical teaching, license not required. Certified Nurse Educator certification for nursing preferred;"
    },
    {
      "duty": "LICENSES / CERTIFICATIONS: "
    },
    {
      "duty": "S - Sedentary Work - Exerting up to 10 pounds of force occasionally Sedentary work involves sitting most of the time, but may involve walking or standing for brief periods of time. Jobs are sedentary if walking and standing are required only occasionally and all other sedentary criteria are met."
    }
  ],
  "skills": [
    {
      "skill": "Teaching",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Curriculum Development",
      "experience": 5
    },
    {
      "skill": "Clinical Supervision",
      "experience": 5
    },
    {
      "skill": "Program Development",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Student Advising",
      "experience": 5
    },
    {
      "skill": "Education Administration",
      "experience": 5
    },
    {
      "skill": "Program Evaluation",
      "experience": 5
    },
    {
      "skill": "Accreditation Process",
      "experience": 5
    },
    {
      "skill": "Budget Planning",
      "experience": 5
    },
    {
      "skill": "Community Relations",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree from a regionally accredited institution of higher learning recognized by the US Department of Education"
    }
  ]
}