{
  "meta": [
    {
      "job_title": "Process Engineering Department Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Energy & Chemicals",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Process Engineering",
      "experience": 15
    },
    {
      "skill": "Supervisory Experience",
      "experience": 15
    },
    {
      "skill": "Engineering Design",
      "experience": 15
    },
    {
      "skill": "Technical Leadership",
      "experience": 15
    },
    {
      "skill": "Project Management",
      "experience": 15
    },
    {
      "skill": "Sales and Marketing Support",
      "experience": 15
    },
    {
      "skill": "Client Relationship Management",
      "experience": 15
    },
    {
      "skill": "Manpower Planning",
      "experience": 15
    },
    {
      "skill": "Performance Management",
      "experience": 15
    },
    {
      "skill": "Staff Recruitment",
      "experience": 15
    },
    {
      "skill": "Quality Process Management",
      "experience": 15
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 15
    },
    {
      "skill": "Communication Skills",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage a team of engineers and designers, and serve as a technical specialist in formulating and developing advanced concepts, techniques, and standards."
    },
    {
      "duty": "Supervise and manage the process engineering department, including planning, coordinating, executing, and monitoring all activities."
    },
    {
      "duty": "Review the work and performance of process engineering department personnel to ensure accuracy, quality, and timeliness of project and process requirements."
    },
    {
      "duty": "Perform conceptual, preliminary, and detailed process design as needed."
    },
    {
      "duty": "Lead in planning, workhour estimates, cost development and management, and scheduling for assigned projects."
    },
    {
      "duty": "Coordinate process engineering department personnel to ensure business unit and overall company priorities are addressed in a timely manner."
    },
    {
      "duty": "Ensure client inputs and project requirements are adequately addressed and implemented consistently with contractual requirements."
    },
    {
      "duty": "Provide technical leadership and process engineering expertise for the company."
    },
    {
      "duty": "Support sales and marketing effort and work closely with business development on proposals and presentations."
    },
    {
      "duty": "Interact with project managers to verify project designs are accurate and meet the intended scope."
    },
    {
      "duty": "Maintain effective communication with project team members and with the customer."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Chemical Engineering or technical field from an accredited college or University. Master’s Degree preferred. P.E. License preferred."
    }
  ]
}