{
  "meta": [
    {
      "job_title": "Regional Director",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Business Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Public Relations",
      "experience": 5
    },
    {
      "skill": "Marketing",
      "experience": 5
    },
    {
      "skill": "Human Resource Management",
      "experience": 5
    },
    {
      "skill": "National Accreditation Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for overall regional performance and quality outcomes management, including client satisfaction with clinic and clinic services."
    },
    {
      "duty": "Achieve regional financial results to meet operations budget."
    },
    {
      "duty": "Responsible for payer and referral source satisfaction within the region."
    },
    {
      "duty": "Responsible for physical plant improvements and appearance of the region supervised."
    },
    {
      "duty": "Directs clinic directors in organization development and training of clinic staff."
    },
    {
      "duty": "Adheres to company standards of conduct as delineated in the CTC Corporate Statement of Ethics."
    },
    {
      "duty": "Complies with Opioid Treatment Program Division operating policies and procedures."
    },
    {
      "duty": "Reviews clinic and Opioid Treatment Division Policies and Procedures Manual(s) on an annual basis making recommendations for revision."
    },
    {
      "duty": "Responsible for implementation and management of Corporate HR system in the clinics supervised."
    },
    {
      "duty": "Provides supervision to clinic department heads and other personnel as needed."
    },
    {
      "duty": "Responsible for public relations and marketing efforts related to clinic operation."
    },
    {
      "duty": "Maintains compliance with national accreditation, governmental regulations and maintains the clinic’s operating licenses."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in behavioral healthcare, business or related field or equivalent work experience required. Master’s degree preferred."
    }
  ]
}