{
  "meta": [
    {
      "job_title": "Sterile Processing Technician Lead",
      "job_category": "Healthcare",
      "job_class": "Lead",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Responsible for coordinating the day-to-day functions for assigned area."
    },
    {
      "duty": "Assists with ensuring that departmental goals are achieved, timelines met, and service excellence provided in all aspects of work."
    },
    {
      "duty": "Subject matter expert."
    },
    {
      "duty": "Responsible to practice in a professional manner and enforcing the standards of quality assurance, infection control, DNV and other regulatory agencies."
    },
    {
      "duty": "Assigns work; plans and manages priorities, provides technical assistance, oversees staff schedules, monitors quality of work, monitors team projects, mentors staff, provides constructive feedback, oversees staff training, ensures quality improvement, provides leadership feedback on staff performance, and assists with goal setting for the team."
    },
    {
      "duty": "Responsible for the coordination, assembly and distribution of supplies, equipment and instruments for surgical cases."
    },
    {
      "duty": "Provides in-services for new instrumentation."
    },
    {
      "duty": "Assists and participates in process improvement initiatives, responsible for documenting, monitoring and maintaining accurate records demonstrating high level disinfection and sterilization in accordance with current professional and regulatory agencies."
    },
    {
      "duty": "Collaborates with the Perioperative Nursing staff to provide sterile instrument sets, and equipment in an accurate and timely manner."
    },
    {
      "duty": "Assists in maintaining consistent and continuous workflow, providing superior customer service."
    },
    {
      "duty": "Re-stocking inventory."
    },
    {
      "duty": "Cleaning, decontaminating, disassembling and sterilizing instruments and supplies."
    },
    {
      "duty": "Operate a variety of sterilization equipment."
    },
    {
      "duty": "Clean and maintain department equipment."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 100,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent preferred."
    },
    {
      "credential": "Certification from IAHCSMM, as a Certified Registered Central Service Tech (CRCST), or certification from CBSPD as a Certified Sterile Processing and Distribution Tech (CSPDT) or other nationally recognized certifying body required."
    },
    {
      "credential": "Certification from IAHSCMM as a Certified Instrumentation Specialist (CIS) required."
    }
  ]
}