{
  "meta": [
    {
      "job_title": "Stylist",
      "job_category": "Retail",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 34000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Acts as a brand representative reflective of the company values; drives the store experience on the sales floor through an energized pace."
    },
    {
      "duty": "Initiates conversation and interacts with the customer in a personalized, genuine way; connects with the customer on shared passions of wellness, fitness, and an active lifestyle."
    },
    {
      "duty": "Actively shares details to promote FP Movement events, as well as drive engagement and participation; supports the execution of events in collaboration with fitness and wellness partners."
    },
    {
      "duty": "Utilizes technology to be well-informed on events and special offers in store and online to enhance the customer experience with an omni perspective."
    },
    {
      "duty": "Contributes to an inclusive and people-first philosophy by being positive, respectful and helpful to others."
    },
    {
      "duty": "Collaborates with peers and leadership, sharing ideas with the team and actively participating in daily meetings, store initiatives, and brand focuses."
    },
    {
      "duty": "Takes initiative to gain expertise on product and shares knowledge regarding fit, fabrication, and styling to inspire the customer."
    },
    {
      "duty": "Maintains FP Movement's visual and operational standards while keeping the focus on the customer."
    },
    {
      "duty": "Supports the shipment process to gain awareness of product including what’s new and what’s reship."
    },
    {
      "duty": "Adheres to store’s safety standards, inventory accuracy, reduction of product loss, and upholds all company policy and procedures to support the profitability of the store."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Team Player",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": []
}