{
  "meta": [
    {
      "job_title": "Managing Consultant, Biologist/Ecologist",
      "job_category": "Consulting",
      "job_class": "Consultant",
      "sector": "Environmental",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Environmental Impact Assessments",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Permitting",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide senior biological related leadership on environmental impact assessments for power, oil and gas, renewable energy, and sustainability-related projects."
    },
    {
      "duty": "Prepare plans, permits, and reports for wetlands and threatened and endangered species consultations and surveys for renewable energy and associated electric transmission projects."
    },
    {
      "duty": "Perform environmental compliance assessments and implement follow-up corrective actions to ensure compliance with federal, state, and local regulations."
    },
    {
      "duty": "Conduct field work, including ecological field studies."
    },
    {
      "duty": "Provide general environmental compliance support to clients, including on-site assistance, as needed."
    },
    {
      "duty": "Compile and evaluate data and assist in report preparation."
    },
    {
      "duty": "Perform project tasks within scope/budget/schedule expectations and ensure quality standards on project deliverables."
    },
    {
      "duty": "Support ERM Partners-in-Charge and Project Managers to deliver exceptional client value on projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master’s degree in biology, environmental studies, planning, or related natural resources science or natural history field of study"
    }
  ]
}