{
  "meta": [
    {
      "job_title": "Project Director",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 180000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work in close collaboration with the Project Lead to provide operational and strategic leadership to the HIV matrix teams by working with functional area partners to deliver robust, fit for purpose plan, and oversee its execution."
    },
    {
      "duty": "Generate scenario planning for the project team, enabling robust data-driven decision-making, and for the oversight and reporting of development program deliverables and objectives."
    },
    {
      "duty": "Use 'soft skills' to keep the matrix team motivated, aligned and focused on delivering the team’s critical path."
    },
    {
      "duty": "Influence the strategy, seamlessly integrate it into an endorsed development plan, optimize the critical path, and oversee its execution."
    },
    {
      "duty": "Be accountable to, and work with, the Project Leader (and Project Team) to translate the strategy into a robust, competitive medicines development plan, with an optimized critical path and clear go/no go decision points."
    },
    {
      "duty": "Drive scenario planning and enable Governance/Decision-Making."
    },
    {
      "duty": "Manage Resource and Budget: Identify and manage project resource/budget requirements and anticipated variance, and work with the Project Leader and matrix team to ensure estimates are accurate, gaps are addressed, and progress tracked."
    },
    {
      "duty": "Manage the Matrix Team: Provide operational leadership of project team by overseeing the execution of the strategy, manage project-level team meetings, ensure they have a structure and are effective, document clear decisions/actions (minutes) that are communicated to team members and stakeholders."
    },
    {
      "duty": "Own the Project Communication: Utilize effective communication skills to facilitate appropriate information exchange between Functional Lines, Project Leader, and senior management; ensuring project information is quickly communicated to the appropriate stakeholders, in an agreed format and cadence, and in compliance with approved standards."
    },
    {
      "duty": "Drive continuous development of yourself and the department: Continuously enhance personal understanding and application of project management tools and methodologies in the pharmaceutical industry, participate in process improvement initiatives and bring in external perspective and industry standard practices, perform project data analyses and reporting, as needed."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Change Management",
      "experience": 10
    },
    {
      "skill": "HIV Drug Development",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Project Management, Business, or a related field (Master’s preferred)"
    },
    {
      "credential": "PMP or equivalent certification"
    },
    {
      "credential": "HIV drug development experience"
    }
  ]
}