{
  "meta": [
    {
      "job_title": "Client Communications Specialist",
      "job_category": "Communications",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Strategic Communication",
      "experience": 5
    },
    {
      "skill": "Client Relations",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Content Development",
      "experience": 5
    },
    {
      "skill": "Research and Analysis",
      "experience": 5
    },
    {
      "skill": "Public Speaking",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Brand Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage client communication needs and support GSA programs through various communication strategies with consistent branding."
    },
    {
      "duty": "Serve as a liaison between clients and the Office of Strategic Communication, providing strategic advice and direction on communication needs."
    },
    {
      "duty": "Write, edit, and distribute written materials covering GSA and/or client programs, including newsletters, brochures, web content, and other publications."
    },
    {
      "duty": "Research, write, and edit professional communication materials, including news and feature stories, formal presentations, video scripts, and other materials for various clients."
    },
    {
      "duty": "Develop finished written and visual products that articulate and explain complex agency and/or client policies and research findings."
    },
    {
      "duty": "Assess and improve the effectiveness and management of GSA written communication initiatives, processes, and systems."
    },
    {
      "duty": "Research background data and interview sources to write material for newsletters and websites."
    },
    {
      "duty": "Develop informational and educational materials such as handbooks, web content, and other publications."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Communications, Public Relations, Business, or a related field (Master's preferred)"
    }
  ]
}