{
  "meta": [
    {
      "job_title": "Assistant Controller",
      "job_category": "Accounting",
      "job_class": "Assistant",
      "sector": "Finance",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Non-profit Accounting",
      "experience": 5
    },
    {
      "skill": "GAAP Compliance",
      "experience": 5
    },
    {
      "skill": "Financial Statements Preparation",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Audit Preparation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and manage the daily operations of the finance department, including accounts receivable, cash receipts, and donation pledges."
    },
    {
      "duty": "Ensure compliance with GAAP, IRS Form 990, CA 592, and 1099 forms."
    },
    {
      "duty": "Maintain and manage the general ledger, ensuring accuracy and completeness."
    },
    {
      "duty": "Prepare and present financial statements, including balance sheet, income statement, and cash flow statement."
    },
    {
      "duty": "Develop and maintain audit schedules, ensuring all financial records are prepared and ready for internal and external audits."
    },
    {
      "duty": "Assist in the preparation and management of the organization's annual budget."
    },
    {
      "duty": "Collaborate with other departments to ensure accurate and timely financial reporting."
    },
    {
      "duty": "Provide financial analysis and guidance on all activities, plans, targets, and business drivers."
    },
    {
      "duty": "Develop and implement financial policies and procedures to improve efficiency and effectiveness within the finance department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 20,
      "introvert_extrovert": 20
    }
  ],
  "education_certification": [
    {
      "credential": "CPA certification is required. A minimum of 3 years of experience in a similar role within a non-profit organization. Extensive knowledge of public accounting and non-profit accounting principles, including GAAP. Experience with IRS Form 990, CA 592, and 1099 forms. Proven track record of managing accounts receivable, cash receipts, and donation pledges. Strong knowledge of financial statements, including balance sheet, income statement, and cash flow statement. Proficiency in accounting software and Microsoft Office Suite, particularly Excel. A strong commitment to the mission and values of our organization."
    }
  ]
}