{
  "meta": [
    {
      "job_title": "Accessories Designer",
      "job_category": "Design",
      "job_class": "Designer",
      "sector": "Fashion",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Design Skills",
      "experience": 5
    },
    {
      "skill": "Adobe Illustrator",
      "experience": 5
    },
    {
      "skill": "Microsoft Suite",
      "experience": 5
    },
    {
      "skill": "Graphic Design",
      "experience": 5
    },
    {
      "skill": "Textile Print Knowledge",
      "experience": 5
    },
    {
      "skill": "3D Design",
      "experience": 3
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Fashion Industry Knowledge",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the design process from inspiration to finalized tech pack hand off, providing finished design materials for presentations and collateral."
    },
    {
      "duty": "Partner closely with Design Director and Product Marketing team to shape the accessory category offering."
    },
    {
      "duty": "Present category ideas to Design team, Marketing team, and other internal groups, displaying a cohesive design approach."
    },
    {
      "duty": "Study and interpret market conditions and trends related to golf, sharing insights with design leadership, marketing, and development teams."
    },
    {
      "duty": "Actively research trade publications, style analysis, trade fairs, online design tools, and market visits to inspire and promote future thinking."
    },
    {
      "duty": "Utilize live fittings and reviews for each proto round and execute design work according to the visual language of the brand."
    },
    {
      "duty": "Support, inspire, energize, and challenge the immediate design team and cross-functional counterparts."
    },
    {
      "duty": "Understand and follow seasonal calendar and process, adhering to given Corporate Identity guidelines and legal guidance."
    },
    {
      "duty": "General interest in fashion, golf, and sportswear market/trend."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Fashion Design degree and/or relevant work experience in performance industry"
    }
  ]
}