{
  "meta": [
    {
      "job_title": "Host",
      "job_category": "Hospitality",
      "job_class": "Entry Level",
      "sector": "Hospitality",
      "salary": 28000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure the prompt recognition and seating of all guests in outlets as assigned."
    },
    {
      "duty": "Assist the servers in providing attentive courteous and efficient service to guests throughout their dining experience."
    },
    {
      "duty": "Assist the cashier in the collection of payment for all guest transactions."
    },
    {
      "duty": "Approach all encounters with guests and employees in a friendly service-oriented manner."
    },
    {
      "duty": "Maintain high standards of personal appearance and grooming."
    },
    {
      "duty": "Comply with certification requirements as required for position to include Food Handlers, Alcohol Awareness, Safety, etc."
    },
    {
      "duty": "Greet and seat guests at appropriate tables in a timely manner."
    },
    {
      "duty": "Assist in providing a pleasant dining experience to guests."
    },
    {
      "duty": "Assist cashier in collection of money or credit cards."
    },
    {
      "duty": "Ensure quality control of menus with regard to cleanliness and appearance."
    },
    {
      "duty": "Perform opening and closing duties according to established side work checklist."
    },
    {
      "duty": "Answer the telephone according to standards."
    },
    {
      "duty": "Have a complete knowledge of standards of service for receiving a room service order."
    },
    {
      "duty": "Know and understand the state liquor laws."
    },
    {
      "duty": "Perform other duties as requested by management."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Hospitality Industry Knowledge",
      "experience": 1
    },
    {
      "skill": "Cash Handling",
      "experience": 1
    },
    {
      "skill": "Problem-Solving",
      "experience": 1
    },
    {
      "skill": "Attention to Detail",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma and/or experience in a hotel or a related field preferred."
    }
  ]
}