{
  "meta": [
    {
      "job_title": "Environmental Services Technician",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 33000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain cleanliness and safety of rooms, patient care areas, offices, hallways, and other assigned areas."
    },
    {
      "duty": "Remove soiled linen and waste from assigned area."
    },
    {
      "duty": "Clean and maintain hard floor surfaces, including dust mop, wet mop, strip, wax, and polish."
    },
    {
      "duty": "Clean and maintain carpeted floors, including vacuuming, shampooing, and extracting."
    },
    {
      "duty": "Clean and sanitize fittings, furniture, walls, ceilings, and vents."
    },
    {
      "duty": "Clean inside glass in assigned area."
    },
    {
      "duty": "Follow appropriate security measures when cleaning medication rooms and refrigerators, and understand the need for medication inventory control and security."
    },
    {
      "duty": "Utilize tools, equipment, and supplies to obtain maximum efficiency and safety."
    },
    {
      "duty": "Demonstrate knowledge of the safe and proper use of housekeeping equipment."
    },
    {
      "duty": "Handle cleaning chemicals in a safe and economical manner, using protective equipment when necessary."
    },
    {
      "duty": "Demonstrate proper care and maintenance of equipment and report damaged or dangerous equipment to supervisor."
    },
    {
      "duty": "Assist with conference room set-ups as required."
    },
    {
      "duty": "Complete all job assignments per scheduled requirements efficiently and safely."
    },
    {
      "duty": "Inform supervisor/lead if schedule is completed or if a block of time becomes available for other tasks."
    },
    {
      "duty": "Communicate effectively, openly, and respectfully to all customers."
    },
    {
      "duty": "Establish open and appropriate communication with customers, co-workers, and supervisors."
    },
    {
      "duty": "Report any unsafe conditions found in work area to the appropriate supervisor."
    },
    {
      "duty": "Participate in educational programs and in-service meetings."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Basic familiarity with computers preferred."
    }
  ]
}