{
  "meta": [
    {
      "job_title": "Client Services Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Veterinary",
      "salary": 38000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for greeting clients, determining the needs of the clients and patients, and completing the check-in and check-out process."
    },
    {
      "duty": "Follows established policy and procedures in scheduling clients for prompt treatment of ill and/or injured patients, as well as proper scheduling of patients in need of vaccinations, rechecks, surgeries, in-hospital procedures, and other services that require the doctors’ and technicians’ time."
    },
    {
      "duty": "Helps with client reminders for annual health assessments, parasite checks, dentistry, senior care, etc."
    },
    {
      "duty": "Pulls patient charts for daily scheduled appointments and collects information to make necessary updates, including the creation of new charts, when appropriate."
    },
    {
      "duty": "Assists technician in filling prescriptions with appropriate medication and providing routine instructions to owners on the proper administration of the medication."
    },
    {
      "duty": "Performs over-the-counter sales of merchandise such as food and special diets, shampoos, flea and tick control products, heartworm, etc."
    },
    {
      "duty": "Invoices clients, collects fees, makes change, imprints credit card forms, and obtains authorization for credit charges following the credit policies of the hospital."
    },
    {
      "duty": "Demonstrates basic emergency procedures and can give proper information on transporting the patient to the hospital."
    },
    {
      "duty": "Responsible for advising hospital staff about incoming emergencies."
    },
    {
      "duty": "Maintains appearance and cleanliness of the waiting room and reception area, including re-stocking of products, office supplies, client educational materials, hospital brochures, etc."
    },
    {
      "duty": "Prepares and sends welcome letters, new client information packets, referral and thank you letters, condolences, long wait notes, and other correspondence for the doctors and/or Hospital Manager."
    },
    {
      "duty": "Demonstrates a full working knowledge of PIMS procedures and functional applications."
    }
  ],
  "skills": [
    {
      "skill": "Client Service",
      "experience": 3
    },
    {
      "skill": "Telephone Etiquette",
      "experience": 3
    },
    {
      "skill": "Veterinary Medical Knowledge",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Basic Computer Skills",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED required. Prior client service experience in veterinary industry required. Basic veterinary medical knowledge, including products and services."
    }
  ]
}