{
  "meta": [
    {
      "job_title": "Senior Recruiter",
      "job_category": "Human Resources",
      "job_class": "Recruiter",
      "sector": "Human Resources",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Full Life Cycle Recruitment",
      "experience": 8
    },
    {
      "skill": "Architecture & Construction Experience",
      "experience": 5
    },
    {
      "skill": "Business Relationship Building",
      "experience": 5
    },
    {
      "skill": "ATS (Applicant Tracking Systems)",
      "experience": 5
    },
    {
      "skill": "MS Office",
      "experience": 5
    },
    {
      "skill": "Sourcing and Networking",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Decision Making",
      "experience": 5
    },
    {
      "skill": "Virtual Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Adaptability",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage full life-cycle recruitment including creating search strategies, actively sourcing candidates, pre-screening, interviewing, and presenting qualified candidates to hiring managers, negotiating offers and facilitating the hiring and on-boarding processes."
    },
    {
      "duty": "Provide consultation to hiring managers on all aspects of the hiring process, including hiring strategies, recruitment cycle timing, coaching and guidance on best practices and sourcing trends."
    },
    {
      "duty": "Responsible for developing, recommending, and executing recruitment strategy with decision makers to ensure a successful candidate search within the identified time frames."
    },
    {
      "duty": "Use proactive methods to network with industry experts and professional industry related associations, in order to build ongoing passive candidate networks."
    },
    {
      "duty": "Build relationships and communicate consistently and proactively throughout the recruitment process to ensure all participants in the hiring process are updated and well informed."
    },
    {
      "duty": "Create a positive candidate experience (for both the selected and non-selected candidates) throughout the entire recruiting process."
    },
    {
      "duty": "Other duties as may be assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree + 6+ years of experience or demonstrated equivalency of experience and/or education of full life cycle recruiting experience. 3 years of industry experience in Architecture & Construction - Architecture & Construction experience is required."
    }
  ]
}