{
  "meta": [
    {
      "job_title": "Cook",
      "job_category": "Hospitality",
      "job_class": "Cook",
      "sector": "Food Services",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for preparing all food items based on standardized recipes for the Restaurant/Dining Outlet, Cafe, Room Service, Employee Cafeteria, and Banquets while maintaining the highest standards to produce an appealing and appetizing product."
    },
    {
      "duty": "Ensure the cleanliness, sanitation, and safety in the kitchen and work areas while minimizing waste and maximizing cost/production ratio."
    },
    {
      "duty": "Approach all encounters with guests and associates in a friendly service-oriented manner."
    },
    {
      "duty": "Maintain regular attendance in compliance with Aimbridge Hospitality standards as required by scheduling."
    },
    {
      "duty": "Maintain high standards of personal appearance and grooming, including wearing the proper uniform and name tag when working."
    },
    {
      "duty": "Maintain cleanliness and organization of all storage areas."
    },
    {
      "duty": "Complete necessary food and station preparations prior to opening of the Restaurant/Dining Outlet/Cafe in order to ensure that guests are served promptly and efficiently during the operating hours."
    },
    {
      "duty": "Prepare and display buffet food items according to Aimbridge Hospitality standards."
    },
    {
      "duty": "Maintain post on the kitchen line as required during the operating hours in order to prepare food to order maintaining the highest standards of efficiency, productivity, and quality."
    },
    {
      "duty": "Prepare food for Banquets as required following specifications of Banquet Event Orders."
    },
    {
      "duty": "Prepare and service food for Associate Cafeteria as specified by the restaurant leadership."
    },
    {
      "duty": "Breakdown buffets and kitchen line, storing food and equipment properly at the end of each meal period."
    },
    {
      "duty": "Work banquet food station as scheduled by restaurant leadership."
    },
    {
      "duty": "Practice safe work habits at all times to avoid possible injury to self or other associates."
    },
    {
      "duty": "Be familiar with all hotel policies and house rules."
    },
    {
      "duty": "Be familiar with hotel's emergency procedures."
    },
    {
      "duty": "Assist in storage and rotation of food items according to hotel procedures."
    },
    {
      "duty": "Attend meetings as required by management."
    },
    {
      "duty": "Perform any other duties as requested by management."
    }
  ],
  "skills": [
    {
      "skill": "Food Preparation",
      "experience": 5
    },
    {
      "skill": "Sanitation and Safety Standards",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ]
}