{
  "meta": [
    {
      "job_title": "Program Manager II",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the Sr. Program Manager in the implementation and maintenance of program strategies and initiatives."
    },
    {
      "duty": "Development and maintenance of program timeline, plans, and milestones according to prioritization."
    },
    {
      "duty": "Risk-based prioritization of program execution and implementation of program changes."
    },
    {
      "duty": "Facilitating process development meetings, management presentations, and meeting note-taking and scheduling."
    },
    {
      "duty": "Identification and timely escalation of project risks to management, working with the team to develop risk mitigations plans."
    },
    {
      "duty": "Assist in the development of a robust project plan and integration of workstream project Gantts for the overall program."
    },
    {
      "duty": "Manage interdependency among workstreams, identify and communicate issues, and drive improvement of workstream processes and efficiency."
    },
    {
      "duty": "Develop and maintain integrated project plans, weekly meetings, project Gantts, issue meeting minutes, management updates, risk log, decision log, and timely analysis and update on task issues."
    },
    {
      "duty": "Schedule and run program meetings to resolve issues and track/facilitate program execution activities as required."
    },
    {
      "duty": "Work with cross-functional teams in a fast-paced, high-visibility environment."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Process Development",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Engineering, Health Sciences, Business, or Financial Management (Master's preferred)"
    }
  ]
}