{
  "meta": [
    {
      "job_title": "Data Center Lab Tech Tier 2",
      "job_category": "IT",
      "job_class": "Technician",
      "sector": "IT",
      "salary": 97000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Linux",
      "experience": 7
    },
    {
      "skill": "Computer Hardware",
      "experience": 7
    },
    {
      "skill": "Supervisory Skills",
      "experience": 7
    },
    {
      "skill": "English Communication",
      "experience": 7
    },
    {
      "skill": "Technical Troubleshooting",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Report Analysis",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Installing, troubleshooting, and maintaining servers and devices in a lab environment."
    },
    {
      "duty": "Identifying and escalating opportunities for efficiency and effectiveness improvements within the client's infrastructure."
    },
    {
      "duty": "Screening for technical capabilities and recommending hire of long-term resources."
    },
    {
      "duty": "Assisting in the onboarding and training of new hires."
    },
    {
      "duty": "Ensuring local execution of key deliverables and metrics."
    },
    {
      "duty": "Performing root cause analysis of complex technical issues and driving resolution."
    },
    {
      "duty": "Leading hardware installation, rack and stack, cabling, and integration tasks."
    },
    {
      "duty": "Debugging hardware, Linux, and Windows OS-related issues using command-line tools and techniques."
    },
    {
      "duty": "Deploying device/system configuration via Linux and Windows OS."
    },
    {
      "duty": "Analyzing data to diagnose systemic issues and providing support to multiple locations within the Bay Area."
    },
    {
      "duty": "Participating in on-call rotation and maintaining an efficient hardware test lab operation."
    },
    {
      "duty": "Helping develop global standards for processes, workflow, and automation roadmaps for data center operations."
    },
    {
      "duty": "Providing cross-functional communication and other relevant tasks as required."
    },
    {
      "duty": "Participating in the on-call/standby rotation schedule and providing on-site support to multiple locations within the Bay Area."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, IT Degree, or equivalent experience"
    }
  ]
}