{
  "meta": [
    {
      "job_title": "Accounting Manager",
      "job_category": "Accounting",
      "job_class": "Manager",
      "sector": "Accounting",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Provide oversight of all accounting functions (accounts receivable, accounts payable, payroll, etc.) for a growing government contractor."
    },
    {
      "duty": "Responsible for Accounts Receivable, including new customer account set up, monthly billing, and payment collection."
    },
    {
      "duty": "Process Accounts Payable, including vendor setup, bill entry, and payment."
    },
    {
      "duty": "Ensure accuracy of entry and timely payment of all bills."
    },
    {
      "duty": "Review vendor invoice transactions, corporate credit cards, and employee expense reports to ensure compliance with prescribed procedures."
    },
    {
      "duty": "Oversee payroll and timesheet cycle, maintain related records, ensure reconciliation with payroll system and accounting system is complete."
    },
    {
      "duty": "Assist with month-end closing process, including preparation of supporting schedules, recording journal entries, balance sheet reconciliations, and monthly bank reconciliations."
    },
    {
      "duty": "Reconcile accounts and investigate any issues in Accounts Payable, Accounts Receivable, and labor accounts."
    },
    {
      "duty": "Support property tax filings and various state and local business tax items, as needed."
    },
    {
      "duty": "Research technical tax, audit, and accounting/cost issues as necessary."
    },
    {
      "duty": "Prepare quarterly financial package for executive and external review."
    },
    {
      "duty": "Coordinate and serve as primary point of contact during yearly audits with an outside firm."
    },
    {
      "duty": "Assist with the annual corporate tax process and send annual 1099’s to necessary vendors."
    },
    {
      "duty": "Use excel and data analytical skills to conduct in-depth analyses to identify, isolate, and resolve complex discrepancies."
    },
    {
      "duty": "Perform other accounting, financial, or administrative tasks as required by the Director of Finance or other."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Accounting or related field"
    }
  ]
}