{
  "meta": [
    {
      "job_title": "Financial Controller",
      "job_category": "Accounting",
      "job_class": "Controller",
      "sector": "Management",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Accounting",
      "experience": 5
    },
    {
      "skill": "GAAP Compliance",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "CPA Certification",
      "experience": 5
    },
    {
      "skill": "SOX Compliance",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Auditing",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "SEC Filings",
      "experience": 5
    },
    {
      "skill": "Software Industry Experience",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee day-to-day accounting operations, ensuring adherence to company accounting policies and procedures."
    },
    {
      "duty": "Lead and manage AP and GL teams, fostering their performance and professional growth."
    },
    {
      "duty": "Spearhead timely monthly, quarterly, and annual financial closes, meticulously reconciling balances and verifying accuracy."
    },
    {
      "duty": "Collaborate closely with the VP & Corporate Controller and external auditors to assess and ensure compliance with SOX 404."
    },
    {
      "duty": "Prepare and review monthly financial statements, including thorough quarterly flux analysis."
    },
    {
      "duty": "Provide critical support to cross-functional teams, sharing accounting expertise to enhance financial reporting accuracy."
    },
    {
      "duty": "Research, develop, and implement accounting policies and procedures in alignment with industry standards."
    },
    {
      "duty": "Engage actively in researching applicable accounting standards to ensure internal and external compliance in financial recording and reporting."
    },
    {
      "duty": "Assist in external year-end audits, contributing to the preparation of essential work papers."
    },
    {
      "duty": "Take the lead in training, developing, and motivating accounting staff, contributing to a high level of employee commitment and departmental achievement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum 4 years with 'Big 4' public accounting firms, including 3+ years of supervisory experience in accounting close and consolidation. Active CPA certification is mandatory. In-depth knowledge of current GAAP accounting, particularly revenue recognition guidance. Strong analytical skills and attention to detail, able to propose system improvements. Comfortable working independently, embracing both hands-on detailed tasks and strategic thinking. Intermediate to advanced Excel skills. Experience with SEC filings preferred, particularly in a public company setting. Previous work experience in the software industry."
    }
  ]
}