{
  "meta": [
    {
      "job_title": "Senior Human Resources Data Analyst",
      "job_category": "Human Resources",
      "job_class": "Analyst",
      "sector": "Management",
      "salary": 106000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "SharePoint Online",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Application Design",
      "experience": 5
    },
    {
      "skill": "Relational Databases",
      "experience": 5
    },
    {
      "skill": "Power Apps",
      "experience": 5
    },
    {
      "skill": "Power BI",
      "experience": 5
    },
    {
      "skill": "Power Automate",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "HRIS Administration",
      "experience": 5
    },
    {
      "skill": "UML Diagrams",
      "experience": 5
    },
    {
      "skill": "Report Design",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as SDOT’s SharePoint Online (SPO) secondary site collector and subject matter expert."
    },
    {
      "duty": "Develop and maintain Microsoft Power Apps (Power Automate, Power BI, Dataverse, Forms)."
    },
    {
      "duty": "Design, develop, maintain, and implement systems processes for work order systems, ticketing systems, salary compensation, interview panel pools, Adobe Sign, and other projects."
    },
    {
      "duty": "Gather business and systems requirements, analyze current business and systems processes, and document in UML diagrams, flow charts, and data schemas."
    },
    {
      "duty": "Research, analyze, problem-solve, report, and recommend solutions based on existing systems/tools."
    },
    {
      "duty": "Write complex SQL statements for key workforce teams and act as SDOT HR's department administrator for HRIS (EV-5, payroll, labor reconciliation)."
    },
    {
      "duty": "Support department goals in promoting diversity and social justice in keeping with the City’s Race and Social Justice Initiative."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in business, information science, computer science, or related field."
    },
    {
      "credential": "Three (3) years of experience with data analysis, application design, relational databases, data architecture, and graphical information reporting. OR: An equivalent combination of education and experience that demonstrates the ability to perform the position duties."
    },
    {
      "credential": "Previous experience working with macros, VBA, SQL, Python, and various programing languages."
    },
    {
      "credential": "Experience working with Tableau, Power Apps, Power Automation, logic, functions, and algorithms."
    },
    {
      "credential": "Previous experience developing, tracking, and reporting on HR-oriented metrics."
    },
    {
      "credential": "Strong customer service orientation and commitment to customer satisfaction."
    },
    {
      "credential": "Attention to detail, organization, and the ability to actively manage multiple processes."
    },
    {
      "credential": "Ability to effectively work in a multi-cultural workplace with a diverse customer base."
    },
    {
      "credential": "Work is typically performed in a hybrid work environment in which a minimum of 2 days of the work is completed in a City office, and 3 days of the work is completed remotely in a regular 40-hour work week."
    }
  ]
}