{
  "meta": [
    {
      "job_title": "Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 57200,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Lead Generation",
      "experience": 5
    },
    {
      "skill": "Customer Satisfaction",
      "experience": 5
    },
    {
      "skill": "Territory Management",
      "experience": 5
    },
    {
      "skill": "Cold Calling",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Sell Comcast Internet, Data, Video and Voice services to small and mid-size businesses."
    },
    {
      "duty": "Create and deliver face-to-face sales presentations demonstrating knowledge of the latest Comcast products and services."
    },
    {
      "duty": "Promote the sale of bundled products to ensure the optimal solution for the customer."
    },
    {
      "duty": "Stay abreast of competitive landscape and emerging technologies to best position Comcast Business Services in the marketplace."
    },
    {
      "duty": "Generate new leads with targeted businesses through various prospecting activities, including cold calling, canvassing, customer referrals, and partner relationships."
    },
    {
      "duty": "Effectively manage a territory with a high activity and comprehensive business plan."
    },
    {
      "duty": "Team with technical, customer service, and related support staff to ensure end-to-end customer sales and satisfaction."
    },
    {
      "duty": "Consistently maintain a pipeline of qualified prospects that will yield production levels of monthly quota performance and above."
    },
    {
      "duty": "Remain knowledgeable of Comcast products and services to facilitate sales efforts."
    },
    {
      "duty": "Adherence to all company standards and business professionalism."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree"
    }
  ]
}