{
  "meta": [
    {
      "job_title": "NDC Mailing and Shipping Processor",
      "job_category": "Operations",
      "job_class": "Processor",
      "sector": "Logistics",
      "salary": 32000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "NDC mail processing",
      "experience": 1
    },
    {
      "skill": "General mailroom experience",
      "experience": 1
    },
    {
      "skill": "Verbal and written communication skills",
      "experience": 1
    },
    {
      "skill": "Understanding of mail classifications",
      "experience": 1
    },
    {
      "skill": "Shipping processes and software knowledge",
      "experience": 1
    },
    {
      "skill": "Basic PC skills with Microsoft Excel",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Process all incoming and outgoing expedited Fedex, UPS, and US Postal Service letters and packages."
    },
    {
      "duty": "Data entry into shipping and tracking systems, matching and preparing required state specific documents and checks for daily mailings."
    },
    {
      "duty": "Reports daily shipment data to customers and liaisons to facility employees on most efficient shipping methods."
    },
    {
      "duty": "Sets up shipments of equipment between field offices."
    },
    {
      "duty": "Provides assistance for Incoming Document Processing and document retention."
    },
    {
      "duty": "May work a schedule outside of traditional business hours."
    },
    {
      "duty": "Work in uncontrolled climate conditions."
    },
    {
      "duty": "Researches shipping addresses utilizing different databases to ensure correct addressing is used to prevent delays."
    },
    {
      "duty": "Operates and maintains high speed print equipment used for mail processing."
    },
    {
      "duty": "Determines mailing classification type and mailing vendor for processing of outbound OKC/KC shipments."
    },
    {
      "duty": "Processes overnight shipments for the Total Loss COE."
    },
    {
      "duty": "Processes outbound expedited shipments for Large Loss Property claims using in-house mail and shipping systems."
    },
    {
      "duty": "Ensures any special documentation is included in outgoing shipments."
    },
    {
      "duty": "Stores all paper documents mailed to the NDC on a carousel ensuring each document is tracked to a specific location and can be retrieved at any time."
    },
    {
      "duty": "Retrieves original documents by request."
    },
    {
      "duty": "Maintains records for chain of custody purposes to ensure customer data is kept confidential using certified destruction process."
    },
    {
      "duty": "Works directly with destruction vendor to maintain proper inventory of destruction bins, seals and tickets."
    },
    {
      "duty": "Sorts incoming Total Loss packages received by Fed Ex, UPS, and USPS by type, department name, claim representative name and enters data into tracking system."
    },
    {
      "duty": "Assists the Mailing and Shipping Processor II to complete daily overnight shipping and receiving reports."
    },
    {
      "duty": "Answers and helps with routine mailing and shipping questions from all employees, supervisors, and managers."
    },
    {
      "duty": "Researches and records reason for all return packages and reports back to Leadership."
    },
    {
      "duty": "Provides assistance to Inbound Mail Processors and Imaging Technicians in times of high volume in those areas."
    },
    {
      "duty": "Performs other duties as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent required."
    }
  ]
}