{
  "meta": [
    {
      "job_title": "Senior Project Manager/Program Component Lead",
      "job_category": "Program Management",
      "job_class": "Senior Manager",
      "sector": "Management",
      "salary": 160000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage a major component of a multi-disciplinary infrastructure program with technical and non-technical complexity, under the direction of the Program Manager."
    },
    {
      "duty": "Promote alignment within the integrated consultant and client Program and project component teams through effective and regular communications."
    },
    {
      "duty": "Develop and implement various plans, business processes, and tools to drive efficiency, emphasize accountability, bring team alignment, and promote transparency."
    },
    {
      "duty": "Monitor and manage internal and external factors related to the assigned project component that influence the Program."
    },
    {
      "duty": "Coordinate with project controls team and multiple project delivery teams to monitor and control the program/project’s scope, cost, schedule, and quality metrics."
    },
    {
      "duty": "Manage component risk register and enforces Program Risk Management policies and procedures."
    },
    {
      "duty": "Develop component scope, budget, and schedule for tasks under the Program Management contract."
    },
    {
      "duty": "Monitors status of component performance and deliverables and develops monthly reports for the client."
    },
    {
      "duty": "Assist in securing resources required to deliver services specified in the contract scope with a focus on contract compliance."
    },
    {
      "duty": "Coordinates client’s interdisciplinary review of project deliverables."
    },
    {
      "duty": "Prepare and make detailed presentations to the team and client."
    },
    {
      "duty": "Enforce Program quality control policy."
    },
    {
      "duty": "Organize component assignments to develop junior staff."
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 15
    },
    {
      "skill": "Environmental Engineering",
      "experience": 15
    },
    {
      "skill": "Infrastructure Project Management",
      "experience": 15
    },
    {
      "skill": "Project Planning",
      "experience": 15
    },
    {
      "skill": "Risk Management",
      "experience": 15
    },
    {
      "skill": "Stakeholder Management",
      "experience": 15
    },
    {
      "skill": "Technical and Non-technical Communication",
      "experience": 15
    },
    {
      "skill": "Resource Management",
      "experience": 15
    },
    {
      "skill": "Quality Control",
      "experience": 15
    },
    {
      "skill": "Presentation Skills",
      "experience": 15
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in an Engineering discipline, Construction Management, or closely related field. U.S. P.E. or Canada P.Eng. or the ability to obtain through reciprocity in 6 months is required."
    },
    {
      "credential": "Minimum fifteen (15) years of experience in the management and delivery of civil engineering infrastructure projects and/or large water or wastewater development projects."
    },
    {
      "credential": "Current holder of, or have no restrictions to obtain, sufficient immigration documents for travel to/from U.S. and Canada."
    },
    {
      "credential": "Valid driver's license required and a clean driving record."
    },
    {
      "credential": "PMP or PgMP certification through the Project Management Institute."
    }
  ]
}