{
  "meta": [
    {
      "job_title": "Manager of Analytical Development",
      "job_category": "Science",
      "job_class": "Manager",
      "sector": "Science",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Analytical Method Development",
      "experience": 7
    },
    {
      "skill": "Biologics Development",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Filings",
      "experience": 5
    },
    {
      "skill": "Process Characterization",
      "experience": 5
    },
    {
      "skill": "CMC Activities",
      "experience": 5
    },
    {
      "skill": "Tech Transfer",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Biochemistry",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage analytical development activities performed at CROs/CDMOs associated with method development, qualification/validation, transfer and characterization of drug substance, drug product, in-process testing, and reference standards qualification."
    },
    {
      "duty": "Develop and execute strategies for product and process characterization with a focus on CQA assessment, specification, release, stability, and comparability studies."
    },
    {
      "duty": "Facilitate tech transfer of methods to GMP testing facility, commercial groups, and to CMO's."
    },
    {
      "duty": "Collaborate with process and quality functions to ensure strong cross-functional collaborations and integrated process and product development and characterization."
    },
    {
      "duty": "Author, review and/or approve key source documents for relevant sections of regulatory filings (IND, IMPD, BLA, etc.)."
    },
    {
      "duty": "Lead and track analytical development commitments to support all CMC filing activities for pre-INDs, INDs, IMPDs, CTAs and BLAs, draft and review of regulatory filings, and address RTQs."
    },
    {
      "duty": "Assure all documentation and other regulatory compliance systems are maintained according to GSK corporate standards."
    },
    {
      "duty": "Establish and implement processes, technical concept, and methodologies to enable effective collaboration with CRO/CDMO business partners to ensure efficiency and high quality of results."
    },
    {
      "duty": "Partner with Quality Assurance and Regulatory Affairs-CMC to ensure completion of appropriate documentation and maintenance of high-quality standards."
    },
    {
      "duty": "Provide clear communication to partners and functional line management regarding progress against technical and project objectives/milestones."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "B.S., M.S. or Ph.D. in chemistry, biochemistry, chemical engineering, or related field with (bio)pharmaceutical industry experience."
    }
  ]
}