{
  "meta": [
    {
      "job_title": "Staffing Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Recruiting",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "HR Compliance",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Overseeing all aspects of caregiver performance management, ensuring that proper protocols are in place for employee recognition, employee discipline and warnings, employee termination, incident investigation and resolution, injury and worker’s compensation management, use of paid sick time, and other HR-related issues, partnering with the HR team as needed."
    },
    {
      "duty": "Providing one-on-one supervision to the caregivers, including training, coaching, counseling, disciplining, hiring, and firing, and ensuring the caregivers are fully prepared for assigned duties."
    },
    {
      "duty": "Independently analyzing each caregiver to identify the best caregiver for each job assignment based upon relevant factors, including the client’s needs and goals and the caregiver’s skill level, reliability, past performance, availability, and geography."
    },
    {
      "duty": "Managing the Caregiver Team, responding to their requests, providing leadership and support when needed, and ensuring that caregivers are complying with our policies and procedures."
    },
    {
      "duty": "Supporting the retention of our caregiver staff by providing high-touch, white-glove personnel management service and going the extra mile as needed. This may include referral to additional support systems, including caregiver support specialists."
    },
    {
      "duty": "Proactively reaching out to caregiver staff to ensure each is faring well and to determine areas of support needed, including scheduled check-in calls."
    },
    {
      "duty": "Working together with recruiting for facilitating, interviewing, screening, and hiring new caregivers."
    },
    {
      "duty": "Ensuring each caregiver has successfully completed orientation prior to the first assignment. Coordinating additional training as needed."
    },
    {
      "duty": "Communicating with our clients and their families to ensure a positive and successful relationship."
    },
    {
      "duty": "Determining the rate of pay a caregiver will receive for their assignments in order to maintain appropriate margins and change for staffing success."
    },
    {
      "duty": "Responsible for daily entries into the scheduling system; verification of time(s) worked, notes completed, and accurate payroll for the caregivers by the stated deadline."
    },
    {
      "duty": "Reviewing caregiver performance on an ongoing basis and as appropriate increasing caregivers compensation to align with business goals."
    },
    {
      "duty": "Authority to make expense decisions as it pertains to the caregiver while maintaining accountability with a predetermined budget."
    },
    {
      "duty": "Ensuring compliance with any applicable labor laws and/or industry regulations."
    },
    {
      "duty": "Ensuring proper documentation is entered into the scheduling system for disciplinary action, performance reviews, and termination paperwork where appropriate."
    },
    {
      "duty": "Responsible for the oversight of caregiver profiles and skill sets in the scheduling system."
    },
    {
      "duty": "Ensuring caregivers' competence with company tools, systems and technology including our Caregiver App, and Training Platforms."
    },
    {
      "duty": "Providing after-hours support for our clients and caregivers (including evenings and weekends) – this support may include email, telephone, and/or home visits."
    },
    {
      "duty": "Additional duties and responsibilities as assigned by your Supervisor."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a human or health services field preferred\nHigh school diploma required"
    }
  ]
}