{
  "meta": [
    {
      "job_title": "Quality Assurance Specialist",
      "job_category": "Quality Assurance",
      "job_class": "Specialist",
      "sector": "Manufacturing",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "SOP Compliance",
      "experience": 5
    },
    {
      "skill": "Document Management",
      "experience": 5
    },
    {
      "skill": "GMP Compliance",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Change Control",
      "experience": 5
    },
    {
      "skill": "CAPA",
      "experience": 5
    },
    {
      "skill": "Auditing",
      "experience": 5
    },
    {
      "skill": "Training",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Reads, understands, and follows SOP’s and aligns with cGMP’s."
    },
    {
      "duty": "Writes new standard operating procedures or revises existing documentation using document management systems."
    },
    {
      "duty": "Supports the evaluation and disposition of labelling, raw materials, intermediates and finished products through timely evaluation of batch records, laboratory results and other cGMP documents."
    },
    {
      "duty": "Supports the issuance and reconciliation of GMP documentation."
    },
    {
      "duty": "Reviews documented information from their functional area, reports abnormalities."
    },
    {
      "duty": "Assists in the implementation of new processes."
    },
    {
      "duty": "Initiates and/or reviews and approves minor deviations; completes tasks related to CAPA and Change Control action items."
    },
    {
      "duty": "Represents QA on site committees such as SHE, etc."
    },
    {
      "duty": "Creates/revises QA documents (SOPs, technical reports, risk assessments) in document management system."
    },
    {
      "duty": "Supports internal audits of manufacturing, analytical testing, labeling to ensure compliance with SOPs and regulatory requirements per the requirements of the self-inspection program."
    },
    {
      "duty": "Facilitates and coordinates training of new and existing team members, prepares training materials as necessary."
    },
    {
      "duty": "Provides guidance to lower-level associates daily."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in biology, engineering, or science related field preferred (Master's preferred)"
    }
  ]
}