{
  "meta": [
    {
      "job_title": "Sales Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Sales",
      "remote": false,
      "salary": 35000
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Team Player",
      "experience": 3
    },
    {
      "skill": "Visual Merchandising",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Flexibility",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Engage with customers in a personalized way to ensure a genuine and unique experience for each customer."
    },
    {
      "duty": "Support a selling environment in all areas of the sales floor by connecting with multiple customers and providing product suggestions."
    },
    {
      "duty": "Utilize technology to provide a frictionless customer experience by transacting in the moment and finding sizes, colors, and placing orders for items not available in-store."
    },
    {
      "duty": "Build productive relationships with peers, ask for support when needed, and make an effort to help others."
    },
    {
      "duty": "Participate in the learning and sharing of product knowledge, current trends, and personal styling priorities to inspire the customer."
    },
    {
      "duty": "Support the shipment process, understand the contribution to service and selling on every shift, and maintain Anthropologie’s visual and operational standards."
    },
    {
      "duty": "Maintain stock levels of the floor, stay current on merchandising updates, and contribute to completion of omni order fulfillment processes."
    },
    {
      "duty": "Contribute to a positive team morale, participate in store initiatives, and communicate feedback to Store Leadership."
    },
    {
      "duty": "Work flexible hours to meet the needs of the store, including nights, weekends, and holidays."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Experience in customer service and being a team player. Ability to work flexible hours to meet the needs of the store, including nights, weekends, and holidays."
    }
  ]
}