{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 132150,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Risk Mitigation",
      "experience": 5
    },
    {
      "skill": "Resource Management",
      "experience": 5
    },
    {
      "skill": "Project Documentation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, monitor, and manage enterprise-wide projects from initiation through completion."
    },
    {
      "duty": "Lead or coordinate enterprise-wide project planning, progress reporting, and troubleshooting."
    },
    {
      "duty": "Oversee multiple project teams to determine enterprise-wide resource requirements and estimate project costs."
    },
    {
      "duty": "Mitigate project risks, establish contingency plans, anticipate dependencies affected by ongoing project changes."
    },
    {
      "duty": "Manage enterprise-wide projects through the application of comprehensive project management concepts."
    },
    {
      "duty": "Maintain project documentation, including the plan, IT release readiness, communication plan, and deployment timeline."
    },
    {
      "duty": "Coordinate stakeholder and dependency meetings to ensure all ancillary teams, deliverables, and processes are on track."
    },
    {
      "duty": "Create and deliver project updates at Program Meetings and Product Day updates to Senior Managers, Directors, and Executive levels across IT, Product, and Service."
    },
    {
      "duty": "Manage project alignment, buy-in, and support of diverse stakeholders by building and maintaining relationships with internal partners, third-party vendors, and leadership."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Project Management, Business, or related field"
    }
  ]
}