{
  "meta": [
    {
      "job_title": "Nursery Technician",
      "job_category": "Agriculture",
      "job_class": "Technician",
      "sector": "Agriculture",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Caring for plants in the vegetative state in either the mom, clone or veg room."
    },
    {
      "duty": "Transplanting, cutting clones, watering, trimming, bottoming, topping, pruning, and defoliating."
    },
    {
      "duty": "Recognizing requirements associated with the strain, growth patterns, and identifying anomalies within the plants."
    },
    {
      "duty": "Participating in all aspects of plant maintenance depending on Cultivation needs."
    },
    {
      "duty": "Using dexterity, coordination, and precision to perform manual plant maintenance activities."
    },
    {
      "duty": "Maintaining open communication with the Leadership team and co-workers."
    },
    {
      "duty": "Cleaning and sanitizing all flower rooms, benches, irrigation systems, etc. to ensure cleanliness."
    },
    {
      "duty": "Interpreting and following cultivation schedules."
    },
    {
      "duty": "Following department-specific work instructions and SOP’s."
    },
    {
      "duty": "Meeting production goals while maintaining performance, safety, and quality."
    },
    {
      "duty": "Being aware of hazards in the workspace and reporting safety incidents/concerns."
    },
    {
      "duty": "Complying with area safety requirements, state regulations, and PPE requirements."
    },
    {
      "duty": "Performing record-keeping accurately and completely as directed by a lead or supervisor."
    },
    {
      "duty": "Maintaining and calibrating tools, equipment, and machinery as directed by a lead or supervisor."
    },
    {
      "duty": "Reporting and escalating safety & quality concerns."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of a high school diploma. GED, or associate degree or certifications preferred."
    },
    {
      "credential": "Prior experience in manufacturing or fast-paced environment."
    },
    {
      "credential": "Ability to utilize simple math for calculations."
    }
  ]
}