{
  "meta": [
    {
      "job_title": "Position Classification Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Human Resources",
      "salary": 82000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs position classification pay and position management functions for exempt and nonexempt jobs."
    },
    {
      "duty": "Conducts job evaluations analysis and pay analysis."
    },
    {
      "duty": "Interprets regulations, policies, and directives, and provides accurate pay setting guidance in accordance with relevant policy and NEXCOM standards/practices."
    },
    {
      "duty": "Assists with developing and providing policy guidance throughout the Department on a wide range of compensation programs."
    },
    {
      "duty": "Analyzes proposed pay legislation and regulations for impact on agency HR policies and programs and develops policies and programs to revise and/or implement new pay policies and procedures."
    },
    {
      "duty": "Provides guidance on available incentives, such as recruitment, relocation, and retention, and other pay-setting flexibilities permissible within guidelines of DoD and applicable OPM policies and guidance."
    },
    {
      "duty": "Conducts studies to analyze and measure the effectiveness of recruitment and retention processes, annual incentives for exempt associates, and the necessity of special wage rate schedules for specific jobs."
    },
    {
      "duty": "Gathers and analyzes salary and occupational data from other federal agencies, private sector institutions, professional societies, etc., to determine local market or representative salary rates in order to conduct compensation studies and trends analyses for similar positions."
    },
    {
      "duty": "Conducts research regarding complex, controversial, or unprecedented compensation issues, including but not limited purchased surveys, outreach to other NAF Agencies, HR professional, local agencies/societies/chapters, etc."
    },
    {
      "duty": "Classifies positions using NEXCOM, DoD, and OPM classification standards. Determines appropriate job title, series and grade/band in conformance with applicable standards and NEXCOM organizational structures."
    },
    {
      "duty": "Conducts position management reviews for assigned area(s) of responsibilities by providing assistance to managers on ways to improve existing or establish new structures that will optimize efficiency, productivity, and organizational effectiveness in accordance with sound classification standards/requirements."
    },
    {
      "duty": "Determines the correct position classification by comparison to applicable classification standards relative to the position(s) in question, or under review, and prepares evaluation statement(s) to finalize resolution and/or options determined."
    },
    {
      "duty": "Reviews NEX and NEXCOM organizational structures for effectiveness and sound position management and provides recommendations regarding organizational restructure and impact to existing and/or need for establishing of new positions."
    },
    {
      "duty": "Develops partnerships and collaborations among teammates and other managers to assist with implementing programs and/or initiatives under the purview of Compensation, Recognition, and Wellness programs."
    },
    {
      "duty": "Keeps abreast of current commercial and government sector practices regarding pay, incentive plans, rewards, recognition, and other related benefits considered part of total compensation."
    },
    {
      "duty": "Provides technical advice, resolves problems, and works with NEXs and DoD to develop special wage schedules (increased minimum rates, special schedules), as necessary."
    },
    {
      "duty": "Assists with maintaining the NEXCOM job description library maintained in the Human Resources Information System, ensuring all required and applicable fields are populated with accurate data."
    },
    {
      "duty": "Prepares and conducts training and presentations to managers, supervisors, and associates regarding NES pay and classification programs."
    },
    {
      "duty": "Works closely with associates at all levels within NEXCOM Enterprise and establishes and maintains productive working relationships with other retail NAF instrumentalities and private sector consulting firms regarding pay and classification personnel."
    }
  ],
  "skills": [
    {
      "skill": "Job Analysis",
      "experience": 5
    },
    {
      "skill": "Pay Analysis",
      "experience": 5
    },
    {
      "skill": "Classification Standards",
      "experience": 5
    },
    {
      "skill": "Policy Development",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Training and Presentation",
      "experience": 5
    },
    {
      "skill": "Technical Advice",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business, or a related field (Master's preferred)"
    }
  ]
}