{
  "meta": [
    {
      "job_title": "Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop new business, penetrate existing accounts, and minimize lost business to achieve profitable sales growth and special objectives within assigned territory."
    },
    {
      "duty": "Seek and qualify prospects following company account stratification goals."
    },
    {
      "duty": "Research customer business needs and develop a mix of products and service to meet needs."
    },
    {
      "duty": "Drive personal vehicle to customer accounts, conventions, company meetings, etc."
    },
    {
      "duty": "Answer customers' questions about products, prices, availability, and product use."
    },
    {
      "duty": "Participate in company functions, promotions, customer visits, and customer events."
    },
    {
      "duty": "Attend and participate in general sales and district meetings."
    },
    {
      "duty": "Engage in ongoing training sessions."
    },
    {
      "duty": "Assist with the training of new employees as requested."
    },
    {
      "duty": "Perform administrative duties, such as preparing sales budgets and reports, maintaining sales records, processing credits, and pick-up requests, preparing sales quotes and menu suggestions, and filing reports."
    },
    {
      "duty": "Other duties may be assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 60,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Sales, Marketing, Hospitality, Culinary Arts or related discipline OR HSD/GED and 3 years Restaurant Management, B2B or outside sales experience, or equivalent relatable experience."
    },
    {
      "credential": "Valid driver's license with a 'clean' driving record"
    },
    {
      "credential": "Submit to pre-employment testing (Drug Screen, Background Check)"
    },
    {
      "credential": "Must sign Sysco Protective Covenants Agreement"
    },
    {
      "credential": "Reside or willing to relocate to the geographical vicinity of territory"
    }
  ]
}