{
  "meta": [
    {
      "job_title": "HVAC Service Technician",
      "job_category": "Service Technician",
      "job_class": "III",
      "sector": "HVAC",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Heating, Ventilation, and Air Conditioning (HVAC) Repair",
      "experience": 5
    },
    {
      "skill": "Diagnostic and Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 5
    },
    {
      "skill": "Pipefitting and Brazing",
      "experience": 5
    },
    {
      "skill": "Customer Education",
      "experience": 5
    },
    {
      "skill": "Sales Opportunities Identification",
      "experience": 5
    },
    {
      "skill": "Data Entry and Computer Literacy",
      "experience": 5
    },
    {
      "skill": "Chiller Trend Data Analysis",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "First Aid/CPR",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Diagnose, repair, and perform preventative maintenance on commercial and industrial HVAC equipment, including large and small rooftop units, split systems, chillers, and boilers."
    },
    {
      "duty": "Perform maintenance, repair, and replacement of defective equipment, components, or wiring."
    },
    {
      "duty": "Conduct intermediate - advanced diagnostics, troubleshooting, pipefitting, and brazing of CAT I, II, and III HVAC equipment."
    },
    {
      "duty": "Educate customers on proper use of equipment, maintenance schedule, and operating manual."
    },
    {
      "duty": "Lead the rebuild and retrofit of CAT I, II and III level units, and guide less experienced technicians through hands-on demonstration."
    },
    {
      "duty": "Identify and quote opportunities for minor repairs directly to the customer and communicate potential sales opportunities to the sales staff."
    },
    {
      "duty": "Perform basic data entry, navigate the use of email, internet, and word processing programs, and analyze chiller trend data to ensure optimal performance."
    },
    {
      "duty": "Potentially travel with some overnight travel for service applications and training."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree or equivalent from two-year college or technical school, with a certificate in Heating, Ventilation, and Air Conditioning."
    },
    {
      "credential": "Refrigeration Certification or other professional on-the-job training in the HVAC Industry."
    },
    {
      "credential": "Valid driver's license with acceptable driving record."
    },
    {
      "credential": "Any required license(s) and/or training card as required by local law district."
    },
    {
      "credential": "Ability to lift up to 50lbs with or without an accommodation."
    }
  ]
}