{
  "meta": [
    {
      "job_title": "Contract Manufacturing Analyst",
      "job_category": "Operations",
      "job_class": "Analyst",
      "sector": "Manufacturing",
      "salary": 80000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the operations management and administration of an assigned area within the strategic partner network."
    },
    {
      "duty": "Provides direction and coordination of SAP set up and maintenance, procurement of OS sourced materials, material management, and reconciliations."
    },
    {
      "duty": "Works with functional partners; I/T, Demand Planning, Manufacturing, Procurement, Transportation, Warehousing, Customer Service, Alliance Partners, and Finance to ensure that partner activities support strategic plans."
    },
    {
      "duty": "Manage partner raw materials losses and report any excesses of contractual agreement to Contract Manufacturing Mgr."
    },
    {
      "duty": "Audit and recommend approval for invoices, resolving any discrepancies, work to ensure on-time payment to all vendors, seek and implement opportunities for cost reduction."
    },
    {
      "duty": "Meet with senior management monthly to review and evaluate performance metrics, provide feedback to the appropriate internal functions on programs and procedures that affect the partner’s ability to meet the requirements of the contract, support internal audit activities."
    },
    {
      "duty": "Coordinate new product set up at the partner locations in SAP including BOM, condition records, and provide support to Contract Manufacturing Mgrs."
    }
  ],
  "skills": [
    {
      "skill": "Operations Management",
      "experience": 4
    },
    {
      "skill": "SAP",
      "experience": 4
    },
    {
      "skill": "Math Skills",
      "experience": 4
    },
    {
      "skill": "Food and Beverage Manufacturing",
      "experience": 4
    },
    {
      "skill": "Leadership",
      "experience": 4
    },
    {
      "skill": "Process Improvement Methodologies",
      "experience": 4
    },
    {
      "skill": "Analysis",
      "experience": 4
    },
    {
      "skill": "Contingency Planning",
      "experience": 4
    },
    {
      "skill": "Accounting",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Operations Management or related field"
    }
  ]
}