{
  "meta": [
    {
      "job_title": "Device Sales Specialist",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Marketing",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Clinical Expertise",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Meet territory sales quota for ICU IV Infusion Device product line: Plum 360, LifeCare PCA and complimentary dedicated pump infusion sets along with MedNet safety software and IV EMR connectivity."
    },
    {
      "duty": "Master presentation skills and command of technical knowledge of the ICU family of products and how they relate to guidelines (FDA, CDC, SHEA, INS, ONS, ASHP, etc.) in order to communicate professionally with Hospital Clinicians."
    },
    {
      "duty": "Conduct executive level presentations on clinical concepts, current ICU products, and future product pipeline."
    },
    {
      "duty": "Know the strengths and weaknesses of competing products in the market and how to position ICU Medical’s offerings against them clinically."
    },
    {
      "duty": "Be the clinical expert / consultative problem solver at the field level for clinical and supply chain contacts."
    },
    {
      "duty": "Maintain a high level of technical and commercial competence on relevant products, technologies, and services. Quickly demonstrate expertise and establish credibility with clinical and executive decision makers"
    },
    {
      "duty": "Know the assigned territory and customer base, contracts, pumps, solutions, distribution models, etc. Be able to conduct product trials and implementation of all ICU products."
    },
    {
      "duty": "Know your market and the clinicians in the market through local AVA, INS, APIC, and ONS chapters."
    },
    {
      "duty": "Develop strategic customer relationships throughout the hospital to drive the purchase of ICU’s infusion devices."
    },
    {
      "duty": "Communicate with managers and align sales efforts with Company and regional targets."
    },
    {
      "duty": "Develop and maintain a high level of customer satisfaction."
    },
    {
      "duty": "Negotiate contracts with hospital supply chain and administrative organizations."
    },
    {
      "duty": "Understand market dynamics and healthcare trends."
    },
    {
      "duty": "Work on special projects as they arise."
    },
    {
      "duty": "Work occasionally during weekends/nights, when necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from an accredited college or university is required. MBA or MHA a plus. Minimum 5 years of medical sales experience, selling capital equipment, medical devices, or software in a hospital environment."
    }
  ]
}