{
  "meta": [
    {
      "job_title": "Management Professor",
      "job_category": "Education",
      "job_class": "Professor",
      "sector": "Education",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Teaching",
      "experience": 5
    },
    {
      "skill": "Research",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    },
    {
      "skill": "Curriculum Development",
      "experience": 5
    },
    {
      "skill": "Academic Advising",
      "experience": 5
    },
    {
      "skill": "Public Speaking",
      "experience": 5
    },
    {
      "skill": "Community Engagement",
      "experience": 5
    },
    {
      "skill": "Student Recruitment",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Teaching introduction and upper-level management courses in undergraduate and graduate programs."
    },
    {
      "duty": "Conducting research that enhances Business Administration program instruction and practice in the industry."
    },
    {
      "duty": "Mentoring and advising students in alignment with the mission and vision of the University and school."
    },
    {
      "duty": "Engaging in ongoing professional development, especially activities that advance student engagement, learning, and equity."
    },
    {
      "duty": "Providing service to the Department, School, and University."
    },
    {
      "duty": "Contributing to the intellectual and academic life of the department, University, and community."
    },
    {
      "duty": "Selecting and organizing materials based on course outcomes/objectives and program learning outcomes."
    },
    {
      "duty": "Developing an instruction plan that responds to students' needs, the instructor's teaching style, the course's goals, and the subject matter's nature."
    },
    {
      "duty": "Staying current in the discipline and related pedagogy."
    },
    {
      "duty": "Additional faculty responsibilities include student recruitment, academic advising, campus committees, curriculum development, and community outreach."
    },
    {
      "duty": "Other duties as assigned by the Dean or the Chair of the Department of Business Administration."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Ph.D. or Master's degree in Management, Business Administration, or a related field. ACBSP or AACSB credentials preferred."
    }
  ]
}