{
  "meta": [
    {
      "job_title": "LVN",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 42000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Welcoming patients warmly with compassion and listening carefully to patient needs."
    },
    {
      "duty": "Communicating clear and accurate information in response to all members of the health care team."
    },
    {
      "duty": "Working collaboratively with other health care team members to ensure patient needs are met and clinic operations are efficient."
    },
    {
      "duty": "Taking and recording accurate vital signs and measurements as well as assisting with exams and procedures."
    },
    {
      "duty": "Assisting nurse manager in ensuring all team members are meeting service standards and following department guidelines."
    },
    {
      "duty": "Identifying needs for improvement and opportunities to recognize excellence in the performance of all team members."
    },
    {
      "duty": "Managing refill requests and administering medications to patients following policies and procedures for medication management."
    },
    {
      "duty": "Implementing teaching plans for patients and their families in accordance with individual care plans."
    },
    {
      "duty": "Participating in the identification of patients' needs for referrals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of a Board of Nursing Accredited program of vocational nursing or scheduled to complete a program of vocational nursing within 120 days of applying for a position."
    },
    {
      "credential": "Current Vocational Nursing license in the state of Texas or the attainment of a temporary permit from the Board of Nursing to practice vocational nursing pending full licensure in the state of Texas."
    },
    {
      "credential": "Passing the National Council Licensure Examination for Practical Nurses (NCLEX- PN) on the first attempt."
    }
  ]
}