{
  "meta": [
    {
      "job_title": "Sr Counsel I, GTAL - HIV Prevention",
      "job_category": "Legal",
      "job_class": "Counsel",
      "sector": "Legal",
      "salary": 246382,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Legal Counsel",
      "experience": 6
    },
    {
      "skill": "Compliance",
      "experience": 6
    },
    {
      "skill": "Pharmaceutical Law",
      "experience": 6
    },
    {
      "skill": "Litigation",
      "experience": 6
    },
    {
      "skill": "Healthcare Regulations",
      "experience": 6
    },
    {
      "skill": "Communication Skills",
      "experience": 6
    },
    {
      "skill": "Legal Writing",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide legal and compliance advice with a focus on commercialization, promotion, marketing and advertising of the Company’s approved product(s)."
    },
    {
      "duty": "Support a wide range of Company activities such as advising on promotional review, business plans, regulatory actions, investigations, and drafting compliance policies."
    },
    {
      "duty": "Monitor legal developments affecting pharmaceutical promotion and interactions with health care professionals."
    },
    {
      "duty": "Develop an understanding of business objectives and translate them into the Legal Department’s priorities to deliver practical advice to the business."
    },
    {
      "duty": "Partner with legal teams and enhance alignment and consistency of legal guidance, policy, and process."
    },
    {
      "duty": "Triage a heavy workflow, set priorities, devise solutions, and collaborate with internal and external stakeholders."
    },
    {
      "duty": "Recognize and escalate matters of specialty, or unusual complexity or risk as appropriate."
    },
    {
      "duty": "Provide prompt review and guidance to the Promotional Review Committee and Medical Review Committee."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Juris Doctorate from a nationally accredited law school. Member in good standing of the State Bar of California."
    }
  ]
}