{
  "meta": [
    {
      "job_title": "Technical Implementation Specialist",
      "job_category": "Information Technology",
      "job_class": "Specialist",
      "sector": "Technology",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide front line support in a conversion to ensure client functionality is properly selected to meet client specifications and expectations resulting in a fully successful implementation."
    },
    {
      "duty": "Sets up and installs technical systems, applications, or process designs for clients'/company's outsourced technology and business process solutions."
    },
    {
      "duty": "Works directly with client to manage initial access, supports map and transfer data, creates required process documents, and trains or coordinates training for client users."
    },
    {
      "duty": "Tests and troubleshoots functionality of installed systems; identifies and documents technical issues to be escalated to other product and system integration teams for resolution, where appropriate."
    },
    {
      "duty": "Provides feedback based on client experiences to product and professional services teams for product and process improvements."
    },
    {
      "duty": "May work directly with clients on-site or provide installation support remotely."
    }
  ],
  "skills": [
    {
      "skill": "IT System Installation",
      "experience": 6
    },
    {
      "skill": "Client Support",
      "experience": 6
    },
    {
      "skill": "Technical Troubleshooting",
      "experience": 6
    },
    {
      "skill": "Data Transfer and Mapping",
      "experience": 6
    },
    {
      "skill": "Documentation",
      "experience": 6
    },
    {
      "skill": "Training Coordination",
      "experience": 6
    },
    {
      "skill": "Testing and Quality Assurance",
      "experience": 6
    },
    {
      "skill": "Client Feedback Analysis",
      "experience": 6
    },
    {
      "skill": "Technical Communication",
      "experience": 6
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree, Relevant Experience or Degree in: Major in Business or Computer Science preferred, other majors considered. Willing to accept additional experience in lieu of a degree, TSYS systems or industry related experience strongly preferred."
    }
  ]
}