{
  "meta": [
    {
      "job_title": "Associate Revenue Operations Analyst",
      "job_category": "Operations",
      "job_class": "Analyst",
      "sector": "Revenue Operations",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Operational Thinking",
      "experience": 3
    },
    {
      "skill": "Documentation",
      "experience": 3
    },
    {
      "skill": "Collateral Preparation",
      "experience": 3
    },
    {
      "skill": "Salesforce Administration",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Document process changes and internal step-by-step guides and playbooks, covering a myriad of situations from customer onboarding to internal rules of engagement."
    },
    {
      "duty": "Work with the Revenue team members and systems to ensure our licensing and provisioning process is efficient and scales with our business, with a focus on improving customer journey and experience."
    },
    {
      "duty": "Help drive systems onboarding for new members of the Revenue team so they can quickly contribute to the team upon joining."
    },
    {
      "duty": "Monitor the team’s progress by assisting with the calculation of metrics to inform Mixpanel’s weekly revenue cadence."
    },
    {
      "duty": "Work with cross-functional teams including Sales, Marketing, FP&A, and EPD."
    },
    {
      "duty": "Verifying information in Salesforce and connected apps (creating/updating reporting, dashboards, and maintaining data quality)."
    },
    {
      "duty": "Leverage analytical tools to generate insights from data, help in forecasting, trend analysis, and predictive modeling to support business decisions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum 1 year of experience working in a client-facing environment (sales, customer success, sales operations) preferred. Expertise in Google Suite, Microsoft Excel, Salesforce (administration, database architecture, creating custom objects, fields, formulas, workflows, and validation rules). Excellent communication skills and critical thinking skills to understand sales policies and processes. Strong organizational skills."
    }
  ]
}