{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Customer Service",
      "salary": 32000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Consultative Selling",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Emotional Resilience",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Critical Thinking",
      "experience": 3
    },
    {
      "skill": "Conflict Resolution",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide consultative customer service and support, addressing billing, policy changes, and other inquiries with a focus on a positive customer experience."
    },
    {
      "duty": "Identify gaps in coverage, upsell, cross-sell, and retain customers by providing tailored insurance solutions."
    },
    {
      "duty": "Proactively share knowledge and information to reduce customer effort and enhance their understanding of insurance products."
    },
    {
      "duty": "Adapt to each customer, offering a consultative, non-scripted approach to efficiently solve problems and address customer needs."
    },
    {
      "duty": "Manage time effectively in a fast-paced contact center environment, working non-traditional shifts and maintaining reliability in attendance."
    },
    {
      "duty": "Utilize technology and learning resources to deliver efficient problem resolution and maintain expert knowledge of insurance products and services."
    },
    {
      "duty": "Analyze, clarify, and resolve intermediate policy and account-related questions from internal and external customers."
    },
    {
      "duty": "Participate in in-house or outside insurance/industry-related courses/seminars to expand product/system knowledge and support the organization's overall strategy."
    },
    {
      "duty": "Meet individual performance metrics and goals, and suggest innovative process changes to support business practices."
    },
    {
      "duty": "Accept feedback and work well with others, incorporating best practices from team members to achieve optimal performance."
    },
    {
      "duty": "Demonstrate advanced conflict resolution skills and consistently meet or exceed performance measurement goals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent (Four-year college degree preferred)"
    }
  ]
}