{
  "meta": [
    {
      "job_title": "Weddings Stylist",
      "job_category": "Fashion",
      "job_class": "Stylist",
      "sector": "Fashion",
      "salary": 48000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for styling, outfitting education, team development, client outreach, and booking appointments."
    },
    {
      "duty": "Acts as a brand representative reflective of the company values, contributes to the service and selling culture in the store by developing authentic customer connections, offering expert styling advice, and providing an individualized experience with product recommendations."
    },
    {
      "duty": "Utilizes technology to provide a frictionless client experience and transact in the moment by upselling or sharing product not available in store; supports associate education, clienteling, and brand focuses through the use of technology."
    },
    {
      "duty": "Inspires team through creativity, outfitting, and shared fate; drives the store by being positive, confident, respectful, and helpful to others, collaborates with peers and leadership, sharing ideas with the team and actively participating in daily meetings, store initiatives, and brand focuses, partners with leadership team to mentor service and selling strategies to impact individual and monthly goals."
    },
    {
      "duty": "Assists store leaders in maintaining a visually compelling store that is neat, clean, and organized; supports weekly store objectives relating to customer service, outfitting, or styling, assesses Anthropologie Weddings styling expectations looking for business driving opportunities for the store; takes smart risks with measurable results to maximize sales and impact customer experience."
    },
    {
      "duty": "Adheres to store’s safety standards, inventory accuracy, reduction of product loss, and upholds all company policy and procedures to support the profitability of the store, participates in store communication and fit sessions; facilitates sharing of product knowledge, current trends, and personal styling priorities to inspire the staff and customer, provides store and departmental insight related to the customer experience and communicates to Anthropologie Weddings leadership team; participates in district forums when applicable, fosters ongoing relationships with clients through outreach and networking, appointment generation, service follow-up, and engagement through store events"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 75,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Certificate or Diploma in fashion design or related field (Bachelor's degree preferred)"
    }
  ]
}