{
  "meta": [
    {
      "job_title": "Senior Student Recruitment Counselor",
      "job_category": "Admissions",
      "job_class": "Counselor",
      "sector": "Education",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruitment",
      "experience": 2
    },
    {
      "skill": "Student Counseling",
      "experience": 2
    },
    {
      "skill": "Event Planning",
      "experience": 3
    },
    {
      "skill": "Market Analysis",
      "experience": 2
    },
    {
      "skill": "Relationship Building",
      "experience": 3
    },
    {
      "skill": "Marketing Campaigns",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Software",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage territory for recruiting freshman, transfer, international, and/or graduate enrollees and/or prospective students."
    },
    {
      "duty": "Plan and implement all recruitment functions to increase student enrollment."
    },
    {
      "duty": "Organize, create, and participate in events, both on and off campus, as well as virtual events."
    },
    {
      "duty": "Provide advice and counsel to prospective students and parents about specific educational opportunities, admissions requirements, and financial aid and scholarship processes."
    },
    {
      "duty": "Serve as a mentor and trainer to new admission counselors, coordinate travel schedules and assignments, and assist with developing and implementing recruitment plans."
    },
    {
      "duty": "Review and evaluate prospective students' transcripts and applications for admission, counsel applicants regarding their eligibility status."
    },
    {
      "duty": "Develop and nurture relationships with influential contacts such as university department personnel, high school counselors, advisors, and community college liaisons."
    },
    {
      "duty": "Travel to conferences, high schools, colleges, and other learning institutions to publicize and explain admission requirements and procedures."
    },
    {
      "duty": "Answer phone calls and respond to e-mails from prospective students and their family members."
    },
    {
      "duty": "Assist in developing and implementing marketing and recruiting campaigns to achieve target enrollment goals."
    },
    {
      "duty": "Evaluate effectiveness and provide assessment of recruitment activities; provide written updates of territory and enrollment goals."
    },
    {
      "duty": "Assist other areas/departments on campus with recruitment efforts."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree with 2 years of experience counseling students in academic and scholastic matters or equivalent"
    }
  ]
}