{
  "meta": [
    {
      "job_title": "Broadband Installation Technician",
      "job_category": "Technology",
      "job_class": "Technician",
      "sector": "Technology",
      "salary": 45000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs installations and changes of service, while adhering to: applicable codes, requirements, guidelines, company procedures and safe work practices in order to provide an outstanding customer experience."
    },
    {
      "duty": "Updates customer account to ensure an accurate record of products and services is captured to ensure that customer has a positive experience throughout the ongoing customer relationship."
    },
    {
      "duty": "Through the use of sound judgement and decision making, troubleshoots and problem solves customer inquiries and concerns to ensure products and services are working properly to drive a positive customer experience."
    },
    {
      "duty": "Communicates, engages and provides customer with education on products and services."
    },
    {
      "duty": "Manipulates connectors, fasteners, wire and uses hand tools."
    },
    {
      "duty": "Lifts and carries loads of 70 lbs. or more, works in confined spaces such as crawl spaces or attics, works while standing 50 -70% of the time and performs work near power lines and electricity."
    },
    {
      "duty": "Drives company vehicle in performance of duties in a safe and responsible manner with appropriate state licensing requirements while working and traveling in inclement weather."
    },
    {
      "duty": "Training will be provided in areas of safety, company specific training, installations and other areas as necessary."
    }
  ],
  "skills": [
    {
      "skill": "Broadband Installation",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Troubleshooting",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Critical Thinking",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma / GED"
    }
  ]
}