{
  "meta": [
    {
      "job_title": "Development Operations Quality Assurance Manager",
      "job_category": "Quality Assurance",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 125000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "IT Infrastructure Management",
      "experience": 8
    },
    {
      "skill": "Quality Assurance",
      "experience": 8
    },
    {
      "skill": "Technical Support",
      "experience": 8
    },
    {
      "skill": "Source Control",
      "experience": 8
    },
    {
      "skill": "Automated Testing",
      "experience": 8
    },
    {
      "skill": "Customer Support",
      "experience": 8
    },
    {
      "skill": "Incident Resolution",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the smooth and secure operation of the IT infrastructure supporting development, customer support, and customer projects related to the SigmaFlow product."
    },
    {
      "duty": "Build and maintain servers used for the software development process and customer projects."
    },
    {
      "duty": "Monitor server performance and ensure servers are appropriately patched."
    },
    {
      "duty": "Develop and maintain processes for source control, build automation, and product releases."
    },
    {
      "duty": "Plan testing activities and objectives, monitor performance, and uncover system vulnerabilities."
    },
    {
      "duty": "Create manual and automated tests to identify software problems, and analyze bugs and errors found during tests."
    },
    {
      "duty": "Document results of tests for the software development team, work with developers, testers, and other stakeholders to troubleshoot testing failures and bugs."
    },
    {
      "duty": "Responsible for SigmaFlow customer technical support, oversee customer support program, build relationships with key SigmaFlow clients, and provide Level 2 production support."
    },
    {
      "duty": "Coordinate team members responding to support issues, prioritize customer issues, and recommend solutions for product releases."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "4-year degree in Computer Science (or related curriculum) and 8-10 years of relevant experience. Individuals with a 2-year degree and an additional 3 years of relevant experience can be considered. Those candidates without a degree will be required to have an additional 5 years of relevant experience for consideration."
    }
  ]
}