{
  "meta": [
    {
      "job_title": "Emergency Management Training Manager",
      "job_category": "Emergency Management",
      "job_class": "Training Manager",
      "sector": "Emergency Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Training Program Management",
      "experience": 8
    },
    {
      "skill": "Emergency Management",
      "experience": 8
    },
    {
      "skill": "Supervisory Skills",
      "experience": 8
    },
    {
      "skill": "Organizational Development",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Communication skills",
      "experience": 8
    },
    {
      "skill": "Microsoft Office",
      "experience": 8
    },
    {
      "skill": "A/V and Presentation Equipment",
      "experience": 8
    },
    {
      "skill": "Course Material Development",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, prepare, and deliver training programs for Airport Emergency Management employees."
    },
    {
      "duty": "Assess current program and develop strategy to revise the training program for the 24hr Airport Operations Center."
    },
    {
      "duty": "Ensure training documents are developed, distributed and remain current based on operational conditions and processes."
    },
    {
      "duty": "Assess and implement organizational development programs, processes, and training initiatives to support the bureau’ strategies."
    },
    {
      "duty": "Develop methods for evaluation of orientation, performance management and organizational development training."
    },
    {
      "duty": "Participate in budget preparation, submittal and administration related to training programs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors degree in Business Administration, International Affairs, Marketing, or related area, 5-8 years of applicable work experience in: international affairs, business development, or marketing with some experience as a supervisor, team leader, etc."
    },
    {
      "credential": "Bachelors degree in Education, Emergency Management, Organizational Development, Business or related field (Equivalent professional experience may be considered for substitution for the required degree on an exception basis) and 8 years' of specific training experience with demonstrated management experience."
    },
    {
      "credential": "Post Certified Instructor preferred, APCO Certified Trainer"
    }
  ]
}