{
  "meta": [
    {
      "job_title": "IT Audit Manager",
      "job_category": "IT",
      "job_class": "Manager",
      "sector": "IT",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "IT Audit",
      "experience": 5
    },
    {
      "skill": "SOX Compliance",
      "experience": 5
    },
    {
      "skill": "IT Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Scope, coordinate, conduct, and report on IT audits, including SOx IT General Controls Testing."
    },
    {
      "duty": "Partner with IT and 3rd party service provider(s) to identify, and coordinate scope, timing, and resources for audits."
    },
    {
      "duty": "Actively participate in all aspects of the audit process, with an increased focus on ensuring that audit objectives are met."
    },
    {
      "duty": "Assist the IT Audit Senior Manager in managing audit staff and planning, organizing, directing, and monitoring IT internal audit operations."
    },
    {
      "duty": "Assist in evaluating IT deficiencies and communicate the results of audit and consulting projects via written reports and oral presentations to Management."
    },
    {
      "duty": "Assist in the identification and evaluation of the company’s IT risk areas and provide major input into the development of the annual audit plan."
    },
    {
      "duty": "Work closely with the audit staff to develop career goals and provide guidance to support the achievement of these goals."
    },
    {
      "duty": "Develop and maintain productive relationships (with emphasis on IT) throughout the company through individual contacts and meetings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in information systems, Computer Science, Accounting or Finance (Master's preferred)"
    },
    {
      "credential": "Certification as a CISA, CIA, CISSP or CISM."
    }
  ]
}