{
  "meta": [
    {
      "job_title": "Product Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 95052,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Product Management",
      "experience": 3
    },
    {
      "skill": "Cross-Functional Team Management",
      "experience": 3
    },
    {
      "skill": "Market Research",
      "experience": 3
    },
    {
      "skill": "Agile Methodology",
      "experience": 3
    },
    {
      "skill": "Design Thinking",
      "experience": 3
    },
    {
      "skill": "Lean Methodology",
      "experience": 3
    },
    {
      "skill": "Digital Product Management",
      "experience": 3
    },
    {
      "skill": "Relationship Management",
      "experience": 3
    },
    {
      "skill": "Product Roadmap Development",
      "experience": 3
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 3
    },
    {
      "skill": "Agile, Design Thinking, Lean Methodologies",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the product roadmap for digital products, from ideation to implementation."
    },
    {
      "duty": "Define customer and business requirements, enabling cross-functional teams to develop solutions efficiently."
    },
    {
      "duty": "Ensure products align with enterprise strategic priorities, define key metrics for product success, prioritize product features, and conduct market research to evaluate best practices."
    },
    {
      "duty": "Evaluate product performance and determine improvements, maintain relationships with vendors, and ultimately own the product."
    },
    {
      "duty": "Partner with key internal and external stakeholders to build, develop, and deploy digital products, representing the customer’s voice throughout the product development lifecycle."
    },
    {
      "duty": "Establish and evangelize the vision and strategy for assigned digital products, articulate the 'why' behind the products, and own the digital product roadmap."
    },
    {
      "duty": "Bridge technology, business, and customer needs to create remarkable digital experiences that solve customer’s problems, drive business value, and produce desired outcomes."
    },
    {
      "duty": "Collaborate with digital design, digital development, and data & analytics counterparts to align and coordinate efforts for effective delivery, using Agile, Design Thinking, and Lean methodologies as needed to manage product development and deployment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in STEM or related field. Master of Business Administration, Healthcare Management, Public Health or Product Development. RN preferred"
    }
  ]
}