{
  "meta": [
    {
      "job_title": "Dean of College and Career",
      "job_category": "Education",
      "job_class": "Dean",
      "sector": "Education",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage all school-based college staff: college counselors, summer programs manager, and Foundation of Leadership teachers."
    },
    {
      "duty": "Execute and monitor systems that ensure an efficient and effective college application process; Codify and institutionalize all processes, procedures and supporting documents for the college application process on Better Lesson."
    },
    {
      "duty": "Maintain systems for managing the alumni counseling office including the master calendar, success toward articulated goals and metrics, and the development of alumni rituals and traditions."
    },
    {
      "duty": "Build and maintain systems for managing summer programs including the master calendar, success toward articulated goals and metrics and the development of new and continued community partnerships."
    },
    {
      "duty": "Oversee & manage the comprehensive 9 through 13 Foundations of Leadership curriculum including the 9-12 Foundations of Leadership and Transition to College Seminar. "
    },
    {
      "duty": "Manage and maintain a relationship with the College Board including but not limited to test dates, score reporting, PSAT and SAT and Advanced Placement tests."
    },
    {
      "duty": "Accountable for all college initiatives and the success of those initiatives."
    },
    {
      "duty": "Designate owners for each metric in the College and Alumni Report Card. Manage and track progress to reaching both monthly and end of year goals."
    }
  ],
  "skills": [
    {
      "skill": "Educational Leadership",
      "experience": 3
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "College Advising",
      "experience": 5
    },
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Alumni Relations",
      "experience": 3
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Leadership Development",
      "experience": 3
    },
    {
      "skill": "Educational Program Development",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree; master’s degree preferred. At least 3 years of teaching experience with a record of high student achievement."
    }
  ]
}