{
  "meta": [
    {
      "job_title": "Broadband Installation Trainee",
      "job_category": "Technology",
      "job_class": "Entry-Level",
      "sector": "Technology",
      "salary": 35000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs installations and changes of service, while adhering to applicable codes, requirements, guidelines, company procedures, and safe work practices in order to provide an outstanding customer experience."
    },
    {
      "duty": "Updates customer account to ensure an accurate record of products and services is captured to ensure that customer has a positive experience throughout the ongoing customer relationship."
    },
    {
      "duty": "Through the use of sound judgment and decision making, troubleshoots and problem solves customer inquiries and concerns to ensure products and services are working properly to drive a positive customer experience."
    },
    {
      "duty": "Communicates, engages and provides customer with education about products and services."
    },
    {
      "duty": "Displays active listening skills, perceive emotional awareness in difficult situations and empathize with customers to enhance an overall positive experience."
    },
    {
      "duty": "Uses installation tools and hand tools and perform jobs from high places, including climbing poles with proper equipment, ladders, and bucket trucks."
    },
    {
      "duty": "Manipulates connectors, fasteners, wire and uses hand tools. Lifts and carries loads of 70 lbs. or more, works in confined spaces such as crawl spaces or attics, works while standing 50 -70% of the time and performs work near power lines and electricity."
    },
    {
      "duty": "Drives company vehicle in performance of duties in a safe and responsible manner with appropriate state licensing requirements."
    },
    {
      "duty": "Training will be provided in areas of safety, company specific training, installations and other areas as necessary. Continued employment is contingent upon achieving required training, certifications and safety requirements."
    },
    {
      "duty": "Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) and overtime as necessary."
    },
    {
      "duty": "Other duties and responsibilities as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Broadband Installation",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Troubleshooting",
      "experience": 1
    },
    {
      "skill": "Basic Technical Knowledge",
      "experience": 1
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma / GED"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ]
}