{
  "meta": [
    {
      "job_title": "Training Associate",
      "job_category": "Education",
      "job_class": "Associate",
      "sector": "Education",
      "salary": 52500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Curriculum Development",
      "experience": 3
    },
    {
      "skill": "Facilitation",
      "experience": 3
    },
    {
      "skill": "Program Evaluation",
      "experience": 3
    },
    {
      "skill": "Training Needs Analysis",
      "experience": 3
    },
    {
      "skill": "Community Partnership Building",
      "experience": 3
    },
    {
      "skill": "Collaboration",
      "experience": 3
    },
    {
      "skill": "Cultural Competency",
      "experience": 3
    },
    {
      "skill": "Technical Assistance",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support and facilitate online synchronous, online asynchronous, and in-person trainings for professionals via the PPGNY Training Institute."
    },
    {
      "duty": "Ensure adherence to PPGNY’s mission, values, guiding principles."
    },
    {
      "duty": "Stay up to date with current developments and research on sexuality-related topics."
    },
    {
      "duty": "Support with curriculum development and application of learning concepts, such as adult learning theory, trauma responsive care, models of health behavior change, human centered design, and universal design for learning."
    },
    {
      "duty": "Develop and revise professional training designs related to sexual and reproductive health topics that are responsive to participant and community needs."
    },
    {
      "duty": "Provide technical assistance to internal and external stakeholders who are working to integrate sexual and reproductive health knowledge and skills into their practice."
    },
    {
      "duty": "Collect demographic, monitoring, and evaluation data from training participants; compile data appropriately and prepare submissions."
    },
    {
      "duty": "Build and sustain partnerships and community relationships, making connections with internal and external resources and centering community priorities."
    },
    {
      "duty": "Assist and collaborate with team members to execute any cross-program opportunities or overarching program initiatives."
    },
    {
      "duty": "Represent the Education Department for selected internal and external committees, meetings, and working groups."
    },
    {
      "duty": "Perform other educational and experience-related duties as outlined by the Education Department’s annual Work Plan or as outlined in grant applications."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Experience in sexual and reproductive health care, public health, and /or health education preferred. Three (3) years of experience providing educational workshops and presentations."
    }
  ]
}