{
  "meta": [
    {
      "job_title": "Survey Crew Chief",
      "job_category": "Engineering",
      "job_class": "Chief",
      "sector": "Engineering",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Surveying",
      "experience": 5
    },
    {
      "skill": "AutoCAD Civil 3D",
      "experience": 3
    },
    {
      "skill": "Trimble Equipment",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Teamwork",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Commute to and from sites daily in a company provided truck."
    },
    {
      "duty": "Perform survey activities such as leveling, traversing, topographic mapping, construction layout, as-built surveys, boundary surveys and profile and cross section surveys."
    },
    {
      "duty": "Set up, adjust, and operate Trimble survey equipment including; total station, data collector and GPS equipment."
    },
    {
      "duty": "Reviewing survey field calculations and adjust when needed."
    },
    {
      "duty": "Locating or establishing vertical and horizontal control."
    },
    {
      "duty": "Prepare accurate field notes and complete as-built drawings."
    },
    {
      "duty": "Responsible to maintain work issued vehicle, laptop, and survey equipment."
    },
    {
      "duty": "Follow safety protocols."
    },
    {
      "duty": "Work independently as a one-man crew, or collaborate with a survey crew member."
    },
    {
      "duty": "Ability to read and interpret engineering plans."
    },
    {
      "duty": "Attend paid training and development events opportunities."
    },
    {
      "duty": "Mentor survey crew members and assist with new hire training plan, career planning, and continuous professional development."
    },
    {
      "duty": "Reward and motivate your crew with spot bonuses and Peer Recognition Rewards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "5+ years of experience in a Survey Crew Chief role"
    }
  ]
}