{
  "meta": [
    {
      "job_title": "Maintenance Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist with the operation maintenance and repair of equipment. Change out light bulbs; perform preventative maintenance for guest rooms to include: vinyl repair, touch up paint, minor furniture repair, tub caulking, tile repairs, etc. Perform preventative maintenance for ice machines, refrigerators, kitchen equipment, laundry equipment, HVAC, guestrooms, meeting rooms, the swimming pool, and hot tub. Perform plumbing repair, laundry equipment repair, and preventative maintenance on all exhaust fans and supply; monitor energy conservation; repair vacuum cleaners and any other small equipment upon request. Immediately follow up on any alarms to determine the exact location and cause - determine emergency status and report to the Front Desk with findings. Perform other tasks/jobs as assigned by the supervisor or manager."
    },
    {
      "duty": "Asistir con la operaci\\u00f3n, mantenimiento y reparaci\\u00f3n de equipos. Cambiar las bombillas; Realice el mantenimiento preventivo de las habitaciones de hu\\u00e9spedes para incluir: reparaci\\u00f3n de vinilo, pintura de retoque, reparaci\\u00f3n de muebles menores, calafateo de tinas, reparaci\\u00f3n de azulejos, etc. Realice mantenimiento preventivo para m\\u00e1quinas de hielo, refrigeradores, equipos de cocina, equipos de lavander\\u00eda, HVAC, habitaciones, salas de reuniones, la piscina y el jacuzzi. Realizar reparaciones de plomer\\u00eda, reparaci\\u00f3n de equipos de lavander\\u00eda, mantenimiento preventivo en todos los extractores y suministros; monitorear la conservaci\\u00f3n de energ\\u00eda; repare aspiradoras y cualquier otro equipo peque\\u00f1o a pedido. Asista de inmediato a cualquier alarma para determinar la ubicaci\\u00f3n exacta y la causa: determine el estado de emergencia e informe a la recepci\\u00f3n con los resultados. Llevar a cabo otra tarea seg\\u00fan asignada por el supervisor o gerente."
    }
  ],
  "skills": [
    {
      "skill": "Maintenance and Repair",
      "experience": 3
    },
    {
      "skill": "Plumbing",
      "experience": 3
    },
    {
      "skill": "Carpentry",
      "experience": 2
    },
    {
      "skill": "Electrical Repair",
      "experience": 2
    },
    {
      "skill": "HVAC",
      "experience": 3
    },
    {
      "skill": "Preventative Maintenance",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent required. Licensed in a trade preferred (plumbing, electrical, HVAC, carpentry, etc.). Must have a valid driver\\u2019s license for the applicable state (property specific). Must have an acceptable MVR (Motor Vehicle Driving Record) (property specific). Certificado de curso de un a\\u00f1o de colegio o escuela t\\u00e9cnica; o tres a seis meses de experiencia o capacitaci\\u00f3n relacionada a la materia; o una combinaci\\u00f3n equivalente de estudios y experiencia. Preferentemente conocimiento b\\u00e1sico y experiencia en carpinter\\u00eda, plomer\\u00eda, reparaci\\u00f3n mec\\u00e1nica, pintura y sistemas de aire acondicionado y calefacci\\u00f3n (HVAC)."
    }
  ]
}