{
  "meta": [
    {
      "job_title": "Management Faculty",
      "job_category": "Education",
      "job_class": "Faculty",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Teaching introduction and upper-level management courses in the undergraduate program and Master Entrepreneurial Studies (MES) program."
    },
    {
      "duty": "Contribute to the intellectual and academic life of the department, University, and community."
    },
    {
      "duty": "Engage and mentor students in alignment with the mission and vision of the University and school."
    },
    {
      "duty": "Select and organize materials based on course outcomes/objectives and program learning outcomes."
    },
    {
      "duty": "Develop an instruction plan that responds to students' needs, the instructor's teaching style, the course's goals, and the subject matter's nature."
    },
    {
      "duty": "Conduct research that enhances Business Administration program instruction and practice in the industry."
    },
    {
      "duty": "Provide service to the Department, School, and University."
    },
    {
      "duty": "Provide students with frequent, timely assessments and clear feedback about their performance."
    },
    {
      "duty": "Stay current in the discipline and related pedagogy."
    },
    {
      "duty": "Engage in ongoing professional development, especially activities that advance student engagement, learning, and equity."
    },
    {
      "duty": "Additional faculty responsibilities include student recruitment, academic advising, campus committees, curriculum development, and community outreach."
    },
    {
      "duty": "Other duties as assigned by the Dean or the Chair of the Department of Business Administration."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 180,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Ph.D.D.B.A. or expect to complete a Ph.D. by July 31, 2023 (Master's degree in Management or an MBA will be seriously considered with evidence of high quality teaching experience)"
    }
  ]
}