{
  "meta": [
    {
      "job_title": "Automotive Service Technician",
      "job_category": "Retail",
      "job_class": "Technician",
      "sector": "Automotive",
      "salary": 42000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Automotive Repair",
      "experience": 2
    },
    {
      "skill": "ASE Certification",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Mechanical Diagnostics",
      "experience": 2
    },
    {
      "skill": "Technical Training",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Driving",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform automotive services and repairs in compliance with company procedures and guidelines."
    },
    {
      "duty": "Conduct inspections on vehicles and communicate mechanical diagnoses to non-mechanical individuals."
    },
    {
      "duty": "Maintain cleanliness and orderliness of the service center and equipment, and review maintenance/operating efficiency of tools and store equipment."
    },
    {
      "duty": "Drive company vehicles to drop off and pick up automotive parts, and perform store deliveries."
    },
    {
      "duty": "Perform tire services, oil changes, alignments, brake services, and fluid services with physical demands."
    },
    {
      "duty": "Analyzes market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum 2 years of automotive repair experience, completion of Vocational-Technical School program in a related field, or demonstrated skills via third-party certificates/assessment."
    },
    {
      "credential": "A.S.E certification in at least one of A1-A8 is preferred. Will accept equivalent external qualifications or training certifications. (New Hires with external similar qualification/certification will have up to 2 years of employment to comply.)"
    }
  ]
}