{
  "meta": [
    {
      "job_title": "Promoter",
      "job_category": "Sales",
      "job_class": "Promoter",
      "sector": "Sales",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Engage business owners & other key decision makers through friendly, consistent and professional communications."
    },
    {
      "duty": "Qualify and evaluate potential showrooms for UMI displays and marketing efforts."
    },
    {
      "duty": "Regularly conduct product informational updates, educating our retail sales partners and fabricators about UMI “The Source” and our lines of products."
    },
    {
      "duty": "Maintain accurate information about the customer, address, email addresses of all members of theclients’ team and updating the information into our Inventory system."
    },
    {
      "duty": "Ensure all displays are in order, clean and with all samples in place, and make sure all of our marketing collateral are in place."
    },
    {
      "duty": "Handle heavy lifting, loading and unloading displays up to 50 pounds."
    },
    {
      "duty": "Driving most of the time and part of your time will be spend internally at your assigned branch, helping customers showing slabs, assembling displays, collecting samples and supporting internal staff under supervision of the local Branch manager or the executive team."
    },
    {
      "duty": "Be part of the internal staff as needed and part of the schedule rotating Saturday."
    },
    {
      "duty": "Expect to occasionally work extended hours on the weekend."
    }
  ],
  "skills": [
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Sales",
      "experience": 4
    },
    {
      "skill": "Organization",
      "experience": 4
    },
    {
      "skill": "Planning",
      "experience": 4
    },
    {
      "skill": "Teamwork",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Time Management",
      "experience": 4
    },
    {
      "skill": "Customer Evaluation",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Marketing, or a related field"
    }
  ]
}