{
  "meta": [
    {
      "job_title": "Location National Account Coordinator",
      "job_category": "Sales",
      "job_class": "Coordinator",
      "sector": "Sales",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for marketing, quoting, pricing, sales and service of national accounts, pro-oriented retailer, large DIY retail operations, industrial or a combination of these accounts. Provide wide range of communication, promotional, merchandising material (displays, samples, literature racks, catalogs) and manage customer relations between national store contact, customer, vendor, and Boise. Develop promotion opportunities, attend and participate in customer promotional events. Resolve customer issues, respond to complaints and receivable problems, and provide claims service. Provide training and demonstrations to customers, customer associates, and contractors. Maintain knowledge of competitor products. Explore special order opportunities. Perform systems pricing maintenance and EDI coordination. Monitor inventory and review SKU mix by store / customer to identify sales and service opportunities. Demonstrate strong commitment to safety, quality, environmental awareness, and continuous process improvement. Extensive overnight travel required. Perform other duties and responsibilities as assigned."
    },
    {
      "duty": "Basic Qualifications: College Degree or equivalent work experience in related job function. One (1) to five (5) years building products experience and broad knowledge of building product lines. Must have demonstrated effective interpersonal, organizational and communication skills. Working Conditions include an a normal office environment with minimal physical exertion; may be required to drive personal car to customer sites, including active construction sites. May be required to work in addition to normal business hours for cycle counts, promotions, and business travel. Must be able to safely drive to customer location and physically place product displays. During these times requires moderate physical exertion."
    },
    {
      "duty": "Preferred Qualifications: Typically more than seven (7) years experience in related job function; may require professional certification."
    }
  ],
  "skills": [
    {
      "skill": "Marketing",
      "experience": 3
    },
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Communication",
      "experience": 4
    },
    {
      "skill": "Promotions",
      "experience": 3
    },
    {
      "skill": "Negotiation",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Travel Management",
      "experience": 4
    }
  ],
  "education_certification": [
    {
      "credential": "College Degree or equivalent work experience in a related job function. Typically, a bachelor's degree in marketing or a related field."
    }
  ]
}