{
  "meta": [
    {
      "job_title": "Systems Engineering Process Lead",
      "job_category": "Engineering",
      "job_class": "Lead",
      "sector": "Software Engineering",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Systems Development Lifecycle",
      "experience": 5
    },
    {
      "skill": "Agile Systems Development",
      "experience": 5
    },
    {
      "skill": "Systems Engineering Processes",
      "experience": 5
    },
    {
      "skill": "Requirements Management",
      "experience": 5
    },
    {
      "skill": "Artifact Development",
      "experience": 5
    },
    {
      "skill": "Writing Systems Engineering Plans",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Navy C4I Systems",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the development of systems engineering processes for major C4I systems and evolve them with advanced technology solutions."
    },
    {
      "duty": "Translate real-world needs into technical specifications and design and develop systems engineering processes."
    },
    {
      "duty": "Broaden skillset into areas like tactical networks and cybersecurity to create effective systems engineering processes for Navy systems."
    },
    {
      "duty": "Write effective systems engineering plans and lead teams of engineers in the development of these plans."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Foster collaboration and guide the efforts of marketing specialists towards achieving set goals."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering, Computer Science, Mathematics, Cybersecurity, or Physical Science (Master's degree in Systems Engineering preferred)"
    }
  ]
}