{
  "meta": [
    {
      "job_title": "Director of Product, MyBSWHealth",
      "job_category": "Product Management",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 150000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Define and communicate the strategic vision and goals for MyBSWHealth, aligning them with broader organizational objectives."
    },
    {
      "duty": "Drive continuous improvement and innovation in the product's features and functionalities to enhance the user experience and meet evolving customer needs."
    },
    {
      "duty": "Lead, coach, and support a high-powered team of 8-10 product managers (direct and indirect reporting relationships)."
    },
    {
      "duty": "Foster a collaborative and high-performing culture, ensuring that each squad is motivated, empowered, and equipped to deliver exceptional results."
    },
    {
      "duty": "Oversee the activities of 5-6 cross-functional agile software development squads."
    },
    {
      "duty": "Collaborate closely with product, development, design, and QA teams to ensure efficient development cycles, timely delivery of features, and adherence to quality standards."
    },
    {
      "duty": "Develop and maintain a strategic product roadmap that reflects market trends, Voice of the Customer, and business priorities."
    },
    {
      "duty": "Be a thought leader and collaborate with technology, business, and clinical stakeholders to understand their requirements and incorporate their input into the product strategy."
    },
    {
      "duty": "Build strong relationships and effectively communicate the product vision and progress."
    },
    {
      "duty": "Ensure product execution excellence. Ensure product development lifecycle optimized so that teams produce quality work while meeting deadlines."
    }
  ],
  "skills": [
    {
      "skill": "Product Management",
      "experience": 8
    },
    {
      "skill": "Agile Methodologies",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Design Thinking",
      "experience": 8
    },
    {
      "skill": "Strategic Roadmapping",
      "experience": 8
    },
    {
      "skill": "Stakeholder Management",
      "experience": 8
    },
    {
      "skill": "Healthcare Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 10
    },
    {
      "skill": "Excellent Communication Skills",
      "experience": 10
    },
    {
      "skill": "Technology and Data Acumen",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Marketing, Business, or related industry required. Relevant Master's degree preferred."
    }
  ]
}