{
  "meta": [
    {
      "job_title": "Payroll Manager",
      "job_category": "Admin - Clerical",
      "job_class": "Manager",
      "sector": "Administration",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Payroll Administration",
      "experience": 5
    },
    {
      "skill": "Tax Reporting",
      "experience": 5
    },
    {
      "skill": "Benefit Administration",
      "experience": 5
    },
    {
      "skill": "Payroll Systems Maintenance",
      "experience": 5
    },
    {
      "skill": "HR Systems",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage payroll activities for multiple regions within a centralized payroll department, handling tax reporting, benefit administration, payroll processing, and payroll systems maintenance."
    },
    {
      "duty": "Ensure compliance with company policies and government regulations affecting payroll procedures."
    },
    {
      "duty": "Analyze and standardize payroll procedures to improve efficiency across the company."
    },
    {
      "duty": "Address payroll errors, handle complaints, and respond to inquiries for providing information."
    },
    {
      "duty": "Communicate with internal and external parties to ensure accurate processing of payroll deductions/garnishments."
    },
    {
      "duty": "Maintain payroll information, files, and records in written and electronic formats for compliance and audit trail purposes."
    },
    {
      "duty": "Reconcile account balances and prepare payroll-related documents for documentation and compliance requirements."
    },
    {
      "duty": "Monitor payroll activities to ensure effective department functioning and compliance with financial and administrative requirements."
    },
    {
      "duty": "Prepare and complete bi-weekly payrolls for all regions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree (Bachelor's preferred) and a minimum of 4 years of experience in payroll or closely related field."
    }
  ]
}