{
  "meta": [
    {
      "job_title": "Associate Customer Success Engineer",
      "job_category": "Customer Success",
      "job_class": "Engineer",
      "sector": "Sales",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Advocacy",
      "experience": 5
    },
    {
      "skill": "Customer Engagement",
      "experience": 5
    },
    {
      "skill": "Technical Position",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Data Engineering Platforms",
      "experience": 4
    },
    {
      "skill": "Cloud Providers",
      "experience": 4
    },
    {
      "skill": "Customer Success Platform",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Welcome new customers into the Cribl ecosystem, acting as a trusted advisor to ensure momentum is not lost between the pre- and post-sales process."
    },
    {
      "duty": "Engage with Sales and Solutions engineering to drive a seamless handoff with Customer Success to understand customer business goals and objectives."
    },
    {
      "duty": "Develop a deep understanding of the Cribl platform features and solutions to ensure customers are leveraging the platform's functionality to its fullest potential."
    },
    {
      "duty": "Engage with customers post sales leveraging the customer success platform to provide training documentation, presentations, and content that will help onboard new customers and provide continued value to all customers."
    },
    {
      "duty": "Proactively develop and project manage a customer’s integration strategy, plan, and timeline with our implementation services team."
    },
    {
      "duty": "Help develop training documentation, presentations, and content that will help onboard new customers and provide continued value to all customers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "3 - 5 years in a related function with direct customer advocacy and engagement experience in post-sales, support, pre-sales or consulting with a passion for customer success and empathy for customer outcomes and value. Experience in a technical position."
    }
  ]
}