{
  "meta": [
    {
      "job_title": "Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Customer Relations",
      "experience": 4
    },
    {
      "skill": "Cold Calling",
      "experience": 4
    },
    {
      "skill": "Product Demonstration",
      "experience": 4
    },
    {
      "skill": "Market Research",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Inventory Control",
      "experience": 4
    },
    {
      "skill": "Medical Device Industry Knowledge",
      "experience": 4
    },
    {
      "skill": "Market Positioning",
      "experience": 4
    },
    {
      "skill": "Relationship Building",
      "experience": 4
    },
    {
      "skill": "Emergency Response",
      "experience": 4
    },
    {
      "skill": "Compliance",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Achieve predetermined sales goals and quotas within assigned territory."
    },
    {
      "duty": "Establish, build, and maintain customer relations through constant communication and outstanding customer service."
    },
    {
      "duty": "Grow the business through the expansion of the customer base."
    },
    {
      "duty": "Prospect and generate new business, including cold-calling in the field."
    },
    {
      "duty": "Support existing clients and conduct product demonstrations."
    },
    {
      "duty": "Maintain expert knowledge of medical device products within the sales territory."
    },
    {
      "duty": "Research potential markets and customers, looking for existing and new market opportunities."
    },
    {
      "duty": "Provide training and customer education in support of new product launches."
    },
    {
      "duty": "Implement new sales plans and effective marketing strategies to meet/exceed territory objectives."
    },
    {
      "duty": "Adhere to all policies and SOPs regarding sales activities and training."
    },
    {
      "duty": "Work with a high degree of intensity and commitment to sell products that meet customer needs."
    },
    {
      "duty": "Organize and sort possible solutions quickly during operating room consultations."
    },
    {
      "duty": "Meticulously manage and maintain inventory of products, and assist customers whenever needed."
    },
    {
      "duty": "Build credibility with surgeons by providing advice and training on products and tools used for positive patient outcomes."
    },
    {
      "duty": "Participate in and attend sales meetings and professional association meetings outside regular business hours."
    },
    {
      "duty": "Adhere to compliance and the principles of responsibility by maintaining privacy and confidentiality of information, protecting company assets, and acting with ethics and integrity."
    },
    {
      "duty": "Adhere to applicable federal, state, and local laws and regulations, accreditation and licenser requirements, and Company’s policies and procedures."
    },
    {
      "duty": "Not counting hours but rather lives impacted, and driven by the extreme demands of med device sales."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree or 4+ years’ experience in a clinical healthcare or sales role (or a combination of the two)."
    }
  ]
}