{
  "meta": [
    {
      "job_title": "Infection Preventionist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Epidemiology",
      "experience": 4
    },
    {
      "skill": "Infection Control",
      "experience": 4
    },
    {
      "skill": "Microbiology",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Healthcare Epidemiology",
      "experience": 4
    },
    {
      "skill": "Strategic Thinking",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Policy Development",
      "experience": 4
    },
    {
      "skill": "Clinical Experience",
      "experience": 4
    },
    {
      "skill": "Medical Technology",
      "experience": 4
    },
    {
      "skill": "Clinical Laboratory Science",
      "experience": 4
    },
    {
      "skill": "Infection Prevention Program Management",
      "experience": 4
    },
    {
      "skill": "Mentoring",
      "experience": 4
    },
    {
      "skill": "Consultation",
      "experience": 4
    },
    {
      "skill": "Research and Publication",
      "experience": 4
    },
    {
      "skill": "Leadership",
      "experience": 4
    },
    {
      "skill": "Emergency Response",
      "experience": 4
    },
    {
      "skill": "Malpractice Insurance Compliance",
      "experience": 4
    },
    {
      "skill": "COVID Compliance",
      "experience": 4
    },
    {
      "skill": "English Proficiency",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct ongoing infection control surveillance, prevention, and control program activities within the facility."
    },
    {
      "duty": "Lead or support multiple projects and work on a broad portfolio of System-wide infection prevention projects."
    },
    {
      "duty": "Serve as a strategic thought partner to guide, direct, and implement appropriate infection prevention and control measures."
    },
    {
      "duty": "Provide consultative services and act as subject matter expert on various committees."
    },
    {
      "duty": "Design and implement educational programs and initiatives for infection prevention and control."
    },
    {
      "duty": "Collaborate with Information Technology and data analysts to ensure validity of data."
    },
    {
      "duty": "Provide oversight of the Infection Prevention Department and Program in the absence of the Director."
    },
    {
      "duty": "Conduct the annual Infection Prevention Program Risk Assessment and preparing the annual Infection Prevention Program Plan."
    },
    {
      "duty": "Contribute to knowledge of leading practice through research, publication, and presentation at conferences."
    },
    {
      "duty": "Consult on the development of policy, procedures, protocols, and standard work."
    },
    {
      "duty": "Support patients, families, administration, committees, healthcare providers, and ancillary staff in infection prevention, control, and epidemiology issues."
    },
    {
      "duty": "Maintain malpractice insurance and comply with COVID guidelines."
    },
    {
      "duty": "Respond to urgent infection prevention questions after hours or on weekends."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree from an accredited college or university in Epidemiology, Microbiology, Clinical Laboratory Science, Medical Technology, Nursing, or a related discipline and four (4) years of satisfactory clinical experience or experience working in infection prevention and control, health care epidemiology or a related field in a hospital or a health care setting; or Baccalaureate degree from an accredited college or university in disciplines, as listed above; and five (5) years of satisfactory experience, as described above."
    },
    {
      "credential": "Infection Control Professional Certification (CIC)"
    }
  ]
}