{
  "meta": [
    {
      "job_title": "Consulting Senior Associate, Air Quality",
      "job_category": "Consulting",
      "job_class": "Associate",
      "sector": "Environmental Management",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Air Quality Analysis",
      "experience": 3
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 3
    },
    {
      "skill": "Air Quality Permitting",
      "experience": 3
    },
    {
      "skill": "Emission Inventory Reporting",
      "experience": 3
    },
    {
      "skill": "Climate Change Projects",
      "experience": 3
    },
    {
      "skill": "Environmental Compliance Audits",
      "experience": 3
    },
    {
      "skill": "Client Relationship Management",
      "experience": 3
    },
    {
      "skill": "Technical Writing",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct air quality analyses, assess regulatory compliance, and perform regulatory applicability evaluations."
    },
    {
      "duty": "Develop complete and accurate air quality permits applications for construction, Synthetic Minor, Title V, PSD, and New Source Reviews."
    },
    {
      "duty": "Interact with state and local program regulators to steward permit application review and issuance."
    },
    {
      "duty": "Prepare emission inventory reports; quantify air pollutant emissions, upload/enter inventory data to state on-line systems and impacts."
    },
    {
      "duty": "Evaluate air pollution control technologies, including technical and economic feasibility of air pollution control equipment."
    },
    {
      "duty": "Implement climate change projects, such as greenhouse gas inventories, emission reductions, energy efficiency, public disclosure and verification."
    },
    {
      "duty": "Assist clients with MACT compliance programs."
    },
    {
      "duty": "Implement environmental compliance management systems and processes."
    },
    {
      "duty": "Prepare recommendations and reporting of results."
    },
    {
      "duty": "Perform environmental compliance audits and implement follow-up corrective actions to ensure compliance with federal, state, and local regulations."
    },
    {
      "duty": "Perform multiple tasks within scope/budget/schedule expectations and ensure quality standards on project deliverables."
    },
    {
      "duty": "Interact and maintain successful relationships with clients, ERM employees, and subcontractors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS in chemical, environmental, or mechanical engineering, science or related degree. E.I.T. preferred with ability to obtain P.E. within 5 years"
    }
  ]
}