{
  "meta": [
    {
      "job_title": "Transportation Manager",
      "job_category": "Logistics",
      "job_class": "Manager",
      "sector": "Supply Chain",
      "salary": 92500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Operations Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "International Collaboration",
      "experience": 5
    },
    {
      "skill": "Analytical Thinking",
      "experience": 5
    },
    {
      "skill": "Decision Making",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Manufacturing & Production",
      "experience": 5
    },
    {
      "skill": "MS Office Proficiency",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee day-to-day operations, customer service, staff performance, planning, scheduling, health and safety, and regulatory compliance within assigned function."
    },
    {
      "duty": "Lead and develop exempt and non-exempt employees, and ensure attainment of daily operational goals."
    },
    {
      "duty": "Work within international functional teams, analyze complex problems, and demonstrate professional skills in job-related areas."
    },
    {
      "duty": "Make decisions in a timely manner, maintain professional relationships within all levels of the organization, and operate independently as well as part of a team."
    },
    {
      "duty": "Support off shifts in case of critical customer network disruption or crisis, and ensure compliance with local and federal regulations."
    },
    {
      "duty": "Create and maintain professional relationships, multitask, stay organized, and exhibit attention to detail and excellent follow-up practices."
    },
    {
      "duty": "Utilize MS Office tools, apply advanced logistics knowledge, adhere to local and federal regulations, and possess fundamental knowledge of supply chain management and strong manufacturing and production understanding."
    },
    {
      "duty": "Plan, schedule, staff, and execute day-to-day activities, both as a leader and as a team member."
    },
    {
      "duty": "Exhibit flexibility, self-driven attitude, and capability to handle a fast-paced environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Logistics, Supply Chain (Master's preferred)"
    }
  ]
}