{
  "meta": [
    {
      "job_title": "Housekeeper",
      "job_category": "Housekeeping",
      "job_class": "Housekeeper",
      "sector": "Hospitality",
      "salary": 26000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Housekeeping",
      "experience": 2
    },
    {
      "skill": "Sanitization Procedures",
      "experience": 2
    },
    {
      "skill": "Guest Relations",
      "experience": 2
    },
    {
      "skill": "Cleaning Supplies Management",
      "experience": 2
    },
    {
      "skill": "Attention to Detail",
      "experience": 2
    },
    {
      "skill": "Time Management",
      "experience": 2
    },
    {
      "skill": "Physical Stamina",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain clean and attractive guest rooms, hallways, and public areas, following hotel procedures and standards."
    },
    {
      "duty": "Service guest rooms daily, stocking cart with room supplies, replacing bed linens, and replenishing guest room supplies."
    },
    {
      "duty": "Conduct 'deep cleaning' activities within guest rooms in conjunction with preventative maintenance tasks."
    },
    {
      "duty": "Approach all encounters with guests and employees in a friendly service-oriented manner."
    },
    {
      "duty": "Maintain regular attendance and high standards of personal appearance and grooming as per hotel standards."
    },
    {
      "duty": "Comply with hotel standards and regulations to encourage safe and efficient hotel operations."
    },
    {
      "duty": "Thoroughly clean and restock the required number of guest rooms per shift."
    },
    {
      "duty": "Remove all trash and dirty linen from guest rooms."
    },
    {
      "duty": "Perform other tasks as assigned by the supervisor or manager."
    },
    {
      "duty": "May be required to disassemble furniture or items in the guest room to conduct deep cleaning tasks."
    },
    {
      "duty": "Deep cleaning tasks may include changing the AC filter, cleaning the AC coils, touching up paint on walls/molding, touching up scratched furniture, or rehanging closed slide doors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 40,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent, with experience in hotel or related field preferred"
    }
  ]
}