{
  "meta": [
    {
      "job_title": "Food and Beverage Supervisor",
      "job_category": "Food and Beverage",
      "job_class": "Supervisor",
      "sector": "Hospitality",
      "salary": 37500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Food and Beverage Management",
      "experience": 2
    },
    {
      "skill": "Guest Service",
      "experience": 2
    },
    {
      "skill": "Team Motivation",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Budget Management",
      "experience": 2
    },
    {
      "skill": "Sales Management",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the smooth daily operation of F&B outlets and ensure effective utilization of cost management systems."
    },
    {
      "duty": "Develop, implement, and measure quality standards across all food outlets to enhance the customer experience and maximize revenue."
    },
    {
      "duty": "Manage and motivate the team to maximize revenue opportunities through up-selling and drive a focus on exceptional guest experience for all food outlets."
    },
    {
      "duty": "Ensure that health and safety, and food hygiene standards are upheld and adhered to at all times, and actively drive sales to achieve targeted KPIs."
    },
    {
      "duty": "Actively drive sales to achieve KPIs and ensure the outlet meets excellence standards, preparations for the running of the outlet are completed and that the team know their areas of responsibility and daily tasks."
    },
    {
      "duty": "Deliver guest satisfaction targets through exceptional standards, food hygiene, maximum product availability and ensure the team genuinely exceed customer expectations. Focus on our people and culture agenda when recruiting and developing effective teams."
    },
    {
      "duty": "Maintain positive relationships with other areas of the business and follow all health and safety regulations, and comply fully with all food hygiene standards and legislation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "2 years of food and beverage experience, guest service experience, and experience in a visitor attraction, theme park, museum, leisure, hotel or theater environment. Excellent communication and motivational skills are required."
    }
  ]
}