{
  "meta": [
    {
      "job_title": "Front End Supervisor",
      "job_category": "Retail",
      "job_class": "Supervisor",
      "sector": "Sales",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Cash Handling",
      "experience": 3
    },
    {
      "skill": "Training and Development",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Organization Skills",
      "experience": 3
    },
    {
      "skill": "Computer Literacy",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise and ensure that every guest receives the fastest and most pleasant checkout experience possible through consistent execution of company's Guest Service Standards and Policies."
    },
    {
      "duty": "Maintain front end standards detailed in the No Noticeable Wait Policy at all times."
    },
    {
      "duty": "Manage guest traffic flow from both the guest side and bagging side of the register, using this positioning as an opportunity to interact with guests and monitor productivity."
    },
    {
      "duty": "Train cashiers to call additional hosts to the front end as dictated by guest needs and established daily call-up list."
    },
    {
      "duty": "Handle guest and host requests, refunds, overrides, and check approvals promptly and professionally."
    },
    {
      "duty": "Ensure front end is clean, neat, and clutter free at all times and that the parking lot is free of debris and excessive carts."
    },
    {
      "duty": "Provide training and direction to hosts not meeting the front end standards."
    },
    {
      "duty": "Communicate problem areas and hosts not meeting performance standards to management."
    },
    {
      "duty": "Process guest orders, perform as a cashier or guest service clerk, and perform all other duties as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent (Associate's degree preferred)"
    }
  ]
}