{
  "meta": [
    {
      "job_title": "Room Service Assistant",
      "job_category": "Clerical",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Basic Computer Skills",
      "experience": 1
    },
    {
      "skill": "Problem Solving",
      "experience": 1
    },
    {
      "skill": "Written Communication",
      "experience": 1
    },
    {
      "skill": "Oral Communication",
      "experience": 1
    },
    {
      "skill": "Teamwork",
      "experience": 1
    },
    {
      "skill": "Independence of Action",
      "experience": 1
    },
    {
      "skill": "Decision Making",
      "experience": 1
    },
    {
      "skill": "Physical Job Nature",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver patients' meals directly to the patients or other Room Service Associates on the nursing units."
    },
    {
      "duty": "Prepare patients' bedside table for meal delivery."
    },
    {
      "duty": "Measure/record patients' intake information as required by physicians' orders or nursing standards of care."
    },
    {
      "duty": "Respond to questions from patients and/or family members regarding meals and/or menu selection process."
    },
    {
      "duty": "Utilize the At Your Request Room Service Dining computerized scanner to track meals' status."
    },
    {
      "duty": "Retrieve soiled trays from patient rooms and nursing units and return them to the dish room."
    },
    {
      "duty": "Inspect trays for patients' belongings, medical devices, or medications. Assist patients in their rooms with completion of their menus if needed."
    },
    {
      "duty": "Visit patients as necessary when a change has been made in a patient's meal selection. Allow patient input into revision of the menu as appropriate."
    },
    {
      "duty": "Prepare floor stock sheets according to established par levels. Gather, deliver, and put away floor supplies in the nursing units kitchen. Rotate stock and discard outdated perishables."
    },
    {
      "duty": "Mix tube/special feedings according to item specific directions. Portion and label tube/special feedings/supplements accurately. Maintain the clean and sanitary condition of the formulary room and equipment. Inventory supplements and formulary supplies in the store room, prepare order list as necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 20,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Some High School required."
    }
  ]
}