{
  "meta": [
    {
      "job_title": "Furniture Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Primarily responsible for leading the furniture team and for driving furniture sales."
    },
    {
      "duty": "Accountable for the furniture department’s overall performance, including furniture merchandising, presentation, and recovery standards, as well as for furniture sales metrics."
    },
    {
      "duty": "Works collaboratively with store leadership to accomplish furniture sales and operational goals and tasks to help drive overall store performance."
    },
    {
      "duty": "Leads and provides direction to store associates performing all cashiering, customer service, recovery, and furniture-related activities on the sales floor."
    },
    {
      "duty": "Responsible for the leadership and operational performance of the furniture department, including furniture sales and related processes, furniture salesperson training, customer service, and merchandising and presentation standards."
    },
    {
      "duty": "Provides clear work direction and coaching to furniture sales team members regarding all aspects of the sales process, including merchandising, new product information, competing product comparisons, cashiering, lease to purchase, price holds, and display assembly."
    },
    {
      "duty": "Provides feedback to store leadership regarding the team’s performance."
    },
    {
      "duty": "Assists customers with product information, selection, and purchase and ensures third party delivery program is marketed to customers and understood by associates."
    },
    {
      "duty": "Manages the price hold process, including weekly audits."
    },
    {
      "duty": "Maintains furniture department inventory, including cycle counts, in an effort to maximize sales and inventory turn."
    },
    {
      "duty": "Identifies furniture display needs in sufficient time to allow displays to be built and merchandising standards to be achieved."
    },
    {
      "duty": "Develops plans for furniture department coverage during special events."
    },
    {
      "duty": "Strives to continually improve the furniture department’s sales and ensures merchandising and presentation standards, signage, recovery, and cleanliness are maintained."
    },
    {
      "duty": "Serves in the Manager on Duty role as needed including opening and closing the store."
    },
    {
      "duty": "Drives the customer experience and ensures resolution of customer issues."
    },
    {
      "duty": "Assists with recovery of the entire store as needed."
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Sales Management",
      "experience": 3
    },
    {
      "skill": "Merchandising",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Store Operations",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, GED, or equivalent work experience required."
    }
  ]
}