{
  "meta": [
    {
      "job_title": "Per Diem Patient Encounter Associate",
      "job_category": "Healthcare",
      "job_class": "Associate",
      "sector": "Healthcare",
      "salary": 50,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Reception",
      "experience": 1
    },
    {
      "skill": "Scheduling",
      "experience": 1
    },
    {
      "skill": "Pre-clearance",
      "experience": 1
    },
    {
      "skill": "Insurance Eligibility Determination",
      "experience": 1
    },
    {
      "skill": "Medical Office Experience",
      "experience": 1
    },
    {
      "skill": "Computer System Utilization",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform patient reception, scheduling, and financial pre-clearance functions to ensure patient satisfaction and maximum reimbursement."
    },
    {
      "duty": "Update patient insurance and demographic information and enter it into the practice management system."
    },
    {
      "duty": "Answer phones, schedule appointments, and contact patients to confirm scheduled and canceled appointments."
    },
    {
      "duty": "Check in patients, verify demographics, and complete financial screening."
    },
    {
      "duty": "Collect co-pays and enter payments from patients."
    },
    {
      "duty": "Facilitate prior authorization for diagnostic testing and review waiting room status."
    },
    {
      "duty": "Ensure prior approval and other required procedures are met prior to the delivery of care."
    },
    {
      "duty": "Reconcile daily patient schedule and review encounters that may require correction."
    },
    {
      "duty": "Scan documents into the practice management system on a daily basis."
    },
    {
      "duty": "Participate in system development and process improvement by providing feedback to management."
    },
    {
      "duty": "Follow all HIPAA and other federal/state agency requirements regarding proper handling of PHI documents."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "HS/GED; Associates degree preferred. Minimum of one week training on-site provided by practice. Preferred: experience in a medical office setting, utilizing a computer system for physician scheduling"
    }
  ]
}