{
  "meta": [
    {
      "job_title": "Managing Consultant",
      "job_category": "Strategy & Transformation Consulting",
      "job_class": "Consulting",
      "sector": "Management",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Healthcare Strategy",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Consulting Experience",
      "experience": 5
    },
    {
      "skill": "Health Industry Trends",
      "experience": 5
    },
    {
      "skill": "Healthcare Analytics",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as a trusted advisor to healthcare executives, supporting them in developing strategy and addressing operational challenges."
    },
    {
      "duty": "Manage significant client engagements and day-to-day relationships."
    },
    {
      "duty": "Oversee, mentor, and develop senior consultants and consultants."
    },
    {
      "duty": "Assist with data acquisition, integration, and analysis to support a wide range of healthcare analytics, including financial analysis, clinical, and operational benchmarking."
    },
    {
      "duty": "Regularly present results and updates to clients, effectively communicating strategies and tactics through verbal and written forms."
    },
    {
      "duty": "Proactively initiate and develop industry and market-based analysis of healthcare trends, competitor threats, expansion opportunities, and internal performance trends."
    },
    {
      "duty": "Lead teams in data-driven design of long-term healthcare market strategy, providing value and innovative solutions for clinical service line and capital strategies."
    },
    {
      "duty": "Direct a team to identify and mitigate project risks around scope, schedule, and quality, effectively escalating to engagement leadership."
    },
    {
      "duty": "Develop strategies to solve complex clinical, technical, and operational strategies for healthcare clients."
    },
    {
      "duty": "Actively support business development activities to help identify, research, and pursue opportunities for new/existing clients."
    },
    {
      "duty": "Assess health industry trends to inform clients on leading practices and drive continued transformation efforts."
    },
    {
      "duty": "Develop transformation strategies to inform clients’ long-range strategic planning efforts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree"
    }
  ]
}