{
  "meta": [
    {
      "job_title": "IT Asset Analyst",
      "job_category": "Information Technology",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "IT Asset Management",
      "experience": 2
    },
    {
      "skill": "Hardware Configuration",
      "experience": 2
    },
    {
      "skill": "Data Management",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Vendor Management",
      "experience": 2
    },
    {
      "skill": "Troubleshooting",
      "experience": 2
    },
    {
      "skill": "Project Coordination",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the full life cycle of hardware asset management from planning to retirement."
    },
    {
      "duty": "Provision, prepare, clean, configure, or image hardware for new issue, break/fix, and refresh."
    },
    {
      "duty": "Ship, receive, track, and manage retirement of assets."
    },
    {
      "duty": "Ensure content accuracy and effective management of the hardware asset database."
    },
    {
      "duty": "Provide stock projections, maintain inventory counts, and request purchase of hardware and computer peripheral needs."
    },
    {
      "duty": "Coordinate and track the full life cycle of warranty repairs for hardware."
    },
    {
      "duty": "Maintain spare parts inventory and perform repairs as needed."
    },
    {
      "duty": "Submit workflows for assets ready for refresh."
    },
    {
      "duty": "Coordinate with internal stakeholders to report on asset dispositions and inventory."
    },
    {
      "duty": "Participate in testing new hardware and software as needed."
    },
    {
      "duty": "Assist with hardware and software releases and roll-outs."
    },
    {
      "duty": "Recommend new and updated hardware and software options."
    },
    {
      "duty": "Evaluate continuous improvement with IT asset management process and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "1-2 years working in an Information Technology field or relevant studies, internship or training. Experience working with desk phone and mobile device hardware preferred."
    }
  ]
}