{
  "meta": [
    {
      "job_title": "Benefits Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Employee Benefits",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "HR Strategy Alignment",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "MS Excel",
      "experience": 5
    },
    {
      "skill": "MS PowerPoint",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as subject matter expert in health & welfare benefits, life and disability, retirement plans, wellness and leave of absence policies and programs."
    },
    {
      "duty": "Support the design, implementation, ongoing evaluation, and administration of benefit programs, policies and strategies to ensure competitiveness and compliance with local, state and federal requirements."
    },
    {
      "duty": "Develop and present ideas to improve effectiveness, build efficiencies, and proactively enhance the delivery of benefit programs."
    },
    {
      "duty": "Partner with HRIS, Payroll, and HRBPs, and other cross-functional teams to implement and execute the operational aspects of benefits."
    },
    {
      "duty": "Ownership of annual Open Enrollment cycle, including employee communication and training, system testing, and reporting."
    },
    {
      "duty": "Act as a project manager on benefit initiatives such as annual benefit renewals and wellness challenges."
    },
    {
      "duty": "Responsible for preparation of all required benefit plan audits, testing and timely filings (ACA, 5500s, non-discrimination, annual disclosures, etc.)."
    },
    {
      "duty": "Lead, manage and train small team of professionals, including providing coaching and training, setting goals, evaluating performance, planning staff assignments and development."
    },
    {
      "duty": "Prepare special reports by gathering, analyzing, summarizing, and presenting information on benefit trends."
    },
    {
      "duty": "Maintain working knowledge of legal and regulatory compliance and labor contracts that may affect benefit policies."
    },
    {
      "duty": "Support merger and acquisitions activities and implementation."
    },
    {
      "duty": "Efficient vendor management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business Administration, Finance, or related fields of study. Certified Employee Benefits Specialist (CEBS) designation preferred."
    }
  ]
}