{
  "meta": [
    {
      "job_title": "Strategy Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 160000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Business Strategy",
      "experience": 6
    },
    {
      "skill": "Data Analysis",
      "experience": 6
    },
    {
      "skill": "Executive Stakeholder Collaboration",
      "experience": 6
    },
    {
      "skill": "MBA",
      "experience": 3
    },
    {
      "skill": "Cross-Functional Stakeholder Collaboration",
      "experience": 3
    },
    {
      "skill": "Growth Strategy",
      "experience": 3
    },
    {
      "skill": "Business Software/SaaS Strategy",
      "experience": 2
    },
    {
      "skill": "Operational Initiatives",
      "experience": 2
    },
    {
      "skill": "Business Analysis",
      "experience": 2
    },
    {
      "skill": "Productivity and Collaboration Dynamics",
      "experience": 2
    },
    {
      "skill": "Market Analysis",
      "experience": 2
    },
    {
      "skill": "Mergers and Acquisitions Analysis",
      "experience": 2
    },
    {
      "skill": "Partnership Opportunities Analysis",
      "experience": 2
    },
    {
      "skill": "Product Differentiation",
      "experience": 2
    },
    {
      "skill": "Go-To-Market Strategy",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and support strategic initiatives across Workspace, develop recommendations to the leadership team by analyzing strategic questions, develop and analyze data, identify priorities, and align with cross-functional partners across Engineering, Product, Merger and Acquisitions, Partnerships, Customer Experience, Marketing, and Sales teams."
    },
    {
      "duty": "Deliver on multiple strategy projects including research and analysis, draft strategy documents and presentation materials, stakeholder management, communicate findings or recommendations to leadership, and land the project team's work."
    },
    {
      "duty": "Develop an understanding and strategic narrative across all components of the Workspace business and in particular areas (e.g., GTM execution, pricing, product launches, Merger and Acquisitions, etc.)."
    },
    {
      "duty": "Synthesize and communicate decisions between executive management and the broader organization to ensure strategy and priority alignment."
    },
    {
      "duty": "Onboard and coach junior teammates and guide their professional development on projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent practical experience.6 years of experience in consulting, investment banking, corporate strategy, enterprise software, or similar organizations.2 years of experience collaborating with executive stakeholders."
    },
    {
      "credential": "MBA or Master’s degree.3 years of experience working in a business environment with cross-functional stakeholders, directly collaborating and building trust with executive management, and growth strategy.2 years of strategy experience in business Software/SaaS domain.Experience executing strategic and operational initiatives in an ambiguous environment.Experience performing detailed business analysis of potential strategic recommendations (e.g., valuation and Merger and Acquisitions analysis, partnership opportunities, or operational optimization).Understanding of productivity and collaboration category dynamics, competitive landscape, product differentiation, or GTM."
    }
  ]
}