{
  "meta": [
    {
      "job_title": "Training & Development Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "HR",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Learning Management System (LMS) Management",
      "experience": 5
    },
    {
      "skill": "Job Analysis",
      "experience": 5
    },
    {
      "skill": "ISO Audit Compliance",
      "experience": 5
    },
    {
      "skill": "HR Functions",
      "experience": 5
    },
    {
      "skill": "Organizational Behavior",
      "experience": 5
    },
    {
      "skill": "Conflict Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, implement, and evaluate comprehensive learning and development programs for both hourly and salaried employees."
    },
    {
      "duty": "Analyze and identify the training and development needs of employees in all areas of the business (including both hourly and salaried)."
    },
    {
      "duty": "Conduct job analysis and benchmarking to ensure accurate job descriptions and classifications for the hourly workforce."
    },
    {
      "duty": "Develop relationships with external workforce development partners (technical schools, community colleges, etc.) and develop apprenticeship opportunities."
    },
    {
      "duty": "Streamline, communicate and oversee the full onboarding process for new team members, including the revamp and enhancement of existing processes."
    },
    {
      "duty": "Lead ISO audit findings, by coordinating efforts to organize training records and ensuring compliance with ISO standards."
    },
    {
      "duty": "Support the development of front-line leaders (leads, supervisors and management team)."
    },
    {
      "duty": "Assist in core HR functions as needed, supporting the broader HR team in various projects and initiatives."
    },
    {
      "duty": "Stay current with industry trends and best practices in training and development, applying innovative approaches to enhance the employee learning experience."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree is highly preferred with a concentration in Business, Organizational Development, Human Resources, or related fields (Master's preferred)"
    }
  ]
}