{
  "meta": [
    {
      "job_title": "Senior Clinical Research Coordinator",
      "job_category": "Clinical Research",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Research Protocol Management",
      "experience": 5
    },
    {
      "skill": "Patient Enrollment",
      "experience": 5
    },
    {
      "skill": "Data Management",
      "experience": 5
    },
    {
      "skill": "IRB Compliance",
      "experience": 5
    },
    {
      "skill": "Medical Terminology",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and coordinate the implementation of clinical research protocols related to COVID-19, asthma, and COPD in the Breathe Chicago Center."
    },
    {
      "duty": "Coordinate the activation and maintenance of clinical protocols, including review and completion of submissions, amendments, and adverse event reports as required by the UIC Institutional Review Board (IRB) and regulatory agencies."
    },
    {
      "duty": "Develop and implement effective patient recruitment strategies and oversee and participate in subject recruitment, screening, scheduling, testing, and data management for research projects."
    },
    {
      "duty": "Assist in identification, recruitment, and enrollment strategies of patients to meet clinical research protocols."
    },
    {
      "duty": "Execute informed consent process and monitor patient status; Enroll participants into programs, explaining the research protocols to the clients and obtaining appropriate consent forms."
    },
    {
      "duty": "Analyze retention rates and formulate plans to retain participants; Participate in conducting surveys of participants and maintain up-to-date knowledge of research protocols and principles."
    },
    {
      "duty": "Assist investigators in preparing study data, literature reviews, analysis for meeting presentations, and publications."
    },
    {
      "duty": "Act as a liaison between physicians, clinical staff, grant sponsors, and regulatory agencies to ensure priorities are clearly communicated and resources are allocated appropriately across multiple ongoing projects."
    },
    {
      "duty": "Notify and inform stakeholders of adverse events and protocol modifications, including their impact on the clinical research program."
    },
    {
      "duty": "Collect and review client evaluations/assessments, surveys, and participant interviews to develop reports for the PI and appropriate agencies and grant sponsors."
    },
    {
      "duty": "Communicate clinical information and work with stakeholders to create best practice tools."
    },
    {
      "duty": "Evaluate data to determine project effectiveness."
    },
    {
      "duty": "Maintain up-to-date knowledge of research protocols, principles, and procedures, and aspects of clinical research studies."
    },
    {
      "duty": "Assist in establishing and coordinating the implementation of clinical research protocol priorities and organizational structure."
    },
    {
      "duty": "Review laboratory and clinical procedures and evaluations regularly to ensure protocol compliance."
    },
    {
      "duty": "Collect, process, and store biological samples, take vitals and measurements."
    },
    {
      "duty": "Assist investigators in preparing study data, literature reviews, analysis for meeting presentations, and publications."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in nursing, mental health, psychology, pharmaceutical sciences, social science, or a related field required. Certified Clinical Research Coordinator (CCRC) preferred."
    }
  ]
}