{
  "meta": [
    {
      "job_title": "Engineering Technician II/III",
      "job_category": "Engineering",
      "job_class": "Technician",
      "sector": "Engineering",
      "salary": 25000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Engineering",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Creating, processing, logging, e-plan stamping, scanning, filing maintenance and quality control review of documents related to the Engineering Division."
    },
    {
      "duty": "Providing technical support and coordinates with staff engineers, inspectors, consulting engineers, and developers for document acquisition for water, wastewater, reclaimed water, and solid waste construction projects."
    },
    {
      "duty": "Scanning documents into the eDocs document management system."
    },
    {
      "duty": "Providing customer assistance with Utilities File Room inquiries and logging and filing Utilities projects."
    },
    {
      "duty": "Managing document coordination, processing, and maintenance of utility projects using the Plan File application."
    },
    {
      "duty": "Coordinating file room activities with agencies, local cities, private utilities, consultants, and various departments/divisions of Orange County."
    },
    {
      "duty": "Maintaining the section’s KPI spreadsheet and coordinating with the County’s Records Management group for the storage, retrieval, tracking, and disposal of project documents."
    },
    {
      "duty": "Acting as the primary Engineering Division contact for the 311 tracking system, tracking and preparing orders for File Room and printer supplies, and processing FEMA paperwork."
    },
    {
      "duty": "Coordinating maintenance with IT for color printers, large format plotters and printers, and data entry into GIS involving utility project information."
    },
    {
      "duty": "Editing utility infrastructure with new project information and maintaining data layers through regular updates from staff field notes, redlines, clearance letters, certificate of completion, and video inspection data."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 10,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Graduation from high school or equivalent, and one year of appropriate engineering experience. Thirty semester hours of college training may be substituted for the required experience, provided such training included twelve semester hours of engineering related course work."
    },
    {
      "credential": "Graduation from high school or equivalent, and three years of appropriate engineering experience, two years of which must be in general Civil Engineering technology. Thirty semester hours of college training may be substituted for each year of the required experience, provided such training included twelve semester hours of engineering related course work."
    }
  ]
}