{
  "meta": [
    {
      "job_title": "Retail Employee / Project Specialist",
      "job_category": "Retail",
      "job_class": "Employee",
      "sector": "Retail",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Welcomes and greets all customers either as Host in the front entrance or throughout the store"
    },
    {
      "duty": "Connects with our customers throughout the store suggesting solutions to their organizational challenges"
    },
    {
      "duty": "Designs and sells custom closets and other storage and organization solutions"
    },
    {
      "duty": "Serves as a register person with strong focus on providing a great customer experience during check out"
    },
    {
      "duty": "Introduces and enrolls customers in our rewards program"
    },
    {
      "duty": "Works merchandise processing during early morning or evenings (based on the schedule)"
    },
    {
      "duty": "Maintains the Sales Floor \nKeeping shelves full and presented according to our brand standards."
    },
    {
      "duty": "Supports carryout to our customers cars whether through curbside or in the parking lot/garages."
    },
    {
      "duty": "Assists with cleaning routines around the store \nIncluding dusting, restrooms and vacuuming"
    },
    {
      "duty": "Processes customers' orders for curbside pick-up and/or delivery"
    },
    {
      "duty": "Organizes the stockroom, ensuring it is well-maintained to support selling efforts of the store"
    },
    {
      "duty": "Adheres to the time expectations established for the role, performing tasks with accuracy and timeliness, while exhibiting pace and attention to detail"
    },
    {
      "duty": "Actively engages with customers to solve their organizational challenges"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 120,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma preferred"
    }
  ]
}