{
  "meta": [
    {
      "job_title": "Account Administrator",
      "job_category": "Customer Service",
      "job_class": "Administrator",
      "sector": "Account Management & Service",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clerical Support",
      "experience": 4
    },
    {
      "skill": "Technical Support",
      "experience": 4
    },
    {
      "skill": "Insurance Knowledge",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Mathematical Skills",
      "experience": 4
    },
    {
      "skill": "Life, Accident and Health Insurance License",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Respond promptly and professionally to the service needs of insureds."
    },
    {
      "duty": "Provide clerical and technical support to Producers to benefit clients and to reach agency's strategic business goals."
    },
    {
      "duty": "Assist producer in adding coverages to existing accounts."
    },
    {
      "duty": "Produce quote requests, spreadsheets and other related items while verifying their accuracy."
    },
    {
      "duty": "Maintain controls on renewals to ensure timely preparation and processing."
    },
    {
      "duty": "Prepare summaries of insurance and proposals as needed for account review."
    },
    {
      "duty": "Remarket renewals, contact clients, create renewal proposals and handle other renewal activities in coordination with the producer."
    },
    {
      "duty": "Refer current and prospective clients to other departments for solicitation of those lines of business."
    },
    {
      "duty": "Adhere to all Agency systems, procedures and state regulations."
    },
    {
      "duty": "Communicate effectively orally and in writing."
    },
    {
      "duty": "Maintain required client filing."
    },
    {
      "duty": "Oversee functions performed by Assistant CSSs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 130,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma, four years in insurance company or agency with at least three of those years in employee benefits. Experience working with computers in Windows environment. Strong MS Office skills, e.g. MS Word and MS Excel. Good written and oral communication skills. Above average mathematical skills. Life, Accident and Health Insurance License or must obtain within 120 days of employment"
    }
  ]
}