{
  "meta": [
    {
      "job_title": "Sales Specialist",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 87500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Financial Acumen",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Business Acumen",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute targeted Specialty/Import sales strategies to achieve region and individual annual business goals, delivering profitable sales growth and penetration across applicable categories, specialty segments, and Sysco brand."
    },
    {
      "duty": "Identify the needs of customers and prospects to assemble a product mix that delivers solutions and helps achieve business objectives."
    },
    {
      "duty": "Utilize data analytics to prioritize Specialty/Import opportunities."
    },
    {
      "duty": "Collaborate on opportunities and champion the team selling process through use of Salesforce (Sysco's CRM tool)."
    },
    {
      "duty": "Provide feedback to specialty company and merchandising on product quality, product integrity, product mix, customer satisfaction, perceived value, and competition."
    },
    {
      "duty": "Develop and maintain relationships with customers, specialists, and sales team members."
    },
    {
      "duty": "Support execution of prioritized sales strategies through direct selling and engagement of customers and prospects at Sysco events."
    },
    {
      "duty": "Engage and manage relationships with European Imports, specialty & import segment manufacturers, and the broker community. Participate in continual education opportunities provided by European Import produced for the role."
    },
    {
      "duty": "Utilize the skills and offerings from the European Imports market support team that provides sales support resources, facilitates cross regional sales opportunities for national accounts, emerging chains, and retail customers, delivers field ready POS and product videos, and supports field events like GSMs, trainings, and sales events."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a related field or equivalent educational level (Preferred: Specialty/Import certification & CRM Certification)"
    }
  ]
}