{
  "meta": [
    {
      "job_title": "Assistant Professor, Business Economics",
      "job_category": "Education",
      "job_class": "Professor",
      "sector": "Teaching",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Economics",
      "experience": 5
    },
    {
      "skill": "Teaching",
      "experience": 5
    },
    {
      "skill": "Research",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    },
    {
      "skill": "Grant Writing",
      "experience": 5
    },
    {
      "skill": "Student Engagement",
      "experience": 5
    },
    {
      "skill": "Curriculum Development",
      "experience": 5
    },
    {
      "skill": "Academic Advising",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, prepare, and teach a variety of coursework in Macroeconomics, Microeconomics, and Business or other pure and applied economics courses."
    },
    {
      "duty": "Conduct research and develop grant proposals to enhance the School of Business general programs."
    },
    {
      "duty": "Provide service to the Department, School, and University."
    },
    {
      "duty": "Mentor and engage with students in alignment with the mission and vision of the University and school."
    },
    {
      "duty": "Stay current in the discipline and related pedagogy."
    },
    {
      "duty": "Contribute to the intellectual and academic life of the department, University, and community."
    },
    {
      "duty": "Advise students, serve on committees, and participate in the broader university communities."
    },
    {
      "duty": "Engage in ongoing professional development, especially activities that advance student engagement, learning, and equity."
    },
    {
      "duty": "Student recruitment, academic advising, campus committees, curriculum development, and community outreach."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Ph.D. in Economics, Business, or closely related areas with at least 18 credit hours of economics or related applied economics."
    },
    {
      "credential": "Master's degree with at least 18 graduate hours in Economics is required."
    },
    {
      "credential": "Evidence of high-quality teaching experience and a demonstrated ability to communicate with and mentor diverse populations."
    },
    {
      "credential": "Relevant professional experience, industry certification, online learning credentials, and a demonstrated record of grants, research, and scholarship."
    }
  ]
}