{
  "meta": [
    {
      "job_title": "Inventory Manager",
      "job_category": "Inventory Control",
      "job_class": "Manager",
      "sector": "Supply Chain Solutions",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Tracks day-to-day facility inventory costs and assists in supporting the facility KPI’s (Key Performance Indicators) to consistently meet/exceed established goals, including but not limited to GMP’s (Good Manufacturing Practices), safety, quality, productivity, sanitation, and maintenance."
    },
    {
      "duty": "Maintain daily reports that are established to measure daily, weekly and monthly KPI’s."
    },
    {
      "duty": "Develop and maintain inventory control systems that meet ongoing and future facility needs."
    },
    {
      "duty": "Develop and manage the facility cycle count program and the inventory recoup/repack/return/recycle program."
    },
    {
      "duty": "Provide floor support to Operations Supervisors and hourly associates regarding inventory issues and office support to the I/O Coordinators and receiving/shipping office personnel."
    },
    {
      "duty": "Facilitates and executes the hold process for local site."
    },
    {
      "duty": "Has a positive influence on and assists in the development of employees and conducts periodic performance evaluations of direct reports."
    },
    {
      "duty": "Insure daily communications and shift meetings provide the necessary information for employees to do their jobs consistently well while making them feel a real part of the team."
    },
    {
      "duty": "Promotes positive customer relationships."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "H.S. diploma/GED required"
    },
    {
      "credential": "Bachelor's degree preferred logistics, supply chain, or related field."
    },
    {
      "credential": "APICS certified intermediate preferred"
    }
  ]
}