{
  "meta": [
    {
      "job_title": "Project Manager - Global Treasury Management",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Strategic Planning",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 4
    },
    {
      "skill": "Change Management",
      "experience": 4
    },
    {
      "skill": "Budget Management",
      "experience": 4
    },
    {
      "skill": "Risk Management",
      "experience": 4
    },
    {
      "skill": "Communication",
      "experience": 4
    },
    {
      "skill": "Team Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead larger efforts to independently manage sub-program components of moderate complexity within change management."
    },
    {
      "duty": "Contribute to project plans and budgets, work with users to understand complex problems and bring issues to resolution in accordance with change management timelines."
    },
    {
      "duty": "Review and analyze moderately complex business organizational systems and navigation to anticipate change impacts while ensuring full understanding of project impacts and comprehensive engagement strategies."
    },
    {
      "duty": "Analyze or resolve resource requirements, project dependencies, planning or progression, financials management, status reporting, effective communications, ongoing risk adaptation, appropriate escalation strategies and implementation while leading team to meet change management deliverables."
    },
    {
      "duty": "Collaborate and consult with project coordinators, business partners, project staff, stakeholders, and project leads in times of highly unusual or complex ambiguity and achieve project goals and established timelines in coordination with more experienced management."
    },
    {
      "duty": "Execute matrix managing other project managers and project coordinators for projects."
    }
  ]
}