{
  "meta": [
    {
      "job_title": "Project Manager, Strategic Initiatives",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Research",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Event Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Project Management Tools",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide project focused support to executives and senior leadership to help advance organizational strategic goals and objectives."
    },
    {
      "duty": "Act as a liaison with key points of contact for coordination of key meetings."
    },
    {
      "duty": "Gather and prepare strategic content, and deliver business development presentations."
    },
    {
      "duty": "Collaborate with others to ensure initiatives align with corporate priorities and position the organization as best-in-class."
    },
    {
      "duty": "Develop and execute projects and plans, as well as control risk, change, and communication management."
    },
    {
      "duty": "Manage, plan, execute and ensure follow-up of special events and projects."
    },
    {
      "duty": "Model best practices within the project management life cycle."
    },
    {
      "duty": "Demonstrate effective presentation skills and written communication skills."
    },
    {
      "duty": "Handle multiple concurrent assignments with strong attention to details."
    },
    {
      "duty": "Summarize results and produce executive reports as well as offer drill down to provide details supporting these summaries."
    },
    {
      "duty": "Respond effectively to shifting of priorities to meet demands and expectations."
    },
    {
      "duty": "Establish, maintain, and improve superior relationships with team members."
    },
    {
      "duty": "Ensure deliverables, timetables, and milestones are met."
    },
    {
      "duty": "Work independently with little supervision."
    },
    {
      "duty": "Coordinate and manage work activities of other team members."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree and 3+ years of project management experience, or Associate’s Degree and 5+ years of project management experience, or GED, High School Diploma and 8+ years of project management experience."
    }
  ]
}