{
  "meta": [
    {
      "job_title": "Associate Sales Engineer",
      "job_category": "Sales",
      "job_class": "Engineer",
      "sector": "Sales",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Support",
      "experience": 3
    },
    {
      "skill": "Solution Providing",
      "experience": 3
    },
    {
      "skill": "Customer Integration",
      "experience": 3
    },
    {
      "skill": "Sales Support",
      "experience": 3
    },
    {
      "skill": "Product Functionality",
      "experience": 3
    },
    {
      "skill": "CAD Proficiency",
      "experience": 3
    },
    {
      "skill": "Thermal Calculations",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide technical support and solutions to sales team and customers from pre-sale through installation and implementation."
    },
    {
      "duty": "Analyze customer requirements and illustrate how company solutions can provide value and support their organization."
    },
    {
      "duty": "Configure technical solutions for customers and ensure successful customer integration."
    },
    {
      "duty": "Answer client questions on product functionality and usage and solve sales support problems."
    },
    {
      "duty": "Provide technical consultation and knowledge transfer with sales staff/trainers/product support."
    },
    {
      "duty": "Support the field sales and system consultant teams including technical application support, documentation, BOM’s and drawings, detailed specifications."
    },
    {
      "duty": "Provide communication to the sales organization, as well as essential internal customers."
    },
    {
      "duty": "Provide support establish Rittal as the default provider for cabinets, climate control and IA products."
    },
    {
      "duty": "Thermal calculations for climate control opportunities that have clearly defined criteria."
    },
    {
      "duty": "Assisting in thermal audits as needed."
    },
    {
      "duty": "Creation of conceptual assembly and modification drawings."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "4-year Degree in Engineering, Mechanical or Industrial studies or equivalent experience required."
    },
    {
      "credential": "Working knowledge of Microsoft Outlook, Word, Excel, and PowerPoint."
    }
  ]
}