{
  "meta": [
    {
      "job_title": "Senior Debt Capital Markets Specialist",
      "job_category": "Finance",
      "job_class": "Specialist",
      "sector": "Banking",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Securities Transactions Processing",
      "experience": 3
    },
    {
      "skill": "Financial Technology",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Teamwork",
      "experience": 3
    },
    {
      "skill": "Research and Analysis",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    },
    {
      "skill": "Marketing",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Process securities transactions with a high degree of accuracy, including new account establishment, security issue setup, trade tickets, settlements, payments, and pledging."
    },
    {
      "duty": "Utilize technology and resources to perform functions efficiently, including communications, recordkeeping, and reporting."
    },
    {
      "duty": "Research and resolve issues independently, providing knowledge sharing with team members to strengthen understanding of processes and controls."
    },
    {
      "duty": "Participate in proactive team efforts to achieve departmental and company goals, remaining knowledgeable of changes affecting securities processes."
    },
    {
      "duty": "Maintain good relationships with internal and external customers, ensuring compliance with policies, procedures, code of conduct, and regulatory guidelines."
    },
    {
      "duty": "Provide assistance to colleagues, perform marketing endeavors, and continuously update skills through professional training."
    },
    {
      "duty": "Remain composed under pressure and respond to customer and coworker concerns regularly, while maintaining a positive attitude."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 40,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent (Bachelor's degree preferred)"
    }
  ]
}