{
  "meta": [
    {
      "job_title": "AOD Certified Clinical Supervisor",
      "job_category": "Counseling",
      "job_class": "Supervisor",
      "sector": "Healthcare",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Providing supervision of the clinical staff in an outpatient addiction recovery environment."
    },
    {
      "duty": "Ensuring compliance with state and federal regulations, CARF standards, and clinic and corporate policies and procedures."
    },
    {
      "duty": "Monitoring counselor’s compliance with productivity requirements and developing improvement plans when requirements are not met."
    },
    {
      "duty": "Making staff assignments and creating schedules; updating support staff when changes are made."
    },
    {
      "duty": "Conducting patient treatment plan reviews as needed."
    },
    {
      "duty": "Performing chart audits and communicates results of audits to staff."
    },
    {
      "duty": "Assisting with the recruitment, hiring and training of qualified clinical staff."
    },
    {
      "duty": "Involvement in crisis intervention and working as a liaison within the community as needed."
    },
    {
      "duty": "Ensuring ethical and professional conduct by clinical staff."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Master’s Degree in behavioral or related field and 2 years clinical experience in a health or human service agency, one year of which working directly with behavioral health or addiction recovery population OR  Bachelor’s Degree in behavioral or related field and 3 years clinical experience in a health or human service agency, one year of which working directly with behavioral health or addiction recovery population OR  Associates’ Degree in behavioral or related field and 4 years clinical experience in a health or human service agency, one year of which working directly with behavioral health or addiction recovery population"
    }
  ]
}