{
  "meta": [
    {
      "job_title": "Manager - Inside Sales",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the execution of strategic direction, development, and performance of inside sales activities in assigned markets."
    },
    {
      "duty": "Work collectively with the Inside Sales Supervisor to staff and direct the inside sales team."
    },
    {
      "duty": "Provide leadership towards the achievement of maximum profitability and growth with customers in line with the Company’s vision and values."
    },
    {
      "duty": "Ensure execution of plans and strategies to expand customer base and contribute to the development of training and educational programs for clients and inside sales personnel."
    },
    {
      "duty": "Execute and manage business plan and sales strategy for branch to ensure attainment of company sales goals and profitability."
    },
    {
      "duty": "Plan and strategically partner with selected supplier partners to ensure achievement of mutual growth plans."
    },
    {
      "duty": "Serve as coach and mentor to inside sales personnel."
    },
    {
      "duty": "Promote vision by providing customers with creative and broad-based solutions to assist in achieving their goals."
    },
    {
      "duty": "Work collectively with inside sales and field sales leaders to ensure effective communication within the branch."
    },
    {
      "duty": "Oversee performance and development of the inside sales team."
    },
    {
      "duty": "Prepare action plans for inside sales team for effective search of sales leads and prospects."
    },
    {
      "duty": "Identify and create new sales initiatives and execute sales strategies to penetrate new markets."
    },
    {
      "duty": "Assist in the implementation of marketing plans."
    },
    {
      "duty": "Maintain accurate records of pricings, sales, and activity reports submitted by the sales team."
    },
    {
      "duty": "Maintain contact with clients in market area to ensure high levels of client satisfaction."
    }
  ],
  "skills": [
    {
      "skill": "Strategic Sales Planning",
      "experience": 4
    },
    {
      "skill": "Business Development",
      "experience": 4
    },
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Sales Strategy Execution",
      "experience": 4
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 4
    },
    {
      "skill": "Market Expansion",
      "experience": 4
    },
    {
      "skill": "Sales Initiatives Development",
      "experience": 4
    },
    {
      "skill": "Performance Management",
      "experience": 4
    },
    {
      "skill": "Business Plan Execution",
      "experience": 4
    },
    {
      "skill": "Marketing Strategy Implementation",
      "experience": 4
    },
    {
      "skill": "Account Management",
      "experience": 4
    },
    {
      "skill": "Sales Reporting",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150
    },
    {
      "student_teacher": 100
    },
    {
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Degree or equivalent required; Bachelor’s Degree preferred"
    }
  ]
}