{
  "meta": [
    {
      "job_title": "National Account Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Category Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Forecasting",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Driving sales growth for Riverside Natural Foods in the Alternative & Food Service Channels: Demonstrate and uphold Riverside’s Core Values, mission, and vision."
    },
    {
      "duty": "Effectively manage sales and sales agents. Hunter mentality to gain new customers, and farmer opportunities to grow existing relationships."
    },
    {
      "duty": "Think proactively and strategically in order to drive organization-wide sales results. Utilize sales and influencing skills across written verbal and presentation forms of communication internally and externally."
    },
    {
      "duty": "Identify, research, and analyze problems, identify alternative solutions, and project consequences of proposed actions. Gather, evaluate, and interpret information, particularly as they relate to information on funding sources, market issues, and trends."
    },
    {
      "duty": "Create and present customer-specific presentations. Develop customer-specific programs to drive strong velocities. Discover medium- and long-term opportunities. Offer a solution-based selling approach. Attend designated trade shows and events."
    },
    {
      "duty": "Compile and review quantitative sales data and react rapidly to changing trends or new competitive threats and opportunities. Have a close pulse on the environment and proactively have plans to support customers and RNF brands."
    },
    {
      "duty": "Develop and present strategic plans, annual forecasts, and promotional programs to enhance the sale of products and profits."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 125,
      "student_teacher": 50,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "A Bachelor’s degree with a business concentration is preferred. Minimum of 3+ years in Food Service sales in the CPG industry"
    }
  ]
}