{
  "meta": [
    {
      "job_title": "Product Sales Specialist",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Experience",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Capital Equipment Sales",
      "experience": 5
    },
    {
      "skill": "Healthcare Sales",
      "experience": 5
    },
    {
      "skill": "Travel Adaptability",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Generating proposals, preparing sales quotations and presentations, planning customer meetings, and demonstrating equipment capabilities on Cardiovascular Ultrasound (CVUS) products in assigned territory."
    },
    {
      "duty": "Maintaining satisfactory after-sale relationships."
    },
    {
      "duty": "Penetrating competitive accounts and communicating current market intelligence back to the business, along with field concerns, issues and requirements."
    },
    {
      "duty": "Providing leadership in market analysis and development/execution of strategies and action plans to drive CVUS sales."
    },
    {
      "duty": "Prospecting for new customers and business in addition to growing and maintaining our existing customer portfolio."
    },
    {
      "duty": "Annual and quarterly achievement of multiple sales and revenue targets."
    },
    {
      "duty": "Development of long-term customer relationships coupled with the ability to identify and capitalize on opportunities that immediately satisfy customer needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 45,
      "introvert_extrovert": 75
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors Degree & 3 years of experience; OR High School Diploma/GED & 5 years of experience; OR Bachelors Degree & a graduate of GE HealthCare CLPDemonstrated experience presenting complex information both verbally and written to decision makers.Must live in the territory and be willing to travel within the territory. (Territory: Iowa, Nebraska, South Dakota, and North Dakota) "
    }
  ]
}