{
  "meta": [
    {
      "job_title": "Director of Business Development",
      "job_category": "Business Development",
      "job_class": "Director",
      "sector": "Sales",
      "remote": false,
      "salary": 165000
    }
  ],
  "skills": [
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Client Management",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Business Growth",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Public Relations",
      "experience": 5
    },
    {
      "skill": "CRM Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and drive business growth."
    },
    {
      "duty": "Lead a team of business development and marketing professionals, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify business development opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's client relationships and network, optimizing engagement and client satisfaction for business growth."
    },
    {
      "duty": "Monitor and provide regular updates on budget allocation for business development initiatives."
    },
    {
      "duty": "Recommend, manage, and support traditional marketing activities aimed at positioning the company for targeted client wins."
    },
    {
      "duty": "Represent the company at significant events, fostering connections and opportunities for business development."
    },
    {
      "duty": "Infuse a return on investment (ROI) mindset into all business development undertakings and expenditures; evaluate investments and offer recommendations concerning new and existing programs."
    },
    {
      "duty": "Leverage company's marketing technology to identify potential leads, track and manage opportunities, and oversee pursuits."
    },
    {
      "duty": "Maintain the integrity of the company's client experience database, collaborating with PR, Digital, and CRM teams to gather experience, update marketing materials, and elevate the company's profile."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Marketing, Business Administration, or a related field"
    }
  ]
}