{
  "meta": [
    {
      "job_title": "Director of Content and Creative Strategy",
      "job_category": "Marketing",
      "job_class": "Director",
      "sector": "Marketing",
      "salary": 91000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Online Presence Management",
      "experience": 10
    },
    {
      "skill": "Event Planning",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Digital Marketing",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Organizational Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Powerfully conveys the values and impact of the Dartmouth Health, Geisel, and Dartmouth College brands through compelling storytelling and content development."
    },
    {
      "duty": "Builds and leads a high-performing Communications Content and Creative team, comprising three primary workgroups: creative/design, content/writing, and video production."
    },
    {
      "duty": "Establishes and maintains highly productive, collaborative working relationships with institutional leaders, department chairs, center and program leaders, faculty, administrators, and staff."
    },
    {
      "duty": "Develops and implements best-of-industry content and creative content, strategies, and tactics to build, strengthen, and sustain a culture of philanthropy."
    },
    {
      "duty": "Leads internal and cross-departmental working groups to accomplish program goals."
    },
    {
      "duty": "Counsels and mentors frontline staff on proposal development and reviews their draft proposals to ensure clarity and conformity with institutional gift and endowment policies."
    },
    {
      "duty": "Works with communications and marketing leaders across Geisel, Dartmouth College, and Dartmouth Health to build new, unified paradigms for powerful storytelling, including content curation and editorial collaboration."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 130,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a related field (Master’s preferred)"
    }
  ]
}