{
  "meta": [
    {
      "job_title": "Regional Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Regional Sales Planning",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Sales Closing",
      "experience": 5
    },
    {
      "skill": "CRM Software",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Software Applications",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop regional sales plans, forecasts, and targets. Achieve regional sales results consistent with or in excess of forecasted levels."
    },
    {
      "duty": "Maintain a strong relationship with existing customers and establish relationships with new customers to expand A&B’s business opportunities."
    },
    {
      "duty": "Professionally represent A&B’s capabilities with customers and at trade shows, identifying and developing contacts to increase the company’s customer base."
    },
    {
      "duty": "Thorough knowledge of supply chain concepts and purchasing practices."
    },
    {
      "duty": "Gather sales project information and follow up with customers at appropriate intervals on quoted business to understand the status of projects and maximize A&B sales opportunities."
    },
    {
      "duty": "Record/keep up-to-date customer and project information utilizing our C.R.M. (Customer Relationship Software)."
    },
    {
      "duty": "Update job and competitive knowledge by maintaining market and industry trend data, participating in educational opportunities, reading professional publications, maintaining personal networks, etc."
    },
    {
      "duty": "Develop and implement sales techniques to drive results and meet specific market and industry needs."
    },
    {
      "duty": "Travel regularly to customer locations, trade shows, etc. (estimate 70%). Obtain market intelligence, new product opportunities, and customer feedback to suggest potential improvements to products and A&B’s estimating, sales, and marketing practices."
    },
    {
      "duty": "Actively participate in assigned product development opportunities. Work closely with other regional managers where required to coordinate sales efforts."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Sales, Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}