{
  "meta": [
    {
      "job_title": "HHA - Home Health Aide",
      "job_category": "Healthcare",
      "job_class": "Aide",
      "sector": "Healthcare",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Personal Care Assistance",
      "experience": 2
    },
    {
      "skill": "Behavioral Supervision",
      "experience": 2
    },
    {
      "skill": "CPR Certification",
      "experience": 2
    },
    {
      "skill": "Elderly Care Experience",
      "experience": 2
    },
    {
      "skill": "Care Certification",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide personal care assistance maintaining the independence of the participant to conduct activities of daily living, including toileting, showers, eating, and grooming."
    },
    {
      "duty": "Assist participants in the maintenance of physical activity, exercise, and walking."
    },
    {
      "duty": "Provide behavioral supervision or support for participants, such as reality orientation, reminder to follow through with nursing and medication instruction, diet restrictions, and emotional reassurance."
    },
    {
      "duty": "Assist with general activities such as conversing with participants, recreation activities, meal and snack serving, and housekeeping."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent required. Active Home Health Aide certification in the state of location required. Certified Nurse Assistant Certification preferred. Active CPR Certification required. Minimum of one (1) year of documented experience working with a frail or elderly population or if less than one (1) year of experience, must receive appropriate training from the PACE organization on working with a frail or elderly population upon hiring."
    }
  ]
}