{
  "meta": [
    {
      "job_title": "Graduate in Human Resources",
      "job_category": "Human Resources",
      "job_class": "Graduate",
      "sector": "Human Resources",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Employee Relations",
      "experience": 2
    },
    {
      "skill": "Coaching",
      "experience": 1
    },
    {
      "skill": "Recruitment",
      "experience": 1
    },
    {
      "skill": "Talent Management",
      "experience": 1
    },
    {
      "skill": "Performance Management",
      "experience": 1
    },
    {
      "skill": "Leadership",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Safety Management",
      "experience": 2
    },
    {
      "skill": "Flexibility",
      "experience": 2
    },
    {
      "skill": "Networking",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Providing support to employees and managers whilst coaching and advising on employee relations and application of other HR processes."
    },
    {
      "duty": "Rotations in operations involving providing advice, support, and coaching regarding the application of policies and programs on employee relations, compensation, fringe benefits, recruitment, and talent and performance management."
    },
    {
      "duty": "Developing fundamental leadership skills through gamified leadership simulation and gaining outside perspective from futurists and external thought leaders."
    },
    {
      "duty": "Acquiring a toolkit focused on future skills, inspiring innovation and creativity through a series of masterclasses."
    },
    {
      "duty": "Innovating solutions for future business and world challenges with graduate colleagues."
    },
    {
      "duty": "Getting 1-1 coaching sessions with an experienced external coach and networking with senior leaders and subject matter experts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor or master’s degree in Human Resources, Industrial Relations or other related field. Less than two years of relevant work experience (local and international). Right to work in the United States. Valid driver license. A commitment to the safety of yourself and your team. Leadership skills, eagerness to learn and ready for the challenges ahead. Interest in working in a large complex industrial environment. Safety mindset. Excellent verbal and written communication skills. Flexibility and autonomy. Enthusiasm to collaborate with different teams in unique environments."
    }
  ]
}