{
  "meta": [
    {
      "job_title": "Construction Superintendent",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Project Planning",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide overall on-site management of a commercial construction project."
    },
    {
      "duty": "Supervise total construction effort to ensure project is constructed in accordance with all contract documents, construction budget, and schedule."
    },
    {
      "duty": "Foster good communication with client representatives, AE representatives, other contractors, etc."
    },
    {
      "duty": "Plan, coordinate and supervise onsite functions to assure high quality control."
    },
    {
      "duty": "Manage subcontractors’ installation procedures to assure material installations follow manufacturer printed installation requirements."
    },
    {
      "duty": "Be responsible for timely receipt of direct-purchase materials."
    },
    {
      "duty": "Schedule and manage the work to assure tight adherence to critical path activities of the project schedule."
    },
    {
      "duty": "Supervise laborers and subcontractors as required by the contract."
    },
    {
      "duty": "Direct field activities with a thorough understanding of drawings and specification requirements."
    },
    {
      "duty": "Assist project management in developing and implementing project procedures, working documents, standards, etc."
    },
    {
      "duty": "Ensure all onsite personnel comply with project procedures, safety program requirements, work rules, and contract documents."
    },
    {
      "duty": "Document daily activities, field conditions, and safety violations."
    },
    {
      "duty": "Assume responsibility for a safe work environment, productivity of crafts, efficient use of materials and equipment, and contractual performance of the project."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Construction Management, Civil Engineering, or related field (Master's preferred)"
    }
  ]
}