{
  "meta": [
    {
      "job_title": "Coordinator",
      "job_category": "Operations",
      "job_class": "Coordinator",
      "sector": "Manufacturing",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "SAP",
      "experience": 4
    },
    {
      "skill": "Logistics Coordination",
      "experience": 4
    },
    {
      "skill": "Inventory Management",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "HAZMAT Shipping",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Microsoft Word",
      "experience": 4
    },
    {
      "skill": "Microsoft Excel",
      "experience": 4
    },
    {
      "skill": "Standard Operating Procedures",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Administering, coordinating, and improving activities associated with import, export, inbound and outbound operations to customers and logistics centers."
    },
    {
      "duty": "Generating process orders and delivery pick list from SAP."
    },
    {
      "duty": "Preparing orders and pulling materials for other colleagues to build kits and a la carte."
    },
    {
      "duty": "Coordinating other colleagues to pack and ship orders."
    },
    {
      "duty": "Coordinating finished good inventory and tracking movement of products and materials."
    },
    {
      "duty": "Shipping of products and materials involving customs and documentation."
    },
    {
      "duty": "Making recommendations for new or modified policies, practices, or procedures."
    },
    {
      "duty": "Assisting in receiving of products and materials, including chemicals and other orders."
    },
    {
      "duty": "Updating and writing documentations and standard operating procedures to support daily work."
    },
    {
      "duty": "Working with materials for shipment using dry ice, freezer cold packs, and room temperature items."
    },
    {
      "duty": "Working in a dynamic environment and actively working on feet most of the day, working in a 4C cold room for short periods of time, and lifting/moving items up to 40lbs."
    },
    {
      "duty": "Cross-training in different areas as needed to support."
    },
    {
      "duty": "Conducting other activities as assigned by the manager. May be an informal team lead."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Logistics, Supply Chain Management, Business, or a related field (Master's preferred)"
    }
  ]
}