{
  "meta": [
    {
      "job_title": "Visual Merchandising Manager",
      "job_category": "Merchandising",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Merchandising",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Product Flow Management",
      "experience": 3
    },
    {
      "skill": "Customer Experience Management",
      "experience": 3
    },
    {
      "skill": "Staff Mentoring",
      "experience": 3
    },
    {
      "skill": "Budget Management",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Visual Direction",
      "experience": 3
    },
    {
      "skill": "Business Analysis",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct the merchandising, product flow, and display to create an inspiring and dynamic experience for the customer."
    },
    {
      "duty": "Manage product flow, visual execution, and in-store marketing to drive sales and create a compelling store environment."
    },
    {
      "duty": "Mentor the team to provide a frictionless customer experience utilizing technology to transact in the moment."
    },
    {
      "duty": "Set clear objectives and coach team members on analysis of business related to visual presentation to achieve department sales goals."
    },
    {
      "duty": "Assess store business using Company reporting tools to identify merchant opportunities within product placement, outfitting, and stock levels."
    },
    {
      "duty": "Own an effective shipment process utilizing reporting and business analysis to maximize new product placement on the floor and in back of house."
    },
    {
      "duty": "Contribute to a customer-first philosophy by flexing schedule to the needs of the business and supporting operations and zone coverage as needed."
    },
    {
      "duty": "Provide global product and visual feedback to Store Manager and District Manager; submit store environment photos to highlight merchandising and display updates."
    },
    {
      "duty": "Contribute to positive team morale through brand and store initiatives such as employee recognition and team building activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "3+ years store visual merchandising and leadership experience"
    }
  ]
}