{
  "meta": [
    {
      "job_title": "Scores Client Services - Vice President",
      "job_category": "Client Services",
      "job_class": "Vice President",
      "sector": "Finance",
      "salary": 190000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Mortgage Analytics",
      "experience": 10
    },
    {
      "skill": "Capital Markets",
      "experience": 10
    },
    {
      "skill": "Consultative Approach",
      "experience": 10
    },
    {
      "skill": "Sales and Business Development",
      "experience": 10
    },
    {
      "skill": "Client Relationship Management",
      "experience": 10
    },
    {
      "skill": "Strategic Business Management",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Global Business Environment",
      "experience": 10
    },
    {
      "skill": "MBA",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as a trusted advisor and Subject Matter Expert (SME) to strategic clients in the mortgage industry."
    },
    {
      "duty": "Use deep knowledge of mortgage analytics and scores innovations to support clients' strategic objectives and provide education and training on Scores products."
    },
    {
      "duty": "Cultivate and maintain trusted advisor relationships with a variety of Mortgage client stakeholders, including Executives and heads of Capital Markets."
    },
    {
      "duty": "Lead discussions and create solutions in various settings, including client sessions, internal meetings, and industry events."
    },
    {
      "duty": "Proactively work with customer CXOs and executives to understand their most pressing business issues and successfully position FICO Scores for broad use in the industry."
    },
    {
      "duty": "Support the development, testing, and implementation of client solutions based on FICO products, and participate in the validation confirmation to ensure the resulting solution satisfies the defined requirements."
    },
    {
      "duty": "Drive marketing plan through the creation of thought leadership white papers, executive briefings, and industry symposium presentations."
    },
    {
      "duty": "Provide executive interaction support or speak at industry trade shows, conferences, and seminars."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in business, MBA or advanced degree preferred."
    }
  ]
}