{
  "meta": [
    {
      "job_title": "Clinical Program Manager",
      "job_category": "Clinical",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 144868,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Operations",
      "experience": 5
    },
    {
      "skill": "Staff Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Financial Responsibility",
      "experience": 5
    },
    {
      "skill": "Performance Improvement",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Healthcare Compliance",
      "experience": 5
    },
    {
      "skill": "Educational Program Development",
      "experience": 5
    },
    {
      "skill": "Quality Assessment",
      "experience": 5
    },
    {
      "skill": "Regulatory Standards",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee clinical operations, using data and fact-based problem solving techniques to improve processes and outcomes."
    },
    {
      "duty": "Manage staff recruitment, training, coaching, evaluation, and disciplinary procedures in accordance with policies and procedures."
    },
    {
      "duty": "Develop, maintain, and reconcile departmental budget with financial responsibility and oversight for department or division."
    },
    {
      "duty": "Coordinate educational and performance improvement activities within a designated clinical specialty."
    },
    {
      "duty": "Establish and implement short and long term goals, objectives, policies, and operating procedures for high level of performance in nursing care delivery."
    },
    {
      "duty": "Maintain readiness for Joint Commission and other agency surveys, and present related programs during visits."
    },
    {
      "duty": "Participate in the performance appraisal process of designated Nursing staff."
    },
    {
      "duty": "Prepare reports and analysis associated with orientation of new hires, ongoing competency, and evaluation of staff performance."
    },
    {
      "duty": "Maintain professional and technical knowledge by attending educational workshops; reviewing professional publications; establishing personal networks; benchmarking state-of-the-art practices; participating in professional societies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Baccalaureate Degree in Nursing is required. Masters in Nursing or health related field is preferred. Certification in specialty area preferred. 5 years directly related experience (some supervisory preferred) New York State License with current registration as a registered professional nurse."
    }
  ]
}