{
  "meta": [
    {
      "job_title": "Hydrogen Refueling System Supply Chain Manager",
      "job_category": "Supply Chain",
      "job_class": "Manager",
      "sector": "Supply Chain",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Procurement",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "SAP",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "High-Pressure H2 Regulations",
      "experience": 5
    },
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "People Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and implement material control, procurement, expediting, and warehousing activities for engineered equipment, systems, and materials in support of project execution."
    },
    {
      "duty": "Lead the use of advanced planning tools to model, simulate, and release optimized material plans, and align with commercial teams to maintain inventory requirements."
    },
    {
      "duty": "Coordinate activities of assigned Material Management specialists and provide accurate, timely records of material status."
    },
    {
      "duty": "Evaluate and improve material management and control activities, analyze forecasts, and recommend necessary corrective action."
    },
    {
      "duty": "Develop and implement coordinated detailed solutions to drive continued innovation, efficiency, and safety for material planning."
    },
    {
      "duty": "Adhere to and support Health, Safety, Environmental, and Sustainability Policies, as well as support corporate initiatives promoting safety, diversity, ethical behavior, increased employee engagement, and career development."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Supply Chain Management or a relevant discipline (Master’s degree desired)"
    },
    {
      "credential": "APICS certifications preferred: CPIM or CSCP"
    },
    {
      "credential": "Experience in SAP (PP, MM, APO, SNP or PPDS) or related ERP system"
    }
  ]
}