{
  "meta": [
    {
      "job_title": "Corporate Billing Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Customer Service",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Contact customers to obtain payment statuses on past-due invoices, research past due invoices if needed, and document obtained statuses in the cbCentral system."
    },
    {
      "duty": "Provide customers requested copies of invoice documents to support past due statuses, enter customer-reported disputes and requests for account adjustments into the cbCentral system."
    },
    {
      "duty": "Work and resolve cbCentral assigned tasks, solicit customer enrollment for e-mail statements, and answer and resolve in-bound calls placed to the Corporate Billing Customer Service Queue."
    },
    {
      "duty": "Make an average of 65 calls a day, work buyout schedules if assigned, perform research on past-due invoices, work email and statement exceptions if assigned, work return mail if assigned, and document status updates in cbCentral in a clear and concise manner."
    },
    {
      "duty": "Provide excellent customer service by answering inbound and outbound customer service requests in a timely and professional manner."
    },
    {
      "duty": "Work and resolve assigned tasks in cbCentral in a timely and accurate manner and escalate payment status issues to Collections Management."
    },
    {
      "duty": "Train new collectors on collection policies/procedures and system use, and may assist with the dispute resolution process."
    }
  ],
  "skills": [
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Teamwork",
      "experience": 5
    },
    {
      "skill": "General Computer Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Workflow Management",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "High school graduate or equivalent is required."
    }
  ]
}