{
  "meta": [
    {
      "job_title": "Mechanical Inspector and Plans Examiner",
      "job_category": "Mechanical Engineering",
      "job_class": "Inspector/Examiner",
      "sector": "Engineering",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Inspection",
      "experience": 5
    },
    {
      "skill": "Testing",
      "experience": 5
    },
    {
      "skill": "Construction Knowledge",
      "experience": 5
    },
    {
      "skill": "Regulation Interpretation",
      "experience": 5
    },
    {
      "skill": "Blueprint Interpretation",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Computer Proficiency",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Inspect and test mechanical installations in progress and upon completion."
    },
    {
      "duty": "Advise contractors on changes required to assure code compliance and engage in periodic surveillance of assigned area to detect violations."
    },
    {
      "duty": "Perform inspections of existing commercial businesses for Certificates of Use and Occupancy and provide information to contractors and the public."
    },
    {
      "duty": "Conduct field inspections of various mechanical systems and perform acceptance tests for mechanical systems including exhaust and supply fan operation, discharge test for automatic fire suppression systems, and other test procedures."
    },
    {
      "duty": "Provide recommendations and suggestions to contractors regarding changes necessary to assure compliance with the South Florida Building Code and conduct routine and periodic patrols and inspections to detect code violations."
    },
    {
      "duty": "Organize inspection route schedule and maintain accurate records of inspections. Answer telephone calls from contractors and the public and offer information and clarification."
    },
    {
      "duty": "Approve qualifications for homeowners permits."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Florida Standard Inspector Mechanical License and Plans Examiner Mechanical License required. Certified as a Mechanical Inspector and Plans Examiner by the Miami Dade County Board of Rules and Appeals. Valid driver’s license with good driving record."
    }
  ]
}