{
  "meta": [
    {
      "job_title": "Recreational Therapist",
      "job_category": "Healthcare",
      "job_class": "Therapist",
      "sector": "Healthcare",
      "salary": 54000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recreational Therapy",
      "experience": 2
    },
    {
      "skill": "Behavioral Health",
      "experience": 2
    },
    {
      "skill": "Healthcare Experience",
      "experience": 3
    },
    {
      "skill": "Activity Therapy Assessment",
      "experience": 2
    },
    {
      "skill": "Patient Care Documentation",
      "experience": 3
    },
    {
      "skill": "Crisis Intervention",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review multi-disciplinary assessments and complete Activity Therapy assessments for patients."
    },
    {
      "duty": "Facilitate recreational therapy, through group and individual sessions, focused on helping patients make activity choices, which support recovery, life balance, and wellness."
    },
    {
      "duty": "Manage the safety and orderliness of activity therapy work and group areas while maintaining an appropriate quantity and variety of activity therapy supplies."
    },
    {
      "duty": "Thoroughly document any recreation therapy interventions in patients’ electronic medical records."
    },
    {
      "duty": "Collaborate with the behavioral health treatment team, patient, and other necessary parties in the development and revision of the recovery plan and coordination of services."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BA or BS in Activity Therapy related field of study: Therapeutic Recreations, Art Therapy, or Music Therapy. MS in Therapeutic Recreation or related field with eligibility for LPC/LCSW/ATR Licensure preferred. American Heart Association or American Red Cross Basic Life Support (BLS) Health Care Provider required. Must obtain Nonviolent Crisis Intervention within 60 days of hire."
    }
  ]
}