{
  "meta": [
    {
      "job_title": "Phlebotomist",
      "job_category": "Healthcare",
      "job_class": "Phlebotomist",
      "sector": "Healthcare",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Phlebotomy",
      "experience": 1
    },
    {
      "skill": "Blood Collection",
      "experience": 1
    },
    {
      "skill": "Specimen Labeling",
      "experience": 1
    },
    {
      "skill": "Lab Testing",
      "experience": 1
    },
    {
      "skill": "Basic Computer Skills",
      "experience": 1
    },
    {
      "skill": "Written Communication",
      "experience": 1
    },
    {
      "skill": "Oral Communication",
      "experience": 1
    },
    {
      "skill": "Team Work",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform venipunctures, including blood culture collection, and fingersticks ensuring proper ID/labeling of specimens and using vein preservation techniques."
    },
    {
      "duty": "Transport routine and STAT specimens to appropriate laboratories."
    },
    {
      "duty": "Participate in laboratory programs for QA, competency, mandatory training and continuing education."
    },
    {
      "duty": "Ensure adequate stocking of supplies and report needs to phlebotomy leaders."
    },
    {
      "duty": "Interact respectfully with other employees, professional staff and/or external contacts to offer ideas, identify issues, obtain information or deliver services."
    },
    {
      "duty": "Provide a high level of customer service to patients, visitors, staff, and external customers in a professional, service-oriented, respectful manner."
    },
    {
      "duty": "Remain calm in stressful situations."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or GED required. Registration preferred: ASCP Registered, Certificate 1 preferred: NCA Certification. 0-1 years related work experience required. Basic familiarity with computers."
    }
  ]
}