{
  "meta": [
    {
      "job_title": "Senior Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Critical Infrastructure Security",
      "experience": 8
    },
    {
      "skill": "Power System Analysis",
      "experience": 8
    },
    {
      "skill": "Energy Systems Management",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Risk Management",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Research and Development",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and direct research in innovative power testing and analysis of generation, transmission, and distribution systems within the Critical Infrastructure Security & Resilience (CISR) mission."
    },
    {
      "duty": "Manage and lead all aspects of critical infrastructure-related projects within the Energy Systems portfolio."
    },
    {
      "duty": "Run and oversee all project milestones, scope, schedule, cost, and resources, and provide managerial leadership to the project team."
    },
    {
      "duty": "Mentor early to mid-career project managers and project coordinators, and contribute to the strategic vision and goals of Securing the Path to Net-Zero™."
    },
    {
      "duty": "Interface with various DOE offices and other industry stakeholders on infrastructure security-related collaborations and advise Program Manager on research opportunities in the area of security against threats to U.S. critical infrastructures."
    },
    {
      "duty": "Obtain and maintain a Department of Energy \"Q\" clearance, SCI access, and complete a polygraph, which requires US Citizenship."
    },
    {
      "duty": "Ensure alignment with relevant health and safety requirements, emergency action policies, and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Engineering and 8 years of relevant experience or Master's and 6 years or PhD and 4 years"
    }
  ]
}