{
  "meta": [
    {
      "job_title": "Financial Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Financial Reporting",
      "experience": 10
    },
    {
      "skill": "Budget Planning",
      "experience": 10
    },
    {
      "skill": "CPA",
      "experience": 10
    },
    {
      "skill": "MBA",
      "experience": 10
    },
    {
      "skill": "Nonprofit Management",
      "experience": 5
    },
    {
      "skill": "GAAP",
      "experience": 10
    },
    {
      "skill": "Fund Accounting",
      "experience": 5
    },
    {
      "skill": "Grant Management",
      "experience": 5
    },
    {
      "skill": "Financial Communication",
      "experience": 10
    },
    {
      "skill": "Database Management",
      "experience": 10
    },
    {
      "skill": "NetSuite",
      "experience": 5
    },
    {
      "skill": "StratusLIVE CRM",
      "experience": 5
    },
    {
      "skill": "Budget Software",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Providing timely and accurate analyses and financial reporting to ensure the highest level of financial oversight by executives and board members."
    },
    {
      "duty": "Partnering with resource development team members and senior leadership team members to garner input, advice, and approval as appropriate."
    },
    {
      "duty": "Forecasting revenue and expenses to ensure financial liquidity and sustainability of the organization."
    },
    {
      "duty": "Developing and implementing an investment strategy that increases resources available to accomplish our mission and meets the requirements of associated Board policies."
    },
    {
      "duty": "Overseeing and managing relationships with banking institutions and the financial community."
    },
    {
      "duty": "Translating organizational priorities into multi-year budget scenarios and narratives, identifying the resources and considerations underlying strategies using an equity lens."
    },
    {
      "duty": "Building the capacity of all team members to understand financial situation and approaches to revenue and expense planning."
    },
    {
      "duty": "Supporting organizational efforts to use qualitative and quantitative data to identify areas of possible growth, improve operations, and make decisions."
    },
    {
      "duty": "Integrating technology and technology-based solutions to improve processes and results."
    },
    {
      "duty": "Staffing board level committees to monitor trends and changes in finances and provide guidance and advice."
    },
    {
      "duty": "Maintaining strong communication, keeping the senior management team informed of issues related to cash flow, expenses to budget, and revenue projections."
    },
    {
      "duty": "Modeling and promoting values of equity mindset, results, relationships, and continuous improvement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in accounting and/or business, finance, economics, and 10+ years in progressively responsible financial leadership roles, advanced coursework a plus. CPA or MBA desired with experience in nonprofit management, fundraising or stewardship."
    }
  ]
}