{
  "meta": [
    {
      "job_title": "Strategic Sourcing Associate Category Manager - Logistics",
      "job_category": "Logistics",
      "job_class": "Manager",
      "sector": "Logistics",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Sourcing",
      "experience": 5
    },
    {
      "skill": "Supplier Relationship Management",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Market Intelligence",
      "experience": 5
    },
    {
      "skill": "Financial Acumen",
      "experience": 5
    },
    {
      "skill": "Business Partner Engagement",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Cross-Functional Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive category strategies for freight and logistics services, utilizing cross-functional partnerships and external variables."
    },
    {
      "duty": "Lead and guide the development, implementation, and management of category strategies for RFPs on FTL/LTL freight, small parcel, 3PL, and other logistics needs."
    },
    {
      "duty": "Analyze market trends, supplier performance, and risk factors to identify growth opportunities and refine category strategies."
    },
    {
      "duty": "Manage the company's supplier relationships, negotiation strategies, and supplier selection criteria to deliver improved cost and reduced risk."
    },
    {
      "duty": "Drive cross-functional teams to identify, evaluate, and approve new suppliers that meet performance standards, utilizing market intelligence and supplier innovation."
    },
    {
      "duty": "Concisely articulate key points and insights verbally and in writing, providing unbiased recommendations based on facts and data."
    },
    {
      "duty": "Provide actionable solutions for the business, leveraging financial acumen and capital project evaluation."
    },
    {
      "duty": "Partner with the Resource Center to ensure the right data and analytics support category strategies and market intelligence for internal clients."
    },
    {
      "duty": "Navigate through a matrixed organization, collaborating in a cross-regional and cross-functional team to achieve category goals and strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 120,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Logistics, Supply Chain, Business, or a related field (Lean certification, 5S, APICS, or other Supply Chain certifications preferred)"
    }
  ]
}