{
  "meta": [
    {
      "job_title": "Catering and Conference Services Manager",
      "job_category": "Hospitality",
      "job_class": "Manager",
      "sector": "Hospitality",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Catering Sales",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Secure and service ‘Catering’ Business from the Social and Corporate Market, through active and effective promotion, solicitation, and prospecting, while maintaining FS standards and maximizing revenue/profit potential."
    },
    {
      "duty": "Actively solicit new business through aggressive means and respond to inquiries with the intention of confirming profitable Events business and achieving Quarterly Sales Goals and Monthly Activity Goals."
    },
    {
      "duty": "Conduct property tours and entertain planners of meetings and related social events. Plan and/or attend and/or participate in meetings with hotel staff and clients."
    },
    {
      "duty": "Coordinate the sales efforts between sales department and Events to ensure proper utilization of function space to yield maximum revenues."
    },
    {
      "duty": "Finalize the requirements of confirmed bookings while maximizing revenue potential through up selling and ensuring effective communication both written (Resumes, BEO, Daily Reports) and personal contact with all departments for the success of the event."
    },
    {
      "duty": "Supervise the execution of banquet events. Review all function space with the Banquet Captain and when required Director of Food & Beverage. Ensure satisfaction of client at the outset of all events."
    },
    {
      "duty": "Comply with Four Seasons Category One and Two Work Rules and Standards of Conduct as set forth in EmPact."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Hospitality, Business, or a related field (Master's preferred)"
    }
  ]
}