{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 70000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the delivery of nursing care within the assigned unit scope of practice following hospital policies and procedures, nursing process guidelines, standards of care, and standards of practice. Assesses each assigned patient, documents and evaluates their response to plan of care, and takes appropriate corrective action. Plans and implements the patient’s plan of care/standard of care and provides patient teaching using the plan of care/standard of care. Oversees all ancillary personnel for technical tasks. Seeks to improve quality of service by continuously developing individual and unit competencies within scope of practice. Integrates into practice the research of best practice benchmarking and clinical pathways, participates and cooperates with ongoing studies and clinical trials promotion and dissemination of research through professional forums including presentations and publications."
    }
  ],
  "skills": [
    {
      "skill": "Nursing Care",
      "experience": 5
    },
    {
      "skill": "Patient Assessment",
      "experience": 5
    },
    {
      "skill": "Patient Education",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Clinical Research",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an accredited school of nursing. Experience in specialty area will be considered. Experience specific to the unit/position may be required to maintain overall competency level of unit, as required by regulatory agency. Current State of Michigan Registered Nurse license. BLS certification as Healthcare Provider. ACLS certification as Healthcare Provider in the Cardiac Cath Lab."
    }
  ]
}