{
  "meta": [
    {
      "job_title": "Category Management Professional",
      "job_category": "Management",
      "job_class": "Professional",
      "sector": "Management",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sourcing",
      "experience": 10
    },
    {
      "skill": "Operations",
      "experience": 10
    },
    {
      "skill": "Supply Chain Management",
      "experience": 10
    },
    {
      "skill": "Procurement Processes",
      "experience": 10
    },
    {
      "skill": "Analytics",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Change Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support a global team of GE Vernova Facilities Category Management professionals."
    },
    {
      "duty": "Establish and lead strategic commodity management activities in various categories."
    },
    {
      "duty": "Manage corporate sourcing process end-to-end, including strategy, performance monitoring, and supplier relationship management."
    },
    {
      "duty": "Develop best-in-class analytics related to the assigned category spend."
    },
    {
      "duty": "Lead organizational, process, and culture change within the assigned category spend group."
    },
    {
      "duty": "Coordinate with Business Unit Category Management teams to ensure cohesive global strategy and execution of initiatives."
    },
    {
      "duty": "Partner with GE functional stakeholders in Business and Segment Sourcing, Operations, and Supply Chain to drive total cost efficiency reductions."
    },
    {
      "duty": "Address the climate crisis by moving GE energy businesses—including Renewables, Power, Digital and Energy Financial Services—under one banner to deliver a united, focused, one-of-a-kind force: GE Vernova."
    },
    {
      "duty": "Chart the course to a cleaner, better future by acting swiftly and surely to help build a lower carbon energy era."
    },
    {
      "duty": "Retain the treasured birthright of quality and ingenuity through the enduring badge of "
    },
    {
      "duty": "Build a better future by implementing change and delivering results."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree from an accredited university or college (or a high school diploma with relevant experience)"
    },
    {
      "credential": "MBA or Bachelor’s degree in Sourcing or Supply Chain Management (desired)"
    }
  ]
}