{
  "meta": [
    {
      "job_title": "Billing Operations Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review sales agreements and orders to ensure that relevant contractual terms are captured in the billing system."
    },
    {
      "duty": "Verify that subscriptions are set-up in the billing system properly so that resulting invoices are accurate and produce the correct accounting treatment."
    },
    {
      "duty": "Respond in a timely manner to billing inquiries from customers and internal constituents."
    },
    {
      "duty": "Process customer cancellations requests and verify that customer accounts are de-provisioned and accurately refunded if needed."
    },
    {
      "duty": "Work across departments to research and resolve customer issues related to billings."
    },
    {
      "duty": "Prepare billing reports and other related supporting documentation."
    },
    {
      "duty": "Identify and implement billing process improvements that increase efficiency, improve the accuracy of invoices, or strengthen controls."
    },
    {
      "duty": "Assist with the development and implementation of billing system improvements, including defining requirements and performing user acceptance tests."
    },
    {
      "duty": "Fulfill quarterly and annual audit requests."
    },
    {
      "duty": "Perform special projects as requested."
    }
  ],
  "skills": [
    {
      "skill": "SaaS Billing",
      "experience": 3
    },
    {
      "skill": "CRM",
      "experience": 3
    },
    {
      "skill": "ERP System",
      "experience": 3
    },
    {
      "skill": "Advanced Excel",
      "experience": 3
    },
    {
      "skill": "Data Processing",
      "experience": 3
    },
    {
      "skill": "Revenue Recognition",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree, preferably in Business Administration with an emphasis in Accounting or Finance"
    }
  ]
}