{
  "meta": [
    {
      "job_title": "East Coast Fisheries Liaison",
      "job_category": "Environmental",
      "job_class": "Liaison",
      "sector": "Renewable Energy",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Fisheries Research",
      "experience": 5
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Marine Sciences",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the development of large and complex US East Coast offshore wind projects through leading role on all applicable fisheries topics."
    },
    {
      "duty": "Lead engagement with all relevant fisheries stakeholders, including commercial and recreational fisheries, seafood processors, tribal fisheries, fisheries researchers, and academic institutions; relevant state, federal, and regional fisheries agencies, ports, and marine tourism industries, and relevant environmental non-profit organizations."
    },
    {
      "duty": "Lead development of East Coast offshore wind projects' fisheries engagement strategies and engagement plans for all phases of the project including site investigation surveys, project development, monitoring, construction, and operations."
    },
    {
      "duty": "Advise internal team members on all East Coast fisheries-related topics and project requirements, including coordination across workstreams (e.g. technical, commercial) and "
    },
    {
      "duty": "Early and often"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in Marine Sciences, Marine Affairs, Natural resource management, or a related field is preferred."
    },
    {
      "credential": "Experience working for or with state, federal or regional fisheries management entities, and/or similar experience preferred."
    },
    {
      "credential": " At least 5 years of relevant experience engaged in US-specific fisheries and maritime stakeholder topics."
    },
    {
      "credential": "Project management and leadership experience preferred."
    }
  ]
}