{
  "meta": [
    {
      "job_title": "Credit Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Credit Control",
      "experience": 10
    },
    {
      "skill": "Oracle",
      "experience": 10
    },
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Change Management",
      "experience": 10
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 10
    },
    {
      "skill": "Microsoft Excel",
      "experience": 10
    },
    {
      "skill": "Microsoft PowerPoint",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Overseeing the credit granting process and conducting periodic reviews of creditworthiness."
    },
    {
      "duty": "Developing and executing business plans ensuring alignment with corporate strategic plan."
    },
    {
      "duty": "Establishing and managing administrative and review systems and procedures to protect the quality and profitability of the portfolio."
    },
    {
      "duty": "Analyzing, underwriting, and approving/disapproving credit line requests."
    },
    {
      "duty": "Identifying potential problem credit accounts and working with internal staff to minimize risk for loss."
    },
    {
      "duty": "Advising staff, officers, and/or business units on the company's overall Credit policies."
    },
    {
      "duty": "Researching and evaluating customers' creditworthiness."
    },
    {
      "duty": "Defining credit management policies and controls and establishing credit limits."
    },
    {
      "duty": "Providing management and oversight of credit management activities and authorizing credit exceptions."
    },
    {
      "duty": "Establishing metrics to provide up-to-date data to make informed decisions."
    },
    {
      "duty": "Working with management, Sales, and Program Management to monitor AR status and customer credit issues."
    },
    {
      "duty": "Supporting collections team and assessing credit risk."
    },
    {
      "duty": "Acting as the point of contact for all matters relating to credit management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree with 10+ years' work experience in credit control and credit control and analysis."
    },
    {
      "credential": "Experience in Oracle preferred."
    },
    {
      "credential": "Hands-on experience developing and implementing revised credit control processes, policies, and reporting."
    },
    {
      "credential": "Ability to initiate and implement change in a fast-paced environment."
    },
    {
      "credential": "Strong results orientation with a track record of meeting or exceeding business objectives."
    },
    {
      "credential": "Excellent interpersonal skills and ability to interact successfully with all levels of management."
    },
    {
      "credential": "Excellent skills in Microsoft Excel and PowerPoint."
    },
    {
      "credential": "High level of integrity and dependability with a strong sense of urgency."
    },
    {
      "credential": "Fully applies oneself to the requirements of the position."
    }
  ]
}