{
  "meta": [
    {
      "job_title": "Assistant Department Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support service, selling, and business operations to achieve an engaging and inspiring store environment."
    },
    {
      "duty": "Foster community amongst the team through continued education on brand and store initiatives."
    },
    {
      "duty": "Act as a brand representative to promote a positive and inclusive environment in the store, in line with the values of the SPARKED program."
    },
    {
      "duty": "Lead by example in upholding a service culture that demonstrates extraordinary service to cultivate an environment where all customers feel welcome, heard, and valued."
    },
    {
      "duty": "Support the store leadership team and stylists to promote unique customer events that drive brand engagement and deep connections with the local community."
    },
    {
      "duty": "Actively participate in leading the salesfloor and driving engagement in each zone through elevated communication."
    },
    {
      "duty": "Guide the team to prioritize the customer experience and achieve store objectives."
    },
    {
      "duty": "Participate in the recruiting, hiring, and onboarding process to ensure a diverse and engaged team."
    },
    {
      "duty": "Utilize brand resources to champion employee development and support initiatives such as the SPARKED Journal, employee recognition, and team building activities."
    },
    {
      "duty": "Support daily operating processes such as opening and closing procedures, maintaining store standards, restocking product, and helping with facilities or IT issues."
    },
    {
      "duty": "Collaborate with key partners to effectively execute shipment and omni fulfillment processes; support visual standards, product stock levels, and markdowns."
    },
    {
      "duty": "Provide feedback about team training needs to support optimal scheduling and payroll allocation to drive sales and brand initiatives."
    },
    {
      "duty": "Contribute to an inclusive work environment by actively listening to others and seeking different perspectives."
    },
    {
      "duty": "Check in with leadership to maintain communication and teamwork on completing store objectives."
    },
    {
      "duty": "Adopt a people-first philosophy, prioritizing employee engagement and actively sharing store priorities and brand messages with the team."
    },
    {
      "duty": "Provide insights related to the customer and staff experience and communicate feedback to Service and Selling Manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Management, or related field (Master's preferred)"
    }
  ]
}