{
  "meta": [
    {
      "job_title": "Executive Coordinator",
      "job_category": "Administrative",
      "job_class": "Coordinator",
      "sector": "Management",
      "salary": 51000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Business Writing",
      "experience": 2
    },
    {
      "skill": "Event Coordination",
      "experience": 3
    },
    {
      "skill": "Staff Management",
      "experience": 3
    },
    {
      "skill": "Multilingual Skills",
      "experience": 2
    },
    {
      "skill": "Leadership Skills",
      "experience": 4
    },
    {
      "skill": "Technology Proficiency",
      "experience": 4
    },
    {
      "skill": "Board of Directors Interaction",
      "experience": 3
    },
    {
      "skill": "Content Creation",
      "experience": 4
    },
    {
      "skill": "Nature Conservation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide professional coordination and administrative support to the State Director and Director of Philanthropy, including overseeing tasks such as travel arrangements, calendar management, drafting correspondence and reports, and processing expenses."
    },
    {
      "duty": "Plan and manage small and medium-sized philanthropy and government relations events, meetings, and outdoor field trips, coordinating logistics and ensuring successful execution."
    },
    {
      "duty": "Serve as the liaison to the Arkansas Chapter’s Board of Trustees, leading the planning and implementation of meetings, producing board materials, and supporting trustees in their work with The Nature Conservancy."
    },
    {
      "duty": "Develop creative and written content to keep trustees updated on TNC projects and programs, as well as other donor stewardship material."
    },
    {
      "duty": "Implement, process, and practices to improve effectiveness, requiring comprehensive knowledge of the TNC’s policies, operations, programs, and values. Exercise discretion, judgment, tact, and composure under pressure."
    },
    {
      "duty": "Communicate effectively to help staff make decisions, solve problems, and improve workflow and outcomes, maintaining autonomy with little or no day-to-day supervision."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree and 2 years’ experience or equivalent combination in a relevant field. Multi-lingual skills and multi-cultural or cross-cultural experiences are appreciated."
    }
  ]
}