{
  "meta": [
    {
      "job_title": "Credit and Collections Specialist",
      "job_category": "Finance",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 50000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review portfolio and select delinquent accounts for collection efforts, negotiate payment arrangements for delinquent accounts, and evaluate customer records."
    },
    {
      "duty": "Assign terms and credit limits to current and prospective customers, review credit applications, and assist in developing credit rating criteria and internal scoring models."
    },
    {
      "duty": "Maintain a customer service focus, contribute to the continuous improvement of internal credit policies, and prepare credit and collection correspondence as necessary."
    },
    {
      "duty": "Assist in removing obstacles that may prevent customer payment, process credit card payments, and provide answers to customer inquiries regarding billing and payment issues."
    },
    {
      "duty": "Prepare accounts for a write-off, collection agency, or litigation, retrieve and prepare audit documentation, and file documentation to protect the company."
    },
    {
      "duty": "Understand regulations governing business-to-business credit specific to the industry, such as bankruptcies and lien laws."
    },
    {
      "duty": "Participate in special projects and perform other duties as required."
    }
  ],
  "skills": [
    {
      "skill": "Excellent Customer Service",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Customer Credit Management",
      "experience": 5
    },
    {
      "skill": "Accounting",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent required, college degree preferred"
    }
  ]
}