{
  "meta": [
    {
      "job_title": "Project Associate Director",
      "job_category": "Research",
      "job_class": "Director",
      "sector": "Medical Affairs",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Epidemiological Research",
      "experience": 7
    },
    {
      "skill": "Observational Research",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Scientific Writing",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "SAS",
      "experience": 7
    },
    {
      "skill": "STATA",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Organizational Skills",
      "experience": 7
    },
    {
      "skill": "Epidemiology",
      "experience": 7
    },
    {
      "skill": "Biostatistics",
      "experience": 7
    },
    {
      "skill": "Public Health",
      "experience": 7
    },
    {
      "skill": "Qualitative Data Analysis",
      "experience": 7
    },
    {
      "skill": "HIV Research",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and support Client sponsored and collaborative research activities focused on Phase 4 research within GMA and in collaboration with RWE, HEOR, and other cross-functional partners."
    },
    {
      "duty": "Provide high-quality technical and methodological support to cross-functional teams to effectively use RW and health outcomes data to optimize treatment and prevention practice and improve patient outcomes throughout the lifecycle of Client medicines."
    },
    {
      "duty": "Lead and support the development of communications (e.g., manuscripts, scientific forum presentations, slide decks) to build the peer-reviewed published scientific evidence base within GMA and in collaboration with RWE, HEOR, and other cross-functional partners."
    },
    {
      "duty": "Support GMA activities and participation in HIV treatment and prevention IEP and execution teams."
    },
    {
      "duty": "Maintain and continue to enhance knowledge of technical and methodological advances and trends to ensure best approaches are used in relevant studies and evaluations."
    },
    {
      "duty": "Engage key clinical, methodologic, and TA experts and facilitate the building of relationships via collaboration on various projects. Provide support at advisory boards, regional educational programs, conferences, and other external meetings."
    },
    {
      "duty": "Advise on the development, deployment, and appropriate use of Medical Scientists field tools and resources (e.g. slide decks) and ensure correct interpretation and relevant messaging in these tools."
    },
    {
      "duty": "Lead and support workshops and seminars to increase research capacity and literacy among MA and medical scientists and cross-functional stakeholders as necessary."
    },
    {
      "duty": "Provide administrative support in terms of coordination for project contracting and management."
    },
    {
      "duty": "Adhere to all applicable pharmaceutical codes, Office of Inspector General (OIG) guidelines, and Client policies."
    },
    {
      "duty": "Exhibit Client’s core values: integrity, teamwork, accountability, excellence, and inclusion."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Epidemiology, Biostatistics or Public Health (PhD preferred)"
    }
  ]
}