{
  "meta": [
    {
      "job_title": "Sales Professional",
      "job_category": "Sales",
      "job_class": "Professional",
      "sector": "Sales",
      "salary": 350000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Business Networking",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Enterprise Sales",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Strategic Networking",
      "experience": 5
    },
    {
      "skill": "Lead Generation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish and secure high-level meetings with decision-makers within large enterprises, articulating the unique value proposition of CloudFix with the aim of creating opportunities for its successful sale."
    },
    {
      "duty": "Developing and fostering relationships within large enterprises that have significant AWS expenditures."
    },
    {
      "duty": "Fully understanding, then articulating the CloudFix value proposition to potential partners, ensuring the message aligns with their pain points."
    },
    {
      "duty": "Addressing common objections and highlighting how CloudFix stands apart from other solutions."
    },
    {
      "duty": "Applying strategic networking skills, turning cold leads to warm ones, and helping CloudFix find its way into more AWS accounts."
    },
    {
      "duty": "Consistently achieving the objective of setting up high-quality meetings with decision-makers in target organizations."
    },
    {
      "duty": "Using strategic networking skills to turn cold leads into warm ones and assist in expanding CloudFix's market presence."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Established relationships within large enterprises with substantial AWS usage ($10M+ annual spend)"
    },
    {
      "credential": "5+ years experience in enterprise sales, with a focus on SaaS, cloud, or tech products"
    }
  ]
}