{
  "meta": [
    {
      "job_title": "Fiscal Liaison",
      "job_category": "Accounting",
      "job_class": "Liaison",
      "sector": "Finance",
      "salary": 52000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Operations",
      "experience": 1
    },
    {
      "skill": "Budgeting",
      "experience": 1
    },
    {
      "skill": "Accounting",
      "experience": 1
    },
    {
      "skill": "Office Management",
      "experience": 1
    },
    {
      "skill": "Microsoft Suite",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the daily financial operations of the local offices and serve as the liaison on fiscal matters between the local, regional, and national offices."
    },
    {
      "duty": "Supervise the Administrative Assistant and ensure that everyone’s personal financial accounts are maintained with financial propriety."
    },
    {
      "duty": "Schedule and conduct house audits monthly and maintain information for each location regarding petty cash accounts, gas and grocery card account information."
    },
    {
      "duty": "Review and process vehicle maintenance requests and maintain records. Ensure routine maintenance is scheduled and performed as needed."
    },
    {
      "duty": "Process PNA invoices received from national, forward to representative payees, and maintain documentation in individuals file."
    },
    {
      "duty": "Train all staff initially upon hire and annually thereafter regarding proper safeguarding of individual funds and petty cash and gas/grocery account procedures."
    },
    {
      "duty": "Retrieve funds, credit cards, receipts, keys, and all property belonging to COI, audits and verifies accounts when a Program Manager or designee maintaining accounts terminates employment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor Degree preferred. 1+ year of related work experience (Accounting). Previous experience as an Office Manager preferred. Working proficiency in Microsoft Suite. Valid Driver's License."
    }
  ]
}