{
  "meta": [
    {
      "job_title": "Patient Access Rep",
      "job_category": "Healthcare",
      "job_class": "Representative",
      "sector": "Healthcare",
      "salary": 36000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Greet, pre-register and/or register patients in a courteous and professional manner, verify insurance benefits and check for the necessity of pre-certification, authorization and referral."
    },
    {
      "duty": "Provide professional, quality customer service, timely resolution to customer problems, and coordination of services to all customers."
    },
    {
      "duty": "Communicate revenue cycle related issues to patients, physicians, physician office staff, and other hospital colleagues."
    },
    {
      "duty": "Verify and obtain insurance benefits and required referrals and pre-certifications for patients that have not been pre-registered before the patient is treated, immediately after the patient arrives, or, if necessary, within one business day of the patient’s treatment."
    },
    {
      "duty": "Meet the needs of the patient, physician, physician office, and internal colleagues by maintaining good public relation skills."
    },
    {
      "duty": "Properly and accurately register patients utilizing legal name and date of birth and immediately issue patient identification bracelet at the end of the registration process."
    },
    {
      "duty": "Process admissions in a timely and accurate manner to include service location."
    },
    {
      "duty": "Maintain ongoing relationship with Care Coordination as required by departmental processes."
    },
    {
      "duty": "Strive to recognize the cultural beliefs, values, traditions, language preferences, and health practices of the communities that we serve."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Healthcare Administration or related field (Certification in Patient Access preferred)"
    }
  ]
}