{
  "meta": [
    {
      "job_title": "Vice President, Segments",
      "job_category": "Growth",
      "job_class": "Vice President",
      "sector": "Business Development",
      "salary": 180000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Online Presence Management",
      "experience": 10
    },
    {
      "skill": "Event Planning",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Digital Marketing",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Organizational Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive business strategies to establish and expand a national program for leading segments."
    },
    {
      "duty": "Lead a team of Segment Leaders, providing strategic direction and leadership to support growth plans."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's online presence, activating an operational backbone inclusive of consistent reporting, planning templates, etc., to ensure sales enablement and efficiency."
    },
    {
      "duty": "Plan and execute a sales channel strategy that optimizes coverage, reach, and prospect engagement."
    },
    {
      "duty": "Develop and execute a professional development framework to enhance the skills, knowledge, and capabilities of professionals leading the segments."
    },
    {
      "duty": "Foster a culture of innovation, research, and knowledge creation within the industry."
    },
    {
      "duty": "Foster collaboration and alignment across segments and practice areas and with shared services teams."
    },
    {
      "duty": "Drive operational excellence across the segments, seeking ways to optimize processes and utilize firm tools to produce profitable results for the national segment model."
    },
    {
      "duty": "Set and monitor objectives and key results (OKRs) in alignment with the firm-wide OKRs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Marketing, Operations, or a related field. Master’s degree preferred."
    }
  ]
}