{
  "meta": [
    {
      "job_title": "Team Leader",
      "job_category": "Sales",
      "job_class": "Supervisor",
      "sector": "Sales",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Provide daily direction to the associates within the department in areas such as merchandise presentation, inventory control, pricing, sales enhancements, stocking, and customer service activities."
    },
    {
      "duty": "Support the achievement of Departmental Sales, Gross Margin, Inventory Shrinkage, and Payroll Goals under the direction of the Group Sales or Department Manager."
    },
    {
      "duty": "Assist in staffing the department with 'service' oriented associates, participate in interviewing, make recommendations for selection, coordinate training, and consult with GSM and HR Manager."
    },
    {
      "duty": "Resolve customer and associate opportunities with GSM / DM and HR Manager, maintaining a high level of personal customer service and achieving better than Company average customer service results."
    },
    {
      "duty": "Remain a product 'expert' through ongoing product knowledge training, and conduct product demos to the entire staff."
    },
    {
      "duty": "Assist in carrying out supervisory responsibilities, including interviewing, training, planning, assigning and directing work, measuring and evaluating performance, addressing complaints, and maintaining a positive working environment for all associates."
    },
    {
      "duty": "Assist customers in making buying decisions by identifying and evaluating customers' needs, making product recommendations, and promoting programs including CLUB Membership, VOC, and In-Store Pick-up."
    },
    {
      "duty": "Perform all other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent"
    }
  ]
}