{
  "meta": [
    {
      "job_title": "Warehouse Worker",
      "job_category": "Warehouse Operations",
      "job_class": "Worker",
      "sector": "Logistics",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Material Handling Equipment Operation",
      "experience": 2
    },
    {
      "skill": "Inventory Control",
      "experience": 2
    },
    {
      "skill": "Organization",
      "experience": 2
    },
    {
      "skill": "Problem Solving",
      "experience": 2
    },
    {
      "skill": "Computerized Warehouse System",
      "experience": 2
    },
    {
      "skill": "Teamwork",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Transport goods and supplies into and around the warehouse to ensure on time delivery of goods and supplies."
    },
    {
      "duty": "Deliver general warehouse tasks using various material handling equipment to ensure all goods and supplies are stored and recorded with agreed procedures."
    },
    {
      "duty": "Perform basic inventory control tasks and checks on quantities, quality, and availability against records following established inventory control procedures."
    },
    {
      "duty": "Follow mandatory procedures to ensure that work is carried out to the required quality standards and/or to ensure adherence to external regulatory codes and internal codes of conduct."
    },
    {
      "duty": "Adhere to the organization's Health, Safety and Environmental (HS&E) policies, procedures and mandatory instructions to identify and mitigate environmental risks and risks to oneself and others in the workplace."
    },
    {
      "duty": "Utilize and understand the warehouse operating systems to receive, print orders and locate inventory on the floor."
    },
    {
      "duty": "Develop and maintain excellent skills by participating in assessment and development planning activities as well as formal and informal training and coaching."
    },
    {
      "duty": "Perform additional duties as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED preferred."
    }
  ]
}