{
  "meta": [
    {
      "job_title": "Director of Compliance and Training",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Management",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serves as a part of the management team and shares in the professional review of over 4,000 applications for federal financial aid, as well as local, state and national scholarships in terms of determining eligibility for aid programs."
    },
    {
      "duty": "Responsible for the review of special applicant groups such as homeless, special circumstance and dependency overrides. In addition, to the coordination of training, activities & processes to ensure compliance."
    },
    {
      "duty": "Assist students and parents with the application processes, which include: FASFA completion, leading the over award review, serving as liaison with reverify and with the verification process, leads the eligibility review process, and coordinates the withdrawal calculation process as well as packaging, verification and the SAP review, while overseeing the applicant appointment process, virtual and in person."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Finance, or related field (Master's preferred)"
    },
    {
      "credential": "3 years professional experience with both determining eligibility and awarding for both graduate and undergraduate Federal Student Aid and supervisory experience."
    },
    {
      "credential": "Experience with processing using the Banner system."
    },
    {
      "credential": "Consideration will be given if the Candidate possesses less than the 3 years required but is currently working in a similar position. Supervisory experience is preferred."
    }
  ]
}