{
  "meta": [
    {
      "job_title": "Watershed Management Director",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Public Works",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Terminology",
      "experience": 5
    },
    {
      "skill": "Construction Project Management",
      "experience": 5
    },
    {
      "skill": "Engineering",
      "experience": 5
    },
    {
      "skill": "Water Resource Management",
      "experience": 5
    },
    {
      "skill": "Grant Writing",
      "experience": 5
    },
    {
      "skill": "Computer Skills (Microsoft)",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 5
    },
    {
      "skill": "Legal Document Interpretation",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Wastewater Plant Operations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages the overall administration and management of the City's Watershed, including program implementation, fundraising/grant writing, and business operations."
    },
    {
      "duty": "Provides direct management responsibility for the day-to-day operations of functional areas such as Revenue Forecasting, Budgeting, Cash Flow Management, and General Accounting Operations."
    },
    {
      "duty": "Develops policy and writes rules, regulations, and ordinances for environmental protection and land development in the City of Atlanta."
    },
    {
      "duty": "Manages the operation of the Watershed Information Systems, providing IT and GIS support for the Department of Watershed Management."
    },
    {
      "duty": "Acts as a decision-maker, establishing organization strategy and policy within required legislative or executive limitations."
    },
    {
      "duty": "Provides guidance to a varied group of Managers and Supervisors engaged in an organization-wide or policy-advisory activity."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Business, Management or Public Administration. (Equivalent professional experience may be considered for substitution for the master’s degree on an exception basis)"
    },
    {
      "credential": "Professional Engineer License required for Site Development. Georgia Soil & Water Conservation Commission (GSWCC) Level II Certification. Must be obtained within 6 months."
    }
  ]
}