{
  "meta": [
    {
      "job_title": "Special Education Teacher",
      "job_category": "Education",
      "job_class": "Teacher",
      "sector": "Education",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Fosters an educational environment conducive to the learning and maturation process of assigned special education students; plans an instructional program designed to meet individual student needs; prepares individual student lesson plans; adapts and modifies programs and plans as necessary."
    },
    {
      "duty": "Uses necessary and appropriate instructional methods and materials, which are suited to the well-being of the students and to the nature of the learning activities, program and/or curriculum involved; implements established program or curriculum objectives as adapted and modified for the student population; attends in-service training and continues to improve professional growth through study and experimentation to remain current in methods and techniques for special education instruction."
    },
    {
      "duty": "Establishes and implements, in a positive and supportive manner, classroom policies and procedures governing student behavior and conduct; provides guidance, counseling, and discipline to encourage students to meet standards of achievement and conduct; makes referrals for assistance where appropriate."
    },
    {
      "duty": "Confers with students, parents or guardians, specialists and other staff: maintaining an open positive relationship as appropriate to provide guidance and evaluation, and to encourage student achievement."
    },
    {
      "duty": "Establishes classroom goals and objectives appropriate to the special education student population and their individual education programs, following the rules and regulations governing special education, and in conformance with courses of study specified by State and School District statutes, regulations and guidelines; evaluates and records student progress; prepares reports for parents or guardians."
    },
    {
      "duty": "Directs the activities of assigned non-certificated personnel; attends to or directs staff to attend to the physical, emotional, behavioral, medical, or hygienic needs of students as appropriate; monitors conditions and behaviors."
    },
    {
      "duty": "Collects and interprets a variety of data; develops, implements and evaluates individual education plans (IEP's); provides reports for administrative purposes; amends documents where appropriate."
    },
    {
      "duty": "Attends or participates in all required staff meetings and other activities deemed necessary by the District and/or building principal, in order to accomplish the objectives of the position and for professional achievement."
    },
    {
      "duty": "Serves on staff committees as required.Participates in a variety of activities to enhance personal and professional skills.Performs related tasks consistent with the scope and responsibilities of the position.Attends at least one of two annual Special Education Compliance Professional Development days."
    }
  ],
  "skills": [
    {
      "skill": "Behavior Management",
      "experience": 5
    },
    {
      "skill": "Special Education Instruction",
      "experience": 5
    },
    {
      "skill": "Lesson Planning",
      "experience": 5
    },
    {
      "skill": "Guidance and Counseling",
      "experience": 5
    },
    {
      "skill": "Data Collection and Interpretation",
      "experience": 5
    },
    {
      "skill": "Classroom Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree with a teaching certification in Special Education (Master's degree preferred)"
    }
  ]
}