{
  "meta": [
    {
      "job_title": "Accountant",
      "job_category": "Finance",
      "job_class": "Senior Accountant",
      "sector": "Accounting",
      "salary": 91000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Accounting Principles",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Internal Audit",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Forecasting",
      "experience": 5
    },
    {
      "skill": "CPA Qualification",
      "experience": 5
    },
    {
      "skill": "Bilingual Proficiency (Spanish/French)",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform accounting functions and conduct the theory and practice of recording, classifying, examining, and analyzing data and records of financial transactions."
    },
    {
      "duty": "Review Country Office financial performance on a monthly basis including balance sheet reconciliations and activity reviews."
    },
    {
      "duty": "Process and record journal entries, and respond to inquiries and assist in trainings."
    },
    {
      "duty": "Maintain general ledger accounts and supporting sub-ledgers, and produce various accounting reports."
    },
    {
      "duty": "Participate in various accounting projects including external or internal audits, system upgrades, changes to accounting processes or procedures, and other projects as assigned."
    },
    {
      "duty": "Apply accounting principles and practices to a limited range of accounting and/or other fiscal functions."
    },
    {
      "duty": "Provide support for field programs by conducting live meeting training on financial systems and processes."
    },
    {
      "duty": "Review Country Office monthly financial reports and balance sheet reconciliations, and assist in various financial analysis projects and closure of accounting records."
    },
    {
      "duty": "Independently apply accounting principles and practices to a variety of accounting, budgeting, forecasting, cost accounting, and/or other fiscal functions."
    },
    {
      "duty": "Prepare reports and statements requiring interpretation and analysis, and ensure daily operations of the accounting systems."
    },
    {
      "duty": "Respond to new or changing management requests related to audit and fiscal procedures, account structures or reports, and accounting systems."
    },
    {
      "duty": "Perform other duties as assigned."
    },
    {
      "duty": "Apply in-depth knowledge of Generally Accepted Accounting Principles (GAAP), theories, and systems design."
    },
    {
      "duty": "Research, analyze, and ensure implementation of new and/or changing accounting and reporting systems."
    },
    {
      "duty": "Make risk assessment of internal financial control systems and may be requested to suggest improvements or changes in processes."
    },
    {
      "duty": "Convey concise, comprehensive, and accurate findings on matters of a complex nature in written form."
    },
    {
      "duty": "Convey issues of a complex nature in a clear, concise, and organized manner, and may consult and/or negotiate with senior management / external entities for the purpose of funding levels, cost allocations, or related financial issues."
    },
    {
      "duty": "Assist in the preparation of field office risk assessment reports."
    },
    {
      "duty": "Independently resolve issues of moderate to advanced complexity."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree or its International Equivalent - Accounting, Business Administration, Finance or Related Field."
    },
    {
      "credential": "CPA preferred."
    },
    {
      "credential": "Bi-lingual Spanish and / or French preferred."
    }
  ]
}