{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Information Security",
      "experience": 4
    },
    {
      "skill": "Risk Management",
      "experience": 6
    },
    {
      "skill": "Stakeholder Management",
      "experience": 6
    },
    {
      "skill": "Communication",
      "experience": 6
    },
    {
      "skill": "Team Management",
      "experience": 6
    },
    {
      "skill": "Budget Management",
      "experience": 6
    },
    {
      "skill": "Strategic Planning",
      "experience": 6
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 6
    },
    {
      "skill": "Issue Resolution",
      "experience": 6
    },
    {
      "skill": "Project Reporting",
      "experience": 6
    },
    {
      "skill": "Consulting",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and direct multiple projects under the guidance of Project Management Office (PMO) leadership."
    },
    {
      "duty": "Identify and document project requirements, support clients on various information security initiatives, and manage issues to resolution."
    },
    {
      "duty": "Responsible for all aspects of the project over the entire life cycle with a focus on project risk management, forecasting challenges, and devising strategies to overcome them."
    },
    {
      "duty": "Drive project progress across multiple stakeholders and levels of oversight, ensuring timely and effective resource utilization."
    },
    {
      "duty": "Develop strategic project delivery plans, detailed schedules, project controls, cost forecasting, risk management, issues forecast and resolution planning, and daily task management."
    },
    {
      "duty": "Monitor the project budget, milestones, and deliverables to ensure timely completion and uninterrupted progress."
    },
    {
      "duty": "Report project performance metrics and status reports to internal and external stakeholders and the PMO. Coordinate and manage projects across various functional groups, communicating potential risks and impacts."
    },
    {
      "duty": "Establish communication plans to facilitate core project team coordination and provide status updates to management and extended project team members."
    },
    {
      "duty": "Implement project management controls to ensure projects are delivered on time, within budget, and meet customer expectations."
    },
    {
      "duty": "Maintain strong and seamless relationships by maintaining communications about the project to the team, clients, and delivery personnel."
    },
    {
      "duty": "Collaborate with peers during project execution to track dependencies, project issues, and potential risks."
    },
    {
      "duty": "Consolidate and report project performance metrics and status reports to internal and external stakeholders and the PMO."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 60,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "BA or BS in Computer Science, Management Information Systems, or related field. Advanced degree is desirable. Project Management Professional (PMP) certification strongly preferred."
    }
  ]
}