{
  "meta": [
    {
      "job_title": "Community Manager",
      "job_category": "Property Management",
      "job_class": "Management",
      "sector": "Residential Property Management",
      "salary": 82000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Satisfaction",
      "experience": 3
    },
    {
      "skill": "Financial Management",
      "experience": 3
    },
    {
      "skill": "Marketing Execution",
      "experience": 3
    },
    {
      "skill": "Sales and Marketing",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Budgeting",
      "experience": 3
    },
    {
      "skill": "Property Inspection",
      "experience": 3
    },
    {
      "skill": "Multifamily Property Management",
      "experience": 3
    },
    {
      "skill": "Fair Housing Laws",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Recruit, lead, motivate, and develop a high-performing and diverse staff. Provide coaching, guidance, ongoing feedback, and light mediation."
    },
    {
      "duty": "Prepare, execute, and truly own the property’s operational budget. Utilize an online accounting system such as Yardi to generate and review reports to ensure the property is within budgeted expectations and make recommendations for cost savings and revenue-generating opportunities."
    },
    {
      "duty": "Oversee customer collections and implement legal proceedings when necessary."
    },
    {
      "duty": "Ensure budgeted occupancy levels at budgeted rental rates are in conjunction with other goals of the property."
    },
    {
      "duty": "Prepare and conduct property inspections and corporate or investor tours."
    },
    {
      "duty": "Ensure the effective execution of marketing programs per branding and marketing standards."
    },
    {
      "duty": "Represent and ensure the content for the property is represented accurately on marketing assets such as the property website and social media."
    },
    {
      "duty": "Increase resident satisfaction through lease renewal strategies and resident retention plans."
    },
    {
      "duty": "Serve as a company ambassador by effectively and professionally managing residents’ concerns."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Property Management, Business, or a related field (Master's preferred)"
    }
  ]
}