{
  "meta": [
    {
      "job_title": "Sales Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "salary": 45000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Consult virtually with America's businesses, through self-generated activity to educate stakeholders on our services, and provide consultative solutions to increase market share and drive revenue."
    },
    {
      "duty": "Achieve unit and revenue expectations."
    },
    {
      "duty": "Create, manage, and advance accounts, leads, and opportunities in company’s CRM system (Salesforce) and provide accurate sales activity and forecasts."
    },
    {
      "duty": "Presents Paychex payroll products and services to final decision makers and end users within the prospect universe to educate them on our services with the goal of having them become a Paychex Payroll client."
    },
    {
      "duty": "Schedule and conduct meetings with new prospects through telephone calls, targeted email campaigns, and corporate marketing programs, as directed by Sales Management."
    },
    {
      "duty": "Leverage the Go-to-Market Sales Strategy to identify customers’ needs and present the Paychex solution to key stakeholders and decision makers to increase revenue and market share."
    },
    {
      "duty": "Develop sales skills and maintain a comprehensive understanding of the Paychex product offering to optimize sales results; remain up-to-date with new product initiatives, services, industry trends and other relevant information of interest to customers."
    },
    {
      "duty": "Collect, complete and submit all necessary paperwork for new sales within defined Service Level Agreement (SLA) guidelines."
    },
    {
      "duty": "When required, address and escalate client concerns to our Service Partners, and follow-up as necessary to ensure satisfactory resolution."
    },
    {
      "duty": "May be required to travel for purposes of visiting channel partners, attending sales incentive trips, ongoing training, and/or area meetings."
    },
    {
      "duty": "Upholds and demonstrates the Paychex Values with every interaction internally and externally."
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Marketing",
      "experience": 1
    },
    {
      "skill": "CRM",
      "experience": 1
    },
    {
      "skill": "Payroll Services",
      "experience": 1
    },
    {
      "skill": "Cold Calling",
      "experience": 1
    },
    {
      "skill": "Client Relationship Management",
      "experience": 1
    },
    {
      "skill": "Travel",
      "experience": 1
    },
    {
      "skill": "Service Resolution",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "H.S. Diploma - Required"
    },
    {
      "credential": "Bachelor's Degree - Preferred"
    },
    {
      "credential": "2 years of experience in Relevant Sales/Marketing."
    }
  ]
}