{
  "meta": [
    {
      "job_title": "Home Health LPN",
      "job_category": "Healthcare",
      "job_class": "Licensed Practical Nurse",
      "sector": "Healthcare",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide professional nursing services under the direction of a RN in compliance with the state's Nurse Practice Act, any applicable licensure/certification requirement, applicable healthcare standards, governmental laws and regulations, and Gentiva Health Services policies and procedures."
    },
    {
      "duty": "Provide skilled nursing interventions in the treatment of the patient/clients illness, rehabilitative needs and preventative care."
    },
    {
      "duty": "Utilize a holistic approach in the provision of problem specific therapeutic interventions, teaching and training activities in accordance with the plan of care."
    },
    {
      "duty": "Confer with the RN Supervisor regarding needed changes in the Plan of Treatment."
    },
    {
      "duty": "Maintain contact with patients, physicians, clinical manager(s), other members of the healthcare team in a timely manner regarding patient/family needs and status changes."
    },
    {
      "duty": "Maintain the highest standards of professional conduct in relation to information that is confidential in nature."
    },
    {
      "duty": "Prepare, submit and maintain documentation as required by the Company and/or facility. Visit/shift notes documented on day services are rendered."
    },
    {
      "duty": "Coordinate and manage patient care as appropriate."
    }
  ],
  "skills": [
    {
      "skill": "Nursing Care",
      "experience": 2
    },
    {
      "skill": "Rehabilitation Care",
      "experience": 2
    },
    {
      "skill": "Patient Education",
      "experience": 2
    },
    {
      "skill": "Clinical Practice",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Documentation",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an accredited Licensed Practical Nursing Program or accredited School of Vocational Nursing."
    },
    {
      "credential": "Current nursing license in the practicing state."
    },
    {
      "credential": "Valid drivers license, auto insurance and reliable transportation."
    },
    {
      "credential": "Current CPR certification."
    },
    {
      "credential": "Two years experience as an LPN/LVN in a clinical setting, preferably in a home health or hospice setting."
    }
  ]
}