{
  "meta": [
    {
      "job_title": "Sustainability Program Coordinator",
      "job_category": "Sustainability",
      "job_class": "Coordinator",
      "sector": "Finance",
      "salary": 97000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Cross-functional Communication",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "ESG/Sustainability Knowledge",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Event Coordination",
      "experience": 5
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate internal tracking and reporting across multiple functional teams to support execution of firm-wide project plans and sustainability roadmap."
    },
    {
      "duty": "Support charitable donation process and filing and distribution of Global Foundation mail."
    },
    {
      "duty": "Maintain team master files to support efficiency and organization across team’s broad mandate, including library of shared documents, reports, and other content in support of firm-wide initiatives."
    },
    {
      "duty": "Support team in scheduling meetings, developing agendas, circulating meeting minutes, and tracking requests, action items and issue resolution to advance regional objectives across the firm."
    },
    {
      "duty": "Maintain team budget process, ensure accurate tracking and timely reporting, processing of travel and expenses and other departmental expenses."
    },
    {
      "duty": "Support vendor onboarding, track and process invoices, and support necessary approval processes."
    },
    {
      "duty": "Assist with other team activities, coordinating events as needed, handling of guests, including supporting Group Head and engaging with a variety of internal and external stakeholders."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Finance, or a related field (Master's preferred)"
    }
  ]
}