{
  "meta": [
    {
      "job_title": "Merchandising Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Retail Management",
      "experience": 5
    },
    {
      "skill": "Sales Performance Analysis",
      "experience": 5
    },
    {
      "skill": "Merchandising",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Staffing and Training",
      "experience": 5
    },
    {
      "skill": "Fashion Apparel Merchandising",
      "experience": 5
    },
    {
      "skill": "Computer Software Proficiency",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitor the store’s sales performance on a daily basis utilizing all available sales reports."
    },
    {
      "duty": "Provide guidance to the receiving team associates to expedite the flow of merchandise from the receiving area to the sales floor."
    },
    {
      "duty": "Coordinate sales promotions activities, floor sets, and ensure accurate pricing of store merchandise."
    },
    {
      "duty": "Oversee floor moves, preparation of merchandise displays and presentations consistent with merchandising concepts and guidelines."
    },
    {
      "duty": "Support the Store Manager to resolve store merchandising issues, and obtain guidance for best practices including comparative shopping analysis, fast and slow selling classifications and styles, and customer requests."
    },
    {
      "duty": "Ensure merchandise is sized in compliance to standards, signage is appropriately replaced and updated, ticketing is accurate and up to date, and packaged merchandise is sealed."
    },
    {
      "duty": "Support the Store Manager and others in areas including but not limited to staffing, sourcing, interviewing, training, and succession planning."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Retail Management, Business, or a related field (Master's preferred)"
    }
  ]
}