{
  "meta": [
    {
      "job_title": "BSA Specialist",
      "job_category": "Banking",
      "job_class": "Specialist",
      "sector": "Banking",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the timely filing of Currency Transaction Reports (CTRs), Suspicious Activity Reports (SARs), as well as compliance with other BSA recordkeeping requirements and reporting such as 314a and OFAC (daily)."
    },
    {
      "duty": "Conduct monitoring of client activity to identify instances which may require additional reporting and/or review."
    },
    {
      "duty": "Provide training and act as the Bank’s Subject Matter Expert for associates related to the Bank's BSA Compliance Program."
    },
    {
      "duty": "Conduct High Risk Customer Account reviews, initial and ongoing."
    },
    {
      "duty": "Create and provide reports for the Board of Directors."
    },
    {
      "duty": "Act as a point of contact for Federal and State Regulatory agencies as part of routine exams."
    },
    {
      "duty": "Completes enhanced due diligence on identified customers, assesses the overall risk and completes necessary documentation of findings."
    },
    {
      "duty": "Analyzes high-risk customers and other identified accounts for unusual and suspicious activity."
    },
    {
      "duty": "Works collaboratively with banks to understand bank customers; communicates internally to all lines of business to obtain additional information and further documentation to complete analysis of identified accounts."
    },
    {
      "duty": "Completes annual targeted reviews of customers such as; ATM owners/operators and Money Service Businesses."
    },
    {
      "duty": "Files Currency Transaction Reporting Exemptions (DOEP) with FinCEN and completes the annual reviews."
    },
    {
      "duty": "Ensures that EDD files are maintained and thoroughly documented."
    },
    {
      "duty": "Recommends customers for closure and for further investigation where risk tolerances are exceeded based on EDD reviews."
    },
    {
      "duty": "Provides prompt escalation of BSA findings to appropriate management."
    },
    {
      "duty": "Attends BSA training sessions as directed by management."
    },
    {
      "duty": "Provides other assistance as requested to the BSA/AML Officers in the daily responsibilities of managing the Bank’s BSA/AML and OFAC Compliance Program."
    },
    {
      "duty": "Other job related duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "BSA/AML Knowledge",
      "experience": 3
    },
    {
      "skill": "Banking Regulations",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Financial Compliance",
      "experience": 3
    },
    {
      "skill": "Verbal Communication",
      "experience": 3
    },
    {
      "skill": "Written Communication",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of 2-3 years of banking experience required"
    },
    {
      "credential": "Minimum of 2-3 years of BSA/AML experience required"
    },
    {
      "credential": "High school diploma or general education degree"
    }
  ]
}