{
  "meta": [
    {
      "job_title": "Driver - Mobile Van OTP (Opioid Treatment Program)",
      "job_category": "Transportation",
      "job_class": "Driver",
      "sector": "Healthcare",
      "salary": 38000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Drive company vehicles in a safe and conscientious manner complying with company policies and state transportation laws."
    },
    {
      "duty": "Interact with staff and patients in a professional manner, report any suspicious behavior to the Clinic Director and/or supervisors."
    },
    {
      "duty": "Monitor parking area to ensure no loitering or misconduct takes place, monitor the area to ensure safety and patient-compliance, and complete frequent sweeps around the entire unit."
    },
    {
      "duty": "Drive mobile unit to destination as scheduled and timely."
    },
    {
      "duty": "Assist patients as they get into and out of the vehicle."
    },
    {
      "duty": "Operate wheelchair lifts as needed when applicable."
    },
    {
      "duty": "Report traffic delays enroute back to supervisor."
    },
    {
      "duty": "Report any incidents or accidents to supervisor."
    },
    {
      "duty": "Complete daily visual of vehicle before and after each trip and report any problems in writing."
    },
    {
      "duty": "Check the vehicle to ensure there is an appropriate amount of fuel in the tank prior to leaving the facility."
    },
    {
      "duty": "Maintain accurate logbooks, including weekly, quarterly, and annual maintenance checks."
    },
    {
      "duty": "Maintain vehicle cleanliness and remove trash from the vehicle."
    },
    {
      "duty": "Schedule, organize, and coordinate vehicle maintenance and repair service shop appointments."
    },
    {
      "duty": "Comply with organizational policies, procedures, and performance improvement initiatives and maintain confidentiality."
    },
    {
      "duty": "Communicate clearly and effectively to patients and their family members, guests, and other members of the healthcare team."
    },
    {
      "duty": "Exhibit therapeutic rapport with patients maintaining professional boundaries, being respectful of personal space, and giving patients direct attention while maintaining rational detachment."
    },
    {
      "duty": "Develop constructive and cooperative working relationships with others and maintain them over time."
    },
    {
      "duty": "Encourage and build mutual trust, respect, and cooperation among team members."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 20,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED equivalent"
    }
  ]
}