{
  "meta": [
    {
      "job_title": "Survey Project Manager",
      "job_category": "Engineering",
      "job_class": "Project Manager",
      "sector": "Construction",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Surveying",
      "experience": 8
    },
    {
      "skill": "Team Management",
      "experience": 8
    },
    {
      "skill": "AutoCAD Civil 3D",
      "experience": 8
    },
    {
      "skill": "Project Planning",
      "experience": 8
    },
    {
      "skill": "Mentoring",
      "experience": 8
    },
    {
      "skill": "ALTA Surveys",
      "experience": 8
    },
    {
      "skill": "Construction Planning",
      "experience": 8
    },
    {
      "skill": "GPS Data Collection",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate and lead a team responsible for drafting, reviewing, and finalizing preliminary and final site plans and construction documents."
    },
    {
      "duty": "Review project survey data utilizing the latest technology and industry software."
    },
    {
      "duty": "Plan, organize and supervise survey crews, technicians and office staff members."
    },
    {
      "duty": "Provide oversight on large scale ALTA surveys as they pertain to solar or wind power generation."
    },
    {
      "duty": "Provide construction-related services and guide junior team members to complete items such as permit applications, cut sheets, quantity estimates, and transmittals; organize site plans, construction plans, construction sheet set-up and assembly and other related construction documents."
    },
    {
      "duty": "Attend paid training and development events, industry conferences, and networking opportunities."
    },
    {
      "duty": "Assist with your staff's new hire training plan, career planning, and continuous professional development at Atwell."
    },
    {
      "duty": "Reward and motivate your staff with spot bonuses and Peer Recognition Rewards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Professional Survey License, or the ability to obtain 8+ plus years of survey industry related work experience"
    }
  ]
}