{
  "meta": [
    {
      "job_title": "Service Technician",
      "job_category": "Technician",
      "job_class": "Entry Level",
      "sector": "Service",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Skills",
      "experience": 3
    },
    {
      "skill": "Computer Skills",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Maintenance",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Trade Tooling",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Diagnose, inspect, recondition, repair, assemble, and service equipment as assigned."
    },
    {
      "duty": "Document machine information and repairs completed on work order, including parts and fluids used."
    },
    {
      "duty": "Maintain a clean work area, care for all shop tools, machines, and equipment."
    },
    {
      "duty": "Follow all safety rules and regulations while performing work assignments and adhere to all policies and procedures as specified in company manuals and employee handbook."
    },
    {
      "duty": "Conduct self professionally in the presence of customers and community to represent a professional image of the company."
    },
    {
      "duty": "Seek and participate in available company-sponsored training to develop and advance knowledge base and skill set."
    },
    {
      "duty": "Participate in all company/location driven communication efforts and maintain a positive and professional working relationship with peers, management, and support resources."
    },
    {
      "duty": "Perform all other duties as assigned by management in a professional and efficient manner."
    },
    {
      "duty": "Maintain a GPA of 3.0 during the program and acceptable attendance records."
    },
    {
      "duty": "Provide a copy of transcripts and diploma to RDO Equipment Co. to receive the financial incentive and sign on bonus upon full-time employment."
    },
    {
      "duty": "Adhere to academic policies, rules, and regulations set forth by the higher learning center the student is attending."
    },
    {
      "duty": "Accept full-time employment within RDO Equipment Co. following graduation."
    },
    {
      "duty": "Location and schedule to be determined based on availability."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 100,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Enrollment or attendance in an approved Heavy Equipment Service, Diesel Technology, or other technical service program approved by RDO Equipment Co."
    },
    {
      "credential": "Valid work authorization and ability to work in the U.S. Without company sponsorship."
    }
  ]
}