{
  "meta": [
    {
      "job_title": "Pharmaceutical Sales Specialist",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Proficiency",
      "experience": 5
    },
    {
      "skill": "Healthcare Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Clinical Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership Skills",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop superior product and disease state knowledge and effectively educate and engage healthcare professionals in dialogue about clinical evidence, approved indications, and product efficacy/safety profiles to support on-label prescribing for appropriate patients."
    },
    {
      "duty": "Function independently with a high degree of sales proficiency to drive sales performance and ensure sales forecasts and assigned budgets meet or exceed therapeutic and territory expectations."
    },
    {
      "duty": "Develop and maintain in-depth knowledge of market, demographic, and managed care information relative to your assigned sales territory."
    },
    {
      "duty": "Work with the Regional Sales Director and District Sales Manager to develop a local strategy and business plan to generate recognizable increases of sales in your territory."
    },
    {
      "duty": "Capitalize on formulary approvals and other opportunities through effective implementation of the Strategic Targeting Plans by using a wide variety of promotional, personnel resources and analytical tools to maximize effectiveness in assigned sales territory, based on local assessment of customer needs."
    },
    {
      "duty": "Provide special education to healthcare providers through appropriate programs that fall within the company’s ethical guidelines. Work with other Pharmaceutical Sales Specialists around common objectives to coordinate selling efforts."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in the medical, healthcare, or pharmacy field (Master's preferred)"
    },
    {
      "credential": "Valid driver’s license and safe driving record"
    }
  ]
}