{
  "meta": [
    {
      "job_title": "Corporate Development Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 2
    },
    {
      "skill": "Valuation Modeling",
      "experience": 2
    },
    {
      "skill": "Market Research",
      "experience": 2
    },
    {
      "skill": "Business Analysis",
      "experience": 2
    },
    {
      "skill": "Due Diligence",
      "experience": 2
    },
    {
      "skill": "Financial Modeling Software",
      "experience": 2
    },
    {
      "skill": "Written Communication",
      "experience": 2
    },
    {
      "skill": "Verbal Communication",
      "experience": 2
    },
    {
      "skill": "Industry Trends",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with cross-functional teams to identify potential acquisition targets, strategic partnerships, and investment opportunities aligned with the company's growth objectives."
    },
    {
      "duty": "Conduct thorough market research and analysis to assess industry trends, competitive landscapes, and potential market disruptions that could impact strategic decision-making."
    },
    {
      "duty": "Perform financial analysis, including valuation modeling, to evaluate the financial viability and attractiveness of potential transactions."
    },
    {
      "duty": "Assist in the preparation of presentation materials, including investment memorandums, board presentations, and executive summaries, to communicate findings and recommendations to senior leadership."
    },
    {
      "duty": "Support due diligence efforts by coordinating with internal and external stakeholders to gather necessary information, conduct assessments, and address potential risks."
    },
    {
      "duty": "Participate in negotiations and deal structuring activities to ensure favorable terms for the company while maintaining productive relationships with external parties."
    },
    {
      "duty": "Monitor and track post-transaction performance of acquired assets or partnerships to ensure strategic and financial objectives are being met."
    },
    {
      "duty": "Stay informed about industry trends, regulatory developments, and macroeconomic factors that could impact the company's strategic initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 30,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting or Finance (Master's preferred)"
    }
  ]
}