{
  "meta": [
    {
      "job_title": "Construction Project Manager",
      "job_category": "Construction",
      "job_class": "Project Manager",
      "sector": "Construction",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Attend necessary project presentations and pre-bid meetings."
    },
    {
      "duty": "Request and obtain additional information for bidding and project administration, including Building Rules and related materials."
    },
    {
      "duty": "Identify potential challenges and factors that might impact the project's execution."
    },
    {
      "duty": "Send out Invitations to Bid to subcontractors."
    },
    {
      "duty": "Review and distribute Project Coordinator-issued Addenda."
    },
    {
      "duty": "Create And Compile Project Qualifications For Estimating And Proposals."
    },
    {
      "duty": "Assist in crafting bid proposal forms, and submit them as instructed after marketing review."
    },
    {
      "duty": "Gather, update, propose, and initiate various project documents, including Project contracts with Clients/Owners."
    },
    {
      "duty": "Project Schedules."
    },
    {
      "duty": "RFIs, RFPs, and corresponding logs."
    },
    {
      "duty": "Building permits."
    },
    {
      "duty": "Special inspection requirements as mandated by City, State, Engineers, Architects, Labs, OSHA, Storm Compliance Officers, etc."
    },
    {
      "duty": "Assess and approve Submittals and Shop Drawings."
    },
    {
      "duty": "Define subcontract scope of work."
    },
    {
      "duty": "Review, endorse, and manage subcontract agreements and purchase orders for adherence to contractual terms."
    },
    {
      "duty": "Collaborate with the accounting team to secure bid bonds and performance bonds."
    },
    {
      "duty": "Generate RFIs and RFPs, collect responses from all relevant parties."
    },
    {
      "duty": "Create Pay Applications and track payment status from Clients."
    },
    {
      "duty": "Organize routine OAC meetings and prepare associated documentation."
    },
    {
      "duty": "Validate and authorize Subcontractor/Vendor invoices weekly, releasing them for payment."
    },
    {
      "duty": "Develop and distribute Certificates of Substantial Completion to Clients and Architects."
    },
    {
      "duty": "Generate preliminary punch lists (Pre-Punch) and ensure quality control."
    },
    {
      "duty": "Collaborate with the Architect on the final Punch List, expediting punch item resolution."
    },
    {
      "duty": "Facilitate expedited Closeout Documentation."
    },
    {
      "duty": "Contribute directly to OSC profits by achieving projects within established timelines and budgets."
    },
    {
      "duty": "Cultivate repeat clients to minimize marketing expenditures."
    },
    {
      "duty": "Foster positive relationships with Subcontractors."
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 3
    },
    {
      "skill": "Project Procurement",
      "experience": 3
    },
    {
      "skill": "Project Execution",
      "experience": 3
    },
    {
      "skill": "Profit Accountability",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "A minimum of 3 years of related experience or a degree in Construction Management."
    },
    {
      "credential": "Familiarity with Procore is a plus but not mandatory."
    },
    {
      "credential": "Completion of OSHA 30 certification within 90 days."
    },
    {
      "credential": "Proficiency with Microsoft Office Suite or similar software."
    }
  ]
}