{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 44500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Recruiting",
      "experience": 4
    },
    {
      "skill": "Delegation",
      "experience": 4
    },
    {
      "skill": "Planning and organizing",
      "experience": 4
    },
    {
      "skill": "Problem solving",
      "experience": 4
    },
    {
      "skill": "Cash-handling",
      "experience": 4
    },
    {
      "skill": "Advocating and empathizing",
      "experience": 4
    },
    {
      "skill": "Safety and Security",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Store Manager with oversight of the Station Store operations including hiring, supervising, and working with the staff to accomplish daily tasks, bookkeeping, and merchandising."
    },
    {
      "duty": "Maintain high standards and provide fast and friendly service to customers while executing the food program."
    },
    {
      "duty": "Lead a team of employees/management, recruit, interview, hire, delegate, follow-up, teach, motivate, plan, and organize."
    },
    {
      "duty": "Handle cash-handling and bookkeeping, solve problems, advocate and empathize, and ensure safety and security."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent plus 6 months to 1 year of retail and management work experience preferred."
    },
    {
      "credential": "Ability to work as scheduled including arriving to work on time."
    },
    {
      "credential": "Ability to accurately operate a variety of equipment including cash registers or scanners, hot or cold or beverage dispensers, and other machines or tools."
    },
    {
      "credential": "Required to have a valid driver’s license and dependable transportation."
    },
    {
      "credential": "Ability to work in the physical and work conditions described below."
    },
    {
      "credential": "Ability to work opposite shifts of the Store ManagerAbility to have open availability."
    }
  ]
}