{
  "meta": [
    {
      "job_title": "Oncology Acute Care Nurse Practitioner",
      "job_category": "Healthcare",
      "job_class": "Nurse Practitioner",
      "sector": "Healthcare",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medical Assessment",
      "experience": 5
    },
    {
      "skill": "Prescription Management",
      "experience": 5
    },
    {
      "skill": "Patient Counseling",
      "experience": 5
    },
    {
      "skill": "Diagnostic Interpretation",
      "experience": 5
    },
    {
      "skill": "Invasive Procedure Management",
      "experience": 5
    },
    {
      "skill": "Data Entry",
      "experience": 5
    },
    {
      "skill": "Clinical Collaboration",
      "experience": 5
    },
    {
      "skill": "Therapeutic Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assess the physical and mental condition of patients through comprehensive physical examinations and medical histories."
    },
    {
      "duty": "Order, collect, and interpret laboratory and diagnostic tests to evaluate patient problems and healthcare needs."
    },
    {
      "duty": "Prescribe, recommend, and employ medical drug therapies or other related therapeutic treatments and procedures, and recommend interventions to modify behavior associated with health risks."
    },
    {
      "duty": "Formulate and implement patient treatment plans based on assessments, evidence-based medicine, and collaboration with physicians and other interdisciplinary team members."
    },
    {
      "duty": "Counsel patients and families regarding medical processes, management of health illness, medication, nutrition, and health promotion."
    },
    {
      "duty": "Maintain appropriate records detailing patient treatment plans and outcomes, and initiate timely consultation and referral when necessary."
    },
    {
      "duty": "Provide consultation level services for conditions/problems related to the Provider’s specialty and training, and manage patients in healthcare settings beyond primary clinic setting."
    },
    {
      "duty": "Perform invasive procedures specific to scope of practice and competency as delegated by the supervising Physician."
    },
    {
      "duty": "May be required to perform patient care duties beyond regular schedule based on department coverage needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an Accredited Nurse Practitioner Program"
    },
    {
      "credential": "Current license to practice as a Nurse Practitioner in the state of Texas"
    },
    {
      "credential": "Basic Life Support (BLS) within 30 days of hire or transfer"
    },
    {
      "credential": "Acute Care Certified from an accredited board for the patient population of focus"
    }
  ]
}