{
  "meta": [
    {
      "job_title": "Admissions Records Processor",
      "job_category": "Education",
      "job_class": "Administrative",
      "sector": "Education",
      "salary": 45000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide mid-level admissions records processing by skillful examination and evaluation of student academic records to determine admission eligibility and transferable course credits."
    },
    {
      "duty": "Verify data in the GPA system to confirm accurate grade point averages on transcripts."
    },
    {
      "duty": "Correspond with officials of high schools and institutions of higher education concerning course credits and content comparability."
    },
    {
      "duty": "Review course work data in regard to the course level transcript evaluation; ensure that coursework is captured in the Perceptive imaging system and uploads to Student Information System (MyMav)."
    },
    {
      "duty": "Process admission documents in the workflow of the Perceptive Content imaging system in order to complete admissions files for admissions decisions."
    },
    {
      "duty": "Cross-trained to perform other admissions-related processes."
    },
    {
      "duty": "Perform work in ways that contribute to the university’s successful achievement of enrollment goals."
    },
    {
      "duty": "Perform related duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Academic Records Evaluation",
      "experience": 5
    },
    {
      "skill": "Student Correspondence",
      "experience": 5
    },
    {
      "skill": "Data Verification",
      "experience": 5
    },
    {
      "skill": "Workflow Processing",
      "experience": 5
    },
    {
      "skill": "Enrollment Goal Achievement",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED with a minimum of two (2) years of experience in a position requiring attention to detail and processing accuracy."
    },
    {
      "credential": "Previous experience in admissions in higher education (preferred)."
    }
  ]
}