{
  "meta": [
    {
      "job_title": "Wire Transfer Specialist",
      "job_category": "Finance",
      "job_class": "Specialist",
      "sector": "Banking",
      "salary": 55000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepares and processes all incoming and outgoing domestic and international wires in various currencies including wire exceptions."
    },
    {
      "duty": "Grants temporary wire limit increases or decreases for various bank division wire users."
    },
    {
      "duty": "Ensures data integrity and accuracy."
    },
    {
      "duty": "Complies with the requirements of Dodd Frank Wall Street Reform and Consumer Protection Act, Section 1073, Reg E, and NACHA."
    },
    {
      "duty": "Continuously looks for opportunities for the improvement and simplification of processes to enhance response time and to identify opportunities for increased efficiency."
    },
    {
      "duty": "Performs all required processes and procedures for domestic and international wires including reviewing all customer initiated wire forms and funds transfer agreements."
    },
    {
      "duty": "Serves as point of contact for separation of duties for phone call-backs to customers on all centralized outgoing customer wire requests."
    },
    {
      "duty": "Processes all outgoing customer initiated wire requests."
    },
    {
      "duty": "Reviews all wire forms received from customer, including verification of signers on wires forms, verification of funds transfer agreement and limits for each signer as applicable."
    },
    {
      "duty": "Completes data entry of wire instructions into wire system."
    },
    {
      "duty": "Performs dual verification of wire data entry prior to releasing wire."
    },
    {
      "duty": "Processes wire exceptions from wire queues."
    },
    {
      "duty": "Enters data on productivity log daily."
    },
    {
      "duty": "Ensures daily funds settlement file of all domestic wires is received and processed with core processor."
    },
    {
      "duty": "Reconciles daily domestic and international wires each day back to core processor and Federal Reserve Bank."
    },
    {
      "duty": "Updates and maintains daily wire volume and end-of-day balancing reports."
    },
    {
      "duty": "Processes and maintains bank division funds transfer agreements."
    },
    {
      "duty": "Receives and verifies signers and limits on funds transfer agreements between the Wire Department and Synovus divisions."
    },
    {
      "duty": "Updates domestic wire authorized signers against leave of absence and termination reports."
    },
    {
      "duty": "Scans all funds transfer agreements into KoFax to provide access to domestic wire team."
    },
    {
      "duty": "Researches and resolves simple issues that arise regarding wire transfers."
    },
    {
      "duty": "Coordinates resolution between bank branches, Information Security, customer, and Federal Reserve Bank, as applicable."
    },
    {
      "duty": "Identifies and reports suspicious or fraudulent wire activity to management."
    },
    {
      "duty": "Assists with training new hires on wire system."
    },
    {
      "duty": "Participates in wire system testing with the Information Technology division and the Federal Reserve."
    },
    {
      "duty": "Assists with continuous improvement initiatives to improve existing business processes."
    },
    {
      "duty": "Each team member is expected to be aware of risk within their functional area."
    },
    {
      "duty": "Observing all policies, procedures, laws, regulations and risk limits specific to their role."
    },
    {
      "duty": "Raising and reporting known or suspected violations to the appropriate Company authority in a timely fashion."
    },
    {
      "duty": "Performs other related duties as required."
    },
    {
      "duty": "Ensure compliance with banking regulations and internal policies."
    },
    {
      "duty": "Develop and implement measures to prevent fraudulent activity and maintain high levels of security in wire transfers."
    }
  ],
  "skills": [
    {
      "skill": "Wire Processing",
      "experience": 2
    },
    {
      "skill": "Banking Regulations Compliance",
      "experience": 2
    },
    {
      "skill": "Data Integrity Management",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Risk Management",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent"
    }
  ]
}