{
  "meta": [
    {
      "job_title": "Server",
      "job_category": "Food and Beverage",
      "job_class": "Server",
      "sector": "Hospitality",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Taking customer's food and drink orders, serving food and beverages, and preparing itemized checks."
    },
    {
      "duty": "Escorting guests to tables, serving customers seated at counters, setting up and clearing tables, or operating a cash register."
    },
    {
      "duty": "Checking the identification of patrons to ensure they meet the minimum age requirement for the purchase of alcohol."
    },
    {
      "duty": "Providing the highest quality of service to guests in an efficient and courteous manner."
    },
    {
      "duty": "Complying with Aimbridge Hospitality standards and regulations to encourage safe and efficient hotel operations."
    },
    {
      "duty": "Being familiar with the organization of the restaurant and lounge, knowing the function of each job position, and having thorough knowledge of menus and specials in the restaurant."
    },
    {
      "duty": "Servicing guests with all food and beverage requirements in a warm, friendly, courteous, and professional manner."
    },
    {
      "duty": "Clearing, cleaning, and resetting tables as needed, and ensuring that tables and side stands are kept stocked, tidy, and clean."
    },
    {
      "duty": "Carrying out cashiering functions, performing opening and closing procedures, and side work duties according to station rotation assignment."
    },
    {
      "duty": "Performing other assigned tasks/jobs by the supervisor or manager."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Cash Handling",
      "experience": 3
    },
    {
      "skill": "Food and Beverage Knowledge",
      "experience": 3
    },
    {
      "skill": "POS System Operation",
      "experience": 3
    },
    {
      "skill": "Service Excellence",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent, and Alcohol Awareness Certification, and Food Handlers certification."
    }
  ]
}