{
  "meta": [
    {
      "job_title": "Inside Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 4
    },
    {
      "skill": "Territory Administration",
      "experience": 4
    },
    {
      "skill": "Computer Proficiency",
      "experience": 4
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Medical Industry Knowledge",
      "experience": 4
    },
    {
      "skill": "Market Analysis",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain and grow existing customer base; consistently update customer database."
    },
    {
      "duty": "Implement sales plans and achieve sales goals and objectives set for the geographic territory."
    },
    {
      "duty": "Educate customers on products, procedures, and industry trends through use of our clinical education program and by performing virtual trainings."
    },
    {
      "duty": "Adhere to and ensure the compliance of company's Code of Ethics, all Company policies, rules, procedures and housekeeping standards."
    },
    {
      "duty": "Overcome technical and business objections of prospective customers."
    },
    {
      "duty": "Handle inbound and outbound calls, emails and faxes related to the product ordering process."
    },
    {
      "duty": "Travel occasionally to attend trade shows or field visit with customers."
    },
    {
      "duty": "Maintain thorough knowledge of company's products and exhibit understanding of industry competition."
    },
    {
      "duty": "Interface with key departments within the organization and specialized teams within Customer Service in support of the order placement processes."
    },
    {
      "duty": "Responsible for purchase order processing, including necessary steps to identify customer accounts; verify credit status; pricing, and inventory levels."
    },
    {
      "duty": "Professionally communicate (verbally and written) with customers while providing accurate and timely processing of their purchase orders."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 70,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree (BA/BS) from four-year college or university with emphasis in Science/ Business desired; or equivalent combination of education and experience."
    },
    {
      "credential": "Three (3) years inside sales or related experience and/or training; or equivalent combination of education and experience."
    },
    {
      "credential": "Experience using value selling or target account selling methodology preferred."
    }
  ]
}