{
  "meta": [
    {
      "job_title": "Substation Designer",
      "job_category": "Engineering",
      "job_class": "Designer",
      "sector": "Engineering",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Computer Aided Design (CAD)",
      "experience": 3
    },
    {
      "skill": "AutoCAD",
      "experience": 3
    },
    {
      "skill": "Electrical Drawing",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Verbal & Written Communication",
      "experience": 3
    },
    {
      "skill": "Collaboration",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Computer aided design and drafting of all engineering products and deliverables."
    },
    {
      "duty": "Collaborate with engineers and other drafters to correct discrepancies in drawings and designs."
    },
    {
      "duty": "Operations Diagrams, Single Line Drawings, Three Line Drawings, Current and Potential Schematics"
    },
    {
      "duty": "Protection and Control Schematics, Communication Schematics, Alarm Schematics, Associated Wiring Diagrams (Point to Point Translation)"
    },
    {
      "duty": "Importation of tables and calculations such as BOMs as well as creating notes to be applied to each drawing."
    },
    {
      "duty": "Self-checks all work performed to ensure its accuracy prior to turning it over to the supervisor or designee assigned to review the work."
    },
    {
      "duty": "Understand & meet project schedule, and quality requirements."
    },
    {
      "duty": "Complete drawings accurately and efficiently."
    },
    {
      "duty": "Detailed and quality oriented."
    },
    {
      "duty": "Able to handle multiple projects concurrently and maintain flexibility to changes in work assignments as changes occur in projects."
    },
    {
      "duty": "Actively assist in the delivery of a complete project. This may include phone or e-mail correspondence, Microsoft Teams communications, attending meetings, and other project documents required for project completion."
    },
    {
      "duty": "Provide interdepartmental support as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree in Design & Drafting Technology or related field of study. Minimum of 3 yrs. of CAD experience, AutoCAD experience preferred."
    }
  ]
}