{
  "meta": [
    {
      "job_title": "Administrative Coordinator",
      "job_category": "Administration",
      "job_class": "Coordinator",
      "sector": "Management",
      "salary": 66456,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Payroll Administration",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Report Preparation",
      "experience": 5
    },
    {
      "skill": "Human Resources Coordination",
      "experience": 5
    },
    {
      "skill": "Office Support Staff Supervision",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Answers routine and specific inquiries, directs inquiries to the appropriate department, and assists in maintaining and monitoring the budget and grant allocations."
    },
    {
      "duty": "Initiates and follows through on human resources and payroll transactions, including weekly payroll submission."
    },
    {
      "duty": "Coordinates and resolves issues and problems with human resources and payroll, ensuring adequate restock of supplies for the department."
    },
    {
      "duty": "Plans and coordinates logistical arrangements for forums, conferences, seminars, meetings, and/or visiting professorships, including developing informational packets for participants."
    },
    {
      "duty": "Develops, updates, and/or revises informational flyers, brochures, and mailings, and researches, locates, and compiles information for reports."
    },
    {
      "duty": "Assists with the completion of grant applications, special projects, and survey preparations, as well as mentors, trains, and conducts orientation for new office support staff."
    },
    {
      "duty": "Coordinates administrative, secretarial, and/or general office support coverage, assigns work, sets deadlines, and supervises the work of assigned staff."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree or equivalent combination of applicable5 years related administrative or business experience required. Some supervisory experience preferred. experience and education"
    }
  ]
}