{
  "meta": [
    {
      "job_title": "Environmental Services Technician",
      "job_category": "Environmental Services",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assigned area is maintained in an aseptically clean and aesthetically pleasing manner to guests and co-workers."
    },
    {
      "duty": "Removes soiled linen and waste from assigned area."
    },
    {
      "duty": "Cleans and maintains hard floor surfaces, i.e., dust mop, wet mop, strip, wax and polish."
    },
    {
      "duty": "Cleans and maintains carpeted floors, i.e., vacuum, shampoo and extract."
    },
    {
      "duty": "Cleans and sanitizes fittings and furniture."
    },
    {
      "duty": "Cleans walls, ceilings, and vents."
    },
    {
      "duty": "Cleans inside glass in assigned area."
    },
    {
      "duty": "Follows appropriate security measures when cleaning medication rooms and refrigerators. Respects and understands the need for medication inventory control and security."
    },
    {
      "duty": "Tools, equipment and supplies are utilized to obtain maximum efficiency and safety."
    },
    {
      "duty": "Demonstrates knowledge of the safe and proper use of housekeeping equipment."
    },
    {
      "duty": "Handles cleaning chemicals in a safe and economical manner, using protective equipment when necessary."
    },
    {
      "duty": "Demonstrates proper care and maintenance of equipment and reports damaged or dangerous equipment to supervisor."
    },
    {
      "duty": "Assists with conference room set ups as required."
    },
    {
      "duty": "Completes all job assignments per scheduled requirements. Work schedules are completed efficiently and safely."
    },
    {
      "duty": "Demonstrates effective use of time in completing the daily schedule."
    },
    {
      "duty": "Informs supervisor/lead if schedule is completed or if a block of time becomes available for other tasks."
    },
    {
      "duty": "Communication is effective, open, and respectful to all customers."
    },
    {
      "duty": "Establishes open and appropriate communication with customers, co-workers, and supervisors."
    },
    {
      "duty": "Reports any unsafe conditions found in the work area to the appropriate supervisor."
    },
    {
      "duty": "Participates in educational programs and in-service meetings."
    }
  ],
  "skills": [
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Safety Awareness",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent, Basic familiarity with computers preferred"
    }
  ]
}