{
  "meta": [
    {
      "job_title": "Controller",
      "job_category": "Finance",
      "job_class": "Director",
      "sector": "Finance & Accounting",
      "salary": 180000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Management",
      "experience": 8
    },
    {
      "skill": "Budgeting",
      "experience": 8
    },
    {
      "skill": "Financial Reporting",
      "experience": 8
    },
    {
      "skill": "Cost Management",
      "experience": 8
    },
    {
      "skill": "Internal Controls",
      "experience": 8
    },
    {
      "skill": "ERP Systems",
      "experience": 8
    },
    {
      "skill": "Analytical Skills",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Financial Analysis",
      "experience": 8
    },
    {
      "skill": "Compliance",
      "experience": 8
    },
    {
      "skill": "Revenue Recognition",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Process Management",
      "experience": 8
    },
    {
      "skill": "Accounting Standards",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead all accounting activities and ensure that accounting operations are done properly."
    },
    {
      "duty": "Directly oversee all aspects of the accounting functions of the organization including month-end close, year-end audit, financial statement preparation, cash flow analysis, ERP maintenance, and internal processes owned by the accounting department."
    },
    {
      "duty": "Manage the team to provide timely and accurate financial reporting to the company."
    },
    {
      "duty": "Develop company financial plans and monitor performance against plan."
    },
    {
      "duty": "Keep the company current and compliant with technical accounting standards, regulations, and tax laws."
    },
    {
      "duty": "Provide senior-level oversight to the external audit process for the financial audit as well as bank audits and covenant reporting."
    },
    {
      "duty": "Oversee the approval and processing of revenue, expenditures, and all associated financial reporting, including general ledger account maintenance."
    },
    {
      "duty": "Manage ERP System (Sage Intacct, Inc.) including backend customizations and maintenance of financial data."
    },
    {
      "duty": "Provide insightful analysis of financial results, identifying trends, risks, and opportunities."
    },
    {
      "duty": "Evaluate and recommend improvements to financial systems, processes, and controls to drive operational efficiency."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting, Finance, or a related field (Master's preferred)"
    }
  ]
}