{
  "meta": [
    {
      "job_title": "Supplier Quality Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Automotive",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Automotive PPAP",
      "experience": 5
    },
    {
      "skill": "Supplier Quality Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Vendor Contract Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Quality Process Improvement",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish and maintain professional relationships with suppliers, acting as the main point of contact for all supplier component quality correspondence."
    },
    {
      "duty": "Monitor and manage supplier quality performance (PPM) and partner with suppliers regarding corrective actions."
    },
    {
      "duty": "Identify and address problem areas within supplier quality, initiating requests to investigate quality issues and developing and maintaining PPAP and supplier Corrective Actions Tracking Systems (CATS)."
    },
    {
      "duty": "Collaborate with other departments to evaluate potential supplier quality concerns and document supplier quality processes."
    },
    {
      "duty": "Ensure suppliers understand basic expectations such as 24-hour response, containment, and financial responsibility for supplier-related quality issues."
    },
    {
      "duty": "Administer internal supplier containment and maintain the return material cage, as well as oversee supplier chargeback activity."
    },
    {
      "duty": "Assist with reviewing and approving supplier PPAP packages, as well as external supplier containment. Provide leadership, direction, and coaching to the Supplier Quality Technicians."
    },
    {
      "duty": "Curate supplier PPM data for KPI tracking and provide the accompanying corrective actions, maintaining awareness of the activities performed by the supplier quality engineering team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Engineering (Master's preferred)"
    }
  ]
}