{
  "meta": [
    {
      "job_title": "Principal Engineer I",
      "job_category": "Engineering",
      "job_class": "Principal",
      "sector": "Software Engineering",
      "salary": 128190,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Network Systems Planning",
      "experience": 4
    },
    {
      "skill": "Communication Architecture Integration",
      "experience": 4
    },
    {
      "skill": "Hardware and Software Integration",
      "experience": 4
    },
    {
      "skill": "Transmission and Signaling Link Integration",
      "experience": 4
    },
    {
      "skill": "Protocol Configuration",
      "experience": 4
    },
    {
      "skill": "Cisco CTC",
      "experience": 4
    },
    {
      "skill": "Ciena Optical Platform",
      "experience": 4
    },
    {
      "skill": "Infinera DNA Software",
      "experience": 4
    },
    {
      "skill": "Visio Software",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Technical Standards Development",
      "experience": 4
    },
    {
      "skill": "Network Bandwidth Monitoring",
      "experience": 4
    },
    {
      "skill": "Capacity Planning",
      "experience": 4
    },
    {
      "skill": "Network Efficiency Improvement",
      "experience": 4
    },
    {
      "skill": "End-of-Life Hardware Replacement Planning",
      "experience": 4
    },
    {
      "skill": "Budget Forecasting",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, forecast, implement, and identify resource requirements for network systems of moderate-to-high complexity."
    },
    {
      "duty": "Integrate communication architectures, topologies, hardware, software, transmission and signaling links, and protocols into complete network configurations."
    },
    {
      "duty": "Utilize Cisco CTC, Ciena optical platform, Infinera DNA Software, and Visio Software for designing, provisioning, maintaining, troubleshooting, and repairing optical transport equipment."
    },
    {
      "duty": "Create network design diagrams and evaluate new products for network problem resolution."
    },
    {
      "duty": "Participate in network planning, architecture design, and engineering, as well as assist in the development and documentation of technical standards."
    },
    {
      "duty": "Manage assigned projects, create high-level designs and plans for network augments and uplifts, and support the training and development of junior engineers."
    },
    {
      "duty": "Monitor network bandwidth utilization, provide capacity solutions, and support network change requests, including hub collapses, moves, network overlays, and fiber diversification requests."
    },
    {
      "duty": "Responsible for planning capacity solutions, migration plans, and solving Enterprise capacity demands, as well as updating system topology maps and reviewing end-of-life hardware replacement strategies."
    },
    {
      "duty": "Develop migration plans, planning and designing High Level Diagrams, and working with vendors to integrate new technologies and denser solutions into the market."
    },
    {
      "duty": "Improve network efficiencies, consolidate capacities, and reduce hardware footprints, as well as be responsible for budget forecasts for the assigned markets."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering, Computer Science, IT, or related field."
    }
  ]
}