{
  "meta": [
    {
      "job_title": "PIA Implementation Coordinator",
      "job_category": "Insurance",
      "job_class": "Coordinator",
      "sector": "Insurance",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Insurance Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Recruitment and Selection",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise, monitor, and direct all activities, workflow, service, and transactional management of PIA Implementation Coordinator team within Health & Benefits team in the Paychex Insurance Agency."
    },
    {
      "duty": "Provide direct supervision for a staff of PIA Implementation Coordinators and successful onboarding of new clients to the Health and Benefits product."
    },
    {
      "duty": "Support District and Market Sales Managers as well as regional Service and Retention Managers by supporting the onboarding and transition process from sales to operations."
    },
    {
      "duty": "Maintain and foster carrier relationships to ensure prompt and efficient service to their assigned client team based on follow-up and issue resolution needs."
    },
    {
      "duty": "Define and establish productivity and quality standards, and ensure they are met."
    },
    {
      "duty": "Assist in the establishment of policies and implements all policies and procedures relating to the workflow of the assigned team to ensure timely and accurate service."
    },
    {
      "duty": "Maintain compliance with state, federal, and insurance carrier guidelines, as well as standards set forth within the Agency, and HRS to ensure product and team integrity."
    },
    {
      "duty": "Review business processes to ensure accuracy, efficiency in productivity measures, and adherence to internal and external client service level standards, as well as recommends the necessary changes to maintain a competitive advantage."
    },
    {
      "duty": "Recruit, select, hire, and evaluate performance of personnel to ensure all department needs are handled appropriately."
    },
    {
      "duty": "Assist Agency management to achieve budgeted projections through labor expense and administrative expense controls."
    },
    {
      "duty": "Life, Accident and Health must be obtained within 90 days of employment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 110,
      "student_teacher": 90,
      "introvert_extrovert": 135
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Insurance, Sales, or Customer Service (Master's preferred)"
    },
    {
      "credential": "Relevant Insurance License (Life, Accident and Health)"
    }
  ]
}