{
  "meta": [
    {
      "job_title": "Audit Associate",
      "job_category": "Accounting",
      "job_class": "Associate",
      "sector": "Finance",
      "salary": 65000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform audit procedures in the areas of cash, receivables, inventory, fixed assets, payrolls, and expense analysis."
    },
    {
      "duty": "Work alongside Partners, Managers, and Senior Executives as a member of the engagement team."
    },
    {
      "duty": "Audit transaction cycles, including cash, purchasing, investments, capital expenditures, and other income and expenses."
    },
    {
      "duty": "Gain understanding of client operations, processes, and business objectives and utilize that knowledge on engagements."
    },
    {
      "duty": "Research and analyze financial statements and audit and tax related issues utilizing electronic databases."
    },
    {
      "duty": "Employ audit software to review and compile financial information to resolve client issues discovered during the audit."
    },
    {
      "duty": "Develop and maintain a good working relationship with clients to enhance customer satisfaction."
    },
    {
      "duty": "Work with client management and staff at all levels to perform audit services."
    },
    {
      "duty": "Participate in recruiting efforts as needed."
    },
    {
      "duty": "Attend professional development and training sessions on a regular basis."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 3
    },
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Audit Software",
      "experience": 2
    },
    {
      "skill": "Client Relationship Management",
      "experience": 3
    },
    {
      "skill": "Recruiting",
      "experience": 2
    },
    {
      "skill": "Professional Development",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s or Master’s degree in Accounting"
    },
    {
      "credential": "Completion of necessary education hours to eligible for CPA licensure, if required in the state where the position will be located"
    }
  ]
}