{
  "meta": [
    {
      "job_title": "Supervisor Network Construction",
      "job_category": "Construction",
      "job_class": "Supervisor",
      "sector": "Construction",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Supervise teams of Operators and Technicians performing Outside Plant (OSP) construction using various tools and equipment."
    },
    {
      "duty": "Prepare logistics plans for work within Crown Castle regions and schedule and coordinate mobilization to and from assigned work locations."
    },
    {
      "duty": "Drive the Crown Castle safety culture by ensuring all safety standards, personal protective equipment, and best practices are applied at all times."
    },
    {
      "duty": "Supervise loading and unloading heavy equipment at a jobsite, include towing and backing up trailers safely."
    },
    {
      "duty": "Schedule and coordinate deliveries, plan purchases of materials, and work with inter-departmental team members to drive favorable financial outcomes."
    },
    {
      "duty": "Perform onsite training, formulate processes and procedures, and aid regional teams in the execution of innovative technologies."
    },
    {
      "duty": "Read and interpret engineering designs and construction drawings, provide support to monitor and report Key Performance Indicators (KPIs), and oversee site construction, schedule management, resources, and safety practices on all projects."
    },
    {
      "duty": "Ensure coordination and compliance with permitting, Method of Transportation (MOT), and underground facility locating requirements. Ensure all work is completed in accordance with Crown Castle construction standards, processes, and procedures."
    },
    {
      "duty": "Create and maintain a schedule for a team of technicians, including travel logistics and planning, maintain construction materials inventory, and develop and coach team, identify training gaps, and create career paths for team members."
    },
    {
      "duty": "Supervise a team to support necessary network installation and maintenance activities 24 hours, seven days a week, 365 days a year."
    },
    {
      "duty": "Provide support for the assigned areas respective CAPEX and OPEX spend and budgets, maintain knowledge of technology in use, and/or under development for its impact or potential impact on the operational business process."
    },
    {
      "duty": "Provide 24-hour, 7-day emergency support and perform other related duties as requested or required."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent required. Valid driver's license required - DOT/ CDL preferred. OSHA 10 required, OSHA 30 or greater preferred."
    }
  ]
}