{
  "meta": [
    {
      "job_title": "Audio-Visual Technician",
      "job_category": "Technology",
      "job_class": "Technician",
      "sector": "Hospitality",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Set up and operate basic / small-scale audiovisual systems in a hospitality environment."
    },
    {
      "duty": "Preset / stage equipment for evening /outdoor events."
    },
    {
      "duty": "Testing / troubleshooting installed AV in classrooms for functionality and Hybrid meeting AV use."
    },
    {
      "duty": "Float classrooms / help attendees with AV needs."
    },
    {
      "duty": "Participate in monthly inventory counts / replenish storage rooms / classroom bins."
    },
    {
      "duty": "Provide kick off / trouble shooting support for classrooms (installed AV) – Face to face client support."
    },
    {
      "duty": "Set / strike flip charts, small portable monitors, etc."
    },
    {
      "duty": "Clean classroom glass walls (white boards)."
    },
    {
      "duty": "Plug “smart” tables into floor pockets."
    },
    {
      "duty": "Prep training classrooms for the next day."
    },
    {
      "duty": "Set / kick off / strike moon balloons and small audio systems for outdoor events."
    },
    {
      "duty": "Running power lines / power strips to classroom & ballroom tables."
    },
    {
      "duty": "Strive to exceed the expectations and needs of internal and external customers."
    },
    {
      "duty": "Maintains a positive relationship with all clients through effective communication."
    },
    {
      "duty": "Monitors events and checks in on customers throughout the day."
    },
    {
      "duty": "Understands the technical aspects of the job and demonstrates basic operational ability to troubleshoot and problem solve with equipment and software issues."
    },
    {
      "duty": "Understands company processes, follows procedures and completes systems entry and paperwork accurately."
    },
    {
      "duty": "Uses the equipment sheets to determine the equipment scheduled for set up and for strike."
    },
    {
      "duty": "Increases revenue by utilizing floor up-selling techniques."
    },
    {
      "duty": "Works with clients to finalize invoices."
    },
    {
      "duty": "Completes order entries in Navigator, as needed."
    }
  ],
  "skills": [
    {
      "skill": "Audio Visual Setup",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Troubleshooting",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma required. Associate’s degree is preferred. Achieve Technical Level 3 Certification per Encore Technical Skillset Matrix within 180 days. 1 year of customer service or hospitality experience is preferred. 1 year of audio visual experience or equivalent in educational environment is preferred. A valid driver’s license is required for team members that may operate Company vehicles."
    }
  ]
}