{
  "meta": [
    {
      "job_title": "Value Demonstration Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Health Technology Assessment",
      "experience": 5
    },
    {
      "skill": "Market Access",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Consultancy",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead on complex multi-disciplinary projects in the areas of health technology assessment (HTA), market access, and evidence-based communication."
    },
    {
      "duty": "Establish effective partnerships with clients to understand their strategic goals and milestones, managing and maintaining the scope of projects in a timely and efficient manner."
    },
    {
      "duty": "Build and manage relationships with existing clients, bringing network of contacts and leveraging them for business development."
    },
    {
      "duty": "Lead and coordinate multi-disciplinary project delivery teams, providing clear direction on client objectives and being adaptable to project changes and evolving challenges."
    },
    {
      "duty": "Review and contribute to project deliverables from a strategic perspective, ensuring the content and quality align with client’s goals and Lumanity's standards."
    },
    {
      "duty": "Support business development initiatives by actively identifying and pursuing new opportunities, providing oversight and mentorship of a small number of Value Demonstration team members."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Healthcare, Pharmaceutical Science, or related field (Master’s preferred)"
    }
  ]
}