{
  "meta": [
    {
      "job_title": "Line Cook",
      "job_category": "Culinary",
      "job_class": "Cook",
      "sector": "Hospitality",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Food Preparation",
      "experience": 3
    },
    {
      "skill": "Sanitation and Safety",
      "experience": 3
    },
    {
      "skill": "Menu Knowledge",
      "experience": 3
    },
    {
      "skill": "Buffet Presentation",
      "experience": 3
    },
    {
      "skill": "Kitchen Equipment Operations",
      "experience": 3
    },
    {
      "skill": "Food Storage",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepare and cook food items based on standardized recipes for Banquets and Catering, ensuring highest standards of quality and appeal."
    },
    {
      "duty": "Maintain cleanliness, sanitation, and safety in the kitchen and work areas to minimize waste and maximize cost/production ratio."
    },
    {
      "duty": "Approach all encounters with guests and associates in a friendly, service-oriented manner."
    },
    {
      "duty": "Maintain high standards of personal appearance, grooming, and compliance with hospitality standards."
    },
    {
      "duty": "Comply with certification requirements for Food Handlers Safety, etc."
    },
    {
      "duty": "Complete necessary food and station preparations to ensure prompt and efficient service during operating hours."
    },
    {
      "duty": "Prepare and service food for Associate Cafeteria as specified by the restaurant leadership."
    },
    {
      "duty": "Maintain post on the kitchen line during operating hours to prepare food to order with efficiency and quality."
    },
    {
      "duty": "Prepare food according to hotel standards and specifications following Aimbridge Hospitality standard recipes."
    },
    {
      "duty": "Maintain cleanliness and organization of all storage areas and kitchen equipment."
    },
    {
      "duty": "Assist in storage and rotation of food items according to hotel procedures."
    },
    {
      "duty": "Operate and maintain cleanliness of all kitchen equipment."
    },
    {
      "duty": "Assist in and perform any other duties as requested by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent. Food Handlers Certification required."
    }
  ]
}