{
  "meta": [
    {
      "job_title": "Program Deployment Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Foodservice Systems",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Design",
      "experience": 5
    },
    {
      "skill": "Decision Quality",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Planning",
      "experience": 5
    },
    {
      "skill": "Language Skills",
      "experience": 3
    },
    {
      "skill": "Mathematical Skills",
      "experience": 3
    },
    {
      "skill": "Reasoning Skills",
      "experience": 5
    },
    {
      "skill": "Computer Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead multiple priorities, initiatives, and programs simultaneously."
    },
    {
      "duty": "Working closely with customers, identify program scope and establish parameters; ensure all programs are successfully completed to timeline."
    },
    {
      "duty": "Provides primary program interface and communication between internal function(s) and customers."
    },
    {
      "duty": "Establish and execute program plans including projections of required resources (time, cost, personnel, facilities, equipment)."
    },
    {
      "duty": "Act on customer problems with consistent follow-up until issues have been resolved; quickly identify potential drivers of emerging problems; create and lead group problem-solving discussions/presentations."
    },
    {
      "duty": "Design and execute appropriate analyses to size potential impact of problems and solutions."
    },
    {
      "duty": "Make decisions independently on all key program elements."
    },
    {
      "duty": "Direct all planning of and monitor all activities required to meet program milestones and end goals."
    },
    {
      "duty": "Work with production and vendors to assure the supply of equipment resources; coordinate with all internal functions."
    },
    {
      "duty": "Provide training to all internal stakeholders as required facilitating understanding of customer expectations, equipment, services, and overall program parameters."
    },
    {
      "duty": "Assist with internal and external process decisions and implementation to ensure processes align with existing standards and policies and all departments work collectively to meet customer expectations and goals of the programs."
    },
    {
      "duty": "Track and report program progress on a consistent and accurate basis for all stakeholders, maintaining detailed program and project records; retrieve and analyze data independently and in partnership with stakeholders."
    },
    {
      "duty": "Coordinate mid- and after program reviews to analyze and address any complications, roadblocks, and wins for reference on future programs and initiatives."
    },
    {
      "duty": "Ability for significant travel (>50%)."
    },
    {
      "duty": "Other duties as assigned."
    },
    {
      "duty": "Reliable attendance is a must."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 110,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree minimum;"
    }
  ]
}