{
  "meta": [
    {
      "job_title": "Electrical Competence Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Electrical Engineering",
      "experience": 15
    },
    {
      "skill": "Facility Management",
      "experience": 12
    },
    {
      "skill": "Technical Leadership",
      "experience": 12
    },
    {
      "skill": "Contract Management",
      "experience": 12
    },
    {
      "skill": "Strategic Thinking",
      "experience": 12
    },
    {
      "skill": "Financial Management",
      "experience": 12
    },
    {
      "skill": "Stakeholders Management",
      "experience": 12
    },
    {
      "skill": "Performance Management",
      "experience": 12
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Supplier Management",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Industrial Engineering",
      "experience": 10
    },
    {
      "skill": "Utility Master Planning",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Own and manage all building electrical assets, planning, and documentation for ASML Wilton facilities and manufacturing systems."
    },
    {
      "duty": "Lead the development and implementation of User Requirements Specifications, Engineering Design Guidelines, and Maintenance Policies."
    },
    {
      "duty": "Ensure effective operations, maintenance, and support of facilities and operational services, aligned with strategic pillars."
    },
    {
      "duty": "Monitor and manage contractors, consultants, and suppliers supporting critical assets, systems, and processes."
    },
    {
      "duty": "Act as the expert in electrical systems, managing and coordinating with other competences to ensure alignment and business continuity."
    },
    {
      "duty": "Make key decisions about designs, safety situations, and guidelines that impact the performance and costs of assets."
    },
    {
      "duty": "Collaborate with peers, program managers, project managers, and specialists to support and manage changes and projects in the field."
    },
    {
      "duty": "Support the establishment of strong and clear standards and related sharing, documenting, and distribution of information within the CRE team."
    },
    {
      "duty": "Monitor and coordinate the impact of guidelines and standards on other assets to ensure business continuity."
    },
    {
      "duty": "Cooperate with cross-sector key users and counterparts to assure global alignment and consistency in operations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Electrical Engineering or equivalent; OR 12-15 years of relevant experience in a complex industrial environment. Professional Engineer (PE) preferred."
    }
  ]
}