{
  "meta": [
    {
      "job_title": "PIA Implementation Coordinator",
      "job_category": "Insurance",
      "job_class": "Coordinator",
      "sector": "Insurance",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages a staff of experienced and licensed insurance professional team members focused on driving new sales and retention targets within the Paychex Insurance Agency."
    },
    {
      "duty": "Responsible for all activities associated with onboarding new clients to the Health and Benefits products."
    },
    {
      "duty": "Partners with H&B Market Sales and District Sales Managers to ensure sales agents are receiving the appropriate support and districts are onboarding clients accurately, completely and successfully."
    },
    {
      "duty": "Partners with regional H&B Service and Retention Managers to fully transition implemented and clean client cases for insertion into the region’s and the account manager’s book of business."
    },
    {
      "duty": "Develops and maintains relationships with H&B sales, HR Solutions, MMS, Product Management, Branch Operations, IT and Accounting partners to ensure optimal service to clients with minimal breakdowns between internal Paychex teams."
    },
    {
      "duty": "Maintains and fosters carrier relationships, including General Agents, to ensure prompt and efficient service to their assigned client team based on follow-up and issue resolution needs."
    },
    {
      "duty": "Defines and establishes productivity and quality standards, and ensures they are met."
    },
    {
      "duty": "Communicates expectations to the team members and reviews processes on an ongoing basis to ensure team is meeting operational priorities."
    },
    {
      "duty": "Assists in the establishment of policies and implements all policies and procedures relating to the workflow of the assigned team to ensure timely and accurate service."
    },
    {
      "duty": "Maintains compliance with state, federal and insurance carrier guidelines, as well as standards set forth within the Agency, and HRS to ensure product and team (unit) integrity."
    },
    {
      "duty": "Researches and proposes enhancements to existing products’ operational processes to create efficiencies and maintain service levels."
    },
    {
      "duty": "Reviews business processes to ensure accuracy, efficiency in productivity measures and adherence to internal and external client service level standards, as well as recommends the necessary changes to maintain a competitive advantage."
    },
    {
      "duty": "Recruits, selects, hires and evaluates performance of personnel to ensure all department needs are handled appropriately. Counsels and develops staff for personal and corporate advancement through career development, training programs and other resources as required for professional advancement."
    },
    {
      "duty": "Assists Agency management achieve budgeted projections through labor expense and administrative expense controls"
    },
    {
      "duty": "Life, Accident and Health must be obtained within 90 days of employment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree - Preferred5 years of experience in Insurance industry, Sales or Customer Service experience.2 years of experience in Supervisory experience.Relevant Insurance License. This role requires you to be eligible for applicable insurance licensing in all 50 states, which may involve an enhanced background check. If you are not currently licensed, you will be required to obtain the necessary insurance license(s) within 90 calendar days of your official start date. Failure to obtain the required license(s) within 90 days of your start date and to maintain eligibility throughout the duration of your employment may result in corrective action, up to and including termination of employment. Paychex Insurance Agency, Inc. (PIA) will cover the cost of up to two (2) attempts to pass a state insurance licensing exam including exam materials and testing fee. The cost of any additional attempts will be at the expense of the individual employee. If an individual is hired by PIA with an active and current license(s), that employee will be responsible for the timely updating and/or verifying of any changes that may have occurred with their state license(s) prior to their start date at PIA. This includes any state of residence changes, e-mail changes, mailing address changes or name changes. - Required"
    }
  ]
}