{
  "meta": [
    {
      "job_title": "Sales Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "salary": 40000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Consult virtually with America's businesses, through self-generated activity to educate stakeholders on our services, and provide consultative solutions to increase market share and drive revenue."
    },
    {
      "duty": "Utilizes the telephone, direct mail, and local marketing programs directed by sales management to prospect for new clients and new referral sources."
    },
    {
      "duty": "Schedule and conduct meetings with new prospects through telephone calls, targeted email campaigns, and corporate marketing programs, as directed by Sales Management."
    },
    {
      "duty": "Presents Paychex payroll products and services to final decision makers and end users within the prospect universe to educate them on our services with the goal of having them become a Paychex Payroll client."
    },
    {
      "duty": "Completes and submits accurate new business paperwork and weekly activity reports by agreed upon dates set by Sales management to assist with forecasting."
    },
    {
      "duty": "Analyzes the customer needs and interests to determine which products are appropriate and refers to appropriate party when necessary."
    },
    {
      "duty": "Develop sales skills and maintain a comprehensive understanding of the Paychex product offering to optimize sales results; remain up-to-date with new product initiatives, services, industry trends and other relevant information of interest to customers."
    },
    {
      "duty": "Expedites the resolution of customer problems or complaints to the appropriate channels to ensure client satisfaction."
    },
    {
      "duty": "Achieve unit and revenue expectations."
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 2
    },
    {
      "skill": "Prospecting",
      "experience": 3
    },
    {
      "skill": "Sales Presentations",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "H.S. Diploma - Required"
    },
    {
      "credential": "Bachelor's Degree - Preferred"
    }
  ]
}