{
  "meta": [
    {
      "job_title": "Nurse Assistant",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the direct and/or indirect care of patients assigned utilizing professional nursing skills and knowledge."
    },
    {
      "duty": "Obtain supplies from designated supply rooms to assure patient rooms are ready for patient admission and cleared when patient discharged/transferred."
    },
    {
      "duty": "Demonstrates ability to feed patients, knowledge of dysphagia precautions and calculating and recording intake and output."
    },
    {
      "duty": "Demonstrates competence while collecting specimens-urine routine, clean catch, foley, stools for c-diff, etc."
    },
    {
      "duty": "Demonstrates competence with the application of heat and cold packs, ace wraps, slings, binders, protective devices, and orthopedic devices."
    },
    {
      "duty": "Participates in hourly rounding programs and schedules to ensure patient safety and reduce patient harm; observes for environmental safety, informs patient and family on safety precautions, turns and repositions patients, preemptively assists with toileting activities, and addresses personal needs."
    },
    {
      "duty": "Appropriately seeks assistance of the Nurse Manager of designee for conflict resolution."
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 3
    },
    {
      "skill": "Supply Management",
      "experience": 3
    },
    {
      "skill": "Specimen Collection",
      "experience": 3
    },
    {
      "skill": "Patient Safety",
      "experience": 3
    },
    {
      "skill": "Conflict Resolution",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "High School Graduate/Equivalent required"
    },
    {
      "credential": "PA Nurse Aide Registry (CNA) OR completed a minimum of one semester of clinical rotations in an accredited nursing program."
    }
  ]
}