{
  "meta": [
    {
      "job_title": "Retail Salesperson",
      "job_category": "Retail",
      "job_class": "Salesperson",
      "sector": "Sales",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Introduce tire products and automobile repair/maintenance services to customers in person and/or with other store associates to help maximize total sales, store profits, and customer satisfaction, loyalty, and retention."
    },
    {
      "duty": "Selling and Sales Promotion (65% of time) - Personally handles customer needs in areas of sales, service, complaints, adjustments, etc. Contacts customers, particularly in service department, to assess needs for tires and car service to close sales opportunities. Checks tickets, making sure all tires on every vehicle are inspected and customers needing tires are asked to buy. Solicits and promotes customer use of CFNA Credit Card as frequently as possible. Introduces new products to achieve appropriate sales. Keeps tire selling area and tire displays clean and properly set up at all times. Ensures that correct tires are on display, with correct display materials. Assures store environment exhibits a clean and professional image. Follows and executes appropriate CSDS steps. Administers sales promotion programs. Using display and advertising materials provided, sets up inside and outside displays, including special \\"
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Sales",
      "experience": 4
    },
    {
      "skill": "Retail",
      "experience": 4
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Customer Relations",
      "experience": 4
    },
    {
      "skill": "Cash Handling",
      "experience": 3
    },
    {
      "skill": "POS Operations",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 80,
      "introvert_extrovert": 85
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent"
    },
    {
      "credential": "2-years of consumer retail sales experience"
    }
  ]
}