{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Insurance",
      "salary": 17500,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Consultative Service",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Technology Navigation",
      "experience": 3
    },
    {
      "skill": "Emotional Resilience",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Critical Thinking",
      "experience": 3
    },
    {
      "skill": "Conflict Resolution",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide consultative service support in a complex environment, addressing billing questions, policy changes, rate changes, discounts, and providing support for Farmers.com/mobile app."
    },
    {
      "duty": "Empower and proactively share knowledge to provide a positive customer experience, building effective communication skills to deliver insurance and eligibility information, solutions and initiatives."
    },
    {
      "duty": "Analyze, clarify, and resolve policy and account-related questions from internal and external customers, striving to provide a positive customer experience."
    },
    {
      "duty": "Review problems and communicate with appropriate personnel to obtain information when necessary, and respond to customer inquiries through appropriate mediums."
    },
    {
      "duty": "Attain performance level standards as outlined in performance objectives and stay current with relevant products."
    },
    {
      "duty": "Model Farmers core values and participate in insurance-related courses/seminars to expand product/system knowledge."
    },
    {
      "duty": "Meet or exceed individual performance, metrics, and goals, identify and suggest innovative process changes to support business practices, and demonstrate above-average written and verbal communication skills."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent. Four-year college degree preferred. Completion of required additional training."
    }
  ]
}