{
  "meta": [
    {
      "job_title": "Therapist",
      "job_category": "Healthcare",
      "job_class": "Therapist",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide therapeutic and counseling programs and services for assigned individuals, including individual and group therapy sessions."
    },
    {
      "duty": "Conduct student assessments and evaluations to determine abilities and needs with regard to cognitive, behavioral, social, and emotional development."
    },
    {
      "duty": "Develop therapy plans, activities, and experiences which address identified goals and objectives."
    },
    {
      "duty": "Prepare materials for planned activities and therapy sessions; conduct individual and group therapy sessions."
    },
    {
      "duty": "Collect and record behavioral and progress-related data obtained from therapy sessions and activities."
    },
    {
      "duty": "Consult with supervisors, academic peers, and other staff relating to individual treatment plans and needs."
    },
    {
      "duty": "Provide clinical supervision to non-licensed therapists; assist in developing action plans for pursuing licensure."
    },
    {
      "duty": "Implement crisis intervention strategies as needed; document and report all incidents in accordance with policies and procedures."
    },
    {
      "duty": "Maintain open communications and provide information and interpretations to parents, guardians, and other agencies regarding individual progress, needs, and treatment plans."
    },
    {
      "duty": "Participate in a variety of meetings and committees such as treatment planning meetings, staff meetings, etc."
    },
    {
      "duty": "Provide program-related training to staff as requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in counseling, psychology, or social work."
    }
  ]
}