{
  "meta": [
    {
      "job_title": "Internal Communications Representative",
      "job_category": "Communications",
      "job_class": "Representative",
      "sector": "Marketing",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Content Creation",
      "experience": 5
    },
    {
      "skill": "Internal Communications",
      "experience": 5
    },
    {
      "skill": "Employee Engagement",
      "experience": 5
    },
    {
      "skill": "Digital Signage Management",
      "experience": 5
    },
    {
      "skill": "Intranet Management",
      "experience": 5
    },
    {
      "skill": "Content Calendar Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Graphic Design",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop visually appealing and engaging content for internal communication channels, including digital signage displays and company intranet."
    },
    {
      "duty": "Collaborate with various departments and local sites to gather information and create stories and posts that resonate with employees and reinforce company values and mission."
    },
    {
      "duty": "Customize communication content to suit different audiences, regions, and communication channels, ensuring consistency with branding guidelines."
    },
    {
      "duty": "Manage and regularly update the company intranet with relevant stories, announcements, and resources to keep employees informed and engaged."
    },
    {
      "duty": "Maintain a content calendar to ensure communications are timely, relevant and in line with organizational events and initiatives."
    },
    {
      "duty": "Develop and maintain an active database of current and archived communication content, ensuring easy accessibility for future reference."
    },
    {
      "duty": "Monitor and track the effectiveness of internal communication activity, utilizing feedback and data to drive continuous improvement."
    },
    {
      "duty": "Identify opportunities that effectively engage employees and foster a positive, inclusive workplace culture."
    },
    {
      "duty": "Work closely with the broader marketing and communications team to align internal messaging with external branding efforts."
    },
    {
      "duty": "May perform other duties and responsibilities as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in relevant fields, such as communications or other disciplines demonstrating exceptional writing proficiency."
    },
    {
      "credential": "Proficiency in Microsoft Office Suite, including PowerPoint."
    }
  ]
}