{
  "meta": [
    {
      "job_title": "Metrology Technology Development Intern",
      "job_category": "Technology",
      "job_class": "Intern",
      "sector": "Technology",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Optical Metrology",
      "experience": 3
    },
    {
      "skill": "Data Science",
      "experience": 3
    },
    {
      "skill": "Semiconductor Manufacturing",
      "experience": 3
    },
    {
      "skill": "Electrical Metrology",
      "experience": 3
    },
    {
      "skill": "Data Analytics",
      "experience": 3
    },
    {
      "skill": "MS Office",
      "experience": 3
    },
    {
      "skill": "JMP",
      "experience": 3
    },
    {
      "skill": "MATLAB",
      "experience": 3
    },
    {
      "skill": "Python",
      "experience": 3
    },
    {
      "skill": "C++",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Complete two or three Metrology related projects, summarize the results, and present your project to the larger Metrology team."
    },
    {
      "duty": "Plan, design, and run experiments in a semiconductor cleanroom using state of the art technology."
    },
    {
      "duty": "Analyze top-down and cross-sectional semiconductor structure metrology data using Excel and JMP."
    },
    {
      "duty": "Work on new metrology technology and measurement techniques to ensure that our measurement capabilities meet the technical device roadmaps."
    },
    {
      "duty": "Collaborate with engineers in Metrology, in Boise and across the globe, as well as other process areas."
    },
    {
      "duty": "Evaluations of new metrology tools to determine lowest cost of ownership solutions with the highest accuracy and precision for deployment in R&D and high-volume manufacturing."
    },
    {
      "duty": "Developing applications on next generation processes and technologies within Fab 4 and qualification for technology transfers to production fabs."
    },
    {
      "duty": "Working closely with process development and process integration engineers to optimize measurements for multiple device process flows and layer stacks."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Applicants should be working towards an M.S. or Ph.D. in Engineering, Physics, Material Science, or a semiconductor-related field. Applicants are continuing education in Fall of 2024Six-months co-op and 3 months summer internships will be considered."
    }
  ]
}