{
  "meta": [
    {
      "job_title": "Retail Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Customer Experience",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Sales Metrics",
      "experience": 5
    },
    {
      "skill": "Retail Operations",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Sales Compensation Plans",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Achieve all sales and service metrics through daily supervision and mentorship of retail sales team."
    },
    {
      "duty": "Proactively coach and develop store teams to perform their responsibilities at a high level."
    },
    {
      "duty": "Ensure store environment consistently follows published planograms and branding standards."
    },
    {
      "duty": "Coordinate all daily sales floor responsibilities, including accurate and efficient staffing and scheduling, dress code compliance, sales huddles, and resolution of customer issues."
    },
    {
      "duty": "Drive operational excellence with a focus on inventory management and store inventory cycle counts."
    },
    {
      "duty": "Review store reports looking for improvement opportunities in the areas of sales, inventory, cash handling, efficiency, and net promoter system (NPS)."
    },
    {
      "duty": "Coach team members on how to position all products with customers and ensure customers are treated with the highest levels of courtesy and integrity."
    },
    {
      "duty": "Remain current on new and current products and services, industry, and competitive trends and reinforce findings with the team."
    },
    {
      "duty": "Coordinate cash handling policies and procedures and demonstrate available tools to supervise customer feedback, mentor, and take action to improve the store experience."
    },
    {
      "duty": "Build collaborative relationships with market and region partners."
    },
    {
      "duty": "Must be able to carry and lift up to 25-pound boxes, stand and move about the store constantly. Must be able to work nights and weekends, variable schedule(s), and overtime as vital."
    },
    {
      "duty": "Other duties and responsibilities as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree"
    }
  ]
}