{
  "meta": [
    {
      "job_title": "Beer and Wine Clerk",
      "job_category": "Retail",
      "job_class": "Clerk",
      "sector": "Retail",
      "salary": 32000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Educate guests on product attributes and information and provide guidance for specific needs/preferences."
    },
    {
      "duty": "Ensure marketing and brand materials and tools are properly displayed, maintained, and utilized including, signage, prices, flyers, etc."
    },
    {
      "duty": "Maintain the sanitation and appearance of the Beer Den/Sunmill Wines."
    },
    {
      "duty": "Work with category managers and suppliers to ensure proper pricing and product selection."
    },
    {
      "duty": "Train other Beer Den/Wine clerks and ensure information is correct and available for all hosts who work in the Beer Den/Sunmill Wines."
    },
    {
      "duty": "Conduct tastings as needed in the Beer Den/Sunmill Wines as well as for in-store demos or promotions."
    },
    {
      "duty": "Follow all state laws governing the sampling, sale, and purchasing of beer and wine."
    },
    {
      "duty": "Wash and prepare growlers according to established practices."
    },
    {
      "duty": "Fill growlers upon request by the guest according to established filling, sealing, and labeling standards."
    },
    {
      "duty": "Maintain inventory of growlers, glass, lids, and all other Beer Den and wine supplies through monitoring and ordering."
    },
    {
      "duty": "Announce specials and sale information on the PA system."
    },
    {
      "duty": "Perform all other duties as assigned by management."
    }
  ],
  "skills": [
    {
      "skill": "Product Knowledge",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Product Display Management",
      "experience": 3
    },
    {
      "skill": "Product Pricing",
      "experience": 3
    },
    {
      "skill": "Training Coordination",
      "experience": 3
    },
    {
      "skill": "Sales Compliance",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Working understanding of beer and wine. Familiar with ALE laws governing sell, and purchasing of beer and wine products."
    }
  ]
}