{
  "meta": [
    {
      "job_title": "Inventory Control Specialist",
      "job_category": "Logistics",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direct, hands-on verification of sample inventory to ensure quality execution of policies and procedures related to sample storage."
    },
    {
      "duty": "Assist in the development, implementation, and management of a formal program to perform scheduled and random audits related to sample inventory for integrity and accuracy."
    },
    {
      "duty": "Monitor specialty sample category segregation to ensure client needs are met."
    },
    {
      "duty": "Perform quarterly review of randomly selected sample storage environments to ensure inventory accuracy."
    },
    {
      "duty": "Lead sample inventory verification program to track, report and research inventory discrepancies to make necessary corrections."
    },
    {
      "duty": "Analyze, maintain, and reconcile inventory verification to ensure client and internal requirements are met."
    },
    {
      "duty": "Perform thorough research using all available resources to identify root causes and supply possible solutions."
    },
    {
      "duty": "Work with key personnel to implement process improvements to optimize overall accuracy of sample inventory."
    },
    {
      "duty": "Establish, capture, and manage inventory control metrics."
    },
    {
      "duty": "Facilitate customers inventory audits and provide information to customers upon request."
    },
    {
      "duty": "Assist others in resolving technical or operational problems to ensure an accurate and timely resolution of sample inventory discrepancies."
    },
    {
      "duty": "Maintain list of suppliers and take inventory and re-order consumables via Oracle."
    },
    {
      "duty": "Monitor and maintain sufficient levels of supplies."
    },
    {
      "duty": "Improve inventory software functionality, manage supply stock locations, lead times, and re-order points."
    },
    {
      "duty": "Create purchase order documentation for approval."
    },
    {
      "duty": "Foster effective and cordial relationships with suppliers and vendors."
    },
    {
      "duty": "Maintain a safe work environment by following all established safety guidelines and procedures."
    },
    {
      "duty": "Ensure adherence to all company policies, guidelines, and SOPs."
    },
    {
      "duty": "Identify, investigate, and report service failures appropriately."
    },
    {
      "duty": "Document and follow through with root cause analysis and corrective and preventative actions for errors and discrepancies."
    },
    {
      "duty": "Assist in developing, implementing, validating, and testing of new processes."
    },
    {
      "duty": "Perform routine and non-routine quality checks as directed."
    }
  ],
  "skills": [
    {
      "skill": "Biobank Technician",
      "experience": 6
    },
    {
      "skill": "Senior Biobank Technician",
      "experience": 6
    },
    {
      "skill": "GMP/GTP/CLIA Experience",
      "experience": 6
    },
    {
      "skill": "Communication Skills",
      "experience": 6
    },
    {
      "skill": "Documentation",
      "experience": 6
    },
    {
      "skill": "Process Improvement",
      "experience": 6
    },
    {
      "skill": "Inventory Management",
      "experience": 6
    },
    {
      "skill": "Supply Chain Management",
      "experience": 6
    },
    {
      "skill": "Data Analysis",
      "experience": 6
    },
    {
      "skill": "Problem Solving",
      "experience": 6
    },
    {
      "skill": "Teamwork",
      "experience": 6
    },
    {
      "skill": "Detail Oriented",
      "experience": 6
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Life Sciences Degree (Master's preferred)"
    }
  ]
}