{
  "meta": [
    {
      "job_title": "Client Account Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Exceed sales, revenue, profitability, and client satisfaction targets as assigned."
    },
    {
      "duty": "Develop and maintain a business plan across your portfolio accounts with individual account plans that achieve the assigned targets."
    },
    {
      "duty": "Build and maintain a healthy, qualified pipeline of new opportunities that lead to sales and revenues by working/networking across municipal leaders and attending/participating in local meetings & events."
    },
    {
      "duty": "Nurture and develop new opportunities that are innovative and strategic to growing the organization."
    },
    {
      "duty": "Ensure high client satisfaction and mitigate revenue & client losses by engaging client leaders, leading issue resolution and providing performance reviews and reports."
    },
    {
      "duty": "Establish yourself and the organization as a trusted adviser on the industry and community development services thought leader bringing unique, value-added insights to your clients that help them meet their objectives."
    },
    {
      "duty": "Work closely with the operations teams and organization leaders to grow revenue in existing accounts, develop winning solutions, serve clients better and meet overall financial objectives."
    },
    {
      "duty": "Execute successful account management and sales strategies, techniques, and best practices to optimize growth, win-rates, profitability, and client satisfaction."
    },
    {
      "duty": "Create and present market and competitively differentiated solutions that the organization can profitably deliver and support by working closely with operations and all departments."
    },
    {
      "duty": "Prepare and respond to all target account requests for proposals, company information, and presentations on the company’s capabilities in a manner that distinguishes the organization from competition."
    },
    {
      "duty": "Provide feedback to management to improve the success of sales, solutions, pricing, and go-to-market."
    },
    {
      "duty": "Maintain sales and client databases and provide reporting and forecasting as required."
    },
    {
      "duty": "Perform other duties as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or higher, preferably in business, operations, public admin, construction, economics"
    }
  ]
}