{
  "meta": [
    {
      "job_title": "Financial Services Manager",
      "job_category": "Financial Services",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Compliance Knowledge",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Banking Operations",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise and direct the sales functions of a Retail Branch Office, identifying opportunities and selling a full suite of Retail Banking deposit and lending products to consumers and small businesses."
    },
    {
      "duty": "Support the Branch Manager through coaching and developing platform staff, and work directly with clients on complex consumer, business, and fiduciary account structures."
    },
    {
      "duty": "Manage the sale of Branch lending and deposit products in alignment with the Bank's goals, source and develop new business by expanding and deepening relationships with new and existing customers."
    },
    {
      "duty": "Assist the Branch Manager in internal and external business development, determine sales goals, and develop strategies to meet those sales goals. Coach, guide, develop, and direct subordinate staff."
    },
    {
      "duty": "Coordinate effective retail branch operations and sales with the Banking Services Officer, promoting teamwork, excellent customer service, cross-sales, and the promotion of Bank products and services."
    },
    {
      "duty": "Maintain compliance with established internal operational standards and Federal and State regulations to protect the interest of the Bank and clients, and represent the Bank in civic and community events to enhance visibility and reputation of the Bank, and to expand business opportunities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma/GED required. Minimum of 3 years banking experience in a sales role required. Minimum of 1 year of leadership experience preferred. May require registration as a Mortgage Loan Originator (MLO) under the \"Secure and Fair Enforcement of Mortgage Licensing Act\" and a notary license. Extensive knowledge of Bank Products and Services, policies and procedures related to new accounts and sales functions. Thorough knowledge of small business and consumer credit principles and practices. Knowledge of State and Federal banking regulations as they relate to new accounts and operations functions. Leadership ability to supervise and direct subordinate employees, and provide coaching and development. Ability to persuade, including the value and benefits of using the Bank’s services and products. Excellent interpersonal skills (verbal and written), including customer service, listening, and responding appropriately to requests from customers. Outside calling skills including prospecting, appointment setting, and sales presentations to decision makers"
    }
  ]
}