{
  "meta": [
    {
      "job_title": "Academic Coach",
      "job_category": "Education",
      "job_class": "Coach",
      "sector": "Education",
      "salary": 50000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the first and primary point of contact for all coaching, persistence, and retention initiatives."
    },
    {
      "duty": "Maintain an academic coaching caseload, cultivate meaningful student relationships, and share findings and trends related to retaining and tracking cohort students."
    },
    {
      "duty": "Collaborate with leadership to identify, create, and monitor retention strategies for struggling FTIC student populations identified by academic standing."
    },
    {
      "duty": "Conduct both one on one and group academic coaching sessions utilizing multiple modalities such as in-person, virtual, phone, and email."
    },
    {
      "duty": "Help students make informed academic decisions by teaching them how to track their academic progress, locate and interpret appropriate policies, and utilize the available tools and resources."
    },
    {
      "duty": "Monitor the academic progress of a student caseload. This includes proactive outreach to provide students with just-in-time assistance."
    },
    {
      "duty": "Manage an academic coaching caseload for first year and targeted student populations to emphasize academic and career goal setting, learning strategies, time management and organization, self-regulation, and self-efficacy."
    },
    {
      "duty": "Work with leadership to reach out to high-risk students; create persistence planning with students who are not in good academic standing."
    },
    {
      "duty": "Participate in the daily oversight and implementation of academic coaching best practices and communication of program requirements."
    },
    {
      "duty": "Assist with retention programming, for FTIC and targeted populations, tracking coaching data and program evaluation."
    },
    {
      "duty": "Evaluate retention efforts and provide feedback to improve case management approach and intentional interventions with FTIC and transfer student cohorts."
    },
    {
      "duty": "Stay current on relevant academic programs and support services to provide appropriate referrals to students."
    },
    {
      "duty": "Participate in meetings, professional conferences, and individual professional development."
    },
    {
      "duty": "All other duties as assigned."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree and two to three years (2-3) of experience working with college students or high school students transitioning to Higher Education or equivalent experience."
    },
    {
      "credential": "Master’s degree in higher education, college student development, or a related field with experience equivalent to a master’s degree. Three to five (3–5) years of experience in an advisory, administrative, or educational capacity with college students. Academic advising experience preferred. Leadership and/or supervisory experience at an institution of higher education. Experience implementing, monitoring, and assessing student development programs/projects."
    }
  ]
}