{
  "meta": [
    {
      "job_title": "Technical Program Manager",
      "job_category": "Engineering",
      "job_class": "Program Manager",
      "sector": "Software Engineering",
      "salary": 160000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "Cloud Computing",
      "experience": 5
    },
    {
      "skill": "Management Consulting",
      "experience": 5
    },
    {
      "skill": "Cross-functional Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Stakeholder Relationship Building",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Technical Roadmapping",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead complex, multi-disciplinary projects from start to finish, plan requirements, identify risks, manage project schedules, and communicate clearly with cross-functional partners."
    },
    {
      "duty": "Provide analytic and operational support to the Technology team within Google Public Sector, engage with stakeholders across GPS and Google Cloud."
    },
    {
      "duty": "Conduct analysis, develop communication materials, and facilitate executive sessions and problem-solving meetings in support of the Technology team’s efforts to develop and accredit technical solutions to customers’ challenges."
    },
    {
      "duty": "Lead special initiatives to improve and transform work, support internal planning and reporting requirements, and help develop technical roadmaps and explore technical dependencies."
    },
    {
      "duty": "Develop, manage, and maintain planning and business reporting materials in support of the GPS business and operational cadence."
    },
    {
      "duty": "Identify and solve strategic/operational problems and manage projects with multiple leaders and cross-functional stakeholders."
    },
    {
      "duty": "Develop, manage, and maintain planning and business reporting materials in support of the GPS business and operational cadence."
    },
    {
      "duty": "Identify gaps and propose changes to existing policy, systems, and process frameworks, develop scalable solutions and manage risks across the organization, and develop best practices that are a benefit across the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a technical field, or equivalent practical experience. MBA or Master's degree preferred."
    }
  ]
}