{
  "meta": [
    {
      "job_title": "Program Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage end-to-end delivery for a defined program or portfolio of programs."
    },
    {
      "duty": "Monitor delivery throughout life of the program and assess outcomes to ensure completeness and sustainability."
    },
    {
      "duty": "Modify program plan as necessary in coordination with stakeholders."
    },
    {
      "duty": "Continuously monitor adherence to program budget, and secure additional funding if required and available."
    },
    {
      "duty": "Create and administer central tracking of program stakeholders, scope, timing, resource requirements and deliverables."
    },
    {
      "duty": "Leverage standardized templates and communication channels to monitor delivery against program milestones."
    },
    {
      "duty": "Act as central coordinator of program management office (PMO) and facilitate execution of program deliverables."
    },
    {
      "duty": "Liaise with subject matter experts throughout the organization to contribute as required."
    },
    {
      "duty": "Prepare regular status reports for program management highlighting potential risks in terms of under-delivery, missed deadlines and/or budget overrun."
    },
    {
      "duty": "Act as liaison between program work-streams to promote coordination and awareness of over-arching program objectives."
    },
    {
      "duty": "Prepare impact assessments of program outcomes to socialize target end state with relevant process owners."
    },
    {
      "duty": "Collect and summarize process owner feedback to inform refinements to program outcomes as necessary."
    },
    {
      "duty": "Establish relationships with internal subject matter experts to facilitate involvement and contributions to program delivery."
    },
    {
      "duty": "Align with program management teams in other regions or business verticals to share best practice and collaborate on cross-divisional or cross-regional initiatives as appropriate."
    },
    {
      "duty": "Leverage excellent organizational skills to centrally track and report program delivery on a continuous basis and update program managers and work-stream leads on program status."
    },
    {
      "duty": "Engage effectively with program stakeholders including work-stream leads, business contacts, process owners and infrastructure partners."
    },
    {
      "duty": "Regularly canvas business stakeholders and subject matter experts for input on program deliverables."
    },
    {
      "duty": "Engage Six Sigma, lean and/or agile techniques as appropriate."
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Process Improvement Methodologies",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Management, or related field (Master's preferred)"
    }
  ]
}