{
  "meta": [
    {
      "job_title": "Digital Product Realization Enterprise Team Member",
      "job_category": "Engineering",
      "job_class": "Engineering",
      "sector": "Software Engineering",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work as a key member of the Digital Product Realization Enterprise team to design the configuration of Windchill among other applications, specifically focusing on effectively managing MBD and other Part Objects in downstream manufacturing and quality acceptance applications."
    },
    {
      "duty": "Assess customer needs to determine alignment of unit/corporation business needs and the impact on business processes to establish strategic priorities."
    },
    {
      "duty": "Develop convergence plans toward standards and ensure adherence to quality standards and procedures, reviewing modules for quality assurance."
    },
    {
      "duty": "Identify better sources of data feeds and interface with Enterprise Architects to ensure feasibility with corporate data warehouse."
    },
    {
      "duty": "Perform installation, functional and performance testing, maintenance, and modification of vendor-supplied software."
    },
    {
      "duty": "Lead the development of guidelines and standards to be utilized in software development/ integration and develop and lead implementation plans for integration testing."
    },
    {
      "duty": "Provide technical guidance or business process expertise, technical leadership, coaching and mentoring to team members and assist in developing training material for end users."
    }
  ],
  "skills": [
    {
      "skill": "PTC Windchill 11.0 or Later",
      "experience": 7
    },
    {
      "skill": "Programming in Java, C#, Python",
      "experience": 7
    },
    {
      "skill": "Product Data Management (PDM)",
      "experience": 7
    },
    {
      "skill": "Enterprise Resource Planning (ERP) and Manufacturing Execution Systems (MES)",
      "experience": 7
    },
    {
      "skill": "Model Based CAD software (Creo, Solidworks, etc.)",
      "experience": 7
    },
    {
      "skill": "Advanced engineering and analytical concepts and techniques",
      "experience": 7
    },
    {
      "skill": "Working without supervision and providing technical consultation and guidance to others",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 255,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science degree from an ABET accredited Engineering program or bachelor of science degree in Physics from an accredited program"
    }
  ]
}