{
  "meta": [
    {
      "job_title": "Senior Manager, Cost Model Analytics",
      "job_category": "Management",
      "job_class": "Senior Manager",
      "sector": "Management",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Finance",
      "experience": 5
    },
    {
      "skill": "Pricing",
      "experience": 5
    },
    {
      "skill": "Revenue Management",
      "experience": 5
    },
    {
      "skill": "Sales Operations Analytics",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Business Intelligence",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "PowerBI",
      "experience": 5
    },
    {
      "skill": "Google Big Query",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "MS Excel",
      "experience": 5
    },
    {
      "skill": "Strategic Thinking",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as subject matter expert on cost model allocation methodology and develop continuous improvement process for allocation algorithms to ensure accurate costing and profitability reporting."
    },
    {
      "duty": "Manage and develop a team of analysts; act as a change agent, constantly developing the team profile, skills and talent."
    },
    {
      "duty": "Develop reporting and analyses to attention-direct the sales, pricing and operations teams towards opportunities."
    },
    {
      "duty": "Participate in initiatives to drive continuous improvement in volume, yield and operating ratio."
    },
    {
      "duty": "Create detailed analyses around pricing effectiveness, customer profitability, service offerings and lane-level performance and communicate findings to senior leadership."
    },
    {
      "duty": "Perform miscellaneous analyses and projects as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent related work or military experience.5 years of experience in finance, pricing, revenue management or sales operations analytics desired.Demonstrated strategic thinking, specifically on the use of data and analyses to drive business results.Demonstrated ability to translate complicated subjects into easily digestible communications.Proficiency in data analysis, business intelligence and statistical analysis packages (i.e. SQL, PowerBI, Google Big Query)Strong proficiency in Microsoft Office applications, with advanced skills in MS ExcelMBAProven ability to communicate and collaborate effectively cross-functionally.Ability to independently identify problems and develop action plans for resolution.Strong project management, change management and team management skills.Availability to travel 15% of the time"
    }
  ]
}