{
  "meta": [
    {
      "job_title": "Distribution Center Supervisor",
      "job_category": "Management",
      "job_class": "Supervisor",
      "sector": "Supply Chain",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for supervising and coordinating activities for assigned functional area in the Distribution Center."
    },
    {
      "duty": "Monitors team members' productivity and work quality, and manages performance using available tools."
    },
    {
      "duty": "Mentors team members through on-the-job training and collaborates with DC Trainer on new team member orientation."
    },
    {
      "duty": "Establishes and cultivates morale and engagement of team members. Encourages participation in workplace activities and events."
    },
    {
      "duty": "Upholds compliance with all Centers of Excellence SOP's for each applicable functional area."
    },
    {
      "duty": "Collaborates with management to measure performance compliance and requirements, and directs appropriate actions to maintain performance at or above required levels."
    },
    {
      "duty": "Maintains appropriate records for team members, equipment, and KPI's under their responsibility."
    },
    {
      "duty": "Participates in administrative activities, defines resource needs, and assists in managing daily staffing needs for the designated department."
    },
    {
      "duty": "Participates in team member concerns: reporting, follow-up, investigating, or disciplinary process."
    },
    {
      "duty": "Promotes a safe environment and meets safety requirements complying with company policies and regulations."
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Operational Analysis",
      "experience": 3
    },
    {
      "skill": "Training and Development",
      "experience": 3
    },
    {
      "skill": "Performance Management",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Safety Compliance",
      "experience": 4
    },
    {
      "skill": "Administrative Management",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree and at least 1 year experience in collaborating/leading team projects OR High School/GED and at least 4 years' experience in collaborating/leading team projects OR High School/GED and United States Armed Forces or equivalent experience demonstrating leadership skills."
    }
  ]
}