{
  "meta": [
    {
      "job_title": "Division Engineer",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Engineering",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Civil Engineering",
      "experience": 4
    },
    {
      "skill": "Structural Engineering",
      "experience": 4
    },
    {
      "skill": "Construction Supervision",
      "experience": 4
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 4
    },
    {
      "skill": "Employee Relations",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee Engineering Division office activities, including approving material requisitions and invoices, monitoring budget status, and ordering ballast weekly."
    },
    {
      "duty": "Coordinate inquiries from the field and system personnel, compile weekly reports, and oversee division vehicle registration and licensing."
    },
    {
      "duty": "Handle labor matters, labor investigations, and approve or decline labor claims and grievances."
    },
    {
      "duty": "Represent the Division Engineer at meetings in their absence, and handle new hire contract process and training."
    },
    {
      "duty": "Review injury reports, conduct follow-up investigations, and prepare trend analysis, reports, and presentations."
    },
    {
      "duty": "Coordinate the morning conference call to collect data from field officers, recruit, interview, and train union and non-union subordinates, and handle material distribution for all disciplines of Engineering."
    },
    {
      "duty": "Compile weekly reports on various activities and responsibilities as assigned by manager."
    },
    {
      "duty": "Wear protective equipment, work variable hours, and work inside an office environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Civil Engineering, Structural Engineering, or Construction (Master's preferred)"
    }
  ]
}