{
  "meta": [
    {
      "job_title": "Construction Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Safety Management",
      "experience": 10
    },
    {
      "skill": "Contract Management",
      "experience": 10
    },
    {
      "skill": "Quality Control",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 10
    },
    {
      "skill": "Planning & Coordination",
      "experience": 10
    },
    {
      "skill": "Problem Solving",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direct management of field construction activities in Hydrogen, Ammonia, Air Separation, or other process gas technologies for facilities that AP will own and operate."
    },
    {
      "duty": "Manage the execution of construction contracts at a project site with primary responsibility for meeting safety performance, quality, schedule, and cost objectives."
    },
    {
      "duty": "Plan and coordinate the activities of multiple subcontractors and manage construction contracts to ensure quality and that tasks are completed on time."
    },
    {
      "duty": "Analyze contractor progress and develop corrective action plans as the need arises."
    },
    {
      "duty": "Represent Air Products in a professional manner and work with other Superintendents as part of a site construction team."
    },
    {
      "duty": "Driving and enforcing a progressive safety program with the goal of zero incidents."
    },
    {
      "duty": "Clearing execution obstacles to provide opportunities for subcontractors to be successful."
    },
    {
      "duty": "Demonstrate passionate ownership of the scope of work and implement work practices to ensure safety, quality, and progress tracking."
    },
    {
      "duty": "Participate in efforts to improve group work processes and capabilities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100
    },
    {
      "student_teacher": 80
    },
    {
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering, Construction Management, or related field (Master's preferred)"
    }
  ]
}