{
  "meta": [
    {
      "job_title": "Transportation Data Quality Assurance Analyst",
      "job_category": "Computer Information Systems",
      "job_class": "Analyst",
      "sector": "Energy & Environment Science & Technology",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Processing",
      "experience": 5
    },
    {
      "skill": "Software Development",
      "experience": 5
    },
    {
      "skill": "Python",
      "experience": 5
    },
    {
      "skill": "Data Handling",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Technical Writing",
      "experience": 5
    },
    {
      "skill": "Electric Vehicle Technology",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Capture and interpret data from laboratory testing, field evaluations, and demonstrations of electric and automated vehicles, as well as electric vehicle charging stations and other advanced vehicle and infrastructure technologies."
    },
    {
      "duty": "Characterize data quality and generate metadata describing transportation-related data in multiple repositories and projects."
    },
    {
      "duty": "Work with software developers and analysts to develop, maintain, and improve new and existing tools supporting data analysis needs."
    },
    {
      "duty": "Direct the development of technical reports, literature searches, and presentation/publications."
    },
    {
      "duty": "Contribute to publishing technical papers, reports, and presentations for journal and meeting publications."
    },
    {
      "duty": "Participate in technical meetings to lead project reviews with customers."
    },
    {
      "duty": "Report results directly to customers, partners, and others."
    },
    {
      "duty": "Aid in department and directorate activities including safety teams, program development, and continuing professional development."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree in computer science, data science, or a related field and 5 years of experience, or a Master's degree and 3 years experience."
    }
  ]
}