{
  "meta": [
    {
      "job_title": "Anthropologie Weddings Styling Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Acts as a brand representative reflective of the company values; facilitates sharing of product knowledge, current trends, and personal styling priorities to inspire the customer."
    },
    {
      "duty": "Drives a selling culture by providing support to the styling team and offering individual attention to customers; utilizes technology to provide a frictionless client experience."
    },
    {
      "duty": "Works alongside Stylists to foster ongoing relationships with clients through outreach and networking, appointment generation, service follow-up, and engagement through store events."
    },
    {
      "duty": "Contributes to overall team morale by being positive, confident, respectful, and helpful to others."
    },
    {
      "duty": "Collaborates with peers and leadership, sharing ideas with the team and actively participating in daily meetings, fit sessions, store initiatives, and brand focuses."
    },
    {
      "duty": "Assists store leaders in maintaining a visually compelling store that is neat, clean, and organized; supports weekly store objectives relating to customer service, outfitting, or styling."
    },
    {
      "duty": "Supports leadership and styling team with executing service and selling strategies to impact store goals and profitability; understands key metrics and how they contribute to the overall profitability of the shop."
    },
    {
      "duty": "Adheres to store’s safety standards, inventory accuracy, reduction of product loss, and upholds all company policy and procedures to support the profitability of the store."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Team Player",
      "experience": 2
    },
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Fashion Knowledge",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "None required"
    }
  ]
}