{
  "meta": [
    {
      "job_title": "Renal Specialty Sales Specialist",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 129500,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Clinical Knowledge",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Healthcare Compliance",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Business Analytics",
      "experience": 5
    },
    {
      "skill": "Medical Information",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and position AstraZeneca as a leader through development of long term relationships with key Nephrologists, Endocrinologists, other Diabetes specialty customers and targeted hospital accounts."
    },
    {
      "duty": "Demonstrate superior product and disease state knowledge and effectively educate and engage healthcare professionals in dialogue about clinical evidence, approved indications, product efficacy and safety profiles to support on-label prescribing for appropriate patients."
    },
    {
      "duty": "Develop and maintain in-depth knowledge of market, demographic, and managed care information relative to assigned sales territory."
    },
    {
      "duty": "Regularly use a wide variety of promotional resources, analytical tools to understand and evaluate the business in order to best determine the use of resource personnel to maximize effectiveness in assigned sales territory, based on local assessment of customer needs to accomplish sales objectives."
    },
    {
      "duty": "Thinks strategically by leveraging insights to create a customer/account engagement plan, taking a dynamic and collaborative approach to maximize the business."
    },
    {
      "duty": "Work with your Regional Business Director and District Sales Manager to develop a local strategy and business plan to generate recognizable increases of sales in territory."
    },
    {
      "duty": "Drive sales performance and ensure the sales forecasts and assigned budgets meet or exceed therapeutic and territory goals, while managing your budget."
    },
    {
      "duty": "Ability to identify innovation opportunities to maximize business impact, adapt as needed, and implement; use of multiple tools/channels to engage a customer/account to drive performance."
    },
    {
      "duty": "Successfully complete all training requirements, including your product examinations."
    },
    {
      "duty": "Capitalize on formulary approvals and other opportunities through effective implementation of the Strategic Targeting Plan."
    },
    {
      "duty": "Demonstrate learning agility, flexibility and ability to leverage feedback to learn, grow, and evolve for impact."
    },
    {
      "duty": "Partner and collaborate with other Renal Metabolic Specialty Sales Specialists to achieve common objectives and coordinated selling efforts."
    },
    {
      "duty": "Provide timely and administrative management of work hours, sales data, customer objectives, communication responses, synchronization, sample and expense reporting."
    },
    {
      "duty": "Work within the framework of AstraZeneca’s Company Values."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree At least two years of documented, full-time, successful pharmaceutical sales in Diabetes sales OR 3 yrs sales experience in scientific/clinical/healthcare environment OR demonstrated experience & knowledge within healthcare ecosystems"
    }
  ]
}