{
  "meta": [
    {
      "job_title": "Sr. LVN",
      "job_category": "Healthcare",
      "job_class": "Senior Licensed Vocational Nurse",
      "sector": "Healthcare",
      "salary": 52000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 2
    },
    {
      "skill": "Clinical Procedures",
      "experience": 2
    },
    {
      "skill": "Vital Signs Measurement",
      "experience": 2
    },
    {
      "skill": "Health Care Team Collaboration",
      "experience": 2
    },
    {
      "skill": "Referral Management",
      "experience": 2
    },
    {
      "skill": "Medication Management",
      "experience": 2
    },
    {
      "skill": "Scribing",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform a wide variety of patient care activities in an assigned specialty or subspecialty outpatient clinic under the direction of a staff nurse and/or physician."
    },
    {
      "duty": "Record accurate vital signs and measurements, assist with exams and procedures."
    },
    {
      "duty": "Collaborate with health care team members to ensure patient needs are met and clinic operations are efficient."
    },
    {
      "duty": "Manage refill requests and administer medications to patients following policies and procedures."
    },
    {
      "duty": "Identify patient needs for referrals and implement teaching plans for patients and their families."
    },
    {
      "duty": "Serve as a leader in providing excellent service to patients by welcoming them warmly and ensuring clear and accurate communication."
    },
    {
      "duty": "Assist Nurse Manager in ensuring all team members meet service standards and follow department guidelines."
    },
    {
      "duty": "Identify needs for improvement and opportunities to recognize excellence in the performance of all team members."
    },
    {
      "duty": "Work under usual clinic conditions, necessitating a high degree of contact with patients, families, and clinic personnel."
    },
    {
      "duty": "Work directly with a provider and record in \"real time,\" facts and events that occur between a patient and a provider as a scribe."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of a Board of Nursing accredited program of vocational nursing. Current Vocational Nursing license in the state of Texas or the attainment of a temporary permit to practice vocational nursing pending full licensure in the state of Texas."
    }
  ]
}