{
  "meta": [
    {
      "job_title": "Principal Consultant/Project Manager, Environmental Compliance and Management Systems",
      "job_category": "Consulting",
      "job_class": "Principal Consultant/Project Manager",
      "sector": "Management",
      "salary": 130000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement a strategic business/action plan, provide leadership, and deliver performance results to expand sustainable operations service and client base."
    },
    {
      "duty": "Provide technical assistance on environmental compliance, environmental management system, and due diligence transaction projects."
    },
    {
      "duty": "Provide on-site EHS compliance support at client facilities."
    },
    {
      "duty": "Perform environmental compliance audits and implement follow-up corrective actions to ensure compliance with federal, state, and local regulations."
    },
    {
      "duty": "Implement environmental management systems and programs for corporate clients."
    },
    {
      "duty": "Develop plans, permits, and procedures for air quality, hazardous waste, spill prevention, stormwater, and wastewater."
    },
    {
      "duty": "Perform Phase I Environmental Site Assessments to support property due diligence services."
    },
    {
      "duty": "Manage litigation support projects under attorney-client privilege."
    },
    {
      "duty": "Prepare technical proposals and participate in business development with existing clients and identified leads."
    },
    {
      "duty": "Maintain client relationships that generate repeat business."
    },
    {
      "duty": "Design and implement corporate environmental strategies and programs, compliance auditing, environmental management systems, high-impact training, and general compliance support."
    },
    {
      "duty": "Achieve client’s expectations for scope, budget, schedule, and quality."
    },
    {
      "duty": "Lead, manage performance, hire and retain, inspire and mentor personnel for overall success of the sustainable operations technical team."
    },
    {
      "duty": "Develop a working understanding of consulting service areas and actively support cross-selling these services to existing clients."
    },
    {
      "duty": "Coordinate with ERM offices in the Americas, Asia-Pacific, and Europe regions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BS/MS degree preferred. Professional Engineering Certification in the field."
    }
  ]
}