{
  "meta": [
    {
      "job_title": "Supply Chain Raw Material Specialist",
      "job_category": "Supply Chain",
      "job_class": "Specialist",
      "sector": "Supply Chain",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Management",
      "experience": 3
    },
    {
      "skill": "Logistics",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Vendor Management",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 3
    },
    {
      "skill": "Analytical Thinking",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for all assigned category(ies) inbound raw material management."
    },
    {
      "duty": "Ensure timely and accurate PO Issuance."
    },
    {
      "duty": "Collaborate with Logistics Team to determine appropriate transportation mode and control freight cost."
    },
    {
      "duty": "Troubleshoot and resolve inbound raw material delays."
    },
    {
      "duty": "Collaborate with Strategic Buyers, local supply chain team, and broader business teams as required."
    },
    {
      "duty": "Support vendor payment process and help in resolving any payment discrepancies with vendors."
    },
    {
      "duty": "Optimize Raw Material Inventory."
    },
    {
      "duty": "Maximize Operational Efficiency with Right Quantity / Right Quality focus."
    },
    {
      "duty": "Reduce Working Capital Requirements by minimizing excess raw material inventory."
    },
    {
      "duty": "Support Strategic Procurement on new raw material set-up process along with 2nd source initiatives."
    },
    {
      "duty": "Track Vendor Execution KPI’s and assist with supplier scorecard data."
    },
    {
      "duty": "Analyze inbound raw material process structure, identify areas of improvement, and lead change initiatives."
    },
    {
      "duty": "Manage priorities from multiple internal customers while remaining professional and thorough."
    },
    {
      "duty": "Attends training sessions external and internal to keep on top of new technology and innovation."
    },
    {
      "duty": "Aligns own goals in accordance with goals of upper management."
    },
    {
      "duty": "Develops superior knowledge of supply chain operations and organizational awareness."
    },
    {
      "duty": "Work to attain positive, cooperative relationships with internal colleagues across divisions and responsibilities."
    },
    {
      "duty": "Effectively use communication channels for proper coordination within the office and other locations."
    },
    {
      "duty": "Portray a positive image of the company and self when interacting with customers and colleagues."
    },
    {
      "duty": "Prepare and submit daily and ad hoc reports."
    },
    {
      "duty": "Participate in the development and training of new employees."
    },
    {
      "duty": "Willingness to work outside normal business hours, depending on business need."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "University Degree in Business Administration or in a related field preferred (Logistics/Supply Chain)"
    }
  ]
}