{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Service",
      "salary": 38000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Respond to customer inquiries via telephone, email, SMS, and Chat to provide problem resolution in accordance with the organization's service standards."
    },
    {
      "duty": "Receive and/or place telephone calls which are predominantly routine, but may require deviation from standard screens, scripts, and procedures."
    },
    {
      "duty": "Answer customer telephone inquiries, orders, service needs, and complaints, respond where applicable or direct to technical/service areas."
    },
    {
      "duty": "Maintain detailed and current knowledge of the company's/assigned client's products and services."
    },
    {
      "duty": "Analyze customer service needs for communication to service and technical departments, when applicable."
    },
    {
      "duty": "Enter required data into client provided systems and databases."
    },
    {
      "duty": "Determine basic reasons for customer issues using a client-provided decision tree and escalates or refers unresolved customer grievances and requests to more experienced Customer Service Representatives or designated departments for further investigation and resolution."
    },
    {
      "duty": "Begin to build base knowledge and familiarization of products, policies, and procedures for a limited number of clients and an understanding of association guidelines and compliance by frequently referring to online manuals and specific client training required to resolve cardholder inquiries."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or Equivalent"
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Data Entry",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    }
  ]
}