{
  "meta": [
    {
      "job_title": "Client Account Specialist",
      "job_category": "Legal Services",
      "job_class": "Specialist",
      "sector": "Legal Services",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepares client bills for billing attorneys; collaborates closely in revisions and takes primary role in correction of time/cost errors; ensures accuracy and timeliness and demonstrates understanding of underlying principles of client billing."
    },
    {
      "duty": "Assists with creating and maintaining matter budgets, matter plans, and status reports; prepares specialized reports as needed."
    },
    {
      "duty": "Assists Client Account Managers with annual rate change process with billing attorneys, management, and administration."
    },
    {
      "duty": "Coordinates data collection for e-billing matter set-up and on-going e-billing maintenance."
    },
    {
      "duty": "Reviews and processes e-billing documentation according to attorney instruction and department procedures; Reviews e-billing documents and client and matter master files for special deals and obtains necessary documentation if deal is not properly reflected in e-billing."
    },
    {
      "duty": "Helps to develop the firm’s e-billing efforts by reviewing procedures and suggesting improvements."
    },
    {
      "duty": "Responsible for time sensitive master files tasks such as client and matter address, UDF and other set ups as needed."
    },
    {
      "duty": "Performs time gathering as needed for specific clients to facilitate bringing time from Carpe Diem to Elite."
    },
    {
      "duty": "Oversee full billing and collection lifecycle. Print and distribute prebills; work with attorneys to edit and finalize bills; follow up on collections and contacting clients as needed."
    },
    {
      "duty": "Become familiar with billing rate structures including potential discounts. Check rates and guidelines; set up e-billing and liaison with e-billing coordinator and attorneys as needed; monitor fee caps, tier discounts and matter budgets and have alerts set up as needed."
    },
    {
      "duty": "Review invoices in depth; finalize invoices and submit in formats meeting attorney and client requirements. Review invoice templates and ensure client specifications are met; review invoices to ensure e-billing requirements have been met and guidelines are being adhered to; respond to any internal and external client inquiries relating to client/matters."
    },
    {
      "duty": "Work with team members to provide analysis and research related to assigned portfolios as needed; providing concise, detail-based documentation, statistics, and recommendations. Prepare effective monthly billing and collections forecasts for assigned portfolio. Update the prebill status report, target cash and star collect; daily monitoring of billing and collection numbers."
    },
    {
      "duty": "Assist with management of client trust accounts, on account billing, accurate payment application, and unapplied fund resolution throughout life cycle of assigned accounts."
    },
    {
      "duty": "Concisely communicate the billing and collection arrangements with clients on their matters. Establish effective backup support processes to ensure seamless support for all portfolio matters."
    }
  ],
  "subjective_elements": [
    {
      "student_teacher": 100,
      "soldier_general": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum two years law firm billing experience, preferably in a large law firm."
    }
  ]
}