{
  "meta": [
    {
      "job_title": "Associate Scientist",
      "job_category": "Science",
      "job_class": "Scientist",
      "sector": "Science",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Molecular Biology techniques (PCR, ddPCR, DNA extraction)",
      "experience": 3
    },
    {
      "skill": "NGS experimental design and data analysis (Illumina, NanoPore, and/or Ion Torrent)",
      "experience": 3
    },
    {
      "skill": "Analytical method development of cell-based assays, binding assays and residual impurities assays",
      "experience": 3
    },
    {
      "skill": "Qualifying, transferring, validating cell therapy analytical methods",
      "experience": 3
    },
    {
      "skill": "Molecular techniques for characterizing Cell and Gene Therapy type materials",
      "experience": 3
    },
    {
      "skill": "Cell culture, ELISAs or similar technology platforms",
      "experience": 3
    },
    {
      "skill": "State-of-the-art cell line engineering technologies",
      "experience": 3
    },
    {
      "skill": "Research with allogeneic CAR T cells",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop robust molecular analytical methods using ground breaking technologies for in process characterization and final product release for cell-based therapies."
    },
    {
      "duty": "Perform analytical testing to support understanding of method attributes or to support cell and gene therapy process development."
    },
    {
      "duty": "Lead analytical method qualification and technology transfer to QC group and partners."
    },
    {
      "duty": "Make detailed observations, analyze data, interpret results, and exercise appropriate technical discretion in the design, execution, and interpretation of experimental results in an independent manner."
    },
    {
      "duty": "Prepare technical reports, protocols, and summaries for presentation."
    },
    {
      "duty": "Present and discuss experimental results at group/project team meetings and at scientific conferences."
    },
    {
      "duty": "Work in a dynamic, team-based structure and collaborate with multiple departments including Research and Process Development."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "BS or MS degree in a relevant field within the biological sciences"
    }
  ]
}