{
  "meta": [
    {
      "job_title": "SAP FS-RI Consultant",
      "job_category": "Information Technology",
      "job_class": "Consultant",
      "sector": "Software Engineering",
      "salary": 132900,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "SAP FS-RI",
      "experience": 5
    },
    {
      "skill": "SAP FS-CD",
      "experience": 5
    },
    {
      "skill": "SAP Configuration",
      "experience": 5
    },
    {
      "skill": "Cost-Benefit Analysis",
      "experience": 5
    },
    {
      "skill": "Business Process Expertise",
      "experience": 5
    },
    {
      "skill": "SAP Integration",
      "experience": 5
    },
    {
      "skill": "SAP Project Lifecycle",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 7
    },
    {
      "skill": "Microsoft Project",
      "experience": 7
    },
    {
      "skill": "Visio",
      "experience": 7
    },
    {
      "skill": "SAP FICO",
      "experience": 8
    },
    {
      "skill": "SAP BW",
      "experience": 8
    },
    {
      "skill": "Business Intelligence",
      "experience": 8
    },
    {
      "skill": "Web Services (SAP NetWeaver)",
      "experience": 8
    },
    {
      "skill": "End-to-End Project Lifecycle",
      "experience": 8
    },
    {
      "skill": "Project and Business Tools",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Acting as a Subject Matter Expert (SME) for the SAP FS-RI (Reinsurance) and/or SAP FS-CD (Collection and Disbursement) applications."
    },
    {
      "duty": "Working directly with the business stakeholders to analyze, document business requirements, and processes for implementation into SAP FS-RI and/or SAP FS-CD."
    },
    {
      "duty": "Creating functional specifications for new functionality as needed."
    },
    {
      "duty": "Developing solutions that take advantage of the out-of-the-box features of the product while minimizing the need for customizations."
    },
    {
      "duty": "Configuring SAP systems per specifications."
    },
    {
      "duty": "Testing changes to configuration and assisting the Quality Assurance (QA) team in test planning and troubleshooting."
    },
    {
      "duty": "Facilitating the acceptance testing of SAP FS-RI and/or SAP FS-CD solutions with end-users."
    },
    {
      "duty": "Conducting Cost-Benefit Analysis of new application functionality."
    },
    {
      "duty": "Providing analysis and troubleshooting of production issues in SAP FS-RI and/or SAP FS-CD and its integration points."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors Degree in Business Administration or Information Technology or Marketing in the area AND 7 or more years of software product management or product development experience."
    },
    {
      "credential": "5+ years of hands-on experience with the configuration of SAP FS-RI (Reinsurance application)"
    },
    {
      "credential": "8+ years of experience with SAP including FICO (Finance and Controlling) or FS-CD (Collections and Disbursements)"
    },
    {
      "credential": "Business process expertise in Billing, Payments, and Collection"
    },
    {
      "credential": "Working knowledge of Business Warehouse (SAP BW) or Business Intelligence (SAP BI)"
    },
    {
      "credential": "Understanding of integration into SAP FS-CD"
    },
    {
      "credential": "Knowledge of web services based on SAP NetWeaver, SAP FS-CD interfaces, and SAP solutions preferred"
    },
    {
      "credential": "Worked on end-to-end project lifecycle experience within SAP FS-RI and/or SAP FS-CD"
    },
    {
      "credential": "Experience of creating clear, concise deliverables that reflect a deep understanding of business needs and out-of-the-box software functionality."
    },
    {
      "credential": "Knowledge and experience of standard project and business tools including Microsoft Project, Excel,PowerPoint, SharePoint"
    }
  ]
}