{
  "meta": [
    {
      "job_title": "Stylist",
      "job_category": "Sales",
      "job_class": "Stylist",
      "sector": "Sales",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Acts as a brand representative reflective of the company values; drives the store experience on the sales floor through an energized pace."
    },
    {
      "duty": "Initiates conversation, shares advice and product knowledge to interact with the customer in every zone in a personalized, genuine way."
    },
    {
      "duty": "Utilizes technology to be well-informed on events and special offers in store and online to enhance the customer experience with an omni perspective."
    },
    {
      "duty": "Contributes to an inclusive and people-first philosophy by being positive, respectful and helpful to others."
    },
    {
      "duty": "Collaborates with peers and leadership, sharing ideas with the team and actively participating in daily meetings, store initiatives, and brand focuses."
    },
    {
      "duty": "Participates in the learning and sharing of product knowledge, current trends, and personal styling priorities to inspire the customer."
    },
    {
      "duty": "Maintains visual and operational standards while keeping the focus on the customer."
    },
    {
      "duty": "Supports the shipment process to gain awareness of product including what’s new and what’s reship."
    },
    {
      "duty": "Adheres to store’s safety standards, inventory accuracy, reduction of product loss, and upholds all company policy and procedures to support the profitability of the store."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Retail Sales",
      "experience": 3
    },
    {
      "skill": "Visual Merchandising",
      "experience": 3
    },
    {
      "skill": "Product Knowledge",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Brand Representation",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 70,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "Experience in customer service."
    },
    {
      "credential": "Experience being a team player."
    },
    {
      "credential": "Ability to work flexible hours to meet the needs of the store including nights, weekends, and holidays."
    }
  ]
}