{
  "meta": [
    {
      "job_title": "Encapsulation Machine Operator",
      "job_category": "Manufacturing",
      "job_class": "Operator",
      "sector": "Manufacturing",
      "salary": 20000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Operate, clean, and maintain an encapsulating press to produce dietary supplements accurately and efficiently, following all GMP and SOP requirements."
    },
    {
      "duty": "Monitor quality throughout the run for physical defects and correct weight, as well as documenting all activity as required by SOP's."
    },
    {
      "duty": "Work in individual production room on your own or with an assistant during cleaning and set-up. Verify current production run with the prior run sample at the start of encapsulation."
    },
    {
      "duty": "Make adjustments to achieve acceptable quality and efficiency. Document all activity as required by SOP’s on batch tickets, room logs, and other records."
    },
    {
      "duty": "Handle and move drums of powder, empty, or filled capsules using hand carts or your safe lifting actions. Maintains a clean and safe work area, remove bags and boxes. Ensure all products are properly marked and remain so throughout the production process."
    },
    {
      "duty": "Communicate problems, solutions, and opportunities."
    }
  ],
  "skills": [
    {
      "skill": "Operating Encapsulating Presses",
      "experience": 1
    },
    {
      "skill": "Quality Monitoring",
      "experience": 1
    },
    {
      "skill": "Documentation",
      "experience": 1
    },
    {
      "skill": "Working Independently",
      "experience": 1
    },
    {
      "skill": "Safe Lifting Practices",
      "experience": 1
    },
    {
      "skill": "Communication",
      "experience": 1
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED – required"
    },
    {
      "credential": "1+ year of experience in operating encapsulating presses in the dietary supplement industry preferred"
    },
    {
      "credential": "Must be able to follow instructions and work independently"
    },
    {
      "credential": "Must be able to work in a fast-paced environment"
    },
    {
      "credential": "Must be able to lift 50 lbs."
    },
    {
      "credential": "Specific vision abilities required may include near acuity, far acuity, depth perception, accommodation, color vision and field of vision."
    }
  ]
}