{
  "meta": [
    {
      "job_title": "HRBP Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Consultation",
      "experience": 5
    },
    {
      "skill": "Talent Management",
      "experience": 5
    },
    {
      "skill": "Organizational Design",
      "experience": 5
    },
    {
      "skill": "Employee Engagement",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Compliance",
      "experience": 5
    },
    {
      "skill": "Leadership Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drives business results and cultivates high performing work teams by proactively assessing culture within assigned business functions to ensure alignment to our core values."
    },
    {
      "duty": "Consults and collaborates with business leaders to provide strategic HR leadership and develops effective talent solutions that drive business strategies, develop core capabilities needed, and address team development opportunities."
    },
    {
      "duty": "Develops and executes HR strategies, processes, and programs to deliver business results including organization design, talent development and succession, engagement, and talent acquisition."
    },
    {
      "duty": "Identifies and keeps business partners and HR Director informed of any high risk/unique employee situations. Conducts thorough investigations and bring to effective resolution when needed."
    },
    {
      "duty": "Collaborates with HR Directors and other HRBPs to ensure consistent and innovative approach for all human resources programs and processes."
    },
    {
      "duty": "Drives consistency in administering human resources policies and procedures to ensure positive employee experience. Responsible for the development and implementation of compliance initiatives."
    },
    {
      "duty": "Maintains in-depth knowledge of legal and regulatory compliance as it relates to employment law, reducing risk, and uses HR expertise and excellent judgement to develop effective solutions."
    },
    {
      "duty": "Any other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business, or a related field (Master's preferred)"
    }
  ]
}