{
  "meta": [
    {
      "job_title": "Senior Finance Business Systems Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 170000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Oracle",
      "experience": 6
    },
    {
      "skill": "Coupa",
      "experience": 6
    },
    {
      "skill": "Anaplan",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Business Systems Analysis",
      "experience": 6
    },
    {
      "skill": "Communication Skills",
      "experience": 6
    },
    {
      "skill": "Strategic Thinking",
      "experience": 6
    },
    {
      "skill": "Accounting",
      "experience": 6
    },
    {
      "skill": "Finance",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as an Oracle Subject Matter Expert (SME) for supporting business processes and develop strong relationships with the business process owners."
    },
    {
      "duty": "Review, analyze & evaluate current business systems and user needs to develop, enhance, implement, and maintain fully functional, integrated business systems within Oracle and related systems, following IT standards."
    },
    {
      "duty": "Work closely with finance partners to develop, establish, and manage the project roadmap for the organization."
    },
    {
      "duty": "Draft business requirements document (BRD), test scripts for user acceptance testing (UAT), and perform UAT testing in certain scenarios."
    },
    {
      "duty": "Collaborate with IT team and other cross-functional systems teams during design and support implementation of business solutions."
    },
    {
      "duty": "Provide regular status updates, highlighting risk and issues to the PMO."
    },
    {
      "duty": "Work with Finance stakeholders and other cross-functional business partners to support project assessments and new initiatives."
    },
    {
      "duty": "Lead cross-functional team collaboration and mentoring to achieve common goals."
    },
    {
      "duty": "Understand current business processes and propose areas of improvements and automation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree in Accounting, Finance, Business Administration, IT, Computer Science, Data Science or equivalent practical experience within accounting, finance, and general business processes (Master's preferred)"
    }
  ]
}