{
  "meta": [
    {
      "job_title": "Finance Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 133000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Reporting",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Forecasting",
      "experience": 8
    },
    {
      "skill": "Financial Analysis",
      "experience": 8
    },
    {
      "skill": "Business Partnering",
      "experience": 8
    },
    {
      "skill": "Excel",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 8
    },
    {
      "skill": "ERP Systems",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Participate in the preparation of the annual operating plan, long-term strategic plan, quarterly forecasts, and quarter-end financial reporting for revenue, gross margin, OPEX, operating margins, and balance sheet."
    },
    {
      "duty": "Provide analysis to identify risks and opportunities to operations and the business unit to assist with the forecasting and reporting processes."
    },
    {
      "duty": "Partner with respective Business Operations and manage the project plans for product growth and development to align with strategies to forecasts and influence outcomes."
    },
    {
      "duty": "Complete detailed analysis and commentary for finance and non-finance executives to drive gross margin and profitability improvement."
    },
    {
      "duty": "Develop complex modeling in support of strategic plans, business sizing, and performance management."
    },
    {
      "duty": "Collaborate with Business Unit to identify and drive profitability."
    },
    {
      "duty": "Support team input to inventory & variance team for standard revaluation cost impacts & Inventory outflow model inputs."
    },
    {
      "duty": "Provide leadership and guidance to revenue, costing, and I&W analysts that assist with the forecasting and reporting processes."
    },
    {
      "duty": "Partner with business management, marketing, engineering, and other functions to align analyses and forecasts and influence outcomes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 128,
      "student_teacher": 96,
      "introvert_extrovert": 144
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree required, Master’s or MBA is a plus."
    }
  ]
}