{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Agriculture",
      "job_class": "Manager",
      "sector": "Agriculture",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Team Development",
      "experience": 5
    },
    {
      "skill": "Mechanical Skills",
      "experience": 3
    },
    {
      "skill": "Electrical Skills",
      "experience": 3
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Maintenance Management",
      "experience": 5
    },
    {
      "skill": "Employee Development",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the day-to-day activities of the grain elevator, including loading/unloading, sampling, grading, transferring, blending, and storage of grain."
    },
    {
      "duty": "Maintain a safe, sanitary workplace in compliance with company policies and regulatory agencies (OSHA, EPA, DNR, DOT, etc)."
    },
    {
      "duty": "Train and lead hourly employees in operations, safety, food safety, and maintaining facilities."
    },
    {
      "duty": "Perform special assignments, initiating improvements to most effectively meet operation objectives."
    },
    {
      "duty": "Establish and maintain appropriate preventative maintenance, sanitation, and operation schedules."
    },
    {
      "duty": "Ensures the safety of all personnel through compliance with occupational safety and health regulations, demonstrate safety leadership through participation in all safety processes with a goal of zero injuries."
    },
    {
      "duty": "Adhere to and implement Good Manufacturing Practices (GMP), HACCP, and FSMA requirements."
    },
    {
      "duty": "Be responsible for the daily plant operations, including safety and environmental compliance, food safety, quality control, production, cost optimization, and efficiencies."
    },
    {
      "duty": "Recognizes environmental, safety, and GMP hazards and takes actions to insure the hazards are eliminated so as not to affect employee safety, product quality, and environmental purity."
    },
    {
      "duty": "Addresses employee concerns and maintains good communications and morale."
    },
    {
      "duty": "Works with employees to develop a high level of job proficiency. Analyze maintenance performance and work to improve efficiencies."
    },
    {
      "duty": "Provides positive reinforcement when employees are observed producing good results and safe performance."
    },
    {
      "duty": "Maintains discipline and documents unusual or unacceptable behaviors."
    },
    {
      "duty": "Responsible for development of employees. Actively engage in the development & training of hourly labor."
    },
    {
      "duty": "Strong troubleshooting skills. Utilizes mechanical and electrical expertise to maintain production systems, utilities, buildings, and grounds."
    },
    {
      "duty": "Remains current with latest and emerging industry regulations and codes relative to systems design and operation."
    },
    {
      "duty": "Ensures corporate policies and standards are followed in the execution of daily activities."
    },
    {
      "duty": "Lead and analyze preventive maintenance schedules, inspections, and repairs to minimize downtime."
    },
    {
      "duty": "Maintain documentation and identify cost-saving ideas."
    },
    {
      "duty": "Ability to lift and transport materials and equipment weighing up to 50 pounds on a frequent basis and up to 100 pounds on an occasional basis."
    },
    {
      "duty": "Prolonged standing and frequent bending, stooping, walking, and reaching daily."
    },
    {
      "duty": "Requires a full range of physical motion in order to operate manual and electrically-powered tools and electrical test equipment. Ability to move throughout the facility, including climbing stairs, ladders in all buildings, and to work at heights."
    },
    {
      "duty": "Work is performed indoors and out-of-doors year-round, occasionally in environments that are dusty, noisy, or which could have work hazards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree preferredHigh School Diploma/GED with years of OJTTechnical Certification"
    }
  ]
}