{
  "meta": [
    {
      "job_title": "Full Stack Developer",
      "job_category": "Software Engineering",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 125000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Azure",
      "experience": 3
    },
    {
      "skill": "API Development",
      "experience": 3
    },
    {
      "skill": "Angular",
      "experience": 3
    },
    {
      "skill": ".NET C#",
      "experience": 3
    },
    {
      "skill": "MVC",
      "experience": 3
    },
    {
      "skill": "Mobile Development",
      "experience": 2
    },
    {
      "skill": "Agile Methodology",
      "experience": 3
    },
    {
      "skill": "Relational Database Design",
      "experience": 3
    },
    {
      "skill": "Continuous Integration",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 4
    },
    {
      "skill": "Feedback Skills",
      "experience": 4
    },
    {
      "skill": "UI/UX Principles",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform technical analysis, database design, prototyping, coding, and unit testing of applications with high-quality deliverables."
    },
    {
      "duty": "Assist with application architecture design and write technical documentation as necessary."
    },
    {
      "duty": "Responsible for the security, quality, and performance of developed applications."
    },
    {
      "duty": "Apply business and product knowledge in the performance of assigned projects."
    },
    {
      "duty": "Provide direct input into the ongoing improvement of standards and processes."
    },
    {
      "duty": "Incorporate innovative ideas and approaches to the software development team."
    },
    {
      "duty": "Write application and database codes based on business requirements or user stories, architectural requirements, and established coding standards."
    },
    {
      "duty": "Participate in the review of business epics and stories, validate code against requirements, and create and test prototypes."
    },
    {
      "duty": "Troubleshoot applications, perform application unit testing, and participate in peer code reviews."
    },
    {
      "duty": "Work within an agile framework, prioritize and execute tasks, and communicate ideas in technical and user-friendly language."
    },
    {
      "duty": "Update and maintain product documentation, escalate issues and impediments in a timely manner, and provide on-call support as needed."
    },
    {
      "duty": "Design, build, and test applications and database solutions, and assist the release engineer with implementation plans."
    },
    {
      "duty": "Utilize skills in data analysis, data verification, problem solving, and provide accurate breakdown tasks and estimates for coding and development unit testing efforts."
    },
    {
      "duty": "Mentor team members, assist with technical interviews and talent recruitment, and participate/lead development COPs."
    },
    {
      "duty": "Hold the team accountable for UNOS agile framework and perform other duties as directed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Four-year degree in Computer Science or related field, or 5 years of related professional IT experience"
    }
  ]
}