{
  "meta": [
    {
      "job_title": "Enterprise Field Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 134500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Experience",
      "experience": 10
    },
    {
      "skill": "Account Management",
      "experience": 10
    },
    {
      "skill": "Infrastructure Software Sales",
      "experience": 10
    },
    {
      "skill": "Database Sales",
      "experience": 10
    },
    {
      "skill": "Analytic Tools Sales",
      "experience": 10
    },
    {
      "skill": "Applications Software Sales",
      "experience": 10
    },
    {
      "skill": "Commercial Agreements",
      "experience": 10
    },
    {
      "skill": "Legal Agreements",
      "experience": 10
    },
    {
      "skill": "Partner Management",
      "experience": 10
    },
    {
      "skill": "Sales Engineering",
      "experience": 10
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build and deepen executive relationships with enterprise customers, and bring to Google C-level relationships to help us grow into new organizations."
    },
    {
      "duty": "Influence long-term direction and serve as a business partner."
    },
    {
      "duty": "Discuss and manage entire complex business cycles, often presenting to C-level executives in corporate and global customers."
    },
    {
      "duty": "Lead account strategy in generating and developing business growth opportunities, working collaboratively with Customer Engineers, and Google partners."
    },
    {
      "duty": "Understand each customer's technology footprint, growth plans and business drivers, technology strategy, and competitive landscape."
    },
    {
      "duty": "Drive business development, forecast accurately, and achieve strategic goals by leading customers through the entire business cycle."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 150,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent practical experience.10 years of experience in software sales or account management at an enterprise Business-to-Business (B2B) company."
    },
    {
      "credential": "Experience selling infrastructure software, databases, analytic tools, or applications software with an ability to exceed business goals."
    },
    {
      "credential": "Experience with commercial and legal agreements in collaboration with procurement, legal, and business teams."
    },
    {
      "credential": "Experience working with and managing partners in implementation projects, including global system integrators and packaged software vendors."
    },
    {
      "credential": "Ability to work with sales engineers and customer’s technical leads to inventory existing software estate, define migration plans, and build business cases for migrations."
    }
  ]
}