{
  "meta": [
    {
      "job_title": "Clinical Assistant",
      "job_category": "Clinical",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 30805,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serves as a liaison between physicians, patients, families, healthcare providers, nursing homes, homecare providers, patient employers and insurance companies to ensure quality patient care for patients seen in the campus and offsite satellite offices."
    },
    {
      "duty": "Coordinates the daily activities of the physician team staff to ensure an effective and efficient daily operations flow."
    },
    {
      "duty": "Fulfills patient care responsibilities as assigned which may include: checking schedules and organizing patient flow; accompanying patients to exam/procedure room, assisting patients as needed with walking, transferring, dressing, collecting and processing specimens and point of care testing, preparing for exam, etc."
    },
    {
      "duty": "Assists physicians with various procedures, takes vital signs, relays instructions to patients and or families; answers calls and provides pertinent information."
    },
    {
      "duty": "Fulfills clerical responsibilities as assigned which may include: sending and receiving patient medical records; obtaining lab/x-ray reports, hospital notes, referral information, etc."
    },
    {
      "duty": "Entering orders into the electronic medical record (EMR) system or prepares prescription refill requests on behalf of the physician for the review and approval by the ordering physician."
    },
    {
      "duty": "May perform medical scribe functions as directed by the supervising physician, depending on the needs of the department."
    },
    {
      "duty": "Inventories, orders or re-stocks medical supplies as applicable."
    },
    {
      "duty": "Provides set-up of examination room and instruments in accordance with proper sterilization techniques established by hospital and infection control policies."
    },
    {
      "duty": "Maintains logging system as required for refrigeration of medications, point of care testing, sterilization process, crash cart or others as needed."
    },
    {
      "duty": "Complies with established personal protective equipment requirements necessary for protection against exposure to blood and other potentially infections body fluids, chemical disinfectants, radiation and other hazardous substances."
    },
    {
      "duty": "May perform appointment scheduling or the booking of surgeries/procedures, or works in conjunction with Surgical Coordinator verifying times with patients; preparing charts, pre-admissions and consent forms."
    },
    {
      "duty": "May be required to perform proficient phlebotomy duties."
    },
    {
      "duty": "May check and verify and update insurance information utilizing internal or web sources."
    },
    {
      "duty": "May perform and verify pre-certification for procedures as necessary."
    },
    {
      "duty": "Provides training and mentoring to Level I MA staff."
    },
    {
      "duty": "May assist in establishing Medical Assistant I and II schedules and work flow to meet the needs of the practice and applicable to patient volumes."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 130,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma/GEDCompletion of a certificate Medical Assistant program from an accredited school;Completion of a Medical Scribe training program (if the Scribe role is required by the department)3+ years of experience as a Medical Assistant"
    }
  ]
}