{
  "meta": [
    {
      "job_title": "Talent Acquisition Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruitment",
      "experience": 7
    },
    {
      "skill": "Human Resources Management",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Professional Services",
      "experience": 7
    },
    {
      "skill": "Contract Management",
      "experience": 7
    },
    {
      "skill": "Diversity Recruitment",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Relationship Management",
      "experience": 7
    },
    {
      "skill": "Applicant Tracking Systems",
      "experience": 7
    },
    {
      "skill": "HR Information Systems",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage assigned open position recruitment, including complex or high-level searches, identifying top talent for MSH vacancies."
    },
    {
      "duty": "Supplement direct applications through the effective and strategic use of search engines, professional networks, career sites, recruiting events, and other innovative sourcing techniques to find the best talent in the market."
    },
    {
      "duty": "Create a positive candidate and hiring manager experience throughout the full cycle of interviews, offer, acceptance, and onboarding."
    },
    {
      "duty": "Refine and further develop strategies tied to recruiting initiatives and communicate these, as appropriate, to meet staffing goals for all open positions based in the United States and MSH’s global offices where there is no HR or TA support."
    },
    {
      "duty": "Monitor recruiting metrics against established efficiency standards and turnaround timetables; develop strategies and solutions with TA and HR Partner Teams when not achieving these metrics."
    },
    {
      "duty": "Collaborate strategically with hiring managers and assigned HR Partners to ensure excellent level of service and problem solving when necessary; follow up with hiring managers to proactively manage quality of support and ensure the organization’s needs are being met."
    },
    {
      "duty": "Support the strategic efforts to build relationships with professional organizations and universities to ensure robust pipelines for diverse candidates."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Human Resources Management or related field, or equivalent experience. HR Certification (PHR/SPHR) is a plus."
    }
  ]
}