{
  "meta": [
    {
      "job_title": "Retail Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Merchandising",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Retail Sales",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for every aspect of the store operation, including selecting, coaching, and developing store teammates, as well as merchandising, advertising, and promotion of products and services."
    },
    {
      "duty": "Manages overall store operations, oversees the work flow through the Customer Service Delivery System (CSDS) program, ensures overall customer satisfaction, resolves customer complaints, and develops and implements customer retention strategies and practices."
    },
    {
      "duty": "Handles personal daily customer sales and product/service concerns, develops long-term relationships with present and new store customers, and implements monthly sales and marketing plans."
    },
    {
      "duty": "Manages financial aspects of the business, protects store and company assets, and controls and directs store operational tasks, including inventories, payroll, bank deposits, teammate productivity measures, merchandising and sales promotions, outside sales solicitations, etc."
    },
    {
      "duty": "Leads in-store behavior implementation for timely execution of organizational strategy, decides inventory stocking levels, and replenishment frequencies."
    },
    {
      "duty": "Coaches, motivates, recruits, interviews, selects, and leads store teammate staff, and manages and approves scheduling and staffing of teammates."
    },
    {
      "duty": "Creates a highly motivated team environment/culture within the store operation, develops and manages teammate retention programs in store, and establishes teammate performance standards and performs effective performance management reviews."
    },
    {
      "duty": "Grows profit through service or tire recommendations, continuously moves about the store sales floor, stock room, and car service department, and sets up and takes down outside tire rack and store displays."
    },
    {
      "duty": "Handles store deliveries, customer vehicles, tire racks, and various management activities, and ensures safety, health, and environmental policies are implemented and maintained."
    },
    {
      "duty": "Interfaces daily with the Area Manager, the Area Education Department, local suppliers, BFS Distribution system teammates, and retail customers from both a personal sales and a customer relations and retention perspective."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent, valid automobile driver’s license at all times, completed all of the current and required BSRO store education courses & modules required for this position"
    }
  ]
}