{
  "meta": [
    {
      "job_title": "Boat & ATV Sales Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform various Selling / Customer Service activities to assist Boat and ATV Customers in making informed buying decisions."
    },
    {
      "duty": "Engage all customers entering the department in a friendly and timely manner."
    },
    {
      "duty": "Meet with potential customers to determine their boating and or ATV needs."
    },
    {
      "duty": "Provide information necessary to allow the customer to make an informed buying decision."
    },
    {
      "duty": "Maintain current product knowledge by using available resources, i.e., product brochures, Internet and product information training meetings."
    },
    {
      "duty": "Remain current on & adhere to all selling skills training & direction."
    },
    {
      "duty": "Work cooperatively with the Service Department to see that delivery to the customer is seamless."
    },
    {
      "duty": "Maintain complete confidentiality of all sensitive & personal information."
    },
    {
      "duty": "Prepare the showroom each morning to ensure proper signage is in place per established presentation standards and all products are clean, presentable and in sellable condition."
    },
    {
      "duty": "Generate and manage leads & prospects in provided Customer Relationship Management (CRM) tool on a daily basis."
    },
    {
      "duty": "Accurately complete all necessary paperwork required within the selling process."
    },
    {
      "duty": "Participate in special events such as Boat Shows, Parking Lot events, etc."
    },
    {
      "duty": "Maintain a clean and professional work area."
    },
    {
      "duty": "Follow all Company Policies and Procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ]
}