{
  "meta": [
    {
      "job_title": "Cook",
      "job_category": "Food Service",
      "job_class": "Cook",
      "sector": "Hospitality",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for preparing all food items based on standardized recipes for the Restaurant/Dining Outlet, Cafe, Room Service, Employee Cafeteria, and Banquets while maintaining the highest standards to produce an appealing and appetizing product."
    },
    {
      "duty": "Ensuring the cleanliness, sanitation, and safety in the kitchen and work areas while minimizing waste and maximizing cost/production ratio."
    },
    {
      "duty": "Approach all encounters with guests and associates in a friendly, service-oriented manner."
    },
    {
      "duty": "Maintain regular attendance in compliance with Aimbridge Hospitality standards as required by scheduling."
    },
    {
      "duty": "Comply at all times with Aimbridge Hospitality standards and regulations to encourage safe and efficient operations."
    },
    {
      "duty": "Maintain high standards of personal appearance and grooming which include wearing the proper uniform and name tag when working."
    },
    {
      "duty": "Have thorough knowledge of menus and the preparation required according to hotel standards."
    },
    {
      "duty": "Maintain cleanliness and organization of all storage areas."
    },
    {
      "duty": "Complete necessary food and station preparations prior to opening of the Restaurant/Dining Outlet/Cafe."
    },
    {
      "duty": "Prepare and display buffet food items according to Aimbridge Hospitality standards."
    },
    {
      "duty": "Maintain post on the kitchen line as required during the operating hours in order to prepare food to order."
    },
    {
      "duty": "Prepare food for Banquets as required following specifications of Banquet Event Orders."
    },
    {
      "duty": "Prepare and service food for Associate Cafeteria as specified by the restaurant leadership."
    },
    {
      "duty": "Breakdown buffets and kitchen line storing food and equipment properly at the end of each meal period."
    },
    {
      "duty": "Work banquet food station as scheduled by restaurant leadership."
    },
    {
      "duty": "Know the location and operation of all fire extinguishing equipment."
    },
    {
      "duty": "Assist in storage and rotation of food items according to hotel procedures."
    },
    {
      "duty": "Attend meetings as required by management."
    },
    {
      "duty": "Perform any other duties as requested by management."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent and/or experience in a hotel or a related field preferred. Food Handlers Certification (must comply with State requirements)"
    }
  ]
}