{
  "meta": [
    {
      "job_title": "Business Integrity Analyst",
      "job_category": "Business Analysis",
      "job_class": "Analyst",
      "sector": "Management",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Entry",
      "experience": 5
    },
    {
      "skill": "Data Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "AS400 Database",
      "experience": 2
    },
    {
      "skill": "Retail Industry",
      "experience": 3
    },
    {
      "skill": "Supply Chain Industry",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute data input requests accurately and timely support and completion of projects and initiatives."
    },
    {
      "duty": "Provide insights into process improvement opportunities related to day-to-day activities."
    },
    {
      "duty": "Work directly with all internal BRS departments to drive open issues to closure."
    },
    {
      "duty": "Manage internal customer communications related to data requests."
    },
    {
      "duty": "Maintain accuracy in all relevant data submissions and support the Manager in testing, implementing, and documenting new processes."
    },
    {
      "duty": "Identify and implement audits of data sets to ensure consistency and accuracy across the customer base."
    },
    {
      "duty": "Demonstrate a basic knowledge of all facets of the new customer implementation process and provide guidance and support for activities related to customer exit process."
    },
    {
      "duty": "Work closely with the Manager of Customer Experience team to analyze data related to account structure improvement and implement necessary systemic updates."
    },
    {
      "duty": "Maintain accuracy of data sets per established process and manage analysis and input of relevant data fields into the AS400 operating system."
    },
    {
      "duty": "Produce/maintain work product/data populations with a high degree of accuracy and limited need for repeated supervisor intervention."
    },
    {
      "duty": "Successfully complete projects accurately and within the allotted timeline."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred and a minimum of 5 years of experience related to data entry and data management (Master's preferred)"
    }
  ]
}