{
  "meta": [
    {
      "job_title": "SaaS Administrator II",
      "job_category": "Information Technology",
      "job_class": "Administrator",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "SaaS Administration",
      "experience": 5
    },
    {
      "skill": "MDM Management",
      "experience": 5
    },
    {
      "skill": "Google Workspace Administration",
      "experience": 5
    },
    {
      "skill": "Automation Scripting",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "IT Service Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Administer and manage SaaS stack, including user management, security configurations, application settings, and integrations."
    },
    {
      "duty": "Collaborate with IT Leadership to define and implement best practices, standards, and policies around all applications company-wide."
    },
    {
      "duty": "Ensure the smooth operation and availability of productivity applications, proactively monitoring performance, troubleshooting issues, and resolving incidents."
    },
    {
      "duty": "Collaborate with IT Leadership and security teams to implement and enforce security measures, compliance requirements, and data protection policies."
    },
    {
      "duty": "Configure user access, permissions, and security. Design and implement integrations, workflows, and automations to streamline processes."
    },
    {
      "duty": "Develop comprehensive documentation for SaaS administration processes, procedures, and guidelines, as well as mentoring more junior IT team members."
    },
    {
      "duty": "Collaborate with IT Leadership and stakeholders in SaaS-related projects, defining project scope, managing resources, and ensuring successful implementation and delivery."
    },
    {
      "duty": "Leverage project management methodologies to plan, execute, and monitor SaaS-related projects, adhering to timelines and quality standards."
    },
    {
      "duty": "Stay updated with the latest trends, updates, and enhancements in JAMF, Google Workspace, OKTA, and automation tools, sharing knowledge and recommending improvements to enhance the SaaS environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or related experience. Relevant certifications in JAMF, Google Workspace, project management, coding/scripting, and API webhook experience."
    }
  ]
}