{
  "meta": [
    {
      "job_title": "Digital Product Designer",
      "job_category": "Design",
      "job_class": "Product Designer",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "User-Centered Design",
      "experience": 5
    },
    {
      "skill": "UX Design",
      "experience": 5
    },
    {
      "skill": "User Research",
      "experience": 5
    },
    {
      "skill": "Collaborative Design",
      "experience": 5
    },
    {
      "skill": "Human-Computer Interaction",
      "experience": 5
    },
    {
      "skill": "Product Design",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Take ownership of the end-to-end experience for digital platforms, working closely with product managers."
    },
    {
      "duty": "Create beautiful, usable solutions based on unbiased user research, setting strategic design direction for financial suite of products."
    },
    {
      "duty": "Lead the product team through the user-centered design process with collaborative workshops for discovery and ideation."
    },
    {
      "duty": "Apply user research insights to drive product design and strategy, and execute user research in collaboration with internal stakeholders."
    },
    {
      "duty": "Advocate for a Human-Centered Design process and creating a collaborative environment, engaging and inspiring the product organization about customers' experiences."
    },
    {
      "duty": "Own UX design and mentor less experienced designers, playing an active role in advocating for a Human-Centered Design process."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in user experience, human-computer interaction, interaction design, service design, graphic design, or digital design-related degree (Master's preferred)"
    },
    {
      "credential": "Additional Bachelor's in sociology, anthropology, psychology, or related degree"
    }
  ]
}