{
  "meta": [
    {
      "job_title": "Key Holder",
      "job_category": "Retail",
      "job_class": "Store Management",
      "sector": "Sales",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with the management team in store operations and leading an engaging and inspiring environment for customers and the team."
    },
    {
      "duty": "Drive sales, build awareness of key metrics, and contribute to the development of team members."
    },
    {
      "duty": "Act as a brand ambassador and create an engaging experience that appeals to customers."
    },
    {
      "duty": "Empower the team to drive sales through personalized service, elevated styling, and outfitting recommendations."
    },
    {
      "duty": "Support the store management team in daily office procedures, execution of operations, and store maintenance."
    },
    {
      "duty": "Participate in managing the store environment and customer experience, facilitating an energized pace and driving sales."
    },
    {
      "duty": "Support an inclusive and people-first philosophy, engaging employees at all levels to encourage open dialogue and reinforce follow through."
    },
    {
      "duty": "Take responsibility for own development and professional growth while considering role replacement for career progression."
    },
    {
      "duty": "Adhere to store’s safety standards, inventory accuracy, reduction of product loss, and uphold all company policy and procedures to support the profitability of the store."
    },
    {
      "duty": "Collaborate with key partners to effectively execute shipment processing, restocking, and placement of product while maintaining visual and display standards."
    },
    {
      "duty": "Ensure omni-channel orders are processed timely and accurately and respond to communication from the leadership team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 130,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Love for the FP brand"
    },
    {
      "credential": "Experience being a team player"
    },
    {
      "credential": "Ability to work flexible hours, including nights, weekends, and holidays"
    },
    {
      "credential": "Eagerness to learn and grow within the organization"
    }
  ]
}