{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Management",
      "job_class": "Senior Manager",
      "sector": "Management",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage projects using established PMO standards, incorporating other approaches as necessary given cultural, situational, ecosystem and other identified factors."
    },
    {
      "duty": "Direct Project meetings and work with Project Sponsor to ensure schedule, deliverables, and overall health of project is on track."
    },
    {
      "duty": "Communicate clearly with team members and stakeholders, resolving any issues and solving problems throughout project life cycle."
    },
    {
      "duty": "Formally document and update all project-related items including implementation plan, project scope, charter, goals, deliverables, risks, project milestones, schedule, and any all-related items."
    },
    {
      "duty": "Identify and clearly communicate expectations to team members and stakeholders through the course of the project."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "University degree in business or related field preferred. 3 to 5 years of direct experience in Project Management, Program Management, or similar experience. Project Management Professional PMP or Certified Associate in Project Management CAPM or a related PMI Certification preferred or within one year of hire."
    }
  ]
}