{
  "meta": [
    {
      "job_title": "Lead Product Manager- Technical",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Technology",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Product Lifecycle Management",
      "experience": 5
    },
    {
      "skill": "System Design",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Data Mining",
      "experience": 5
    },
    {
      "skill": "Technical Acumen",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "UX Design",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop inspiring platform/product visions, derived from business needs, market opportunities, and technology trends."
    },
    {
      "duty": "Decompose business requirements and customer experiences into features and functions that drive the platform/product roadmap."
    },
    {
      "duty": "Work with Technical Program Managers, Developers, UX designers, and internal customers to define the details behind the business requirements."
    },
    {
      "duty": "Act as the voice of the business customer and accountable for the platform services."
    },
    {
      "duty": "Own the working backwards document and vision for feature releases."
    },
    {
      "duty": "Identify gaps and chart new platform capabilities as required."
    },
    {
      "duty": "Participate with the business in customer research to inform platform product feature needs."
    },
    {
      "duty": "Stay aligned with GTM plans for the feature set."
    },
    {
      "duty": "Identify issues that will keep the platform features from delivering on time and/or with the desired requirements and communicate to leadership."
    },
    {
      "duty": "Develop and implement new metrics into measurement techniques; works with development teams to develop reports to monitor them."
    },
    {
      "duty": "Coordinate internal forums to collect and identify feature-level development opportunities."
    },
    {
      "duty": "Own and manage product documentation; enable self-service support and/or work to reduce overhead."
    },
    {
      "duty": "Identify feature risks from business and customer feedback and in-depth analysis of operational performance, share with senior leadership."
    },
    {
      "duty": "Assist with candidate selection and onboarding."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a relevant field (Master's preferred)"
    }
  ]
}