{
  "meta": [
    {
      "job_title": "Collector",
      "job_category": "Collections",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 46000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Handle and resolve defaults and delinquencies with members' accounts, advocating for members and maintaining strong member relationships and meeting member service standards."
    },
    {
      "duty": "Provide assistance and support to members in financial difficulty by identifying mutually agreeable payment arrangements, maintaining excellent member service and strong relationships."
    },
    {
      "duty": "Handle escalated member issues as required."
    },
    {
      "duty": "Work assigned collection queues and make collection attempts by telephone and email (on financial products like auto loans, credit cards, mortgages, etc.), following established procedures and regulations."
    },
    {
      "duty": "Review and submit accounts for loan workout arrangements (such as extensions, modification, forbearance, and partial payments)."
    },
    {
      "duty": "Identify accounts for adverse action (such as repossession, foreclosure, closure, suspension, and charge off) and handle with guidance from internal business partners."
    },
    {
      "duty": "Proactively identify gaps in processes and procedures and make recommendations for improvements."
    },
    {
      "duty": "Conduct skip tracing, as necessary, to obtain contact information in order to contact delinquent/defaulted members."
    },
    {
      "duty": "Participate in department projects and initiatives as required."
    },
    {
      "duty": "Assist in orientation and training of new Collectors."
    },
    {
      "duty": "Participate in system upgrades including quality control and testing."
    }
  ],
  "skills": [
    {
      "skill": "Financial Services Industry Knowledge",
      "experience": 1
    },
    {
      "skill": "Collection Procedures",
      "experience": 1
    },
    {
      "skill": "Loan Calculations",
      "experience": 1
    },
    {
      "skill": "Time Management",
      "experience": 1
    },
    {
      "skill": "Collaboration",
      "experience": 1
    },
    {
      "skill": "Problem Solving",
      "experience": 1
    },
    {
      "skill": "Communication",
      "experience": 1
    },
    {
      "skill": "Microsoft Office",
      "experience": 1
    },
    {
      "skill": "Core Banking System",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or Equivalent"
    }
  ]
}