{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Care Management",
      "experience": 3
    },
    {
      "skill": "Telephonic Care",
      "experience": 3
    },
    {
      "skill": "Case Management",
      "experience": 3
    },
    {
      "skill": "Nursing Process",
      "experience": 3
    },
    {
      "skill": "Patient Education",
      "experience": 3
    },
    {
      "skill": "Healthcare Navigation",
      "experience": 3
    },
    {
      "skill": "Healthcare System Knowledge",
      "experience": 3
    },
    {
      "skill": "Remote Patient Support",
      "experience": 3
    },
    {
      "skill": "Clinical Setting Experience",
      "experience": 3
    },
    {
      "skill": "Patient Advocacy",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver coordinated, patient-centered virtual Care Management by telephone to improve members' health outcomes."
    },
    {
      "duty": "Lead outreach efforts to high-risk individuals and complete care management assessments and care plans for patients enrolled in the program."
    },
    {
      "duty": "Utilize the Nursing Process and broad knowledge of the whole person to support members in their care journey."
    },
    {
      "duty": "Help members navigate the complexity of the healthcare system, providing education and empowerment to support members in meeting their healthcare goals."
    },
    {
      "duty": "Assist throughout acute healthcare episodes, such as hospitalizations and rehabilitation stays, providing coordinated Case Management to support the member and their family."
    },
    {
      "duty": "Identify and discuss current barriers related to member's current conditions and provide interventions to address these barriers."
    },
    {
      "duty": "Work with other disciplines on co-managed cases and collaborate with other teams to assist with benefits and claims questions."
    },
    {
      "duty": "Coordinate necessary resources that holistically address members' problems, whether clinical or social."
    },
    {
      "duty": "Provide compassionate, longitudinal follow-up care, building supportive relationships."
    },
    {
      "duty": "Participate in program case rounds and provide input for process improvement opportunities and resources for the team."
    },
    {
      "duty": "Mentor and be a resource to other registered nurses on the Care Navigation team."
    },
    {
      "duty": "Other duties and projects as assigned by Manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Active RN license in a compact state with ability to be licensed in other states as needed. 1+ years experience in case management. 2+ years experience in a hospital or clinical setting."
    }
  ]
}