{
  "meta": [
    {
      "job_title": "Service Tech w CDL",
      "job_category": "Service",
      "job_class": "Technician",
      "sector": "Service",
      "salary": 48000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Provide technical trouble shooting support for designated client business and delivery of chemicals."
    },
    {
      "duty": "Collect field samples for on-going monitoring and analysis."
    },
    {
      "duty": "Manage internal resources to support business operations."
    },
    {
      "duty": "Coordinate with workers, engineers, designers, and technicians."
    },
    {
      "duty": "Perform inventory management and ensure compliance with specifications."
    },
    {
      "duty": "Operate a ¾ or 1 ton pickup with trailer and maintain truck and equipment."
    },
    {
      "duty": "Load trailers and schedule daily runs to meet customer delivery requirements."
    },
    {
      "duty": "Maintain delivery location maps and operate in accordance with DOT regulations."
    },
    {
      "duty": "Complete work tickets for jobs and report field problems and safety hazards."
    },
    {
      "duty": "Wear appropriate safety gear and keep current on safety techniques."
    },
    {
      "duty": "Complete required safety and equipment related trainings on a monthly basis."
    },
    {
      "duty": "Answer company issued cell phone during on-call hours."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School or GED equivalent.Must be at least 21 years of age.Must have at least one (1) year of previous DOT driving experience.Must be able to communicate effectively with co-workers, customers, clients and management.Requires a strong sense of direction and knowledge of surrounding areas.Must be able to use hand tools.Must be able to drive long distances in company vehicle.Must be able to lift a minimum of 50 lbs."
    }
  ]
}