{
  "meta": [
    {
      "job_title": "HR Business Partner",
      "job_category": "Human Resources",
      "job_class": "Business Partner",
      "sector": "Human Resources",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Employee Engagement",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "HR Generalist",
      "experience": 8
    },
    {
      "skill": "Talent Development",
      "experience": 8
    },
    {
      "skill": "Compliance Management",
      "experience": 8
    },
    {
      "skill": "Conflict Resolution",
      "experience": 8
    },
    {
      "skill": "Recruiting",
      "experience": 8
    },
    {
      "skill": "Policy Development",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support a fast-paced, complex and dynamic business with employees across multiple states and countries."
    },
    {
      "duty": "Partner with global leaders to assess employee talent, develop employee growth plans, and create and implement engagement strategies and activities."
    },
    {
      "duty": "Facilitate virtual employee town halls and leadership learning initiatives."
    },
    {
      "duty": "Guide managers as it relates to HR people data including working in and with our global HRIS."
    },
    {
      "duty": "Collaborate with Managers to lead and action recruiting and hiring top talent for the business."
    },
    {
      "duty": "Review processes and develop and implement new process as part of our continuous improvement strategies."
    },
    {
      "duty": "Conduct investigations into complaints such as harassment, discrimination, and other employee concerns; make recommendations and facilitate resolution."
    },
    {
      "duty": "Provide training and guidance on employee appraisals and the annual pay review processes."
    },
    {
      "duty": "Conduct salary benchmarking and provide advice to managers."
    },
    {
      "duty": "Oversee employee leaves of absence, including providing guidance to managers and employees, ensuring compliance with FMLA and ADAA and analyzing return to work restrictions and accommodations."
    },
    {
      "duty": "Manage the work authorization process, as needed, in conjunction with local HR and Immigration Counsel."
    },
    {
      "duty": "Ensure compliance with local employment laws within a global environment."
    },
    {
      "duty": "Develop partnerships and conduct outreach to continue to build on our diverse and inclusive culture."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Human Resources, Business Management, or related area (required). Master's Degree preferred."
    }
  ]
}