{
  "meta": [
    {
      "job_title": "Client Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Generate revenue opportunities by developing solutions for clients using creativity and the available tools."
    },
    {
      "duty": "Selling Professional Services to US Public Sector accounts, including state and local governments, higher education institutions, federal government agencies, and installations."
    },
    {
      "duty": "Creating a pipeline of opportunities to generate bookings meeting quarterly budget expectations."
    },
    {
      "duty": "Negotiating project deliverables/schedules / costing for services."
    },
    {
      "duty": "Regular and timely updating of opportunity status in the CRM system (Salesforce.com)"
    },
    {
      "duty": "Working with the sales team to generate revenue within existing accounts by proposing the full range of solution realization, enhancement, and operational services."
    },
    {
      "duty": "Ensuring timely delivery and management of resource forecasting, opportunity forecasting, proposal/SOW writing, and achieving required approvals, contract and invoicing status using appropriate tools available."
    },
    {
      "duty": "Understanding revenue forecasting and be able to report accurately on Quarterly revenue and bookings to Regional Vice-President."
    },
    {
      "duty": "Providing leadership in promoting, identifying, recommending, and implementing improvements to any processes."
    },
    {
      "duty": "Managing as required the Professional Services team in writing responses to RFP’s, identifying and tracking opportunities, including participation in Business Development synergy meetings to ensure client account activities are communicated internally to other Open Text stakeholders."
    },
    {
      "duty": "Dealing with Customer Sr. Management and C-Level executives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "University Degree or College Diploma and/or relevant IM/IT experience (5+ years) or equivalent."
    },
    {
      "credential": "Experience selling Professional Services"
    },
    {
      "credential": "At least 4 years of experience with IT systems."
    },
    {
      "credential": "Experience in managing teams and direct reports; ensuring objectives are met on time and budget."
    },
    {
      "credential": "Expertise in complex business and technical processes and their implications across the enterprise."
    },
    {
      "credential": "Knowledge of project management disciplines and processes."
    },
    {
      "credential": "Knowledge of the OpenText product offerings and how to associate such to client’s business requirements"
    },
    {
      "credential": "Ability to use standard methodologies to evaluate and size an opportunity quickly."
    },
    {
      "credential": "Being able to quickly assemble business requirements to OT modules and provide an estimate for budgetary purposes."
    },
    {
      "credential": "Strong presence and confidence, exhibiting professional maturity, strong communication skills"
    },
    {
      "credential": "Solid work ethic with a willingness to ’do what it takes to meet client demands"
    }
  ]
}