{
  "meta": [
    {
      "job_title": "Nurse Extern",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 1
    },
    {
      "skill": "Clinical Rotations",
      "experience": 1
    },
    {
      "skill": "Infection Control",
      "experience": 1
    },
    {
      "skill": "Vital Signs Monitoring",
      "experience": 1
    },
    {
      "skill": "Patient Hygiene",
      "experience": 1
    },
    {
      "skill": "Patient Transfer",
      "experience": 1
    },
    {
      "skill": "Team Collaboration",
      "experience": 1
    },
    {
      "skill": "Conflict Resolution",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs direct and indirect patient care activities following RNs instructions, physician orders, policies, procedures and regulations."
    },
    {
      "duty": "Practices proper hand washing and principles of infection control."
    },
    {
      "duty": "Displays competence in performing oral and personal hygiene and, skin care, and Foley care."
    },
    {
      "duty": "Demonstrates ability to feed patients, knowledge of dysphagia precautions and calculating and recording intake and output."
    },
    {
      "duty": "Transfers patients safely using proper body mechanics during all activities and duties and accurately uses the bed and chair alarm system."
    },
    {
      "duty": "Keeps patient’s room, hallways and unit clean, neat, and orderly and reports any maintenance or environmental services needs."
    },
    {
      "duty": "Answers call lights promptly and communicates any problems, concerns, or issues promptly to the nurse."
    },
    {
      "duty": "Works as a team member demonstrating a positive, supportive, and helpful attitude towards patients, families, visitors, co-workers, and physicians and appropriately seeks assistance of the Nurse Manager for conflict resolution."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of SMMC Nurse Externship."
    },
    {
      "credential": "Successful completion of an approved CNA program or matriculated in an accredited Nursing academic program and have completed a minimum of one year of clinical rotations."
    }
  ]
}