{
  "meta": [
    {
      "job_title": "Process Improvement Advisor",
      "job_category": "Process Improvement",
      "job_class": "Advisor",
      "sector": "Management",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Process Mapping",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Lean Six Sigma",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Business Process Improvement",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead large scale process improvement initiatives that are often cross-functional in nature and may require usage of advanced process improvement methodologies and tools."
    },
    {
      "duty": "Establish good working relationships with business unit associates to understand current structure and process flows."
    },
    {
      "duty": "Conduct interviews and facilitate workshops with stakeholders at all levels of the organization."
    },
    {
      "duty": "Measure process performance and conduct analysis to lead the project towards recommendations which substantially improve process performance."
    },
    {
      "duty": "Conduct process improvement techniques to drive determination of the root cause of process defects or breakdowns."
    },
    {
      "duty": "Lead multiple project streams efficiently and diplomatically in a sometimes high-pressure or complex environment."
    },
    {
      "duty": "Develop key reporting metrics that can measure process performance and productivity."
    },
    {
      "duty": "Effectively present recommendations to management with appropriate data supporting the conclusions."
    },
    {
      "duty": "Demonstrate ability to take initiative and drive projects to successful completion with minimal supervision."
    },
    {
      "duty": "Educate associates on the value that continuous process improvement can provide to the organization."
    },
    {
      "duty": "Understand and comply with bank policy, laws, regulations, and the bank's BSA/AML Program, as applicable to your job duties."
    },
    {
      "duty": "Support and uphold the Arvest Mission Statement."
    },
    {
      "duty": "Formulate and communicate new ideas and suggestions that will improve profitability and efficiency for the company’s overall operation."
    },
    {
      "duty": "Foster and promote the proper company image at all times."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 110,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree, preferably in business or a technical field or equivalent experience required. 5 years of work experience required with 2 years in process improvement initiatives and project management required, preferably in a financial institution. Knowledge of process improvement methodologies such as Define, Measure, Analyze, Improve and Control (DMAIC), Design for Six Sigma (DFSS), and Lean along with tools such as SIPOC, Value Stream Mapping and Kaizen events required. Lean Six Sigma Green Belt or Black Belt preferred. Black Belt required within 1 year of hire if not previously held. Process mapping experience with software such as Visio preferred. Knowledge of statistical applications to business preferred. Masters of Business Administration (MBA) or other relevant graduate degrees preferred."
    }
  ]
}