{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 7
    },
    {
      "skill": "Procurement",
      "experience": 7
    },
    {
      "skill": "Risk Management",
      "experience": 7
    },
    {
      "skill": "Stakeholder Communication",
      "experience": 10
    },
    {
      "skill": "Safety Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages all activities for multiple small projects or subtasks of larger projects, in accordance with approved plans."
    },
    {
      "duty": "Coordinates project requirements with client project management team to ensure high-quality project deliverables."
    },
    {
      "duty": "Develops project documents, processes, and procedures required to support quality control and final project deliverables."
    },
    {
      "duty": "Anticipates project staffing needs and collaborates with the Regional Program Manager to identify and select available personnel."
    },
    {
      "duty": "Establishes and communicates project safety plan, actively promotes safety policies, and monitors job site for good safety practices."
    },
    {
      "duty": "Collaborates with procurement staff for acquisition of qualified vendors and plans materials requirements."
    },
    {
      "duty": "Chairs regular job meetings, submits project progress and pending issues summaries, and submits routine reports to client and regional management."
    },
    {
      "duty": "Negotiates changes to the scope of work with the client and subcontractors, reviews bid documents, and assists with bidder solicitation activities."
    },
    {
      "duty": "Anticipates problems and implements corrective actions in collaboration with project stakeholders."
    },
    {
      "duty": "Maintains accurate documentation of job progress through daily logs and other reports."
    },
    {
      "duty": "Performs other responsibilities associated with the position as appropriate."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a technical or construction related field (Master's preferred)"
    }
  ]
}