{
  "meta": [
    {
      "job_title": "Senior Sales Representative",
      "job_category": "Sales",
      "job_class": "Senior",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review job specifications and blueprints \n\t– prepare take-offs if not provided. Obtain competitive prices from various vendors to support targeted project work. Maintain job binder with quotes, correspondence, specifications, and amendments. Update and maintain spreadsheets in computer prior to placing into quote forms. \n\tAssure prompt and timely submittal of proposals to our customers.Continually attempt to broaden vendor base. Sustain a good working relationship with vendors, customers, and prospective customers.Analyze take-off and specification information and develop knowledge to translate information to vendor nomenclature and Customer Quote Form.Prioritize assigned projects and prepare estimate for bids. Review finished quotes prior to turning over to the project management team. Use of our CRM tool to update project status on all jobs-in-progress \n\t– whether bidding or already sold.Work closely with database information team to determine bid dates and priorities. Review receipt of original P.O. for accuracy and work with contract management team to ensure accuracy.Develop and strengthen relationships with customers through reliable and consistent communication. Demonstrate the highest standards of customer service and strive for unequaled customer satisfaction.Provide aggressive bid follow-up and closing of orders.Partner with contract and project management to ensure successful project delivery."
    },
    {
      "duty": "Experience in the door, frames, hardware, and security integration industry required. Experience generating revenue through cold calling, prospecting, and closing transactions required. Previous estimating and/or project management experience preferred. DHI Certifications a plus. Excellent communication, follow-up and closing skills a must."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ],
  "skills": [
    {
      "skill": "Cold Calling",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Closing Transactions",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Estimating",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ]
}