{
  "meta": [
    {
      "job_title": "Technical Specialist",
      "job_category": "Audiovisual Technology",
      "job_class": "Specialist",
      "sector": "Event Technology",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Audiovisual Equipment Setup",
      "experience": 4
    },
    {
      "skill": "Technical Troubleshooting",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Mentorship",
      "experience": 4
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Inventory Management",
      "experience": 4
    },
    {
      "skill": "Technical Certification",
      "experience": 4
    },
    {
      "skill": "Team Supervision",
      "experience": 4
    },
    {
      "skill": "Event Logistics",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Set up and operate small to large-scale audiovisual systems for live events, ensuring accurate and timely setup, operation, and breakdown of advanced audiovisual equipment."
    },
    {
      "duty": "Troubleshoot technical issues and resolve problems quickly during live events, complying with all security and safety measures."
    },
    {
      "duty": "Provide excellent customer service, collaborate with internal team on event solutions, and maintain positive client relationships through effective communication."
    },
    {
      "duty": "Create an atmosphere that fosters the development of technical and leadership skills in other employees, providing mentorship and coaching to team members."
    },
    {
      "duty": "Perform advanced work with operations team members, supervise and direct other technicians during events, and assist with equipment maintenance and inventory."
    },
    {
      "duty": "Assist with proper security, storage, transportation, and maintenance of audiovisual equipment, as well as forecasting equipment needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree is preferred. Encore Technical Level 3 Certification is required. New Encore team members must be certified by their location within 30 days. 2 - Encore Technical Level Two Core Certifications are required (Audio, Lighting, Projection, Video, Scenic). New Encore team members must be certified by a qualified proctor within 60 days."
    }
  ]
}