{
  "meta": [
    {
      "job_title": "Program Advisor",
      "job_category": "Program Management",
      "job_class": "Advisor",
      "sector": "Management",
      "salary": 140000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide analysis and recommendations on policy development and implementation, strategic planning, engagement with high-level government-wide executive councils, industry associations, and Congress, management of government-wide governance and operating models and contract development and management."
    },
    {
      "duty": "Recommends changes in policy, procedures, or program matters which will enhance the effective and economical operation of the government."
    },
    {
      "duty": "Conceive and recommend projects or studies to advance the state of the art in his/her specialty area(s)."
    },
    {
      "duty": "Monitors technical aspects of broad programmatic issues to ensure successful completion, recommending changes or solutions to problems or redirection of effort as required."
    },
    {
      "duty": "Identifies, leads and participates in regional, national and/or international special projects or studies, workgroups, task forces and panels focusing on unprecedented problems, policy making and shaping the future direction of government-wide programs."
    },
    {
      "duty": "Confer with key Government, private officials and top experts representing the agency at technical symposia and conferences."
    },
    {
      "duty": "Serves on agency, interagency and technical society committees."
    },
    {
      "duty": "Develops papers and reports which state the agency's position and furthers the objectives of the organization's programs, publishing those which embrace new knowledge on subjects of far-reaching interest."
    },
    {
      "duty": "This position has job functions that must be executed within specific geographic locations. The official duty station is a federal facility, leased space, or an alternative worksite (typically the employee’s home) within the specified geographic area. If you are selected for this position you will be expected to report to the duty station listed on this announcement within 45 days. At that time, you may be eligible to request to telework one or more days a pay period depending upon the terms of the agency’s telework policy."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a related field (Master's preferred)"
    }
  ]
}