{
  "meta": [
    {
      "job_title": "Plant Maintenance Worker",
      "job_category": "Construction",
      "job_class": "Maintenance",
      "sector": "Construction",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ground control cleanup, shoveling and housekeeping within the plant areas."
    },
    {
      "duty": "Operate equipment as needed or assigned for ground cleanup."
    },
    {
      "duty": "Complete daily plant walks around inspections of plant components while greasing and lubrication."
    },
    {
      "duty": "Ensure all bearings are properly greased and in working condition."
    },
    {
      "duty": "Complete all equipment and component inspections at the beginning and end of all shifts."
    },
    {
      "duty": "Ensure all work area safety hazards are identified and removed."
    },
    {
      "duty": "Responsible for understanding production plant components including electrical control locations."
    },
    {
      "duty": "Responsible for verbally communicating to supervisor all issues that will result in safety risks, poor quality and production shift downtime risks."
    },
    {
      "duty": "Ensure and conduct corrective actions involving dust control measures"
    },
    {
      "duty": "Remain alert at all times and ensure the ability to visually see and monitor all details at close range and at a distance"
    },
    {
      "duty": "Responsible for maintaining housekeeping according to MSHA guidelines within all work areas"
    },
    {
      "duty": "Plant Maintenance; assist plant mechanics involving component repairs to all plant and heavy equipment"
    },
    {
      "duty": "Performs any combination of following tasks in the sand and gravel pit: Removes mud and muck from surface of stone, using pick, shovel, or other tools"
    },
    {
      "duty": "Lift, carry and hold materials, tools and supplies"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 20,
      "introvert_extrovert": 30
    }
  ]
}