{
  "meta": [
    {
      "job_title": "Business Analyst Animal Nutrition",
      "job_category": "Business Analysis",
      "job_class": "Analyst",
      "sector": "Agriculture",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Financial Planning",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Business Intelligence",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Forecasting and production planning in collaboration with the operations and logistics."
    },
    {
      "duty": "Assist in the development of midterm and long-term strategic plans."
    },
    {
      "duty": "Oversee “WAVE” initiatives to drive implementation and continuously add improvement opportunities."
    },
    {
      "duty": "Lead the execution of new product launches for the NA Animal Nutrition portfolio."
    },
    {
      "duty": "Maintain up-to-date knowledge of market trends and competitor activities and assist with strategic and financial plans."
    },
    {
      "duty": "Driving and reporting cost optimization, on-time deliveries, asset utilization, inventory turns, etc."
    },
    {
      "duty": "Regularly produce progress reports, proposals, and executive summaries."
    },
    {
      "duty": "Prepare and present valuable global market statistics by monitoring competitor activity and current market trends."
    },
    {
      "duty": "Collaborate with ADM’s existing animal nutrition global businesses, aligning and coordinating activities among business-line functions, regional marketing, and sales teams."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "University or college degree in business or equivalent (Master's preferred)"
    },
    {
      "credential": "3 years prior experience within an Agribusiness company"
    }
  ]
}