{
  "meta": [
    {
      "job_title": "NP CV/CT Surgery - Non-Operative",
      "job_category": "Healthcare",
      "job_class": "Non-Operative",
      "sector": "Healthcare",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assess the physical and mental condition of patients by performing comprehensive or problem-focused physical examinations and medical histories."
    },
    {
      "duty": "Order, collect, interpret, and evaluate laboratory and other diagnostic tests to assess patient problems and health care needs."
    },
    {
      "duty": "Prescribe, recommend and employ medical drug therapies or other related therapeutic treatments and procedures, or perform indicated procedures in accordance with approved policies."
    },
    {
      "duty": "Formulate and implement comprehensive patient treatment plans based on patient assessments, evidence-based medicine, and collaboration with physicians and interdisciplinary team members."
    },
    {
      "duty": "Counsel patients and families regarding medical processes, management of health illness/condition, medication, nutrition, and health promotion."
    },
    {
      "duty": "Maintain appropriate records detailing the patient’s treatment plans and outcomes."
    },
    {
      "duty": "Provide consultation level services for conditions/problems related to the Provider’s specialty."
    },
    {
      "duty": "Manage patients in healthcare settings other than the primary clinic setting."
    },
    {
      "duty": "Perform invasive procedures specific to scope of practice and provider’s level of competency as delegated by supervising Physician."
    },
    {
      "duty": "Perform follows-up with patients both pre- and post-operatively, and may also round on patients in the hospital or see patients in the Emergency Department."
    },
    {
      "duty": "May be required to perform patient care duties beyond regular schedule based on coverage needs of the department."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Graduate of an Accredited Program (Nurse Practitioner)"
    }
  ]
}