{
  "meta": [
    {
      "job_title": "Radiologic Technologist Student",
      "job_category": "Healthcare",
      "job_class": "Student",
      "sector": "Healthcare",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Works under general supervision of a certified Radiology Technologist, performing patient care needs and support functions associated with assisting the technologist and nurse in the performance of radiology exams and delegated medical procedures under the direct supervision of the physician."
    },
    {
      "duty": "Includes processing of x-ray studies for interpretation by clinicians."
    },
    {
      "duty": "Prepares patient for exam or procedure and assist technologist, nurse or physician."
    },
    {
      "duty": "Maintains patient and staff confidentiality at all times."
    },
    {
      "duty": "Operates and maintains equipment safely and in accordance with established policies and procedures."
    },
    {
      "duty": "Maintains an adequate inventory of equipment and supplies for assigned area and places general and special supply orders from purchasing in a timely manner."
    },
    {
      "duty": "Thoroughly cleans the room to make ready for the next patient and recommending terminal clean to address patient infection control standards."
    },
    {
      "duty": "Wears personal monitoring device on collar and outside of apron consistently and submits it promptly and regularly for assessment of occupational dosage."
    },
    {
      "duty": "Reports any loss, damage, or unusual events associated with personal monitoring device immediately to the Radiation Safety Office."
    },
    {
      "duty": "Diligently observes patient, recognizes changes in condition and seeks appropriate assistance."
    },
    {
      "duty": "Verifies the requisition/chart for valid written order, priority, date, ordering comments, physician's notes, uses time-out process for invasive procedures and precautions and patient consent forms. Ensures that records are properly completed with patient identification data and appropriate labeling."
    },
    {
      "duty": "Ensures individuals are safe to enter the department by screening them according to approved policies and procedures."
    },
    {
      "duty": "Demonstrates and maintains current knowledge, continued education and skills appropriate care for the following age groups (specific to department): newborn, pediatric, young adult, adult and geriatric."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "H.S. Diploma/GED Equivalent"
    }
  ]
}