{
  "meta": [
    {
      "job_title": "Universal Banker",
      "job_category": "Banking",
      "job_class": "Universal Banker",
      "sector": "Finance",
      "salary": 23000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Banking Operations",
      "experience": 1
    },
    {
      "skill": "Cash Handling",
      "experience": 1
    },
    {
      "skill": "New Accounts",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Consumer Loan Processing",
      "experience": 1
    },
    {
      "skill": "Compliance Knowledge",
      "experience": 1
    },
    {
      "skill": "Sales Techniques",
      "experience": 1
    },
    {
      "skill": "Problem Solving",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform routine teller transactions, new account transactions, and work directly with clients."
    },
    {
      "duty": "Maintain and balance a cash supply for transactions performed."
    },
    {
      "duty": "Provide comprehensive deposit services to individuals and small businesses."
    },
    {
      "duty": "Promote the full range of deposit products and services that best meet the client’s needs."
    },
    {
      "duty": "Receive consumer loan applications, review loan packages, and process simple consumer loan packages."
    },
    {
      "duty": "Assist customers with account maintenance, online banking, mobile banking, and other complex account issues."
    },
    {
      "duty": "Utilize sales techniques to uncover customer needs and match them to the bank’s products and services."
    },
    {
      "duty": "Review client transactions for red flags and fraudulent items. Prevent clients from becoming victims of fraud."
    },
    {
      "duty": "Gather data and process various reports and forms to ensure compliance with bank policies and regulatory compliance programs."
    },
    {
      "duty": "Keep a clean, organized work area and a professional appearance. Complete required compliance training in a timely manner."
    },
    {
      "duty": "Participate in branch, region, and bank campaigns."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 20
    }
  ],
  "education_certification": [
    {
      "credential": "High School Degree/GED required"
    }
  ]
}