{
  "meta": [
    {
      "job_title": "Agile Product Owner",
      "job_category": "IT",
      "job_class": "Product Owner",
      "sector": "Software Engineering",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Agile Methodology",
      "experience": 5
    },
    {
      "skill": "Product Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Employee Benefits",
      "experience": 5
    },
    {
      "skill": "Strategic Thinking",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Innovation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the development of web portals supporting customer, employer, and broker personas in partnership with senior business leaders and development teams."
    },
    {
      "duty": "Provide direction, guidance, and ownership for roadmap execution and delivery."
    },
    {
      "duty": "Ensure web portal development achieves critical milestones on time and on budget."
    },
    {
      "duty": "Own the Product Roadmap, defining and prioritizing features in alignment with portfolio objectives."
    },
    {
      "duty": "Represent voice of the customer and consider their point of view to best solve their problems."
    },
    {
      "duty": "Participate in Planning and work with Architects to understand enabler related work."
    },
    {
      "duty": "Embrace ambiguity and high degree of complexity associated with standing up a new business."
    },
    {
      "duty": "Break down work into manageable parts for agile teams to co-solution and build."
    },
    {
      "duty": "Facilitate deliveries that include multiple third-parties and internal resources."
    },
    {
      "duty": "Thrive in a fast-paced environment, juggling multiple priorities and deadlines."
    },
    {
      "duty": "Drive innovation with an experimental mindset."
    },
    {
      "duty": "Partner with business leaders to continuously align the product vision and roadmap to the capabilities needed to bring business strategy to life."
    },
    {
      "duty": "Provide timely communication between teams and senior management and monitor value achieved vs. planned."
    },
    {
      "duty": "Consider people, processes, technology, and data changes and impact when prioritizing work with the development team."
    },
    {
      "duty": "Carefully plan and oversee web portal development to ensure it aligns with the business strategy and desired outcomes."
    },
    {
      "duty": "Set an agenda in line with company priorities and drive high-impact, high-quality work product through collaborative and individual efforts."
    },
    {
      "duty": "Measure and report on the performance of web portal development using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in an IT-related field (Master's preferred)"
    }
  ]
}