{
  "meta": [
    {
      "job_title": "Digital Assurance & Transparency Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Environmental, Social and Governance",
      "salary": 135000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sustainability Reporting",
      "experience": 5
    },
    {
      "skill": "Environmental Knowledge",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Technology Advisory",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Sustainability Advisory",
      "experience": 5
    },
    {
      "skill": "Thought Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work as part of a team of problem solvers, helping to solve complex business issues from strategy to execution."
    },
    {
      "duty": "Help clients meet evolving stakeholder expectations for transparency on environmental, social, and governance topics."
    },
    {
      "duty": "Work with clients to understand and navigate reporting standards (e.g. Sustainability Accounting Standards Board - SASB, Integrated Reporting, Global Reporting Initiative - GRI, Task Force on Climate-Related Financial Disclosures - TCFD), develop processes, controls, and technology to support reporting, and provide independent assurance over Environmental, Social, and Corporate Governance Data (ESG) disclosures."
    },
    {
      "duty": "Develop thought leadership on sustainability processes and controls and create tailored solutions for clients."
    },
    {
      "duty": "Lead the planning and execution of sustainability-related advisory or assurance projects associated with systems implementations, business process transformation projects, and external audits."
    },
    {
      "duty": "Contribute to thought leadership and sharing best practices on sustainability processes and controls."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Environmental Science, Sustainable Resource Management, or related field (Master's preferred)"
    }
  ]
}