{
  "meta": [
    {
      "job_title": "Specialist Sales Technology",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Agile Development",
      "experience": 3
    },
    {
      "skill": "Product Management",
      "experience": 3
    },
    {
      "skill": "Technical Solution Evaluation",
      "experience": 5
    },
    {
      "skill": "User Testing",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 3
    },
    {
      "skill": "Vendor Evaluation",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide technical support for sales technology and applications."
    },
    {
      "duty": "Evaluate third-party commercial solutions and vendors for the implementation of new technical solutions."
    },
    {
      "duty": "Write user stories, evaluate test cases, and create customer/user-facing documentation for the responsible product areas."
    },
    {
      "duty": "Lead and mentor additional team members assigned to define product offering requirements and gather user feedback/testing."
    },
    {
      "duty": "Evaluate integration opportunities with new internal or external systems and technologies."
    },
    {
      "duty": "Provide reports and presentation views for senior management and the DSD Excellence team to evaluate key performance indicators."
    },
    {
      "duty": "Consolidate feedback, enhancement requests, and beta testing results to prioritize defects and new developments."
    },
    {
      "duty": "Lead and oversee user testing of prototypes, interfaces, and beta version solutions."
    },
    {
      "duty": "Manage and oversee user testing of prototypes, interfaces, hardware, beta version solutions, and other vendor evaluations to achieve product market fit."
    },
    {
      "duty": "Understand and measure usage of the solution to refine operation and future functionality."
    },
    {
      "duty": "Solicit and collect user feedback for inclusion into the derived solution."
    },
    {
      "duty": "Ensure quality of the product through appropriateness of QA test plans and pilot user testing efforts."
    },
    {
      "duty": "Support training, documentation of solution, and implementation activities for solution rollout."
    },
    {
      "duty": "Evaluate integration opportunities with new internal or external systems and technologies as feasible and useful for the user base."
    },
    {
      "duty": "Understand intricate interaction and user flow to translate business requirements into technical requirements, user stories, and epics."
    },
    {
      "duty": "Participate in and lead Agile development ceremonies."
    },
    {
      "duty": "Write epics and user stories to deliver solutions in the Agile process."
    },
    {
      "duty": "Work with operational and other sales teams to test and deploy solutions across the entire sales team, collecting and prioritizing feedback and issues for resolution."
    },
    {
      "duty": "Evaluate third-party commercial solutions and vendors for the implementation of new technical solutions either as stand-alone or integrated to Bimbo Bakeries technical systems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Business, Computer Technology, or related field. A combination of education, training and experience that results in demonstrated competency to perform the work may be substituted."
    }
  ]
}