{
  "meta": [
    {
      "job_title": "Care Coordination Manager",
      "job_category": "Clinical Operations",
      "job_class": "Manager",
      "sector": "Clinical Care",
      "salary": 101250,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Mentorship",
      "experience": 5
    },
    {
      "skill": "Health Insurance Knowledge",
      "experience": 5
    },
    {
      "skill": "Claims Processing",
      "experience": 5
    },
    {
      "skill": "Behavioral Health",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage a team of ~8 Care Coordinators and/or Senior Care Coordinators, leading team-wide initiatives and projects, and partnering with cross-functional teams on projects that impact Care Coordination."
    },
    {
      "duty": "Proactively manage Care Coordinator direct reports, auditing performance, keeping tabs on working dynamics, getting ahead of change management, support direct reports to succeed in their role and provide coaching as needed."
    },
    {
      "duty": "Write, report on, and manage to team goals/SLAs (Service Level Agreements) such as call answer time, email resolution time, CSAT, etc."
    },
    {
      "duty": "Foster relationships with cross-functional stakeholders and partners, including Clinical Leadership, Product Development, Business Development, Care Operations, and Revenue Cycle Management."
    },
    {
      "duty": "Represent Care Coordination on major cross-functional projects (launching in new states, implementing new payer partners, etc.) and serve as a liaison to the rest of the Care Coordination team."
    },
    {
      "duty": "Understand Two Chairs business model and role of Care Coordination, demonstrate proficiency on Care Coordinator workflows, and develop rapport with direct reports and cross-functional partners."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Health Administration, Business, or a related field (Master's preferred)"
    }
  ]
}