{
  "meta": [
    {
      "job_title": "Construction Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Subcontractor Management",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "Critical Path Analysis",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide overall on-site management of a commercial construction project."
    },
    {
      "duty": "Supervise total construction effort to ensure project is constructed in accordance with all contract documents, construction budget, and schedule."
    },
    {
      "duty": "Foster good communication with client representatives, AE representatives, other contractors, etc."
    },
    {
      "duty": "Plan, coordinate and supervise onsite functions to assure high quality control."
    },
    {
      "duty": "Manage subcontractors’ installation procedures to assure material installations follow manufacturer printed installation requirements."
    },
    {
      "duty": "Be responsible for timely receipt of direct-purchase materials."
    },
    {
      "duty": "Schedule and manage the work to assure tight adherence to critical path activities of the project schedule."
    },
    {
      "duty": "Document daily activities, field conditions, and safety violations."
    },
    {
      "duty": "Assume responsibility for a safe work environment, productivity of crafts, efficient use of materials and equipment, and contractual performance of the project."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Overall knowledge and experience in construction with at least 5 years as a superintendent with the ability to work with tools as required to properly complete various construction tasks."
    }
  ]
}