{
  "meta": [
    {
      "job_title": "3D Artist",
      "job_category": "Art & Design",
      "job_class": "Artist",
      "sector": "Software Engineering",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and develop high-quality 3D assets, including visually pleasing and optimized 3D models, textures, and materials for game characters, environments, and other in-game elements."
    },
    {
      "duty": "Produce lifelike animations and rigging, ensuring smooth and realistic movement in-game."
    },
    {
      "duty": "Work closely with the game design team to ensure that the 3D assets and animations enhance the game's mechanics and overall player experience."
    },
    {
      "duty": "Optimize 3D assets to meet technical requirements and performance standards, such as polygon count, texture resolution, and level-of-detail optimization."
    },
    {
      "duty": "Collaborate with programmers to implement custom shaders, visual effects, and other advanced rendering techniques."
    },
    {
      "duty": "Participate in art reviews and critiques, offering and receiving constructive feedback to refine the quality and consistency of the game's visuals."
    },
    {
      "duty": "Stay current with industry trends and techniques, including software tools, 3D rendering methods, and emerging platforms or technologies."
    },
    {
      "duty": "Organize, maintain, and appropriately document all 3D assets, following our studio's naming conventions, file organization, and version control protocols."
    }
  ],
  "skills": [
    {
      "skill": "3D Modeling",
      "experience": 5
    },
    {
      "skill": "Texturing",
      "experience": 5
    },
    {
      "skill": "Animation",
      "experience": 5
    },
    {
      "skill": "Game Design Collaboration",
      "experience": 5
    },
    {
      "skill": "Asset Optimization",
      "experience": 5
    },
    {
      "skill": "Art Reviews",
      "experience": 5
    },
    {
      "skill": "Industry Trends",
      "experience": 5
    },
    {
      "skill": "File Organization",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Fine Arts, Computer Animation, or related field (Master's preferred)"
    }
  ]
}