{
  "meta": [
    {
      "job_title": "Director of Events",
      "job_category": "Event Management",
      "job_class": "Director",
      "sector": "Hospitality",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct leadership of the Events team and responsibility for the Events Budget and P&L."
    },
    {
      "duty": "Develop, implement, and monitor the hotel’s sales strategy to achieve and exceed forecasted revenue targets in Group Rooms, Banquet Food and Beverage, AV, and all other revenue-generating departments."
    },
    {
      "duty": "Design, implement, and facilitate the annual marketing plan for the hotel."
    },
    {
      "duty": "Expand the client base through prospecting, marketing, and cultivating key relationships."
    },
    {
      "duty": "Manage all areas of Catering and Convention Services inclusive of creation and pricing of Banquet menus, identification, and implementation of sustainable practices in meetings and events, and curating experiences for group and event customers."
    },
    {
      "duty": "Support and monitor sales performance of Event Sales Managers and manage administrative tasks in sales and events systems."
    },
    {
      "duty": "Recruit, hire, and successfully onboard colleagues as needed in Events and provide ongoing training for colleagues in the department."
    },
    {
      "duty": "Work closely with Banquet Manager and his/her team to create and ensure quality levels are maintained on a daily basis as well as enhancing overall banquet set-ups."
    },
    {
      "duty": "Administer all areas of the Events Department, including but not limited to sales, planning, marketing, servicing, and administrative procedures."
    },
    {
      "duty": "Protect the hotel’s legal and financial interests through proper contract and risk management practices."
    },
    {
      "duty": "Experiment to improve, demonstrate a growth mindset, and set priorities with data."
    },
    {
      "duty": "Drive for impact by focusing on outcomes, ensuring accountability."
    },
    {
      "duty": "Develop diverse talent through fostering connections, coaching, and mentoring."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Hotel Management, Hospitality, or a related field (Master's preferred)"
    }
  ]
}