{
  "meta": [
    {
      "job_title": "Sales Compensation Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Sales",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Sales Compensation Management",
      "experience": 5
    },
    {
      "skill": "SAP Callidus Cloud",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Business Process Evaluation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and coordinate all activities related to the sales compensation cycle including planning, administration, budgeting/forecasting, reporting, and analysis."
    },
    {
      "duty": "Maintain and update the SAP Callidus platform for plans, quotas, and organizational changes."
    },
    {
      "duty": "Collaborate with external consultants on system design updates, testing, and deployment."
    },
    {
      "duty": "Establish actionable metrics and dashboards to showcase the compensation plan effectiveness."
    },
    {
      "duty": "Present insightful summaries to senior management highlighting key opportunities and areas of concern."
    },
    {
      "duty": "Develop models and analysis to support initiatives driving top-line growth and increase employee engagement and retention."
    },
    {
      "duty": "Participate in cross-functional teams to evaluate business processes and develop strategies for operational excellence."
    },
    {
      "duty": "Provide analytical support on ad hoc projects and data requests working with various internal stakeholders."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "B.S/M.S. in Finance, Mathematics, MIS, Organizational Management, or similar disciplines"
    },
    {
      "credential": "Experience in a Telecommunications or SaaS Company is a plus"
    },
    {
      "credential": "Proficient with Visualization tools like Tableau and Microsoft BI is a plus"
    },
    {
      "credential": "Experience with SQL and data mining tools is a plus"
    }
  ]
}