{
  "meta": [
    {
      "job_title": "Senior Business Continuity Lead",
      "job_category": "Business Continuity",
      "job_class": "Senior Lead",
      "sector": "Management",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, build, run and manage Firmwide strategy, this includes industry accepted BC/DR strategies, plan development, plan exercising, and manage related IT budgets (capital and operational), annual program agendas and recovery improvement metrics."
    },
    {
      "duty": "Participate in assessments of the impact of potential disruptions in IT services, including declaring a disaster and activating the BC/DR plan."
    },
    {
      "duty": "Manage the execution and completion of all BC/DR test activities. This individual will be expected to collaborate with business continuity management (BCM), business unit management, external business partners and key IT staff members to plan, direct, control and maintain effective DR plan testing."
    },
    {
      "duty": "Responsible for data center recovery and serve as the key IT liaison to the enterprise BCM team, ensuring that IT technologies and processes support all key availability and recovery requirements — for example, crisis management, business recovery and supplier contingency."
    },
    {
      "duty": "Manage and enforce contracts, along with associated service-level agreements (SLAs), for external DR service providers, as required."
    },
    {
      "duty": "Assume responsibility for DR (including data-center-specific and non-data-center-specific IT infrastructure), with a major focus on achieving all financial estimates, ensuring adequacy of end-state production recovery environments, meeting all strategic planning deliverables, and coordinating activities of technology resources with key business units and development groups, as required."
    },
    {
      "duty": "Initiate and manage data center recovery capacity planning coordination with key IT technology groups in support of specific business unit initiatives (current, planned, and new), focusing on proactively ensuring an adequate recovery network and processing environment, as well as accurate and predictive budgeting."
    },
    {
      "duty": "Oversee the execution of DR plans when IT and/or major business operations disruptions occur."
    },
    {
      "duty": "Oversee the design, execution and continuous improvement of DR plans through rigorous exercising."
    },
    {
      "duty": "Interface with the IT project office to ensure that new and ongoing projects sustain the level of recoverability consistent with business objectives."
    },
    {
      "duty": "Manage the creation of program status communications to internal management and external stakeholders (including regulators, auditors and customers) regarding the status of the DR program, including annual reporting, audit report responses and customer requests."
    },
    {
      "duty": "Perform all departmental administrative activities, including staff meeting attendance, monthly status reporting, budgeting, strategic planning, staff performance management, expense processing, documentation and other activities, as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Ongoing active participation in BCM and DRM forums or professional bodiesUnderstanding of and experience in applying ISO 27001, ITIL v3, DRI International (DRII) or Business Continuity Institute (BCI) professional practices, as well as industry-specific regulations and regulatory bodiesAt least 5 years of experience in implementing DR plans, including: policy, organization and architecture development; data center infrastructure development and management; backup, recovery, storage systems and IT security management; vendor management of external DR service providers; recovery strategy development, and multiple plan development and maintenance; recovery plan testing; and overall program management and governanceBCM certifications are a plus (Certified Business Continuity Professional or Master Business Continuity Professional, or a fellow in the Business Continuity Institute or master of the Business Continuity Institute)At least two years of experience in a business professional environmentExperience in defining, implementing and enforcing risk-based standards, processes and procedures for responding to disruptions in business or IT operationsProven strategic leadership and relationship management capabilities, including experience with internal stakeholders — particularly senior and business unit management, as well as customers, external business partners and third-party service providersProven competency in executing large projects, on time and within budget, with business and IT personnelExperience leading and managing high-performance multidisciplinary workgroups or teams to meet goals across multiple projects.Experience in creating and defining new operational models and procedures, and explaining complex problems or situationsExtensive experience in leading and managing groups of self-directed professionals.Proven ability to work under stressful conditions, such as business-related crises.Required Knowledge and Skills Thorough knowledge and understanding of current DR planning techniques and technologies, as well as the methods used to perform risk analyses and business impact analysesWorking knowledge of data and voice telecommunications to guide the preparation of related recovery procedures.Strong oral communication and written communication skillsProven experience in the use and application of IT project and program management tools."
    }
  ]
}