{
  "meta": [
    {
      "job_title": "Marketing Coordinator",
      "job_category": "Marketing",
      "job_class": "Coordinator",
      "sector": "Marketing",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "CRO Strategies",
      "experience": 4
    },
    {
      "skill": "Shopify Platform Management",
      "experience": 4
    },
    {
      "skill": "Marketing Supplements",
      "experience": 4
    },
    {
      "skill": "Analytical Mindset",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with marketing and design teams to develop and implement CRO strategies aimed at improving website performance and increasing sales."
    },
    {
      "duty": "Conduct thorough analysis of website traffic, user behavior, and sales data to identify areas for improvement and optimization."
    },
    {
      "duty": "A/B test landing pages, product pages, and checkout processes to maximize conversion rates and customer satisfaction."
    },
    {
      "duty": "Monitor and analyze key performance indicators (KPIs) related to website traffic, user engagement, and sales metrics."
    },
    {
      "duty": "Oversee the Shopify platform, ensuring smooth functionality, managing product listings, and implementing new features and updates."
    },
    {
      "duty": "Stay up-to-date with industry trends, competitor activities, and best practices in CRO and e-commerce to drive innovation."
    },
    {
      "duty": "Work with content creators and influencers to promote products and increase brand awareness."
    },
    {
      "duty": "Proven experience in CRO techniques and strategies, with a track record of driving positive results in an e-commerce environment."
    },
    {
      "duty": "Proficiency in Shopify platform management, including product uploads, website customization, and app integration."
    },
    {
      "duty": "Prior experience in marketing supplements, especially for women, is highly desirable."
    },
    {
      "duty": "Analytical mindset with the ability to interpret data and make data-driven decisions to optimize marketing efforts."
    },
    {
      "duty": "Strong communication skills and the ability to collaborate effectively with cross-functional teams."
    },
    {
      "duty": "Excellent project management and organizational skills to handle multiple tasks and deadlines."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}