{
  "meta": [
    {
      "job_title": "Phlebotomist",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 20,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Phlebotomy",
      "experience": 2
    },
    {
      "skill": "Medical Terminology",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Basic Computer Skills",
      "experience": 2
    },
    {
      "skill": "Patient Identification",
      "experience": 2
    },
    {
      "skill": "Venipuncture",
      "experience": 2
    },
    {
      "skill": "Specimen Collection",
      "experience": 2
    },
    {
      "skill": "Specimen Processing",
      "experience": 2
    },
    {
      "skill": "Medical Protocols",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collect patient specimens for testing in a timely manner, including routine and advanced venipuncture."
    },
    {
      "duty": "Ensure positive patient identification prior to specimen collection and adherence to strict medical protocol."
    },
    {
      "duty": "Process emergency orders within the required time frame and label each specimen accurately."
    },
    {
      "duty": "Operate departmental computer programs to activate orders, perform order management, and troubleshoot as necessary."
    },
    {
      "duty": "Maintain stock of commonly used supplies, perform routine inspections of stock levels, and review expiration dates."
    },
    {
      "duty": "Perform preventive maintenance on equipment and take prompt action to resolve any problems with specimen collection and processing."
    },
    {
      "duty": "Document issues, problems, and opportunities, and escalate to supervisory staff when appropriate."
    },
    {
      "duty": "Participate in quality improvement activities and attend educational in-services and training classes."
    },
    {
      "duty": "May review test requisitions, order tests appropriately, and provide patients with instruction regarding non-blood specimen collections."
    },
    {
      "duty": "Perform basic clerical duties as needed and assist in training new staff or students in blood collection and/or specimen processing."
    },
    {
      "duty": "May assume coordinator responsibilities in the absence of supervisory staff."
    },
    {
      "duty": "Maintain and utilize computerized carts, adhere to patient isolation procedures, and maintain phone availability for emergent collections."
    },
    {
      "duty": "Interact with clinical staff to maintain computerized records, resolve, and troubleshoot outstanding specimen/collections."
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent (Phlebotomy certificate preferred)"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 80,
      "introvert_extrovert": 30
    }
  ]
}