{
  "meta": [
    {
      "job_title": "Healthcare Data Scientist",
      "job_category": "Data Science",
      "job_class": "Research Scientist",
      "sector": "Healthcare",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 5
    },
    {
      "skill": "Healthcare Data Management",
      "experience": 5
    },
    {
      "skill": "Data Quality Assessment",
      "experience": 5
    },
    {
      "skill": "Healthcare Analytics",
      "experience": 5
    },
    {
      "skill": "Research Methodology",
      "experience": 5
    },
    {
      "skill": "Scientific Research",
      "experience": 5
    },
    {
      "skill": "Data Security Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform complex research and data analytic projects related to collection, analysis, and reporting of total health care expenditure (THCE) data, quality, and equity performance."
    },
    {
      "duty": "Lead and coordinate major complex research projects related to the development of spending targets and analyze performance of health care entities against these targets."
    },
    {
      "duty": "Assess data quality and harmonize data across multiple sources, including facility financial reports, claims and encounter data, and others."
    },
    {
      "duty": "Plan, organize, and direct major research studies of a highly developed scientific scope and complexity, making independent, difficult scientific decisions."
    },
    {
      "duty": "Serve as a subject matter expert and scientific lead for specific projects, measuring and assessing data quality and accuracy."
    },
    {
      "duty": "Handle confidential patient data in compliance with specific statutes, regulations, and policies governing the collection, storage, disclosure, and use of confidential data."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Data Science, Statistics, or related field (Master's or PhD preferred)"
    }
  ]
}