{
  "meta": [
    {
      "job_title": "Vice President/General Manager",
      "job_category": "Management",
      "job_class": "Executive",
      "sector": "Management",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a fully functioning multi-platform Spanish language media station with a focus on growing revenue and audience."
    },
    {
      "duty": "Be the primary leader in generating ratings and revenue."
    },
    {
      "duty": "Develop strategic plans and operational plans for the station's growth in multi-platform content delivery and revenue generation that is in alignment with the local brand."
    },
    {
      "duty": "Lead with positive motivation, direction, and insight while holding team accountable for attainment of operational goals."
    },
    {
      "duty": "Encourage innovation across all levels of the organization."
    },
    {
      "duty": "Must be resourceful and solutions-oriented."
    },
    {
      "duty": "Provide visible leadership both inside the station and in the community."
    },
    {
      "duty": "Establish strong relationships with key clients and other business partners."
    },
    {
      "duty": "Effectively communicate to department heads and all employees."
    },
    {
      "duty": "Create a collaborative, team-based environment."
    },
    {
      "duty": "Provide training and development opportunities to team members."
    },
    {
      "duty": "Responsible for all aspects of financial statements and ensuring station compliance."
    },
    {
      "duty": "Responsible for station operating and capital expense budgets."
    },
    {
      "duty": "Enforce all FCC, EEO, SOX and any other appropriate rules and regulations."
    },
    {
      "duty": "Understand and adhere to company policies, and at all times adhere to the highest ethical standards."
    },
    {
      "duty": "Work transparently with divisional general manager and other corporate team members to improve multi-platform operations."
    },
    {
      "duty": "Perform other duties as may be assigned."
    }
  ],
  "skills": [
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Revenue Generation",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Innovation Management",
      "experience": 10
    },
    {
      "skill": "Client Relationship Management",
      "experience": 10
    },
    {
      "skill": "Financial Management",
      "experience": 10
    },
    {
      "skill": "Compliance Management",
      "experience": 10
    },
    {
      "skill": "Ethical Standards Adherence",
      "experience": 10
    },
    {
      "skill": "Multi-Platform Operations",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Four-year degree in a related field (Master's preferred)"
    }
  ]
}