{
  "meta": [
    {
      "job_title": "Clinical Resource Director",
      "job_category": "Healthcare",
      "job_class": "Management",
      "sector": "Healthcare",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Value Analysis",
      "experience": 5
    },
    {
      "skill": "Clinical Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops and implements facility or division-based strategies and processes to reduce supply expense per adjusted admission."
    },
    {
      "duty": "Identifies and implements supply expense margin improvement with a primary focus on high cost of good departments to include surgical services, Cath lab, ep lab and special procedures."
    },
    {
      "duty": "Participates in monthly operating reports and supply expense planning."
    },
    {
      "duty": "Utilizes clinical product value analysis committees to review products and technology for clinical evidence and benefit."
    },
    {
      "duty": "Builds relationships and increases customer satisfaction with hospital leadership, chief medical officer, clinical directors, physicians, value analysis teams and supply chain leadership."
    },
    {
      "duty": "Rounds within the departments and observes procedural cases to identify opportunities and build relationships."
    },
    {
      "duty": "Ability to understand and conduct financial analysis of quantitative and qualitative information through strong data mining and analytical skills."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required (Business, Health Administration, Nursing, Pharmacy or other Allied Health Profession) or a graduate of a Professional school of Nursing (Associate Degree or Diploma) with related experiences in healthcare value analysis, clinical supply chain, or acute care hospital performance. Master’s degree highly, preferred. Certified Materials and Resource Professional (CMRP), Certified Value Analysis Health Professional (CVAHP), or similar credential preferred."
    }
  ]
}