{
  "meta": [
    {
      "job_title": "Applications Architect",
      "job_category": "Software Engineering",
      "job_class": "Architect",
      "sector": "Tech",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Enterprise-wide Application Design",
      "experience": 10
    },
    {
      "skill": "Technical Architecture Analysis",
      "experience": 10
    },
    {
      "skill": "SAP Modules",
      "experience": 10
    },
    {
      "skill": "ABAP Development",
      "experience": 10
    },
    {
      "skill": "Enterprise Architecture",
      "experience": 10
    },
    {
      "skill": "Problem Solving",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "CPG Industry Knowledge",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads design recommendations for enterprise-wide applications in alignment with required business transformations."
    },
    {
      "duty": "Manages technical architecture analysis, research, design, and development of new functionality integrated within the enterprise."
    },
    {
      "duty": "Defines, adopts, and advocates best practices as they relate to application architecture."
    },
    {
      "duty": "Researches and recommends new capabilities and innovations across domains where solutions may benefit the enterprise."
    },
    {
      "duty": "Designs enterprise level applications and custom integration solutions including major enhancements and interfaces."
    },
    {
      "duty": "Owns and leads Architecture standards that are effective in supporting the enterprise. Creates reusable processes and templates as part of the EA portfolio that supports agile enterprise change."
    },
    {
      "duty": "Provides solution design and architecture to internal teams to support ongoing design and development. Leads in continuous review of existing designs/solutions to ensure highest value for the enterprise."
    },
    {
      "duty": "Ability to provide subject matter expertise and be both hands-on as well as act as a mentor and lead others as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in computer science, Engineering, or a related discipline with 10+ years of job-related experience (Master’s degree in systems architecture or similar is desired)"
    }
  ]
}