{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 44500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Recruiting",
      "experience": 5
    },
    {
      "skill": "Planning and Organizing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Cash-Handling",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Advocating and Empathizing",
      "experience": 5
    },
    {
      "skill": "Safety and Security",
      "experience": 5
    },
    {
      "skill": "Merchandising",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Store Manager with oversight of the Station Store operations, including hiring, supervising, and working with staff to accomplish daily tasks, bookkeeping, and merchandising."
    },
    {
      "duty": "Maintain high standards and provide fast and friendly service to customers, overseeing the execution of the food program."
    },
    {
      "duty": "Lead a team of employees/management, recruiting, interviewing, and hiring staff, and delegating and following up on tasks."
    },
    {
      "duty": "Provide regular and predictable onsite attendance, and perform shift supervisions and assume Store Manager responsibilities when needed."
    },
    {
      "duty": "Ensuring all shift sales are completed in accordance with company policies and keeping accurate cash, sales, and inventory control records."
    },
    {
      "duty": "Assist in maintaining a safe environment for employees and customers, and implementing non-discriminatory related management skills while hiring, training, and mentoring employees."
    },
    {
      "duty": "Prepares or assists in the preparation of sales, product, and operating reports as directed by the Store Manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent plus 6 months to 1 year of retail and management work experience preferred."
    }
  ]
}