{
  "meta": [
    {
      "job_title": "Product and Supply Manager",
      "job_category": "Supply Chain Management",
      "job_class": "Manager",
      "sector": "Supply Chain",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute the purchasing and import of products, and manage the domestic warehouse distribution network for the Styrenics foam business."
    },
    {
      "duty": "Provide direction to Customer Care to drive activities and initiatives to meet business financial targets and operational objectives."
    },
    {
      "duty": "Support regional sales and technical team to develop and implement strategic business and marketing initiatives in order to achieve business objectives."
    },
    {
      "duty": "Leverage market intelligence to drive the R&D pipeline and optimize the go-to-market strategy and product positioning."
    },
    {
      "duty": "Manage portfolio and support pricing strategy to meet business profitability targets; including price analysis, entry, and discrepancy resolution."
    },
    {
      "duty": "Analyze financial results and costs to identify opportunities and enable business objectives."
    },
    {
      "duty": "Lead the regional Sales and Operation Planning process and represent the region in the global S&OP process."
    },
    {
      "duty": "Manage system planning parameters, proactively identify and resolve supply imbalances, manage inventory and distribution network, and enable efficient execution of imports and tollers to support the regional business demands and service level targets."
    },
    {
      "duty": "Coordinate with 3PL vendors to improve service levels, resolve operational and quality challenges, and plan service expansions."
    },
    {
      "duty": "Successfully manage the Order to Cash process, meet delivery reliability expectations, and develop strategies to enhance the Customer Experience."
    },
    {
      "duty": "Serve as the primary point of contact regarding all supply/demand related inquiries for areas of responsibility."
    },
    {
      "duty": "Maintain and develop relationships with global colleagues and manage commercial activities including product positioning, pricing proposals, and sales support activities."
    },
    {
      "duty": "Implement continuous improvement initiatives for the business."
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Business Management",
      "experience": 5
    },
    {
      "skill": "Sales and Operations Planning",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "International Trade",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Supply Chain Management, Business Management, or a related discipline (Master's preferred)"
    }
  ]
}