{
  "meta": [
    {
      "job_title": "Operations Quality Assurance Specialist",
      "job_category": "Quality Assurance",
      "job_class": "Specialist",
      "sector": "Quality Assurance",
      "salary": 30000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops audit checklist and audit criteria and performs audits to ensure that productivity and quality standards are met, to ensure adherence to and compliance with policies and procedures, state and regulatory requirements (NAIC, SEC, etc.) and good business practices."
    },
    {
      "duty": "Reviews external research and incorporates key findings in quality monitoring program."
    },
    {
      "duty": "Consults with managers and associates on departmental QA initiatives."
    },
    {
      "duty": "Performs trend and root cause analysis that will help identify skill and service gaps. Develops and maintains reporting to collect and analyze activity data and track trends in service quality and analyzes and measures the effectiveness of existing processes."
    },
    {
      "duty": "Develops sustainable, repeatable and quantifiable process improvements to increase productivity and reduce cost."
    },
    {
      "duty": "Works with department management to clarify changing procedures and collaborates with training resources to provide training on improved processes."
    },
    {
      "duty": "Compiles regular QA reports and provides to management."
    }
  ],
  "skills": [
    {
      "skill": "Quality Assurance",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 2
    },
    {
      "skill": "Process Improvement",
      "experience": 2
    },
    {
      "skill": "Reporting",
      "experience": 2
    },
    {
      "skill": "Compliance",
      "experience": 2
    },
    {
      "skill": "Training and Development",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 75,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Vocational training or College degree in a relevant field"
    }
  ]
}