{
  "meta": [
    {
      "job_title": "Human Resources Specialist 3 (Payroll/Time and Attendance Processing)",
      "job_category": "HR",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Payroll Processing",
      "experience": 8
    },
    {
      "skill": "Time and Attendance Management",
      "experience": 8
    },
    {
      "skill": "Employee Relations",
      "experience": 8
    },
    {
      "skill": "HR Compliance",
      "experience": 8
    },
    {
      "skill": "HR Information Systems",
      "experience": 8
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Validate and reconcile leave, including donated, restored, military, court, annual, sick, and other leave."
    },
    {
      "duty": "Validate requests for compensatory time pay out for Fair Labor Standards Act (FLSA) exempt Federal employees."
    },
    {
      "duty": "Validate and correct adjustments resulting from what was paid versus what should have been paid."
    },
    {
      "duty": "Initiate corrective action for rejected direct deposit information."
    },
    {
      "duty": "Provide general information services to employees and act as liaison between employees, the NASA Centers, and DOI for replacement Electronic Funds Transfer (EFT) and check payments, Equal Employment Opportunity (EEO) and negotiated settlements, salary garnishments, and legal requests for Payroll documentation."
    },
    {
      "duty": "Complete settlement agreement requests, coordinating with other agencies or program areas within the established timeframe."
    },
    {
      "duty": "Conduct audit reviews and validations of information contained in employees’ payroll files, and audit materials."
    },
    {
      "duty": "Scan employees pay record documentation for on-line retrieval; andInitiate NASA employee’s overseas attributes in FPPS, periodically update and return.NASA employee’s attributes back to a U.S. payroll standard."
    },
    {
      "duty": "Validate that the information has been accepted and will be processed by DOI. Inform NASA of the status of bi-weekly time and attendance processing prior to the deadline for receipt by DOI."
    },
    {
      "duty": "Notify employees of early timecard submission or other unique circumstances; andGenerate, maintain, validate, and distribute time and attendance reports."
    },
    {
      "duty": "Process biweekly lift for NASA employees."
    },
    {
      "duty": "Process prior pay period adjustments for bi-weekly processing; andConduct debt validations."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma is required."
    }
  ]
}