{
  "meta": [
    {
      "job_title": "Retail Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Primarily responsible for freight processing and merchandising functions within the store and is accountable for merchandising and storeroom organization standards. Leads, directs, and at times, actively participates in various aspects of the merchandising process, including freight prep, truck unload, stocking, re-lays, financial management, and inventory control. When serving as Manager on Duty, leads and provides direction to store associates performing all cashiering, customer service, recovery, and furniture-related activities on the sales floor. Works collaboratively with store leadership to drive overall store performance. Leads and directs activities related to truck unload, freight flow, backroom organization, ticketing merchandise, stocking shelves, and reconciliation of inventory transactions according to operational and merchandising standards. Leads and supervises the freight team. Establishes plans to accomplish merchandising initiatives and achieve defined goals. Utilizes company tools, reports, and feedback to effectively analyze trends and refine plans. Ensures that the appearance of the store’s interior and exterior are maintained to standards, primarily regarding merchandise presentation and signage. Ensures that price changes and signage are correctly reflected on sales floor. Participates in the interviewing, selection, hiring, and training of associates in collaboration with store leadership. May complete performance evaluations as directed. Administers appropriate disciplinary action to associates, including recommendations for termination, in partnership with the store leadership and in accordance with company guidelines. Assists with store scheduling and payroll processes on a daily and weekly basis. Serves in the Manager on Duty role as needed including opening and closing the store. When serving in this role, provides leadership and direction to floor associates and ensures that store, merchandising, and customer service standards are continuously met, including merchandise presentation, signage, recovery, and cleanliness. Drives the customer experience and ensures resolution of customer issues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, GED, or equivalent work experience required. Must be 18 years of age. Minimum three years retail management experience preferred. Strong organizational, communication, leadership, presentation, and interpersonal skills required. Strong decision-making and problem resolution skills required. Ability to lift, carry, push, and pull a minimum of 50 pounds required. Ability to unload freight, to move product on and off store shelves, to walk, stand, bend, stoop, or kneel for long periods of time, and to move freely throughout store on a continual basis required. Availability to work a variable schedule of at least 40 to 45 hours per week, including nights, weekends, and holidays required. Ability to travel between stores with some overnight stays required. Demonstrated visual merchandising skills required. Basic English literacy, math, and PC skills required."
    }
  ]
}