{
  "meta": [
    {
      "job_title": "SAP S/4HANA Data Design Lead - Order & Distribution to Cash",
      "job_category": "Information Technology",
      "job_class": "Lead",
      "sector": "Software Engineering",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "S/4HANA Data Design",
      "experience": 8
    },
    {
      "skill": "SAP ECC Data Migration",
      "experience": 8
    },
    {
      "skill": "Data Governance",
      "experience": 8
    },
    {
      "skill": "Data Quality Management",
      "experience": 8
    },
    {
      "skill": "SAP Module Knowledge",
      "experience": 8
    },
    {
      "skill": "Global Enterprise Data Standards",
      "experience": 8
    },
    {
      "skill": "Business Process Design",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Project Leadership",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate on all business data requirements within the S/4 HANA design process."
    },
    {
      "duty": "Define and document the S/4 Enterprise Data Standards and ensure that existing SAP ECC data is fit for purpose at the point of migration to S/4 HANA."
    },
    {
      "duty": "Drive out the data designs for all relevant data objects and customizations in the O&DTC space."
    },
    {
      "duty": "Lead the definition, documentation, and implementation of S/4 Enterprise Data standards related to the Material Master, including master data, reference data, and metadata."
    },
    {
      "duty": "Assist in the development of the S/4 Data Quality Strategy and secure its execution through the steering and agreeing the data quality approach for data within O&DTC EPO area enabling simplified migration, interim state, and the ongoing management of data to ensure that it remains fit for purpose post deployment."
    },
    {
      "duty": "Provide support to project data migration processes, including the coordination of pre and post load business sign off."
    },
    {
      "duty": "Assist the S/4 Data Governance team in the creation of effective global procedures to ensure that each data asset is governed throughout its lifecycle."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Qualified Accountant with significant experience and subject matter expertise in Order & Distribution to Cash (O&DTC) processes and related data concepts."
    },
    {
      "credential": "Demonstrable SAP working knowledge across transactions and reporting in an SAP environment."
    },
    {
      "credential": "Experience of Business/IT partnering for the implementation of Data Governance-related solutions."
    },
    {
      "credential": "Demonstrated ability to lead in a diverse, global team, within and across functions. Experience with global working and across cultures."
    }
  ]
}