{
  "meta": [
    {
      "job_title": "Surgical Specialty-Operative",
      "job_category": "Healthcare",
      "job_class": "Surgical Provider",
      "sector": "Healthcare",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care Assessment",
      "experience": 5
    },
    {
      "skill": "Prescriptive Authority",
      "experience": 5
    },
    {
      "skill": "Medical Treatment Planning",
      "experience": 5
    },
    {
      "skill": "Counseling and Patient Education",
      "experience": 5
    },
    {
      "skill": "Diagnostic Test Evaluation",
      "experience": 5
    },
    {
      "skill": "Invasive Procedures",
      "experience": 5
    },
    {
      "skill": "Post-operative Care",
      "experience": 5
    },
    {
      "skill": "Perioperative Patient Management",
      "experience": 5
    },
    {
      "skill": "Emergency Patient Care",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assess the physical and mental condition of patients through comprehensive physical examinations and medical histories."
    },
    {
      "duty": "Order, collect, interpret, and evaluate laboratory and diagnostic tests for patient assessment and healthcare needs."
    },
    {
      "duty": "Prescribe, recommend, or employ medical drug therapies and perform indicated procedures in accordance with approved policies."
    },
    {
      "duty": "Formulate and implement comprehensive patient treatment plans based on assessments, evidence-based medicine, and professional practice guidelines."
    },
    {
      "duty": "Counsel patients and families regarding medical processes, health management, medication, and health promotion."
    },
    {
      "duty": "Maintain appropriate records of patient treatment plans and outcomes."
    },
    {
      "duty": "Provide consultation level services for conditions related to the Provider's specialty and level of training."
    },
    {
      "duty": "Manage patients in healthcare settings other than primary clinic setting."
    },
    {
      "duty": "Perform invasive procedures specific to scope of practice and level of competency."
    },
    {
      "duty": "Follow-up with patients pre- and post-operatively, and may round on patients in the hospital or see patients in the Emergency Department."
    },
    {
      "duty": "Participate in all phases of perioperative patient management including outpatient, inpatient, and operating room settings."
    },
    {
      "duty": "Perform patient care duties beyond regular schedule based on coverage needs of the department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160
    },
    {
      "student_teacher": 40
    },
    {
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an Accredited Physician Assistant Program"
    },
    {
      "credential": "Current license to practice as a Physician Assistant in the state of Texas"
    },
    {
      "credential": "Basic Life Support (BLS) certification within 30 days of hire or transfer"
    },
    {
      "credential": "National Commission on Certification of Physician Assistant (NCCPA) certification"
    }
  ]
}