{
  "meta": [
    {
      "job_title": "Weekend Nursing Supervisor",
      "job_category": "Nursing",
      "job_class": "Supervisor",
      "sector": "Healthcare",
      "salary": 70000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide quality nursing care to residents and supervise the day-to-day activities of nursing assistants in accordance with federal, state, & local laws and policies of this organization."
    },
    {
      "duty": "Ensure all nursing personnel assigned to you comply with written policies and procedures established by this organization."
    },
    {
      "duty": "Assure the implementation of resident care plans."
    },
    {
      "duty": "Conduct assessments and care plans appropriate for residents admitted to the facility."
    },
    {
      "duty": "Communicate pertinent information and interpret facility policies to residents, staff, families, and visitors."
    },
    {
      "duty": "Keep DON informed of information of any changes in resident condition."
    },
    {
      "duty": "Review investigate and document properly all incidents/accidents."
    },
    {
      "duty": "Evaluate emergency situations and take appropriate action."
    },
    {
      "duty": "Admit, transfer, and discharge residents as required."
    },
    {
      "duty": "Perform administrative duties such as completing medical forms, reports, evaluations, charting, etc., as necessary."
    },
    {
      "duty": "Complete and file required record-keeping forms/charts upon the resident’s admission, transfer, and discharge."
    },
    {
      "duty": "Receive and record phone orders from physicians."
    },
    {
      "duty": "Prepare and administer medications as ordered by the physician."
    },
    {
      "duty": "Ensure adequate medications, supplies, and equipment are available."
    },
    {
      "duty": "Perform all job responsibilities in accordance with safety and infection control policies and procedures, including thorough hand washing, use of disposable gloves where indicated and proper disposal of soiled materials."
    },
    {
      "duty": "Conduct all responsibilities in a manner that exhibits the organization's mission, vision, and core values."
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of accredited nursing program"
    },
    {
      "credential": "Current Massachusetts nursing license as an RN"
    },
    {
      "credential": "CPR/BLS/AED and IV certification required"
    }
  ]
}