{
  "meta": [
    {
      "job_title": "Revenue Cycle Systems Analyst",
      "job_category": "Systems Analysis",
      "job_class": "Analyst",
      "sector": "Healthcare",
      "salary": 79500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Business Process Evaluation",
      "experience": 4
    },
    {
      "skill": "CRM Tools",
      "experience": 3
    },
    {
      "skill": "Financial Systems",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Research Skills",
      "experience": 4
    },
    {
      "skill": "Technical Acumen",
      "experience": 4
    },
    {
      "skill": "Problem-Solving",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluating business processes as they relate to revenue and billing cycles, anticipating requirements, uncovering areas for improvement, and developing and implementing solutions."
    },
    {
      "duty": "Striving to understand the needs and use cases of the revenue cycle for all GHX products."
    },
    {
      "duty": "Partnering with Product and Development teams to apply proper revenue and billing rules to product SKU’s."
    },
    {
      "duty": "Acting as a liaison between accounting and business groups such as Product Management, Contract Operations, and Sales Operations to ensure accuracy and streamlined efficiencies across the commercial process."
    },
    {
      "duty": "Maintaining knowledge of CPQ software and how system records are processed and working closely with Corporate Systems to identify and solution issues within CPQ and Accounting software."
    },
    {
      "duty": "Monitoring revenue records and ensuring proper revenue recognition under the guidance of the Revenue Manager."
    },
    {
      "duty": "Analyzing system records to help identify continuous improvement efforts within GHX system processes, product SKU’s and new product implementation/integration."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of the Arts or Bachelor of Science, or a combination of education and related work experience"
    }
  ]
}