{
  "meta": [
    {
      "job_title": "Recruiter",
      "job_category": "HR",
      "job_class": "Recruiter",
      "sector": "Human Resources",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Recruiting",
      "experience": 5
    },
    {
      "skill": "Sourcing",
      "experience": 5
    },
    {
      "skill": "HR Policies",
      "experience": 5
    },
    {
      "skill": "Interviewing",
      "experience": 5
    },
    {
      "skill": "Applicant Tracking System",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Finalize job specifications and create requisitions for entry-level regular, full/part-time, and temporary positions."
    },
    {
      "duty": "Screen resumes/applications, interview candidates, and administer pre-employment tests."
    },
    {
      "duty": "Attend job fairs and visit local colleges to solicit applicants/provide information on the company."
    },
    {
      "duty": "Collaborate with hiring managers to review job descriptions, experience requirements, and sources for open positions."
    },
    {
      "duty": "Attract candidates using various sources, and present a compelling employment value proposition and realistic job preview."
    },
    {
      "duty": "Conduct legally compliant, behavior-based interviews, administer pre-employment tests, and coordinate interview schedules for successful candidates with hiring managers."
    },
    {
      "duty": "Advise hiring managers on starting salaries, extend offers of employment, and prepare/sent offer letters or letters indicating no interest."
    },
    {
      "duty": "Enter staffing-related information into HR systems, prepare periodic and ad hoc reports on staffing activities, and reconcile various invoices related to recruitment."
    },
    {
      "duty": "Keep abreast of and comply with company policies/procedures/guidelines/laws/regulations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum two-year college degree, Minimum of 2 years recruiting and sourcing experience, or related experience in a Human Resources department."
    },
    {
      "credential": "Knowledge of HR principals/practices/policies/systems and related laws/regulations/reporting requirements, recruiting/interviewing techniques, Microsoft Word, Excel, PowerPoint, and applicant tracking system."
    },
    {
      "credential": "Strong oral/written communication, interpersonal, presentation, mathematics skills, detail orientation, and the ability to interact effectively with all levels of management and staff."
    }
  ]
}