{
  "meta": [
    {
      "job_title": "Revenue Cycle Claims Specialist",
      "job_category": "Finance",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medical Billing",
      "experience": 5
    },
    {
      "skill": "Insurance Collections",
      "experience": 5
    },
    {
      "skill": "Prior Authorization",
      "experience": 5
    },
    {
      "skill": "Claims and Appeals",
      "experience": 5
    },
    {
      "skill": "CPT/HCPCS",
      "experience": 5
    },
    {
      "skill": "ICD-10",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Medical Terminology",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as a source of knowledge for the designated revenue cycle function and perform analysis, identify trends, and prioritize initiatives for performance improvement."
    },
    {
      "duty": "Responsible for developing appropriate workflows and tracking for the designated revenue cycle function and establish an ongoing working relationship with other departments impacting revenue cycle performance."
    },
    {
      "duty": "Work closely with various vendor operations teams to oversee operations activity that directly impacts the revenue cycle to accurately process actions in a timely manner for optimal reimbursement."
    },
    {
      "duty": "Lead weekly meetings to review key metrics, workflows, trends, and performance improvement opportunities."
    },
    {
      "duty": "Develop goals and metrics to link department and revenue cycle initiatives with the organization's strategy, and act as an educator on performance improvement requirements in operations and methodologies to related teams and departments."
    },
    {
      "duty": "Continuously seek new and creative technologies that help identify and guide improvement opportunities that align with overall company success."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in a Healthcare-related field of study or equivalent experience (Master's preferred)"
    }
  ]
}