{
  "meta": [
    {
      "job_title": "Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 55493,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the care activities and goal achievements of assigned patients by assessing, diagnosing, planning, and intervening in actual or potential health problems and evaluating the patient's response to care."
    },
    {
      "duty": "Conducts Nursing assessment based on interview, examination, observation, and review of records of the patient."
    },
    {
      "duty": "Ensures that the patient's progress, or lack of progress, is reflected in progress notes and in the revised care plans."
    },
    {
      "duty": "Discharge planning consistent with the patient's status and reflects inter-departmental and inter-agency communication."
    },
    {
      "duty": "Supports the orientation of new staff members by observing professional behaviors, providing feedback to the staff member and by acting as a preceptor, role model, and a resource person."
    },
    {
      "duty": "Functions as a professional role model and mentor for students and volunteers."
    },
    {
      "duty": "Organization of provision of care to meets priority needs of patients and unit."
    },
    {
      "duty": "Participates in the development of other staff members."
    },
    {
      "duty": "Reflects a collaborative effort in meeting the needs of the patient and unit through communication and nursing actions."
    },
    {
      "duty": "Provides direction, assistance, and support."
    },
    {
      "duty": "Identifies and communicates to the immediate supervisor the need for further staff education."
    },
    {
      "duty": "Seeks and utilizes nursing leaders as role models and resource persons."
    },
    {
      "duty": "Reflects collaborative effort in meeting patient and unit needs by communication with other disciplines."
    },
    {
      "duty": "Reflects the philosophy, goals, and objectives of the Department of Nursing and the Hospital Center in communication and interaction with families and other groups."
    }
  ],
  "skills": [
    {
      "skill": "Nursing Assessment",
      "experience": 5
    },
    {
      "skill": "Discharge Planning",
      "experience": 5
    },
    {
      "skill": "Patient Care Assignment",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    },
    {
      "skill": "Care Coordination",
      "experience": 5
    },
    {
      "skill": "Professional Development",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Education",
      "experience": 5
    },
    {
      "skill": "Patient Advocacy",
      "experience": 5
    },
    {
      "skill": "Crisis Management",
      "experience": 5
    },
    {
      "skill": "Teamwork",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science with a major in Nursing preferred. Associate's degree in Nursing is considered only with relevant experience and/or active matriculation in a BSN Program if approved by Chief Nursing Officer or designee."
    },
    {
      "credential": "Licensed as a registered nurse with current registration in New York State."
    },
    {
      "credential": "BCLS, ACLS, and PALS from AHA required."
    },
    {
      "credential": "CAPA – preferred"
    }
  ]
}