{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Clinical",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Telehealth",
      "experience": 3
    },
    {
      "skill": "Patient Triage",
      "experience": 3
    },
    {
      "skill": "Clinical Operations",
      "experience": 3
    },
    {
      "skill": "EMR Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Workflow Management",
      "experience": 3
    },
    {
      "skill": "Point of Care Testing",
      "experience": 3
    },
    {
      "skill": "Healthcare Compliance",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide high quality and convenient care to patients in McLaren Care Now retail health settings using a Telehealth format."
    },
    {
      "duty": "Lead the workflow in performing wellness exams and treating minor illnesses, from patient check-in to discharge, in collaboration with an Advanced Practice Provider (APP)."
    },
    {
      "duty": "Open and close the clinic each day, maintaining daily operations of Point of Care (POC) testing systems."
    },
    {
      "duty": "Greet customers, assist in entering PHI into the Convenience stand, and escort patients to the Console area, identifying chief complaint and entering information into NextGen."
    },
    {
      "duty": "Perform vital signs and POC tests per policy, triage patients based on chief complaint, vital signs, and symptoms, and provide discharge instructions and follow-up care information to patients."
    },
    {
      "duty": "Promote McLaren Care Now clinics, answer customer questions and inquiries, answer phones, and provide responses to questions."
    },
    {
      "duty": "Follow up on test results, provide abnormal findings to APP attention, collect and process patient payments, assist patients in identifying a Primary Care Provider (PCP), and develop close working relations with Walgreen’s Pharmacy and staff."
    },
    {
      "duty": "Perform other related responsibilities as necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 90,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an accredited school of nursing with a current license to practice as a Registered Nurse in the State of Michigan. Minimum of two years of med/surg, critical care, or demonstrated experience in a specialty area."
    },
    {
      "credential": "Preferably, two years hospital experience in ICU or ER, as well as experience in a retail-based clinic."
    }
  ]
}