{
  "meta": [
    {
      "job_title": "Sr Director Facilities Construction",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Engineering",
      "salary": 125000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides civil, structural, electrical and mechanical engineering support for DART Facilities and Systems."
    },
    {
      "duty": "Assists in managing facilities, passenger amenities, and systems operational design assessments, construction contracts and other projects in coordination with other DART departments, government entities, consultants, and other related parties."
    },
    {
      "duty": "Manages moderately complex facilities engineering projects for DARTs Technical Services Division."
    },
    {
      "duty": "Relies on limited experience and judgment to plan and accomplish goals."
    },
    {
      "duty": "Assists and supports making system/process/procedural recommendations based on review, research and analysis."
    },
    {
      "duty": "Updates technical specifications and statements of work (SOW)."
    },
    {
      "duty": "Provides support performing material data analysis to improve asset availability."
    },
    {
      "duty": "Assists in the development of product upgrades through the configuration management program and qualified products list (QPL)."
    },
    {
      "duty": "Assists in developing improvements to established safety and maintenance programs using the configuration management processes."
    },
    {
      "duty": "Oversees and reviews studies necessary to resolve issues surrounding quality, reliability, maintainability, safety, and equipment or system performance."
    },
    {
      "duty": "Participates in and/or submits engineering modifications test criteria, plans and procedures."
    },
    {
      "duty": "Reviews federal, state and local laws and engineering/technical guidelines affecting DART maintenance and operations."
    },
    {
      "duty": "Develops and approves programs necessary to address engineering needs."
    },
    {
      "duty": "Acts as a resource to and a liaison between division and other DART departments and external stakeholders regarding engineering technical support and related issues."
    },
    {
      "duty": "Assists in development of and monitors project budgets and prepares budgetary cost estimates."
    },
    {
      "duty": "Acts as DART representative for coordination, quality assurance and monitoring of construction projects."
    },
    {
      "duty": "Performs other related duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Civil Engineering",
      "experience": 10
    },
    {
      "skill": "Structural Engineering",
      "experience": 10
    },
    {
      "skill": "Electrical Engineering",
      "experience": 10
    },
    {
      "skill": "Mechanical Engineering",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Construction Management",
      "experience": 8
    },
    {
      "skill": "Budget Development",
      "experience": 8
    },
    {
      "skill": "Technical Analysis",
      "experience": 8
    },
    {
      "skill": "Stakeholder Management",
      "experience": 8
    },
    {
      "skill": "Quality Assurance",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 100,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Mechanical, Electrical, Civil Engineering, Construction Management or related field. (Master's preferred)"
    }
  ]
}