{
  "meta": [
    {
      "job_title": "Vehicle Inspection Specialist",
      "job_category": "Automotive",
      "job_class": "Specialist",
      "sector": "Logistics",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Automotive Field Experience",
      "experience": 2
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "CRM Tools",
      "experience": 2
    },
    {
      "skill": "Web-based Applications",
      "experience": 2
    },
    {
      "skill": "Automotive Inspection Tools",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct vehicle inspections at various locations including dealerships, auctions, and consumer residences, and complete detailed vehicle condition inspections and related reporting."
    },
    {
      "duty": "Identify and assess vehicle structural damage, frame condition, and alignment of body panels, as well as detect missing parts and mechanical problems."
    },
    {
      "duty": "List inspected vehicles on the ACV Auctions platform for bidding and purchasing, and interface regularly with customers to develop strong relationships and ensure customer satisfaction."
    },
    {
      "duty": "Collaborate with Territory Management and Business Development to educate and share information on all ACV available products and services, and stay informed with information regarding the ACV products, service improvements, and market conditions."
    },
    {
      "duty": "Sign up independent dealerships as buyers to utilize ACV Auctions digital platform."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Valid driver's license and working knowledge of CRM Tools and web-based applications. Preferable to have 1 - 3 years of experience in the automotive field with a customer service background."
    }
  ]
}