{
  "meta": [
    {
      "job_title": "Client Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Generating revenue opportunities by developing solutions for clients using creativity and the available tools."
    },
    {
      "duty": "Selling Professional Services to US Public Sector accounts that include state and local governments, higher education institutions, federal government agencies, and installations."
    },
    {
      "duty": "Creating a pipeline of opportunities to generate bookings meeting quarterly budget expectations."
    },
    {
      "duty": "Negotiating project deliverables/schedules / costing for services."
    },
    {
      "duty": "Regular and timely updating of opportunity status in our CRM system (Salesforce.com)"
    },
    {
      "duty": "Working with the sales team to generate revenue within existing accounts by proposing the full range of solution realization, enhancement, and operational services including updates, upgrades, customization to existing clients."
    },
    {
      "duty": "Ensuring timely delivery and management of resource forecasting, opportunity forecasting, proposal/SOW writing and achieving required approvals, contract and invoicing status using appropriate tools available."
    },
    {
      "duty": "Understanding revenue forecasting and be able to report accurately on Quarterly revenue and bookings to Regional Vice-President."
    },
    {
      "duty": "Providing leadership in promoting, identifying, recommending, and implementing improvements to any processes."
    },
    {
      "duty": "Managing as required the Professional Services team in writing responses to RFP’s, identifying and tracking opportunities including the participation in Business Development synergy meetings to ensure client account activities are communicated internally to other Open Text stakeholders."
    },
    {
      "duty": "Dealing with Customer Sr. Management and C-Level executives."
    }
  ],
  "skills": [
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Professional Services Sales",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "CRM Management",
      "experience": 5
    },
    {
      "skill": "Revenue Forecasting",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "University Degree or College Diploma and/or relevant IM/IT experience (5+ years) or equivalent."
    },
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}