{
  "meta": [
    {
      "job_title": "Human Resources Business Partner",
      "job_category": "Human Resources",
      "job_class": "Business Partner",
      "sector": "Human Resources",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HR Generalist",
      "experience": 3
    },
    {
      "skill": "Workday",
      "experience": 3
    },
    {
      "skill": "Conflict Management",
      "experience": 3
    },
    {
      "skill": "Employee Relations",
      "experience": 3
    },
    {
      "skill": "Talent Acquisition",
      "experience": 3
    },
    {
      "skill": "Performance Management",
      "experience": 3
    },
    {
      "skill": "Organizational Development",
      "experience": 3
    },
    {
      "skill": "Training",
      "experience": 3
    },
    {
      "skill": "Data Analysis (HR)",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as a consultant to management on all people-related issues and act as an employee champion and change agent for the organization."
    },
    {
      "duty": "Develop integrated HR solutions and partnerships across the organization to create an employee experience that meets the needs of team members and delivers productivity."
    },
    {
      "duty": "Partner with onsite recruiter to ensure the attraction and selection of top talent for the business."
    },
    {
      "duty": "Deliver HR insights, solutions, support, advice, and coaching to managers, supervisors, and employees on HR related matters."
    },
    {
      "duty": "Maintain a high level of employee engagement, amplify productivity, and maximize employee retention through collaboration with management and employees."
    },
    {
      "duty": "Offer day-to-day performance management guidance to management encompassing coaching, career progression, and corrective performance actions."
    },
    {
      "duty": "Ensure consistent administration of HR policies and practices, conduct exit interviews, analyze data, and make suggestions to reduce turnover and increase employee engagement."
    },
    {
      "duty": "Champion diversity, equity, inclusion, and belonging programs, training, and site events."
    },
    {
      "duty": "Develop and implement HR initiatives – process and employee practice improvement, training, metrics/trends, and analysis."
    },
    {
      "duty": "Ensure the accuracy of employee data in all systems and maintain employee files."
    },
    {
      "duty": "Partner with EHS team to create a culture of safety and sustainability."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 75,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or equivalent experience required, Master’s preferred"
    }
  ]
}