{
  "meta": [
    {
      "job_title": "Sr. Program Manager",
      "job_category": "Program Management",
      "job_class": "Senior",
      "sector": "Management",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "M&A Integration",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Quantitative Skills",
      "experience": 5
    },
    {
      "skill": "MS Office (PowerPoint and Excel)",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead cross-functional, high-impact projects and provide analytical support as directed by the Director and VP of Corporate Development."
    },
    {
      "duty": "Work with and coordinate among functional executives on cross-company projects."
    },
    {
      "duty": "Act as a consultant and owner on various strategic initiatives, providing critical project management support and executive level visibility and prioritization."
    },
    {
      "duty": "Implement, coordinate, and measure initiative outcomes, KPIs and improvement initiatives across all functional areas."
    },
    {
      "duty": "Manage and complete the successful implementation of strategic initiatives that enable revenue growth and accelerate company profitability and efficiency."
    },
    {
      "duty": "Partner with various VP and EVP sponsors of specific initiatives."
    },
    {
      "duty": "Lead summits or scoping sessions to clarify initiatives, mission, commitments, and working teams."
    },
    {
      "duty": "Lead initiatives by identifying and resolving impediments."
    },
    {
      "duty": "Lead regular Program ROB’s that identify insights and translate into actions."
    },
    {
      "duty": "Lead annual initiative planning efforts that translate objectives into clear strategies, actions and resource commitments."
    },
    {
      "duty": "Track and follow-up on top actions from ROB’s."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "5+ years of experience in operations, strategy, or product (e.g., change management, M&A integration, engineering program management, product, etc.), with 2+ years of top-tier or boutique management consulting experience preferred (e.g., McKinsey, Bain, BCG, Deloitte, Accenture, PwC, boutique consulting firms, etc.); MBA preferred but not required"
    }
  ]
}