{
  "meta": [
    {
      "job_title": "IAS Supervisor",
      "job_category": "Management",
      "job_class": "Supervisor",
      "sector": "Management",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinates team activities and balances workload (e.g., scheduling, shift management, other administrative duties)."
    },
    {
      "duty": "Works to continually improve policies, procedures and processes; tracks trending of issues and formulates recommendations for management to address recurring issues."
    },
    {
      "duty": "Documents, maintains and enhances work processes and standards in the area, including documenting procedures for troubleshooting and incident resolution / solution."
    },
    {
      "duty": "Responsible for the development of more junior team members; monitors team performance, spotting trends and identifying anomalies for escalation."
    },
    {
      "duty": "Ensures compliance with relevant policies and regulations, and escalates any concerns as appropriate."
    },
    {
      "duty": "Reviews team member performance, including preparing or delivering performance reviews. Provides feedback for performance related matters and coaches team members on performance."
    },
    {
      "duty": "Participates as a key contributor in the recruiting and hiring process."
    },
    {
      "duty": "Coordinates and engages the appropriate level of expertise on issues that involve other functions."
    },
    {
      "duty": "Monitors the environment, especially during peak periods, and manages the resolution of any incidents."
    },
    {
      "duty": "Is the first point of supervision for the team and is accountable for providing direction and guidance on team objectives."
    },
    {
      "duty": "Understand and comply with bank policy, laws, regulations, and the bank's BSA/AML Program, as applicable to your job duties."
    },
    {
      "duty": "Supports and upholds the Arvest Mission Statement."
    },
    {
      "duty": "Upholds the Arvest Code of Ethics and ensures that confidential information is safeguarded."
    },
    {
      "duty": "Maintains a high level of cooperation and rapport with all associates in order to ensure accurate and efficient operations and service."
    },
    {
      "duty": "Formulates and communicates new ideas and suggestions that will improve profitability and efficiency for the company’s overall operation."
    },
    {
      "duty": "Foster and promote the proper company image at all times."
    },
    {
      "duty": "Directly supervises 2 or more associates as assigned by the Manager. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws."
    },
    {
      "duty": "Ensure direct reports have completed required compliance training and are adhering to all internal procedures and controls as it relates to bank policy, laws, regulations and Arvest’s BSA/AML Program."
    },
    {
      "duty": "The incumbent provides training, planning, assigning, and directing work assignments and schedules; addressing complaints and resolving problems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate’s Degree in relevant field or equivalent related experience required. 2 years of relevant experience in progressively responsible positions required. Previous supervisory experience preferred."
    }
  ]
}