{
  "meta": [
    {
      "job_title": "Logistics Coordinator",
      "job_category": "Logistics",
      "job_class": "Coordinator",
      "sector": "Logistics",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Transportation Project Management",
      "experience": 5
    },
    {
      "skill": "Risk Analysis",
      "experience": 5
    },
    {
      "skill": "Policy Knowledge",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Information Technology Management",
      "experience": 5
    },
    {
      "skill": "Logistics Planning",
      "experience": 5
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 5
    },
    {
      "skill": "Air Force Knowledge",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and support Department of Defense (DoD) transportation projects, including analysis, planning, design, development, deployment, operations, and evaluation of highway, rail, transit, freight, aviation, and intermodal systems and services."
    },
    {
      "duty": "Manage projects to improve transportation safety, mobility, environment, and capabilities, finding creative solutions to unique transportation problems."
    },
    {
      "duty": "Mentor and supervise team members in a high tempo, high trust environment, conducting risk analysis and coordinating risk acceptance or waivers from appropriate authorities."
    },
    {
      "duty": "Develop and manage information technology systems and use analytical tools to display the impacts of various capability tradeoffs and impacts to potential alternatives."
    },
    {
      "duty": "Work with VIP or Special Air Mission requirements, perform risk analyses, propose risk mitigations, and have excellent verbal and written communication skills, including technical writing."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 200,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Transportation Management, Engineering, or a related field (Master's preferred)"
    }
  ]
}