{
  "meta": [
    {
      "job_title": "Survey Project Manager",
      "job_category": "Building and Construction",
      "job_class": "Project Manager",
      "sector": "Engineering",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Surveying",
      "experience": 8
    },
    {
      "skill": "AutoCAD Civil 3D",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Site Planning",
      "experience": 8
    },
    {
      "skill": "Mentoring",
      "experience": 7
    },
    {
      "skill": "ALTA Surveys",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate and lead a team responsible for drafting, reviewing, and finalizing preliminary and final site plans and construction documents."
    },
    {
      "duty": "Review project survey data utilizing the latest technology and industry software."
    },
    {
      "duty": "Plan, organize and supervise survey crews, technicians, and office staff members."
    },
    {
      "duty": "Provide oversight on large scale ALTA surveys as they pertain to solar or wind power generation preferred."
    },
    {
      "duty": "Utilize AutoCAD Civil 3D and related engineering software packages to complete assignments on time and within prescribed standards and budgets."
    },
    {
      "duty": "Attend paid training and development events, industry conferences, and networking opportunities."
    },
    {
      "duty": "Assist with staff's new hire training plan, career planning, and continuous professional development at Atwell."
    },
    {
      "duty": "Reward and motivate staff with spot bonuses and Peer Recognition Rewards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Professional Survey License, or the ability to obtain\n8+ plus years of survey industry related work experience\nAbility to coach, mentor, and develop a growing team\nPrior experience working with Trimble Business Center and AutoCAD Civil 3D preferred\nThe ideal Project Manager will have advanced understanding of; Boundary Surveys, ALTA Surveys, Contruction Staking, Leveling, Traversing, GPS, Data Collections, Legal Descriptions, Plan interpretations, along with Real Estate Documents."
    }
  ]
}