{
  "meta": [
    {
      "job_title": "Healthcare Regional Operations Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 125000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Operations",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "P&L Management",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Influence",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Sustain and grow the radiology imaging business through education and relationship-building with physicians, patients, and peers across the region."
    },
    {
      "duty": "Lead short-term and long-range planning and business development activities in collaboration with regional and partner company leadership."
    },
    {
      "duty": "Manage the P&L, perform budget reviews, and develop action plans to address variances."
    },
    {
      "duty": "Identify growth plan development and stand-up of De Novo centers, and manage book of business by forecasting budgets and identifying trends that impact the overall business."
    },
    {
      "duty": "Collaborate with commercial teams to align and implement strategic business goals, and create consistent communication cascades of business activities and successes."
    },
    {
      "duty": "Develop and maintain partnerships with centralized services to streamline operations, and build and maintain relationships with referring physicians and joint venture partnerships."
    },
    {
      "duty": "Develop, mentor, and coach center managers, build relationships with the team, and foster a positive culture."
    },
    {
      "duty": "Lead training sessions for center teams, build formal development and succession plans, oversee talent pipeline, and lead regular team meetings and employee one-on-ones."
    },
    {
      "duty": "Lead, initiate, and participate in annual performance evaluations, development, and performance management of associates, and support employees to ensure the highest level of patient satisfaction."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience in Healthcare Management, Business Administration, or related field (Master's preferred)"
    }
  ]
}