{
  "meta": [
    {
      "job_title": "Inventory Controller",
      "job_category": "Supply Chain",
      "job_class": "Controller",
      "sector": "Supply Chain",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Enterprise Resource Planning Tools",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Procurement",
      "experience": 2
    },
    {
      "skill": "KPI Analysis",
      "experience": 2
    },
    {
      "skill": "Financial Skills",
      "experience": 2
    },
    {
      "skill": "Language Proficiency (English, Spanish)",
      "experience": 2
    },
    {
      "skill": "Continuous Improvement",
      "experience": 2
    },
    {
      "skill": "Lean Six Sigma",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as key user and on-site trainer for all enterprise work order processing applications such as Unify, Maximo, Click mobile, and interface with Power Operations Work preparation authorities."
    },
    {
      "duty": "Analyze and interpret operational data points concerning time booking and operational efficiency, and provide those to the plant manager and ops coordinator."
    },
    {
      "duty": "Maintain training and purchasing/spending records, keep current and log those in a central space in the Power Operations SharePoint system."
    },
    {
      "duty": "Coordinate and complete annual inventories, monthly reporting, and key user activities."
    },
    {
      "duty": "Assure compliance with record-keeping (OSHA logs, calibration certificates, etc.), monitor training due dates, handle PPE, tool, and rigging recertification and calibration."
    },
    {
      "duty": "Manage, improve, and supervise the local shop and warehouse spaces to adhere to quality and safety standards."
    },
    {
      "duty": "Support Ops Coordinators and PM in the procurement process for direct and indirect services and spare parts by following Enbridge’s processes and interface with Power Operations Supply Chain authority."
    },
    {
      "duty": "Support in rolling out a central supply chain for consumables, tools, and equipment."
    },
    {
      "duty": "Support Unit Managers in execution of the action items stemming from audits, Encompass action plans, and continuous improvement efforts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "2+ years’ experience in the wind industry, US preferred, foreign experience is a plus.Extensive knowledge in Enterprise Resource Planning Tools (Click, MAXIMO, ORACLE etc.) with focus on inventory and work order management.Basic financial skills relevant to ordering and procuring services and goods.KPI driven, pro-active and self-driven work ethics.Proficient in English, Spanish is a bonus.Strong follow-up skills (plan do check act)Experience in either continuous improvement, 5S, lean six sigma is an asset."
    }
  ]
}