{
  "meta": [
    {
      "job_title": "Director, Data Strategy",
      "job_category": "Data Strategy",
      "job_class": "Director",
      "sector": "Retail and Commerce",
      "salary": 185000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Strategy",
      "experience": 8
    },
    {
      "skill": "Data Feasibility Assessment",
      "experience": 8
    },
    {
      "skill": "Product Development",
      "experience": 8
    },
    {
      "skill": "Data Design",
      "experience": 8
    },
    {
      "skill": "Data Governance",
      "experience": 8
    },
    {
      "skill": "Data Literacy",
      "experience": 8
    },
    {
      "skill": "Communication",
      "experience": 8
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop data requirements for new product developments and complete thorough design reviews to ensure the use of data and analytics can deliver the required product performance, manages risk, and enables reuse of data across the organization."
    },
    {
      "duty": "Assess data feasibility and the potential differentiation for new product propositions or proofs of concept."
    },
    {
      "duty": "Provide guidance to product and engineering teams based on data availability and requirements."
    },
    {
      "duty": "Identify the data dependencies and synergies across products, segments, lines of business, and third-party data sources."
    },
    {
      "duty": "Maintain a strong understanding of the external data landscape including the data and analytics different customer groups collect and perform, and where the organization's data and services can create additional value."
    },
    {
      "duty": "Develop plans and roadmaps to guide how the organization can build out the required scale of data assets and capabilities, including data rights, to deliver products and manage the regional and global data dependencies."
    },
    {
      "duty": "Develop educational material and train, as needed, on data usage and data literacy."
    },
    {
      "duty": "Define required changes to standards, processes, and systems with data governance, data platforms, and technology teams."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100
    },
    {
      "student_teacher": 70
    },
    {
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in science, mathematical, engineering, or technology or equivalent experience. Master's degree preferred."
    }
  ]
}