{
  "meta": [
    {
      "job_title": "ICU RN",
      "job_category": "Healthcare",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Assessment and Diagnosis",
      "experience": 5
    },
    {
      "skill": "Nursing Care Planning",
      "experience": 5
    },
    {
      "skill": "Patient Education",
      "experience": 5
    },
    {
      "skill": "Medication Administration",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Patient Advocacy",
      "experience": 5
    },
    {
      "skill": "Record Keeping",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Obtain comprehensive admission history, perform physical assessment, and demonstrate integrated assessment abilities."
    },
    {
      "duty": "Differentiate variations of normal and abnormal assessment findings, analyze and prioritize abnormal findings, and initiate appropriate response."
    },
    {
      "duty": "Anticipate actual or potential problems or health concerns in the hospital and/or home setting."
    },
    {
      "duty": "Demonstrate ongoing assessment of patient’s psychosocial, physiological, and educational process."
    },
    {
      "duty": "Integrate analysis of diagnostic information in patient assessment and care."
    },
    {
      "duty": "Formulate an individualized plan of care based on standards of care, practice, and hospital/unit policies."
    },
    {
      "duty": "Identify and focus on the physical, emotional, spiritual, cultural, learning, and discharge planning needs of the patient and significant other(s)."
    },
    {
      "duty": "Develop, interpret, and correlate realistic goals and orders to maintain or improve patient health status."
    },
    {
      "duty": "Discuss and disseminate information concerning patient plan of care with members of the interdisciplinary health care team."
    },
    {
      "duty": "Participate in ongoing discharge planning with members of the interdisciplinary health care team."
    },
    {
      "duty": "Document all aspects of the nursing process in a legible, concise, clear, and timely manner utilizing appropriate hospital forms or technology and terminology."
    },
    {
      "duty": "Recognize patient’s readiness to learn, develop and enhance an individualized teaching plan."
    },
    {
      "duty": "Utilize available teaching materials and support groups, etc.; formulate instructional material as needed."
    },
    {
      "duty": "Evaluate patient’s responses to care and comprehension of education, monitor response to intervention and progress towards goals."
    },
    {
      "duty": "Demonstrate sound judgment with the Nursing Process based upon critical thinking skills and a problem-solving approach."
    },
    {
      "duty": "Organize, prioritize, and demonstrate accountability for nursing care, demonstrate sensitivity to strengths and limitations of peers."
    },
    {
      "duty": "Recognize own limitations, seek assistance, and take corrective action as needed."
    },
    {
      "duty": "Perform other related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Nursing (Master's preferred)"
    }
  ]
}