{
  "meta": [
    {
      "job_title": "Principal Consultant/Project Manager, Environmental Compliance and Management Systems",
      "job_category": "Consulting",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Environmental Compliance",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Strategic Planning",
      "experience": 6
    },
    {
      "skill": "Business Development",
      "experience": 6
    },
    {
      "skill": "Client Relationship Management",
      "experience": 6
    },
    {
      "skill": "EHS Compliance",
      "experience": 6
    },
    {
      "skill": "Environmental Management Systems",
      "experience": 6
    },
    {
      "skill": "Technical Proposal Preparation",
      "experience": 6
    },
    {
      "skill": "Litigation Support",
      "experience": 6
    },
    {
      "skill": "Leadership and Mentoring",
      "experience": 6
    },
    {
      "skill": "Cross-Selling",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement strategic business/action plan, provide leadership, and deliver performance results to expand ERM's Sustainable Operations service and client base, with a particular focus on environmental services."
    },
    {
      "duty": "Serve as a key member of the “core” technical team to drive profitable growth across the Environmental Programs service line."
    },
    {
      "duty": "Provide technical assistance on EHS compliance, environmental management system, and due diligence transaction projects."
    },
    {
      "duty": "Provide on-site EHS compliance support at client facilities."
    },
    {
      "duty": "Perform environmental compliance audits and implement follow-up corrective actions to ensure compliance with federal, state, and local regulations."
    },
    {
      "duty": "Implement environmental management systems and programs for corporate clients."
    },
    {
      "duty": "Develop plans, permits, and procedures for air quality, hazardous waste, spill prevention, storm water, and wastewater."
    },
    {
      "duty": "Manage litigation support projects under attorney-client privilege."
    },
    {
      "duty": "Manage multiple projects of moderate to high complexity, within scope/budget/schedule expectations and ensure quality standards on project deliverables."
    },
    {
      "duty": "Prepare technical proposals and participate in business development with existing clients and identified leads."
    },
    {
      "duty": "Maintain client relationships that generate repeat business."
    },
    {
      "duty": "Communicate with clients, ERM employees, and vendors."
    },
    {
      "duty": "Identify and develop new opportunities, prepare effective technical proposals, and take active leadership role in developing new business with new and existing clients."
    },
    {
      "duty": "Develop and expand client relationships that generate repeat business."
    },
    {
      "duty": "Develop and manage innovative, behavior and performance outcome-focused approaches and programs for a variety of clients with complex technical/ regulatory issues."
    },
    {
      "duty": "Design and implement corporate environmental strategies and programs, compliance auditing, environmental management systems, high-impact training, and general compliance support."
    },
    {
      "duty": "Achieve client’s expectations for scope, budget, schedule, and quality."
    },
    {
      "duty": "Lead, manage performance, hire and retain, inspire and mentor personnel for overall success of the Sustainable Operations technical team."
    },
    {
      "duty": "Develop a working understanding of ERM’s other consulting service areas and actively support cross selling these services to existing clients."
    },
    {
      "duty": "Support the general growth and development of ERM’s international Performance & Assurance technical community."
    },
    {
      "duty": "Coordinate with ERM offices in the Americas, Asia-Pacific, and Europe regions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "BS/MS degree preferred. Professional Engineering Certification in field. Prior consulting experience is required."
    }
  ]
}