{
  "meta": [
    {
      "job_title": "Masters' Level Clinician",
      "job_category": "Healthcare",
      "job_class": "Clinical",
      "sector": "Psychosis Research",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Clinical Assessment",
      "experience": 3
    },
    {
      "skill": "Psychoeducation",
      "experience": 3
    },
    {
      "skill": "Data Management",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Healthcare Administration",
      "experience": 3
    },
    {
      "skill": "Psychosis Research",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct CHR-P specialized intakes and screenings; provide feedback and psychoeducation to youth and families as needed."
    },
    {
      "duty": "Complete required ongoing trainings (reliability, etc.) on CHR-P and other diagnostic assessments."
    },
    {
      "duty": "Consent new participants into the study."
    },
    {
      "duty": "Maintain pre-screening and recruitment database and records."
    },
    {
      "duty": "Schedule participants for screening visits."
    },
    {
      "duty": "Create and disseminate advertising components to attract potential participants into study."
    },
    {
      "duty": "Attend ProNET-related meetings (Friday morning availability required)."
    },
    {
      "duty": "Maintains and modifies project plan documentation and staffing requirements for multiple projects."
    },
    {
      "duty": "Schedules and coordinates project team meetings."
    },
    {
      "duty": "Prepares agendas, materials, presentations, and necessary equipment."
    },
    {
      "duty": "Records and distributes minutes or notes and follow-up actions."
    },
    {
      "duty": "Compiles data and prepares regular and ad hoc reports and presentations."
    },
    {
      "duty": "Distributes project reports and documents as directed."
    },
    {
      "duty": "Monitors and tracks project documents and finances."
    },
    {
      "duty": "Maintains project document files and records in accordance with established procedures."
    },
    {
      "duty": "Tracks and reports on project status and progress, identifies and resolves obstacles to ensure that the project is on track with determined timelines."
    },
    {
      "duty": "Acts as a liaison and resource for multidisciplinary team members."
    },
    {
      "duty": "Communicates to client groups and stakeholders and responds to requests for data and information."
    },
    {
      "duty": "Collaborates with the project manager and team to identify and schedule project deliverables, milestones, and outcomes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Masters' Level clinician position. A Master's degree in Psychology or related field is required."
    }
  ]
}