{
  "meta": [
    {
      "job_title": "Strategic Category Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Supply Chain",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages complex multi-year supplier relationships aligned to enable portfolio strategies."
    },
    {
      "duty": "Plans, organizes, directs, controls and communicates all strategic sourcing activities related to assigned commodities and services."
    },
    {
      "duty": "Conducts brainstorming sessions at facilities with cross functional teams to identify strategic opportunities and deployment priorities on cost-saving initiatives."
    },
    {
      "duty": "Collaborates with global and regional supply teams to identify, screen and qualify strategic suppliers. Works with global facilities to align material cost savings funnels with commercial strategies and financial targets."
    },
    {
      "duty": "Drives spend analysis, including countermeasures for projects falling short of plan and makes decisions to remedy the issues."
    },
    {
      "duty": "Develops and delivers strategies that deliver year-over-year cost savings. Proactively assesses internal and external process improvements and influences effective change and drives innovation and continuous improvements."
    },
    {
      "duty": "Collaborates on the preparation of Request for Proposals (RFPs), Request for Quotations (RFQs) and leads the screening and supplier selection process."
    },
    {
      "duty": "Negotiates and drafts supplier contracts of sale, including payment terms, deliveries, price, freight terms, currency exchange, raw material steel fluctuation, inventory levels."
    },
    {
      "duty": "Analyzes market and delivery conditions to determine present and future (industry trends in pricing and availability that will impact the business) material availability, and prepares market analysis reports. Responsible for timely reporting to agree upon KPI’s and presenting Strategic Sourcing plans, activities and progress."
    }
  ],
  "skills": [
    {
      "skill": "Strategic Procurement/Supply Chain",
      "experience": 8
    },
    {
      "skill": "Category Management",
      "experience": 8
    },
    {
      "skill": "Supplier Development",
      "experience": 8
    },
    {
      "skill": "Change Management",
      "experience": 8
    },
    {
      "skill": "Global Sourcing",
      "experience": 8
    },
    {
      "skill": "Manufacturing Processes",
      "experience": 8
    },
    {
      "skill": "Sourcing Strategy Development",
      "experience": 8
    },
    {
      "skill": "Cost Analysis",
      "experience": 8
    },
    {
      "skill": "Market Analysis",
      "experience": 8
    },
    {
      "skill": "Negotiation Skills",
      "experience": 8
    },
    {
      "skill": "Contract Management",
      "experience": 8
    },
    {
      "skill": "Inventory Management",
      "experience": 8
    },
    {
      "skill": "Process Improvement",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BA or BS degree preferably in Supply Chain/Operations Management, minimum in a business/industrial related field."
    }
  ]
}