{
  "meta": [
    {
      "job_title": "Cardiology Leader",
      "job_category": "Healthcare",
      "job_class": "Leader",
      "sector": "Healthcare",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Supervision",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Policy Development",
      "experience": 5
    },
    {
      "skill": "Team Building",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Education Development",
      "experience": 5
    },
    {
      "skill": "Performance Evaluation",
      "experience": 5
    },
    {
      "skill": "Liaison and Communication",
      "experience": 5
    },
    {
      "skill": "Cardiology Expertise",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide overall clinical supervision and leadership for the APP team in cardiology, including work assignments, training, and evaluation in collaboration with physician leadership and practice manager."
    },
    {
      "duty": "Monitor competency, documentation, and outcomes of care given by APP team. Identify quality goals and facilitate learning for other staff to become more effective in their role."
    },
    {
      "duty": "Model appropriate judgment in the follow-up of patient care issues and use of physician, nursing, and administrative chain of command. Develop department level education, policies, and procedures related to patient care."
    },
    {
      "duty": "Actively participate in and lead discussion of quality results, patient feedback, and development of plans to improve quality of care and service. Address patient concerns brought forth by patient family or staff."
    },
    {
      "duty": "Assist with the annual performance evaluations of cardiology APPs and recommend disciplinary measures when necessary. Participate in interviews and hiring of Physician Assistants or Nurse Practitioners."
    },
    {
      "duty": "Act as a liaison with nursing, medical staff, and management. Support both inpatient and outpatient practices and address other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s Degree in Physician Assistant or Nurse Practitioner (APRN) with 5+ years of clinical work experience and 3+ years’ experience in cardiology. CT Advanced Practice Provider license, DEA, and ACLS/BLS certification required."
    }
  ]
}