{
  "meta": [
    {
      "job_title": "Clinical Data Management Leader",
      "job_category": "Healthcare",
      "job_class": "Leader",
      "sector": "Clinical Data Management",
      "salary": 320000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "Data Management",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Clinical Data Analysis",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a large group or the overall group in Clinical Data Management (CDM)."
    },
    {
      "duty": "Hire, develop, and retain diverse top talent. Set clear and elevating goals for the team and individual direct reports."
    },
    {
      "duty": "Drive the ongoing development and refinement of CDM strategies, processes, standards, practices, efficiencies, and capabilities."
    },
    {
      "duty": "Identify and oversee continuous process improvement, including the development and updating of CDM SOPs, standards, systems, practices, policies, procedures, and other tools."
    },
    {
      "duty": "Oversee timely review of study protocols and assistance to site coordinators, investigators, and field clinical staff in collecting data to meet protocol requirements."
    },
    {
      "duty": "Ensure project deliverables and timelines for clinical data acquisition, quality checking, and reporting are consistently met."
    },
    {
      "duty": "Lead CDM support on regulatory submissions, regulatory/compliance audits and inspections, and other relevant regulatory inquiries."
    },
    {
      "duty": "Own and manage budget and resource plans for a large portion of or the overall CDM organization. Adhere to regulatory requirements of study conduct and industry standards of Good Clinical Practice."
    },
    {
      "duty": "Travel as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "MA/MS/PhD in life sciences or related discipline with 14+ years OR BA/BS in life sciences or related discipline with 16+ years of relevant CDM or other data analytics/data management experience."
    }
  ]
}