{
  "meta": [
    {
      "job_title": "Cyber Security Analyst",
      "job_category": "Information Technology",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs system monitoring and analysis support for the detection of cyber incidents and provides recommendations on how to correct findings."
    },
    {
      "duty": "Monitors the network and supporting systems to detect security compromise events (including intrusions and virus incidents)."
    },
    {
      "duty": "Provides network and security operations technical analysis, assessment, and recommendations to senior personnel."
    },
    {
      "duty": "Identifies where systems/networks deviate from acceptable configurations, enclave policy, or local policy."
    },
    {
      "duty": "Provides recommendations for protecting networks, workstations, servers, and IT assets."
    },
    {
      "duty": "Conducts audits to ensure information systems security policies and procedures are implemented as defined in security plans and best practices."
    },
    {
      "duty": "Performs passive evaluations (compliance audits) and/or active evaluations (vulnerability assessments)."
    },
    {
      "duty": "Develops Risk Management Framework (RMF) certification and accreditation documentation, standard operating procedures, policies, and security instructions for both networked and standalone computer systems and provides oversight and guidance for multiple systems."
    },
    {
      "duty": "Supports formal testing requirements through pre-test preparations, participation in the tests, analysis of the results, and preparation of required reports."
    },
    {
      "duty": "Establishes strict program control processes to ensure mitigation of risks and supports obtaining certification and accreditation of systems."
    },
    {
      "duty": "Participates in response teams to ensure any anomalies are corrected in accordance with government or industry standards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or related field (Master's preferred)"
    }
  ]
}