{
  "meta": [
    {
      "job_title": "Manager, Application Development - Adjudication",
      "job_category": "Software Engineering",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Software Development",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "C++",
      "experience": 8
    },
    {
      "skill": "C#",
      "experience": 8
    },
    {
      "skill": "SQL",
      "experience": 8
    },
    {
      "skill": ".NET",
      "experience": 8
    },
    {
      "skill": "Agile Methodologies",
      "experience": 8
    },
    {
      "skill": "Jira",
      "experience": 8
    },
    {
      "skill": "Azure DevOps",
      "experience": 8
    },
    {
      "skill": "CI/CD",
      "experience": 8
    },
    {
      "skill": "Cloud-Native Applications",
      "experience": 8
    },
    {
      "skill": "PBM Industry",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead, mentor, and inspire a team of software engineers, providing clear direction, setting performance expectations, and fostering a collaborative and innovative work environment."
    },
    {
      "duty": "Implement the technical strategy for the Claim Adjudication team, ensuring alignment with overall company objective and technology roadmap."
    },
    {
      "duty": "Collaborate closely with product owner, product manager, business analysts, quality assurance teams, and other stakeholders to understand business requirements, translate them into technical solutions, and ensure successful project execution."
    },
    {
      "duty": "Collaborate with other Software Development Managers to resolve dependency challenges and conflicts."
    },
    {
      "duty": "Stay up to date with industry best practices, emerging technologies, and trends in software development, and leverage this knowledge to make informed decisions that drive technical excellence within the team."
    },
    {
      "duty": "Ensure that software products meet high-quality standards through rigorous testing, code reviews, and continuous integration practices."
    },
    {
      "duty": "Identify potential risks, issues, and bottlenecks in projects, and proactively work to mitigate them to ensure smooth project execution."
    },
    {
      "duty": "Guide team members to optimize software performance, scalability, and maintainability, with a focus on delivering efficient and reliable solutions."
    },
    {
      "duty": "Manage staffing, including recruitment, supervision, performance management, scheduling, development, evaluation, and disciplinary actions."
    },
    {
      "duty": "Provide ongoing coaching and professional development opportunities for team members to enhance their skills, knowledge, and career growth."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Four-year college or university degree in the field of computer science, information systems, or software engineering and/or a minimum of eight years of work experience is required."
    },
    {
      "credential": "Experience in a leadership role, managing and guiding software development teams."
    },
    {
      "credential": "Experience with cloud-first, API-first and microservice architectures and strategies."
    },
    {
      "credential": "Experience in the PBM industry, particularly with claim adjudication processes, is a plus."
    },
    {
      "credential": "Participate in, adhere to, and support compliance program objectives."
    }
  ]
}