{
  "meta": [
    {
      "job_title": "Senior Professional Sales Representative",
      "job_category": "Sales",
      "job_class": "Senior Professional",
      "sector": "Sales",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Pharmaceutical Sales",
      "experience": 5
    },
    {
      "skill": "Business Acumen",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Leadership Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Travel Management",
      "experience": 5
    },
    {
      "skill": "English Proficiency",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops business plan for assigned territory that is consistent with Viatris sales plans, strategies and objectives."
    },
    {
      "duty": "Conducts quality sales presentations to all targeted customers."
    },
    {
      "duty": "Achieve quarterly sales goals within territory while adhering to all ethical sales practices and required regulations."
    },
    {
      "duty": "Understands and demonstrates targeting principles."
    },
    {
      "duty": "Develops positive and interactive relationships with peers, customers, and Company managers."
    },
    {
      "duty": "Responsible for ensuring high levels of call and field productivity."
    },
    {
      "duty": "Gathers and utilizes information from offices, pharmacists and others to develop and implement specific strategies for territory prescribers."
    },
    {
      "duty": "Leverages sample program, literature and other items to ensure physician awareness of Viatris Products."
    },
    {
      "duty": "Differentiates products from all competitors and responds to customer issues confidentially and appropriately."
    },
    {
      "duty": "Actively pursue continuous learning and professional development on efficient sales, communication & product knowledge training."
    },
    {
      "duty": "Proficiency in speaking, comprehending, reading and writing English is required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of a Bachelor’s degree (or equivalent) and minimum of 1 year of pharmaceutical sales experience. However, a combination of experience and/or education will be taken into consideration."
    }
  ]
}