{
  "meta": [
    {
      "job_title": "Program Manager",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Management",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Consulting",
      "experience": 15
    },
    {
      "skill": "Business Development",
      "experience": 15
    },
    {
      "skill": "Project Management",
      "experience": 15
    },
    {
      "skill": "Energy Sector Knowledge",
      "experience": 15
    },
    {
      "skill": "Leadership",
      "experience": 15
    },
    {
      "skill": "Sales",
      "experience": 15
    },
    {
      "skill": "Networking",
      "experience": 15
    },
    {
      "skill": "Strategy Development",
      "experience": 15
    },
    {
      "skill": "Client Relationship Management",
      "experience": 15
    },
    {
      "skill": "Regulatory Environment Knowledge",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Foster, expand, and leverage a network of excellent client relationships with a focused set of large energy industry organizations."
    },
    {
      "duty": "Drive the continued growth of ERM’s business through recruiting and developing the next generation of leaders."
    },
    {
      "duty": "Contribute to leadership and management of project execution activities in support of ERM clients’ power projects."
    },
    {
      "duty": "Develop new client relationships and expand existing relationships by delivering strategic consulting advice, excellent value, and quality service."
    },
    {
      "duty": "Support and carry out ERM’s strategy of focusing on clients, understanding clients’ businesses and their needs, and delivering exceptional client value."
    },
    {
      "duty": "Actively develop commercial strategies to pursue and win new business opportunities that result in significant growth with ERM’s target power clients."
    },
    {
      "duty": "Meet business health & safety performance standards, financial targets, overall project budgets and schedules, client satisfaction/expectations, and internal risk management and contractual requirements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS/MS in environmental science, engineering, or related field; Or equivalent experience."
    },
    {
      "credential": "Recognized technical expertise and an established reputation in the local marketplace."
    },
    {
      "credential": "Demonstrable track record in delivering multi-million-dollar sales/programs."
    }
  ]
}