{
  "meta": [
    {
      "job_title": "Financial Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Business Management",
      "experience": 5
    },
    {
      "skill": "Forecasting",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Microsoft PowerPoint",
      "experience": 5
    },
    {
      "skill": "Microsoft Word",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide financial expertise and business support to designated business area to achieve key objectives."
    },
    {
      "duty": "Guide management on financial-related matters and decisions."
    },
    {
      "duty": "Manage daily financial inquiries for designated business area."
    },
    {
      "duty": "Contribute to development and execution of business team priorities by participating in joint issue identification, analysis, and resolution."
    },
    {
      "duty": "Lead the preparation of financial forecasts and budgets, including risk identification and negotiation of key operational metrics."
    },
    {
      "duty": "Perform periodic analyses of variances and prepare presentations of budget and forecast information."
    },
    {
      "duty": "Address issues, identify opportunities to improve processes and practices."
    },
    {
      "duty": "Support monthly reviews and periodic business planning sessions, evaluating financial and operational results."
    },
    {
      "duty": "Identify and analyze various investments and substantiate rationale for projects through business case developments."
    },
    {
      "duty": "Directly manage team members, including hiring, developing, motivating, and directing people."
    },
    {
      "duty": "Participate in medium-term and strategic planning for the assigned business area."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree and at least 2 years of experience in an analytical role in finance, accounting, business management, quantitative analysis, or economics OR High School Diploma/GED and at least 5 years of experience in an analytical role in finance, accounting, business management, quantitative analysis, or economics."
    },
    {
      "credential": "At least 2 years of experience identifying operational issues and recommending/implementing strategies to resolve issues and problems."
    },
    {
      "credential": "At least 2 years of experience in analytics principles (Statistics, Mathematics, Operations Research, Business Management, Economics, or Finance)."
    },
    {
      "credential": "At least 2 years of experience with project management."
    },
    {
      "credential": "Experience working as the financial liaison on a business team."
    },
    {
      "credential": "Experience using time management skills, prioritizing/organizing, tracking details, and meeting deadlines of multiple projects."
    },
    {
      "credential": "Intermediate level skill in Microsoft Excel, PowerPoint, and Word."
    },
    {
      "credential": "At least 1 year of experience in direct leadership, indirect leadership, and/or cross-functional team leadership."
    },
    {
      "credential": "Willing to travel up to 5% of the time for business purposes within state and out of state."
    },
    {
      "credential": "Master’s Degree or MBA preferred."
    }
  ]
}