{
  "meta": [
    {
      "job_title": "Bank Teller",
      "job_category": "Banking",
      "job_class": "Teller",
      "sector": "Banking",
      "salary": 34000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Transactions Processing",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Cash Handling",
      "experience": 1
    },
    {
      "skill": "Banking Products Knowledge",
      "experience": 1
    },
    {
      "skill": "Client Communication",
      "experience": 1
    },
    {
      "skill": "Confidentiality Maintenance",
      "experience": 1
    },
    {
      "skill": "Computer Proficiency",
      "experience": 1
    },
    {
      "skill": "Bilingualism (English and Spanish)",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Process financial transactions promptly and accurately, strictly adhering to all bank policies and procedures."
    },
    {
      "duty": "Prioritize client demands and provide impeccable customer service."
    },
    {
      "duty": "Communicate professionally with all clients and colleagues, uphold understanding of all banking products and services."
    },
    {
      "duty": "Participate in job-specific training, various bank training programs, and comply with BSA, AML, and all bank policies and procedures."
    },
    {
      "duty": "Actively participate in the Customer Service First program and support the values of the organization."
    },
    {
      "duty": "Maintain a high level of confidentiality, demonstrate computer proficiency, and possess impeccable written and oral communication skills."
    },
    {
      "duty": "Work in a fast-paced environment, handle frequent interruptions, and work with little to no supervision."
    },
    {
      "duty": "Stand for most of the workday, lift, carry, or move heavy boxes or bags of currency and coin weighing up to 60 pounds."
    },
    {
      "duty": "Work flexible hours and/or extended hours as business requires."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED. Bachelor’s Degree is preferred, along with 6 months previous teller experience within the financial institution industry or 6 months previous cash handling experience in a retail customer service environment."
    }
  ]
}