{
  "meta": [
    {
      "job_title": "Professional Sales Representative",
      "job_category": "Sales",
      "job_class": "Professional",
      "sector": "Sales",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Pharmaceutical Sales",
      "experience": 5
    },
    {
      "skill": "Business Planning",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Product Knowledge Training",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Excel",
      "experience": 5
    },
    {
      "skill": "Outlook",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops business plan for assigned territory that is consistent with Viatris sales plans, strategies, and objectives."
    },
    {
      "duty": "Conducts quality sales presentations to all targeted customers."
    },
    {
      "duty": "Achieve quarterly sales goals within territory while adhering to all ethical sales practices and required regulations."
    },
    {
      "duty": "Understands and demonstrates targeting principles."
    },
    {
      "duty": "Develops pre-call planning strategy for key targets."
    },
    {
      "duty": "Develops positive and interactive relationships with peers, customers, and Company managers."
    },
    {
      "duty": "Responsible for ensuring high levels of call and field productivity."
    },
    {
      "duty": "Gathers and utilizes information from offices, pharmacists, and others to develop and implement specific strategies for territory prescribers."
    },
    {
      "duty": "Leverages sample program, literature, and other items to ensure physician awareness of Viatris Products."
    },
    {
      "duty": "Differentiates products from all competitors and responds to customer issues confidentially and appropriately."
    },
    {
      "duty": "Actively pursue continuous learning and professional development on efficient sales, communication & product knowledge training."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of a Bachelor’s degree (or equivalent) and minimum of 1 year of pharmaceutical sales experience."
    },
    {
      "credential": "Technical knowledge and documented history of successful performance required."
    },
    {
      "credential": "Demonstrated business acumen, demonstrated success in influence and negotiation skills, and demonstrated leadership skills required."
    },
    {
      "credential": "Excellent oral and written communication skills, and strong verbal, interpersonal and listening skills required."
    },
    {
      "credential": "Ability to meet expectations for the key competencies for this role required."
    },
    {
      "credential": "Demonstrated ability to work independently and as a team member to deliver results, demonstrated self-starter and highly motivated required."
    },
    {
      "credential": "Ability to learn, apply and communicate products and disease states over time."
    },
    {
      "credential": "Proficiency in Excel, Word, and Outlook."
    },
    {
      "credential": "Ability to travel."
    },
    {
      "credential": "Must live within the geography of responsibility or within reasonable driving distance."
    },
    {
      "credential": "Must have a valid Driver’s License and acceptable driving record."
    },
    {
      "credential": "Professional or Senior Professional leveling will be based on years of related professional experience."
    },
    {
      "credential": "Proficiency in speaking, comprehending, reading and writing English is required."
    }
  ]
}