{
  "meta": [
    {
      "job_title": "IT Solutions Manager",
      "job_category": "Information Technology",
      "job_class": "Manager",
      "sector": "Information Technology",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "IT Solutions Development",
      "experience": 8
    },
    {
      "skill": "Financial Management",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Business Analysis",
      "experience": 8
    },
    {
      "skill": "Vendor Management",
      "experience": 8
    },
    {
      "skill": "Contract Negotiation",
      "experience": 8
    },
    {
      "skill": "Systems Integration",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and deliver IT solutions for the business and customers, analyzing trends in technology and providing assessments and solutions to address technology and business issues."
    },
    {
      "duty": "Lead and mentor staff, accountable for hardware and software planning, vendor selection, acquisition, problem resolution, set-up integration, testing, and installation."
    },
    {
      "duty": "Contribute to the development of annual technology solution plans, assess customer requirements, and analyze the architecture of business events and data to present recommendations to management."
    },
    {
      "duty": "Manage all aspects of systems analysis, design, development, installation, maintenance, and enhancement for mission-critical application systems for an assigned business unit/area."
    },
    {
      "duty": "Responsible for all aspects of budget for supported products and services, and contributes to and influences the development of standards and decisions regarding changes to systems/applications."
    },
    {
      "duty": "Responsible for vendor management and contract negotiation of supported products and services, as well as participating on advisory level counsels to drive strategy and roadmap for supported product and services."
    },
    {
      "duty": "Manage the technical interface to the business unit/customers, ensuring technology solutions are compliant with architectural standards and established methodologies and practices."
    },
    {
      "duty": "Organize and coordinate the activities associated with installation, deployment, and upgrade of software, hardware, and network facilities as it relates to the environment."
    },
    {
      "duty": "Manage the day-to-day activities of the assigned area, providing leadership, direction, and growth opportunities to members of the department."
    },
    {
      "duty": "Develop and deliver training for internal IT and external users to ensure productive use of existing and new systems."
    },
    {
      "duty": "Work to ensure processes are integrated to support expected customer needs and service levels, and build and maintain good relationships with customers."
    },
    {
      "duty": "Be aware of risk within their functional area, raising and reporting known or suspected violations to the appropriate Company authority in a timely fashion."
    },
    {
      "duty": "Perform other related duties as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Computer Science, Information Systems, or related field (Master's preferred)"
    }
  ]
}