{
  "meta": [
    {
      "job_title": "Data Reporting Analyst",
      "job_category": "Analytics",
      "job_class": "Analyst",
      "sector": "Data Analysis",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs reporting and analysis in support of departmental research, performance reporting, operations management, and departmental operations."
    },
    {
      "duty": "Plans and executes projects to study operations effectiveness and trends."
    },
    {
      "duty": "Designs and prepares reports by accessing databases or by consolidating data from multiple data sources."
    },
    {
      "duty": "Produces reports and dashboards summarizing data and providing commentary or observations based on thorough analysis."
    },
    {
      "duty": "Designs custom reports and data dashboards for projects and standard report formats for organizational needs."
    },
    {
      "duty": "Reviews assigned operating records and/or databases for quality."
    },
    {
      "duty": "Innovation by identifying processes or reporting functions that do not provide the necessary level of completeness, detail, or accuracy."
    },
    {
      "duty": "Designs standard report formats based on organizational needs for information."
    },
    {
      "duty": "Presents periodic reports or special projects to management; partners with staff, managers, and supervisors when conducting studies, surveys, or audits."
    },
    {
      "duty": "Assist managers with recruitment, record maintenance and payroll processing, and provide clerical support to all employees."
    },
    {
      "duty": "Performs other duties related to the maintenance and operation of administrative and information systems related to the area of assignment."
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Reporting and Analysis",
      "experience": 3
    },
    {
      "skill": "Database Management",
      "experience": 3
    },
    {
      "skill": "Data Visualization",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Strategic Planning",
      "experience": 3
    },
    {
      "skill": "Innovation",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in business/public administration, accounting, finance, information technology, statistics, human resources or a related field (equivalent professional experience may be considered for substitution for the required degree on an exception basis)."
    }
  ]
}