{
  "meta": [
    {
      "job_title": "Director, Data Strategy, Retail and Commerce",
      "job_category": "Data Strategy",
      "job_class": "Director",
      "sector": "Retail and Commerce",
      "salary": 184500,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Strategy",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Retail and Commerce Knowledge",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Data Design",
      "experience": 5
    },
    {
      "skill": "Data Governance",
      "experience": 5
    },
    {
      "skill": "Data Literacy",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop data requirements for new R&C product developments and complete thorough design reviews to ensure the use of data and analytics can deliver the required product performance, manage risk, and enable reuse of data across Mastercard."
    },
    {
      "duty": "Assess data feasibility and the potential differentiation for new R&C product propositions or proofs of concept."
    },
    {
      "duty": "Provide guidance to product and engineering teams to enable rapid refinement and testing based on data availability and requirements."
    },
    {
      "duty": "Identify the data dependencies and synergies across products, segments, lines of business, and third-party data sources and options to manage them."
    },
    {
      "duty": "Maintain a strong understanding of the external data landscape in R&C including the data and analytics different customer groups collect and perform, how data flows between them, and where Mastercard data and services can create additional value."
    },
    {
      "duty": "Develop strategic positioning for data assets and capabilities that could be acquired to advance the R&C strategy."
    },
    {
      "duty": "Work with product and technology teams to develop plans and roadmaps to guide how Mastercard can build out the required scale of data assets and capabilities, including data rights, to deliver products across retail and commerce and manage the regional and global data dependencies."
    },
    {
      "duty": "Develop educational material and train, as needed, on data usage and data literacy."
    },
    {
      "duty": "Work with data governance, data platforms, and technology teams to define required changes to standards, processes, and systems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in science, mathematical, engineering, or technology or equivalent experience."
    }
  ]
}