{
  "meta": [
    {
      "job_title": "Clinical Data Monitor I",
      "job_category": "Clinical Research",
      "job_class": "Monitor",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Collection",
      "experience": 4
    },
    {
      "skill": "Clinical Study",
      "experience": 4
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 4
    },
    {
      "skill": "EDC Functionality",
      "experience": 4
    },
    {
      "skill": "Quality Control",
      "experience": 4
    },
    {
      "skill": "Medical Terminology",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Verbal Communication",
      "experience": 4
    },
    {
      "skill": "GCP Guidelines",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain proficient knowledge of EDC functionality for training, change proposals, and user acceptance testing."
    },
    {
      "duty": "Establish and maintain relationships with site data & regulatory coordinators."
    },
    {
      "duty": "Responsible for Quality Control of submitted Case Report Forms (CRFs) including source document verification and issuing queries."
    },
    {
      "duty": "Act as an Evaluator for the internal Clinical Research Coordinator in training; provide extensive, informative feedback to the trainee."
    },
    {
      "duty": "Maintain regulatory documentation for all assigned sites and study staff."
    },
    {
      "duty": "Support and adhere to Good Clinical Practices (GCP) guidelines, FDA, Institutional Review Board (IRB) and HIPPA regulations, Site Operating Procedures, and ethical standards for the conduct of research clinical trials."
    },
    {
      "duty": "Work closely with onsite team to confirm appropriate consenting is being performed and documented prior to data abstraction."
    },
    {
      "duty": "Communicate effectively with the research team, investigator(s), study sponsor and ancillary staff."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred, 3-5 years of experience in data collection activities within a GCP/clinical research regulatory environment."
    },
    {
      "credential": "Experience with EDC systems and Clinical study experience in Oncology."
    },
    {
      "credential": "Strong medical terminology understanding and good written and verbal communication skills in English."
    },
    {
      "credential": "Proposal, implementation, and evaluation of appropriate resolutions."
    },
    {
      "credential": "Completion of pre-employment process including criminal background check, drug screening, and reference verification."
    },
    {
      "credential": "Preferred: Research Coordinator Certification (SoCRA, ACRP)."
    }
  ]
}