{
  "meta": [
    {
      "job_title": "Senior Software Engineer",
      "job_category": "Software Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 142500,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "COBOL",
      "experience": 5
    },
    {
      "skill": "DB2",
      "experience": 5
    },
    {
      "skill": "VSAM",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "JCL",
      "experience": 5
    },
    {
      "skill": "LUW",
      "experience": 5
    },
    {
      "skill": "File-Aid-DB2",
      "experience": 5
    },
    {
      "skill": "STROBE",
      "experience": 5
    },
    {
      "skill": "XPEDITER",
      "experience": 5
    },
    {
      "skill": "ENDEVOR",
      "experience": 5
    },
    {
      "skill": "OPC scheduler",
      "experience": 5
    },
    {
      "skill": "TWS scheduler",
      "experience": 5
    },
    {
      "skill": "Agile Methodology",
      "experience": 5
    },
    {
      "skill": "Mainframe to Cloud/micro-services migration",
      "experience": 5
    },
    {
      "skill": "Transaction processing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, design, and develop technical solutions and alternatives to meet business requirements in adherence with company standards, processes, and best practices."
    },
    {
      "duty": "Lead day to day system development and maintenance activities to meet service level agreements (SLAs) and create solutions with high innovation, cost-effectiveness, high quality, and faster time to market."
    },
    {
      "duty": "Accountable for full systems development life cycle including creating high-quality requirements documents, use-cases, design, and other technical artifacts."
    },
    {
      "duty": "Perform system maintenance, production incident problem management, identification of root cause, remediation of the problems, and on-call pager support schedule."
    },
    {
      "duty": "Participate in PoCs (Proof of Concept) and help with the selection of Vendor Solutions, Technologies, Methodologies, and Frameworks."
    },
    {
      "duty": "Contribute ideas to ensure that required standards and processes are in place, maintain solution and technology road maps, and research and evaluate current and upcoming technologies and frameworks."
    },
    {
      "duty": "Follow and promote Quality Assurance and Quality Control processes, actively look for opportunities to enhance standards and improve process efficiency, mentor and guide other team members during all phases of the SDLC, and ensure adequate test coverage in Unit Testing, System Testing/Integration Testing, and Performance Testing."
    },
    {
      "duty": "Perform Quality Inspections and Walkthroughs throughout the SDLC including Requirements Review, Design Review, Code Review, and Security Review to ensure compliance with company standards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Software Engineering, or a related field (Master's preferred)"
    }
  ]
}