{
  "meta": [
    {
      "job_title": "Hanesbrands Outlet Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Performance",
      "experience": 5
    },
    {
      "skill": "Retail Management",
      "experience": 5
    },
    {
      "skill": "Merchandising",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Achieve store sales objectives supported by monthly promotional activities, sales training, and bra fits service."
    },
    {
      "duty": "Provide customers with outstanding service by training all employees on proper service techniques."
    },
    {
      "duty": "Supervise store personnel in all phases of store activities to ensure proper store operation."
    },
    {
      "duty": "Assume responsibilities for budget control, shrink, overall operation and merchandise presentation within the store."
    },
    {
      "duty": "Responsible for taking annual physical inventory."
    },
    {
      "duty": "Procurement of selected basic stock products to be marketed through the store with approval of Merchandise Manager."
    },
    {
      "duty": "Ensure that all merchandise is displayed and merchandised properly, keep Merchandise Managers informed of out-of-stock, slow sellers and problem merchandise."
    },
    {
      "duty": "Set team member selling goals in accordance with sales plan."
    },
    {
      "duty": "Profitably manage store payroll and financial budget."
    },
    {
      "duty": "Responsible for maintaining accurate records and controlling expenses to achieve budget objectives."
    },
    {
      "duty": "Recruit, select and train store staff."
    },
    {
      "duty": "Evaluate team member job performance per established guidelines."
    },
    {
      "duty": "Ensure adequate staffing."
    },
    {
      "duty": "Assist on the sales floor including cashiering and servicing customers."
    },
    {
      "duty": "Measuring strictly female consumers to determine the proper fit for bras and various other undergarments and intimate apparel in the privacy of the women's fitting room on a regular basis."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 20,
      "student_teacher": 160,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "High school Diploma/GED desired. A college degree is a plus."
    }
  ]
}