{
  "meta": [
    {
      "job_title": "Fulfillment Center Operations Manager I",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Logistics",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Warehouse Operations Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Logistics",
      "experience": 5
    },
    {
      "skill": "Safety Regulation Compliance",
      "experience": 5
    },
    {
      "skill": "ERP Systems",
      "experience": 5
    },
    {
      "skill": "Team Building",
      "experience": 5
    },
    {
      "skill": "Organizational Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive strategies to ensure operational excellence in a fulfillment center, focusing on Safety, Quality, Delivery, Cost, and Growth (SQDCG)."
    },
    {
      "duty": "Lead, mentor, and evaluate direct and indirect reports within the fulfillment center, ensuring alignment with internal and external customers."
    },
    {
      "duty": "Implement policies and procedures to optimize the shipment of products, including safety procedures, and ensure communication channels with multiple business leaders."
    },
    {
      "duty": "Drive continuous improvement of shipment and processes, monitor metrics, and engage in employee development activities to sustain the leader in customer service and delivery."
    },
    {
      "duty": "Ensure the fulfillment center's compliance with federal, state, and local laws or regulations, and develop a culture of highly engaged business owners."
    },
    {
      "duty": "Collaborate with HR and site leaders to ensure policies and procedures support all safety, quality, delivery, and cost reduction goals."
    },
    {
      "duty": "Proactively coordinate with various business divisions to ensure that customers are being serviced according to expectation."
    },
    {
      "duty": "Engage in all safety initiatives and programs for warehouse employees, and drive continuous improvement using tools and activities focused on Safety, Quality, Delivery, Cost, and Growth (SQDCG)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Logistics, Supply Chain Management, Business, or related field. Master's preferred."
    }
  ]
}