{
  "meta": [
    {
      "job_title": "Community Manager",
      "job_category": "Community Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Creating a warm and inviting atmosphere for members and visitors to create a strong sense of authentic community."
    },
    {
      "duty": "Running the daily operations of a hygge location, including ordering supplies, maintaining community orderliness, and engaging with members."
    },
    {
      "duty": "Developing and implementing outreach strategies, creating and implementing engaging member events, and coordinating & hosting meetings and events."
    },
    {
      "duty": "Managing non-profit and start-up scholarships, maintaining a strong presence in the community, and building relationships to foster member growth."
    },
    {
      "duty": "Daily operations tasks such as opening/closing, answering phones, welcoming/greeting members & visitors, and managing email inquiries/incoming leads."
    },
    {
      "duty": "Conducting tours for new member sign-ups, managing member invoices, payments, and customer experience."
    },
    {
      "duty": "Maintaining a local presence, participating in volunteer activities, and providing weekly emails to members on events and opportunities."
    },
    {
      "duty": "Assisting with facilitating corporate offsite meetings/events, catering set up/clean up, and maintaining beverage service throughout the day."
    },
    {
      "duty": "Providing the best-in-class service for all meeting and event guests, as well as handling cleaning and reset of meeting spaces for the following day."
    },
    {
      "duty": "Evening and weekend hours may be required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Management or a related field (Master's preferred)"
    }
  ]
}