{
  "meta": [
    {
      "job_title": "Director of Product",
      "job_category": "Product Management",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 150000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Define and communicate the strategic vision and goals for the digital health product, aligning them with broader organizational objectives."
    },
    {
      "duty": "Lead and support a high-powered team of product managers, fostering a collaborative and high-performing culture."
    },
    {
      "duty": "Collaborate closely with product, development, design, and QA teams to ensure efficient development cycles, timely delivery of features, and adherence to quality standards."
    },
    {
      "duty": "Develop and maintain a strategic product roadmap that reflects market trends, Voice of the Customer, and business priorities."
    },
    {
      "duty": "Collaborate with technology, business, and clinical stakeholders to understand their requirements and incorporate their input into the product strategy."
    },
    {
      "duty": "Ensure product execution excellence and optimize the product development lifecycle for quality work and meeting deadlines."
    },
    {
      "duty": "Build strong relationships and effectively communicate the product vision and progress."
    }
  ],
  "skills": [
    {
      "skill": "Product Management",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Agile Methodologies",
      "experience": 8
    },
    {
      "skill": "Design Thinking",
      "experience": 8
    },
    {
      "skill": "Healthcare industry knowledge",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Excellent Communication and Presentation",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Marketing, Business, or related industry required. Relevant Master's degree preferred."
    }
  ]
}