{
  "meta": [
    {
      "job_title": "Document Specialist",
      "job_category": "Real Estate",
      "job_class": "Specialist",
      "sector": "Real Estate",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Document Generation",
      "experience": 5
    },
    {
      "skill": "Supervisory Skills",
      "experience": 5
    },
    {
      "skill": "Real Estate Terminology",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for database management and document generation as required by the right of way procedure for the project."
    },
    {
      "duty": "Oversees, mentors, and manages the day-to-day operation of the Document Specialist team."
    },
    {
      "duty": "Assists the Manager in producing land acquisition cost totals and forecasts for the project when required."
    },
    {
      "duty": "Works closely with project personnel and the Land Manager to assess the accuracy, efficiency, and effectiveness of reports."
    },
    {
      "duty": "Reviews all executed documents for accuracy."
    },
    {
      "duty": "Prepares releases and subordinations for mortgages and liens when required by the approved Project Procedures."
    },
    {
      "duty": "Assist in landowner mail outs and tracks registered and certified mail receipts."
    },
    {
      "duty": "Records executed documents in the appropriate county after approval by Manager or Supervisor."
    },
    {
      "duty": "Reviews completed files for execution by all parties in interest, checks for proper notarizations, assures all supporting forms have been properly executed, transfers all original documentation to office file and sends all required instruments for recording."
    },
    {
      "duty": "Reviews each condemnation file for completeness and transmits to Manager."
    },
    {
      "duty": "Arranges for transfer of hardcopy tract files to client at project completion."
    },
    {
      "duty": "Adhere to project Safety Plan."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor-s Degree in real property related field preferred, completed training by an authorized real estate company, training courses offered by the IRWA, or paralegal certification is a plus."
    }
  ]
}