{
  "meta": [
    {
      "job_title": "Compensation Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Compensation Analysis",
      "experience": 7
    },
    {
      "skill": "Job Evaluation",
      "experience": 7
    },
    {
      "skill": "Market Data Evaluation",
      "experience": 7
    },
    {
      "skill": "Excel",
      "experience": 5
    },
    {
      "skill": "PowerPoint",
      "experience": 5
    },
    {
      "skill": "HRIS System Administration",
      "experience": 7
    },
    {
      "skill": "Training",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage, analyze, and administer employer compensation programs aligned with company objectives for recruiting, retention, and employee engagement."
    },
    {
      "duty": "Design and communicate pay structures, grades, and compensation budgets."
    },
    {
      "duty": "Advise managers on effective pay decisions supporting employee engagement and compliance with compensation policy and budgetary guidelines."
    },
    {
      "duty": "Participate in compensation surveys and conduct analysis to ensure pay equity across the organization."
    },
    {
      "duty": "Develop, implement, administer, and communicate a variety of complex compensation programs and projects."
    },
    {
      "duty": "Act as an internal technical consultant to HR, hiring managers, and other clients to identify and resolve various compensation-related issues/questions."
    },
    {
      "duty": "Evaluate market data to ensure pay structures align with company's Compensation Philosophy."
    },
    {
      "duty": "Evaluate jobs and develop/maintain job descriptions and job architecture."
    },
    {
      "duty": "Administer the compensation and salary structure in the HRIS system (ADP)."
    },
    {
      "duty": "Act as a resource for company leaders for compensation and FLSA administration."
    },
    {
      "duty": "Participate in compensation surveys, conduct research, and analysis on market competitiveness, pay equity, and compensation trends."
    },
    {
      "duty": "Manage the compensation tool for annual merit and bonus payouts."
    },
    {
      "duty": "Lead compensation policy and procedure training for Managers."
    },
    {
      "duty": "May be responsible for other duties as assigned by manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in human resources, accounting/finance, or a business-related field. (Master's preferred)"
    },
    {
      "credential": "Professional HR certification such as CCP, PHR, SPHR preferred"
    }
  ]
}