{
  "meta": [
    {
      "job_title": "Process Excellence and Compliance Specialist",
      "job_category": "Procurement",
      "job_class": "Specialist",
      "sector": "Procurement",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Process Mapping",
      "experience": 3
    },
    {
      "skill": "Procurement Compliance",
      "experience": 3
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Cross-Regional Team Management",
      "experience": 5
    },
    {
      "skill": "Effective Presentation",
      "experience": 5
    },
    {
      "skill": "Six Sigma Certification",
      "experience": 3
    },
    {
      "skill": "Lean/Kaizen Certifications",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify and implement process and system improvements for procurement operations."
    },
    {
      "duty": "Track and report relevant performance and compliance metrics for procurement processes."
    },
    {
      "duty": "Develop, implement, and maintain cross-functional procedures to track and improve the end-to-end sourcing process and compliance."
    },
    {
      "duty": "Monitor and report statutory and regulatory compliance, including CDP and contract compliance for key categories."
    },
    {
      "duty": "Provide training related to internal policies, procedures, and external laws and regulations for procurement personnel."
    },
    {
      "duty": "Create and maintain a process for sharing best practices across locations and businesses."
    },
    {
      "duty": "Monitor source-to-pay process metrics, identify opportunities to streamline and standardize processes."
    },
    {
      "duty": "Collaborate in an international and remote team, fostering collaboration with procurement teams and other stakeholders."
    },
    {
      "duty": "Manage deviations from standard processes and ensure compliance with procurement policy and procedures."
    },
    {
      "duty": "Support and ensure purchasing activities align with ESG, KAITEKI, and HSE principles."
    },
    {
      "duty": "Report to the regional Head of the Center of Excellence and potentially trainees/student workers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business, economics, engineering or other STEM discipline, or equivalent experience combined with education."
    }
  ]
}