{
  "meta": [
    {
      "job_title": "Asset Maintenance Specialist",
      "job_category": "Finance",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 25000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Entry",
      "experience": 1
    },
    {
      "skill": "Financial Services",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Analyzing and processing transactions related to Private Security and Real Estate maintenance."
    },
    {
      "duty": "Communicating effectively with clients, authorized third parties, and asset sponsors to resolve discrepancies or follow-up on requests."
    },
    {
      "duty": "Adhering strictly to trust regulations and security standards."
    },
    {
      "duty": "Processing cash and securities transactions in the trust accounting system."
    },
    {
      "duty": "Ensuring all transactions are processed accurately and according to the relevant documentation."
    },
    {
      "duty": "Proactively communicating with asset sponsors or government agencies via phone to validate requests and understand the path to completion for each transaction."
    },
    {
      "duty": "Quickly remediating any issues or concerns arising from sponsor or agency contact."
    },
    {
      "duty": "Communicating findings to end clients as needed."
    },
    {
      "duty": "Communicating with clients via phone to advise them of the status of their request."
    },
    {
      "duty": "Assisting in processing activities related to institutional client conversions and deconversions."
    },
    {
      "duty": "Developing an understanding of processing activities across multiple security types (private equity and real estate)."
    },
    {
      "duty": "Processing complex activities related to bulk vendor valuations, client valuation notices, and litigation activities."
    },
    {
      "duty": "Leading institutional client conversions and de-conversions."
    },
    {
      "duty": "Creating action plans and ensuring timely execution of related processing activities."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Demonstrated data entry skills required.0-1 year Financial Services experience required."
    }
  ]
}