{
  "meta": [
    {
      "job_title": "Pharmaceutical Sales Specialist",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Account Based Selling",
      "experience": 5
    },
    {
      "skill": "Prior Authorization Process",
      "experience": 5
    },
    {
      "skill": "Healthcare Provider Partnership",
      "experience": 5
    },
    {
      "skill": "New Product Launch",
      "experience": 5
    },
    {
      "skill": "Neuroscience Sales",
      "experience": 5
    },
    {
      "skill": "Psychiatry Sales",
      "experience": 5
    },
    {
      "skill": "ADHD/Pediatric Psychiatry",
      "experience": 5
    },
    {
      "skill": "Sales Success",
      "experience": 5
    },
    {
      "skill": "Driver's License",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Achieve territory sales goals/targets on quarterly and/or annual basis."
    },
    {
      "duty": "Utilize resources (call activity, speaker programs, payer access tools etc.) against best business opportunities, tracks impact and adjusts accordingly."
    },
    {
      "duty": "Analyze market to understand local dynamics impacting the business and seek out trends that can impact the business."
    },
    {
      "duty": "Keep current on local and national payer access environment and identify opportunities for pull-through in the local market."
    },
    {
      "duty": "Demonstrate thorough understanding of disease state, treatment approaches, competition, and our product, to serve as a valued resource to customers."
    },
    {
      "duty": "Cultivate Key Opinion Leader relationships and understand how those KOL’s influence others. Partner with key stakeholders internal/external to help remove barriers to access."
    },
    {
      "duty": "Participate in industry meetings, conventions, and exhibits as necessary to build relationships and strong awareness of brand and company."
    },
    {
      "duty": "Leverage selling model to build a call continuum over time with logical and sequential steps to gain commitment to action from customers behavior."
    },
    {
      "duty": "Take ownership by actively seeks out challenges and resolves problems to build solutions that consider implications on the customer and the larger organization."
    },
    {
      "duty": "Setting high goals for personal and group accomplishment; using measurement methods to monitor progress toward goals; working to meet or exceed goals while deriving satisfaction from that achievement and continuous improvement."
    },
    {
      "duty": "Leveraging business tools to evaluate data using strategic and critical thinking skills to build business/call plans to drive performance."
    },
    {
      "duty": "Ensuring that the customer perspective is a driving force behind business decisions and activities; crafting and implementing service practices that meet customers’ and own organization’s needs."
    },
    {
      "duty": "Using appropriate interpersonal styles and communication methods to gain acceptance of a product, service, or idea from prospects and clients."
    },
    {
      "duty": "Keeping the organization's vision and values at the forefront of associate decision making and action; ensure all compliance standards and company policies and procedures are adhered to."
    },
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote freight and logistics services."
    },
    {
      "duty": "Lead a team of marketing specialists, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's online presence, optimizing the website and social media channels for maximum engagement and conversions."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "4-year bachelor’s degree from an accredited college/university required."
    }
  ]
}