{
  "meta": [
    {
      "job_title": "Member Support Specialist",
      "job_category": "Customer Service",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 42000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "C-I-CARE framework",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Microsoft Office",
      "experience": 1
    },
    {
      "skill": "Phone Skills",
      "experience": 1
    },
    {
      "skill": "Verbal Communication",
      "experience": 1
    },
    {
      "skill": "Written Communication",
      "experience": 1
    },
    {
      "skill": "Empathy",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Use impeccable C-I-CARE in all patient interactions and ensure a fluid and positive in-office experience through patient intake, same day schedule management, appropriate follow up scheduling, strong knowledge of billing and insurance, monitoring patient feedback and assisting with outreach as necessary."
    },
    {
      "duty": "Perform front of house duties including check in/check out, insurance verification, printing/paperwork tasks, prepping tests, tasking to service level expectations, etc."
    },
    {
      "duty": "Assist senior patients by performing other administrative tasks such as answering phone calls, sending faxes, and coordinating transportation for patients."
    },
    {
      "duty": "Contribute to team development through attending team huddles, participating in team problem solving, supporting in-office providers with ad hoc asks, etc."
    },
    {
      "duty": "Master our technology suite including, but not limited to Slack, G-suite, Zoom, Circulation, RingCentral, and our Electronic Medical Record System, in order to interact with team members and complete daily work."
    },
    {
      "duty": "Perform opening and closing duties/daily office upkeep as required, including maintaining the look and feel of both patient and employee facing spaces, restocking supplies, and organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "At least 1 year of experience in high touch customer or patient facing roles"
    }
  ]
}