{
  "meta": [
    {
      "job_title": "Senior Director, Security Governance, Risk and Compliance (GRC)",
      "job_category": "Information Security",
      "job_class": "Director",
      "sector": "Technology",
      "remote": false,
      "salary": 185000
    }
  ],
  "skills": [
    {
      "skill": "Strategic Leadership",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Compliance Management",
      "experience": 10
    },
    {
      "skill": "Privacy Management",
      "experience": 10
    },
    {
      "skill": "ISO 27001",
      "experience": 10
    },
    {
      "skill": "SOC2",
      "experience": 10
    },
    {
      "skill": "NIST 800-53",
      "experience": 10
    },
    {
      "skill": "FedRAMP",
      "experience": 10
    },
    {
      "skill": "Vendor Security Management",
      "experience": 10
    },
    {
      "skill": "Global Regulatory Dynamics",
      "experience": 10
    },
    {
      "skill": "Security Audit Orchestration",
      "experience": 10
    },
    {
      "skill": "Mentorship",
      "experience": 10
    },
    {
      "skill": "Performance Management",
      "experience": 10
    },
    {
      "skill": "Process Improvement",
      "experience": 10
    },
    {
      "skill": "Automation",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, enhance, and operationalize global security, risk and privacy policies, processes and controls to mitigate risk and comply with applicable laws and regulations."
    },
    {
      "duty": "Assess and monitor the effectiveness of security, risk and privacy controls in line with industry standard frameworks and standards such as, ISO 27001, SOC2, NIST 800-53, and FedRAMP."
    },
    {
      "duty": "Drive efforts to identify, quantify, communicate, track, and prioritize risks to information assets."
    },
    {
      "duty": "Represent the company to external customers and partners on security and compliance related inquiries."
    },
    {
      "duty": "Understand customer contractual requirements and global regulatory dynamics to advise senior management on risks to the business."
    },
    {
      "duty": "Collaborate with key stakeholders to review projects, business-critical systems, and related data to ensure compliance with data privacy laws, and if necessary, perform and advise on privacy impact assessments."
    },
    {
      "duty": "Orchestrate security audits and manage ongoing ISO 27001 certification and SOC2 accreditation cycles."
    },
    {
      "duty": "Develop the vendor security program to assess, rank, and qualify company suppliers and partners."
    },
    {
      "duty": "Lead and mentor GRC personnel and control owners in aligning control objectives with business processes, assessing risk, and driving continuous improvement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Security, Computer Science, or a related field (Master's preferred)"
    }
  ]
}