{
  "meta": [
    {
      "job_title": "Activism Team Leader",
      "job_category": "Retail",
      "job_class": "Team Leader",
      "sector": "Environmental Activism",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Community Engagement",
      "experience": 5
    },
    {
      "skill": "Environmental Activism",
      "experience": 5
    },
    {
      "skill": "Team Building",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Sales Promotion",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the activism programming for the store and ensure team engagement in environmental and social justice initiatives."
    },
    {
      "duty": "Manage and coach the retail team, delegate tasks, and train Customer Experience Guides."
    },
    {
      "duty": "Facilitate engagement and education on Patagonia's grantmaking and the product donation process."
    },
    {
      "duty": "Promote and oversee Activism Hours and Internship programs, ensuring staff are trained and engaged."
    },
    {
      "duty": "Implement the store's Waste Reduction Strategy and maintain relevant processes within the Community Engagement Program."
    },
    {
      "duty": "Serve as a point of contact for local disaster relief or resilience programming if necessary."
    },
    {
      "duty": "Support marketing and environmental needs as appropriate."
    },
    {
      "duty": "Ensure all activism requirements in the Retail Community Engagement Program are fulfilled, including lead retail or community grants, manage product donations, utilize and encourage employee activism hours, lead store's recycling and composting strategies, and provide education on Patagonia Action Works."
    },
    {
      "duty": "Empower and coach staff to offer outstanding customer service, prioritize, and delegate daily tasks, and identify and execute regular priorities with the visual team."
    },
    {
      "duty": "Value and demonstrate quality in all activities, ensure safety and well-being of customers and employees, and assist in hiring employees aligned with the company's values."
    },
    {
      "duty": "Demonstrate initiative, seek opportunities for growth, and actively participate in training and development of team members."
    },
    {
      "duty": "Consistently execute all duties of a Customer Experience Guide when not scheduled for activism duties."
    },
    {
      "duty": "Perform physical tasks as required in dynamic store environments."
    },
    {
      "duty": "Maintain availability aligned with the business needs, including minimum hours spent on marketing tasks."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Environmental Activism, Community Engagement, or related field (Master's preferred)"
    }
  ]
}