{
  "meta": [
    {
      "job_title": "Data Center Logistics Associate",
      "job_category": "Logistics",
      "job_class": "Associate",
      "sector": "Logistics",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Material Handling",
      "experience": 1
    },
    {
      "skill": "Inventory Control",
      "experience": 1
    },
    {
      "skill": "Warehouse Operations",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Microsoft Windows",
      "experience": 1
    },
    {
      "skill": "Forklift Operation",
      "experience": 1
    },
    {
      "skill": "Box Truck Driving",
      "experience": 1
    },
    {
      "skill": "Team Collaboration",
      "experience": 1
    },
    {
      "skill": "Workplace Safety",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Safely move all “the parts” in to, out of and around the warehouse and data center environment using a variety of technology and equipment to support the Logistics Team in the daily execution of service operations."
    },
    {
      "duty": "Ensure compliance of operational execution in line with Standard Operating Practices and Work Instructions."
    },
    {
      "duty": "Maintain strict inventory control and conduct accurate system transactions."
    },
    {
      "duty": "Transport inventory by hand, material handling equipment (i.e. forklifts or pallet jacks) and box truck in accordance with all safety procedures and protocol."
    },
    {
      "duty": "Complete other duties as required with consideration for quality, safety, and efficiency."
    },
    {
      "duty": "Escalate areas of service non-compliance in a timely and effective manner to support investigation and remediation."
    },
    {
      "duty": "Participate in all assigned training to support the execution of assigned responsibilities."
    },
    {
      "duty": "Ensure proactive customer service support to the Client and other operational teams as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Current valid driver’s license and ability to pass a Motor Vehicle Record Check."
    },
    {
      "credential": "Ability to pass a Department of Transportation (DOT) Medical Card physical exam (US only)."
    },
    {
      "credential": "HS Diploma or GED."
    },
    {
      "credential": "1+ years of operations experience."
    },
    {
      "credential": "1+ years of material handling in a warehouse, manufacturing, or distribution center environment."
    },
    {
      "credential": "Good written and verbal communication skills."
    },
    {
      "credential": "Able to safely lift and move a minimum of fifty (50) pounds and can stand the duration of the shift."
    }
  ]
}