{
  "meta": [
    {
      "job_title": "Logistics Specialist 3",
      "job_category": "Logistics",
      "job_class": "Specialist",
      "sector": "Logistics",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Warehouse Operations",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "MS Office (specifically Excel)",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Safety Compliance",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute material logistics including shipping/receiving, storage, distribution, and cycle counting in a data center environment."
    },
    {
      "duty": "Demonstrate leadership and act as a point of contact during shift assignments."
    },
    {
      "duty": "Participate in the development and implementation of goals, objectives, policies, and priorities of the organization."
    },
    {
      "duty": "Manage and supervise hourly logistics personnel for assigned operations."
    },
    {
      "duty": "Oversee work plan for assigned staff within the area and conduct reviews."
    },
    {
      "duty": "Support data center operations including receiving, storing, and shipping materials with strict inventory control."
    },
    {
      "duty": "Ensure accurate and timely shipments and receipts receiving and maintain accurate records and metrics."
    },
    {
      "duty": "Assist in monthly and/or annual physical inventories and provide inventory reports."
    },
    {
      "duty": "Identify, document, and implement opportunities for continuous improvement."
    },
    {
      "duty": "Maintain a strong working knowledge of operating systems pertaining to the work area and participate in order planning for facilities team."
    },
    {
      "duty": "Manage tasks and vendor inventory orders, and participate in inventory audits."
    },
    {
      "duty": "Support OFCI (Construction Bulk Inventory) coordinator with 3-way match receiving and assist with bulk and asset receiving when necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "HS Diploma or GED"
    },
    {
      "credential": "Logistics-related certification(s) (preferred)"
    }
  ]
}