{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "General Nursing Care",
      "experience": 5
    },
    {
      "skill": "Clinical Supervision",
      "experience": 5
    },
    {
      "skill": "Patient Care Coordination",
      "experience": 5
    },
    {
      "skill": "Clinical Chart Review",
      "experience": 5
    },
    {
      "skill": "Medication Administration",
      "experience": 5
    },
    {
      "skill": "New Hire Orientation",
      "experience": 5
    },
    {
      "skill": "Staff Training",
      "experience": 5
    },
    {
      "skill": "Feedback and Performance Evaluations",
      "experience": 5
    },
    {
      "skill": "Clinical Scheduling",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Point-of-Care Testing",
      "experience": 5
    },
    {
      "skill": "Chronic Condition Management",
      "experience": 5
    },
    {
      "skill": "Electronic Health Record (EHR)",
      "experience": 5
    },
    {
      "skill": "Triage and Urgent Care Management",
      "experience": 5
    },
    {
      "skill": "Prescription Management",
      "experience": 5
    },
    {
      "skill": "Clinical Liaison",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide general nursing care to patients including administering prescribed medications and treatments in accordance with nursing standards and per orders."
    },
    {
      "duty": "Organize and provide clinical supervision to the patient care team including delegation of responsibilities, mentoring, evaluating, educating, scheduling, and counseling the care team staff."
    },
    {
      "duty": "Review patient charts for missing labs, reports, and/or open orders and review as part of care team huddles."
    },
    {
      "duty": "Assist with new hire orientation, staff training, providing feedback for performance evaluations, and providing information related to employee discipline and termination of staff."
    },
    {
      "duty": "Prepare and manage materials and deliverables. Review patient charts for missing labs, reports, and/or open orders and review as part of the care team huddles."
    },
    {
      "duty": "Coordinate and manage daily huddles. Prepare and manage materials and deliverables. Review patient charts for missing labs, reports, and/or open orders and review as part of care team huddles."
    },
    {
      "duty": "Facilitate clinical messages and chronic condition management education to patients. Document progress notes in electronic health record within 24 hours."
    },
    {
      "duty": "Serve as a clinical liaison between the call center and medical office. Triage urgent same day or double-booked appointment requests."
    },
    {
      "duty": "Coordinate outpatient work-up and or treatment plans when required, and facilitate communication between physicians and health care providers."
    },
    {
      "duty": "Prepare prescriptions or medication refills for review and signature by the provider."
    },
    {
      "duty": "Perform other job-related duties including participation in nursing practice work groups and committees."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an accredited school of nursing. Bachelor’s Degree in Nursing. Current unencumbered New York State Registered Nurse license. BLS certification."
    }
  ]
}