{
  "meta": [
    {
      "job_title": "Assistant Facility Manager",
      "job_category": "Facilities",
      "job_class": "Manager",
      "sector": "Facility Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Facility Management",
      "experience": 5
    },
    {
      "skill": "Supervisory Skills",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Computer Proficiency",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide day-to-day supervision of engineering staff’s activities and hands-on training to the current staff."
    },
    {
      "duty": "Run daily shift change meetings, provide direction for each staff member, and ensure timely completion of maintenance work orders."
    },
    {
      "duty": "Preside at weekly scheduling meetings and reconcile maintenance requirements to meet facility needs."
    },
    {
      "duty": "Use building systems to maximize technology and provide cost savings initiatives for review and approval."
    },
    {
      "duty": "Ensure environmental policy adherence, safety, and comfort of tenants while reducing tenant work orders."
    },
    {
      "duty": "Follow up with customers to ensure service requests are completed, schedule preventative maintenance, and ensure compliance with procurement programs."
    },
    {
      "duty": "Assist in reviewing and engineering plans for additional maintenance, construction, and renovations and maintain a safe facility."
    },
    {
      "duty": "Oversee various construction projects and confirm compliance with building standards and codes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Three to five years of Facility Management experience in a high-rise building preferred. Excellent verbal and written communication skills. Proficient in computer usage. Prior supervisory/management experience."
    }
  ]
}