{
  "meta": [
    {
      "job_title": "Cloud Systems Administrator",
      "job_category": "Information Technology",
      "job_class": "Administrator",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Systems Administration",
      "experience": 5
    },
    {
      "skill": "Network Management",
      "experience": 5
    },
    {
      "skill": "Cloud Computing",
      "experience": 5
    },
    {
      "skill": "Information Security",
      "experience": 5
    },
    {
      "skill": "Scripting (PowerShell, Python)",
      "experience": 5
    },
    {
      "skill": "STIG Compliance",
      "experience": 5
    },
    {
      "skill": "Virtualization (VMware ESXi)",
      "experience": 5
    },
    {
      "skill": "Network Security",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build and manage a system to enable DoD organizations to take advantage of Cloud technology and reduce data center infrastructure."
    },
    {
      "duty": "Support maintenance activities, including evaluation, integration, fielding, administration, testing, and operations of networks, systems, and subsystems in a virtual and cloud-based environment."
    },
    {
      "duty": "Configure and maintain operational Windows, Linux, and AWS cloud-based server environments."
    },
    {
      "duty": "Perform system security scans, group policy updates, and execute maintenance scripts and jobs."
    },
    {
      "duty": "Monitor system activities, modify configurations to respond to security threats and requirements, and maintain data storage, management, and system backups."
    },
    {
      "duty": "Support Microsoft IIS and SQL applications, and maintain and update network traffic management, routing, firewalls, and load balancing devices."
    },
    {
      "duty": "Design, develop, and implement system changes and enhancements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science or Engineering or 6+ years of experience with implementing and configuring IT infrastructure systems in lieu of a degree"
    },
    {
      "credential": "Security+ Certification"
    }
  ]
}