{
  "meta": [
    {
      "job_title": "Recruitment & Workforce Business Partner",
      "job_category": "Human Resources",
      "job_class": "Business Partner",
      "sector": "Management",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Talent Acquisition",
      "experience": 5
    },
    {
      "skill": "Employee Onboarding",
      "experience": 5
    },
    {
      "skill": "HR Policy Development",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Recruitment Strategy",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Multicultural Experience",
      "experience": 5
    },
    {
      "skill": "Applicant Tracking Systems",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "MS Office",
      "experience": 5
    },
    {
      "skill": "Online Recruitment Tools",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead end-to-end employee lifecycle interactions, including recruitment, onboarding, and management of HR requirements."
    },
    {
      "duty": "Partner with Function Area Leaders to understand service levels, deliverables, and people-related needs within their workstream."
    },
    {
      "duty": "Capture recruitment requirements, create appealing job ads, and decide upon recruiting strategy."
    },
    {
      "duty": "Lead the recruitment and selection process for all event staff, including developing job descriptions, conducting interviews, and coordinating background checks."
    },
    {
      "duty": "Screen applications through an Applicant Tracking System, and oversee pre-employment applicant screening processes."
    },
    {
      "duty": "Develop and maintain HR policies and procedures, ensuring compliance with labor laws, regulations, and FIFA guidelines."
    },
    {
      "duty": "Provide guidance and support to staff on HR-related matters, including employee engagement initiatives and employee relations."
    },
    {
      "duty": "Stay updated on HR trends and best practices, and adapt them to the specific needs and requirements of the FIFA World Cup 2026. Use stats and reports to analyze your contribution and learn for the future."
    },
    {
      "duty": "Own recruitment processes and create a great candidate experience. Be ready to grow and take opportunities to develop into a true Business Partner role."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 140,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree (or equivalent) in Human Resources, or related field"
    }
  ]
}