{
  "meta": [
    {
      "job_title": "Maintenance Technician",
      "job_category": "Maintenance",
      "job_class": "Technician",
      "sector": "Maintenance",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for repairing and maintaining mechanical equipment used in the production and packaging of products."
    },
    {
      "duty": "Regularly inspecting equipment, structures, or material, and working on all requests for the various types of maintenance work assigned."
    },
    {
      "duty": "Effectively and safely operate standard maintenance tools such as power tools, basic hand tools, and basic electrical testing equipment."
    },
    {
      "duty": "Perform preventative maintenance from daily up to Semi-Annual."
    },
    {
      "duty": "Read and understand mechanical and electrical schematics."
    },
    {
      "duty": "Complete minor troubleshooting of mechanical and electrical-related issues without direct supervision."
    },
    {
      "duty": "Maintain work area and equipment in a clean and orderly condition."
    },
    {
      "duty": "Follow prescribed safety rules and regulations as well as other departmental policies and procedures. Help to develop proper safety techniques."
    },
    {
      "duty": "Detect, document, report, and repair improper machine operation and faulty equipment."
    },
    {
      "duty": "Follow and perform emergency procedures regarding power failures."
    },
    {
      "duty": "Diversify maintenance skills that will allow assignments to be given in any work areas as required and, on any shift, required."
    },
    {
      "duty": "Understand and certify in our LOTO program."
    },
    {
      "duty": "Effectively inform through written communication, daily pass-down issues and actions."
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Equipment Repair",
      "experience": 3
    },
    {
      "skill": "Electrical Testing",
      "experience": 3
    },
    {
      "skill": "Preventative Maintenance",
      "experience": 3
    },
    {
      "skill": "Reading Schematics",
      "experience": 3
    },
    {
      "skill": "Troubleshooting",
      "experience": 3
    },
    {
      "skill": "Safety Regulations",
      "experience": 3
    },
    {
      "skill": "Written Communication",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Completed 2-year trades degree and/or 4 years of plant maintenance experience"
    }
  ]
}