{
  "meta": [
    {
      "job_title": "Veterinary Hospital Director",
      "job_category": "Healthcare",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Operations Management",
      "experience": 8
    },
    {
      "skill": "P&L Management",
      "experience": 8
    },
    {
      "skill": "Continuous Quality Improvement",
      "experience": 8
    },
    {
      "skill": "Team Building",
      "experience": 8
    },
    {
      "skill": "Financial Planning",
      "experience": 8
    },
    {
      "skill": "Budget Management",
      "experience": 8
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 8
    },
    {
      "skill": "Data Analysis",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the management and reporting of hospital performance and statistics."
    },
    {
      "duty": "Lead a high performing management team; attract, recruit, develop and retain team members."
    },
    {
      "duty": "Implement and lead a continuous quality improvement process."
    },
    {
      "duty": "Create and identify new ideas and opportunities for the hospital that will promote staff and client experiences as well as improve the quality of life for animals in our care."
    },
    {
      "duty": "Drive collaboration to ensure consistent services and guest experience is offered across the practice in all departments."
    },
    {
      "duty": "Plan, manage, organize, implement and evaluate programs, services, activities, and procedures on an ongoing basis."
    },
    {
      "duty": "Provide leadership in developing standards of care, operation, and financial plans, as well as implementing policies and procedures."
    },
    {
      "duty": "Uphold core values and standards, and promote a cooperative working environment among staff members."
    },
    {
      "duty": "Communicate the practice’s values and mission to the team, and motivate staff to help build and maintain morale."
    },
    {
      "duty": "Promote continuous quality improvement (CQI) to ensure the practice’s success and achieve the vision."
    },
    {
      "duty": "Analyze various sources of data to establish priorities and initiate operational programs."
    },
    {
      "duty": "Show empathy toward clients and treat animals with respect and compassion."
    },
    {
      "duty": "Read and analyze a P&L statement, and demonstrate competence in budgeting and financial reporting."
    },
    {
      "duty": "Maintain inventory and an inventory control system, and manage the hospital software, and implement safety and security procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business or related field (MBA or MPH preferred)"
    },
    {
      "credential": "Certified Veterinary Practice Manager designation or equivalent work experience preferred"
    }
  ]
}