{
  "meta": [
    {
      "job_title": "Medical Assistant",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Under direct supervision of the provider and nursing leadership, the Medical Assistant performs a variety of administrative and clinical tasks to assist in the quality and compassionate care provided to patients."
    },
    {
      "duty": "Perform initial-response screening following protocols approved by supervising provider."
    },
    {
      "duty": "Escort patient to room and prepare patient for examination, procedure, and treatment."
    },
    {
      "duty": "Obtain vital signs and record in the electronic health record (EHR)."
    },
    {
      "duty": "Prepare for, set up and assist with examinations, procedures, and treatments per protocols, policies, and procedures."
    },
    {
      "duty": "Prepare, administer, and document oral, parenteral medications and immunizations as ordered by the supervising provider."
    },
    {
      "duty": "Maintain accurate immunization and medication administration records."
    },
    {
      "duty": "Document care provided during patient visit in EHR."
    },
    {
      "duty": "Recognize and respond to emergencies."
    },
    {
      "duty": "Actively monitor & respond timely to patient requests via telephone encounter, In Basket message and/or My Chart according to identified time frames and document responses in the EHR."
    },
    {
      "duty": "Enter medication, radiology, and lab orders in the electronic health record for provider sign off."
    },
    {
      "duty": "Discharge patient providing after visit instructions to patient and/or caregiver as directed by the provider."
    },
    {
      "duty": "Enter medication refill/request per department guidelines."
    },
    {
      "duty": "Collect and process specimens."
    },
    {
      "duty": "Perform CLIA-waived tests."
    },
    {
      "duty": "Perform electrocardiography, respiratory and other testing based on department needs."
    },
    {
      "duty": "Perform phlebotomy, including venipuncture and capillary puncture."
    },
    {
      "duty": "Serve as a liaison between patients and medical staff in the event of problems or complaints."
    },
    {
      "duty": "Schedule, coordinate, and monitor appointments."
    },
    {
      "duty": "Schedule outpatient procedures."
    },
    {
      "duty": "Apply third party and managed care policies, procedures, and guidelines."
    },
    {
      "duty": "Obtain insurance pre-authorizations."
    },
    {
      "duty": "Enters referrals for provider sign off."
    },
    {
      "duty": "Participate in departmental/divisional Quality Assessment and Quality Improvement Programs."
    },
    {
      "duty": "Practice Standard Precautions, including hand washing and disposal of biohazardous materials."
    },
    {
      "duty": "Apply principles of aseptic and sterile technique."
    },
    {
      "duty": "Clean instruments and equipment per policies and procedures."
    },
    {
      "duty": "Comply with all HFHS and departmental specific safety standards."
    },
    {
      "duty": "Maintain compliance with regulatory standards regarding practice, environment, and documentation."
    },
    {
      "duty": "Function as a health care advocate to meet individual’s needs."
    },
    {
      "duty": "Educate individuals in office policies and procedures."
    },
    {
      "duty": "Educate the patient within the scope of practice and as directed by supervising physician in health maintenance, disease prevention, and compliance with patient’s treatment plan."
    },
    {
      "duty": "Identify community resources for health maintenance and disease prevention to meet individual patient needs."
    },
    {
      "duty": "Uphold goals, policies, procedures, and expectations of Henry Ford Health."
    },
    {
      "duty": "Support the mission, vision, and values of Henry Ford Health."
    },
    {
      "duty": "Maintain examination/treatment rooms, including inventory of supplies and equipment."
    },
    {
      "duty": "Maintain core and applicable specialty competencies as defined by Henry Ford Health."
    },
    {
      "duty": "Other duties as assigned within scope of practice."
    }
  ],
  "skills": [
    {
      "skill": "Clinical Skills",
      "experience": 5
    },
    {
      "skill": "Medical History Taking",
      "experience": 5
    },
    {
      "skill": "Vital Signs Measurement",
      "experience": 5
    },
    {
      "skill": "Patient Care Documentation",
      "experience": 5
    },
    {
      "skill": "Patient Education",
      "experience": 5
    },
    {
      "skill": "Medical Records Management",
      "experience": 5
    },
    {
      "skill": "Healthcare Compliance",
      "experience": 5
    },
    {
      "skill": "Emergency Response",
      "experience": 5
    },
    {
      "skill": "Phlebotomy",
      "experience": 5
    },
    {
      "skill": "Electronic Health Record (EHR) Management",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or G.E.D. equivalent."
    },
    {
      "credential": "Graduate of a Medical Assistant program with completion of a formal clinical externship (160 hour minimum)."
    },
    {
      "credential": "OR Graduate from a Medical Assistant program without completion of a clinical externship but with a minimum one-year experience in clinical medical assisting within the past five (5) years."
    },
    {
      "credential": "OR Current Professionally Recognized Medical Assistant Certification with a minimum of five (5) years of experience in clinical medical assisting."
    },
    {
      "credential": "OR Licensed Practical Nurse (LPN). OR Licensed Paramedic/Emergency Medical Technician (EMT) with at least one-year clinical experience in a clinical medical setting within the past five (5) years."
    },
    {
      "credential": "OR Military trained medical personnel with at least one-year clinical experience in a clinical medical setting within the past five (5) years."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50
    },
    {
      "student_teacher": 30
    },
    {
      "introvert_extrovert": 100
    }
  ]
}