{
  "meta": [
    {
      "job_title": "Academic Advisor I",
      "job_category": "Education",
      "job_class": "Advisor",
      "sector": "Academic",
      "salary": 47000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Academic Advising",
      "experience": 5
    },
    {
      "skill": "Student Support",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organization Skills",
      "experience": 5
    },
    {
      "skill": "Advising Technology",
      "experience": 5
    },
    {
      "skill": "Career Counseling",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Advise students individually, electronically, and/or with groups regarding academic core and/or departmental requirements, appropriate class selection, academic policies and procedures, and campus resources."
    },
    {
      "duty": "Assist students with identification of long-term goals and career plans. Work to position students to meet requirements for graduation within appropriate periods of time while preparing them to meet future goals."
    },
    {
      "duty": "Advise special populations of students within scope of responsibility, such as new or transfer students, undeclared majors, minority groups, etc., assisting in exploration of academic programs, and focusing on academic direction, procedures, policies, and available resources."
    },
    {
      "duty": "Keep accurate advising appointment notes and maintain confidential student advising records. Utilize USF information systems to support delivery of advising service and make appropriate updates to degree audit to accurately reflect student progress."
    },
    {
      "duty": "Perform related duties as required to meet the Academic Advising goals within the Advisor's scope of responsibility, like supporting new students through orientation process and serving at admission recruiting events."
    },
    {
      "duty": "Continue training and professional development to enhance core knowledge, initiative, collaboration, communication, analytical review, professionalism, and dependability to provide excellent academic advising to our students."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Education, Counseling or academic field directly related to the Advisor's specific responsibilities (Master's preferred)"
    }
  ]
}