{
  "meta": [
    {
      "job_title": "Front-End Driver",
      "job_category": "Logistics",
      "job_class": "Driver",
      "sector": "Transportation",
      "salary": 52000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Driving",
      "experience": 5
    },
    {
      "skill": "Customer Interaction",
      "experience": 3
    },
    {
      "skill": "Vehicle Inspection",
      "experience": 5
    },
    {
      "skill": "Safety Procedures",
      "experience": 5
    },
    {
      "skill": "Operational Planning",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Operate front-end trucks to collect and transport waste or recyclables along designated routes."
    },
    {
      "duty": "Perform daily pre- and post-trip inspections of the vehicle and complete vehicle condition reports."
    },
    {
      "duty": "Interact courteously with customers and the general public, addressing their questions and requests."
    },
    {
      "duty": "Maintain clean customer sites and ensure safety along roads and highways by cleaning loose trash."
    },
    {
      "duty": "Submit required logs, route sheets, and vehicle condition reports as per company policy and legal requirements."
    },
    {
      "duty": "Follow safe operating practices and procedures, including equipment checks and lockout/tagout protocols."
    },
    {
      "duty": "Monitor operations for loose debris and visually scan customer sites before and after dumping."
    },
    {
      "duty": "Sustain a motivated workforce by screening, hiring, training, developing, and evaluating personnel."
    },
    {
      "duty": "Adhere to wage and hour laws, compensate personnel in accordance with guidelines, and practice progressive discipline for employee performance issues."
    },
    {
      "duty": "Ensure safe working conditions, plan and operate landfill operations efficiently, and conduct annual performance reviews for employees."
    },
    {
      "duty": "Schedule and conduct safety meetings, document attendees, and establish and review productivity standards."
    },
    {
      "duty": "Promote and uphold an effective safety program, investigate accidents, and ensure proper supply and usage of safety equipment."
    },
    {
      "duty": "Conform with applicable laws, regulations, and company policies, and perform other duties as required by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree from a four-year college or university and/or demonstrated record of serving in an operational environment requiring analytical and general management skills."
    },
    {
      "credential": "Five or more years of experience in the waste or landfill industry or equivalent combination of required education and experience."
    },
    {
      "credential": "Proficiency with operation of dump truck, bull dozer, compactor, track hoe, loader, and backhoe."
    },
    {
      "credential": "Acquire and maintain the SWANA Manager of Landfill Operations certification."
    }
  ]
}