{
  "meta": [
    {
      "job_title": "Material Handler",
      "job_category": "Manufacturing",
      "job_class": "Handler",
      "sector": "Manufacturing",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Warehouse Operations",
      "experience": 3
    },
    {
      "skill": "Inventory Control",
      "experience": 3
    },
    {
      "skill": "Material Handling Equipment Operation",
      "experience": 3
    },
    {
      "skill": "OSHA Compliance",
      "experience": 3
    },
    {
      "skill": "Warehouse Management Software",
      "experience": 3
    },
    {
      "skill": "Inventory Scanning",
      "experience": 3
    },
    {
      "skill": "Loading and Unloading",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Safety Procedures",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Safe loading and unloading of finished goods in accordance with customer orders, specifications, and requirements."
    },
    {
      "duty": "Accurate inventory control in accordance with FIFO inventory methods to maximize product code dates and rotation."
    },
    {
      "duty": "Safe and efficient operation of material handling equipment to include lift trucks, pallet jacks, and electric battery handling equipment in support of OSHA Powered Industrial Truck requirements and Company policies."
    },
    {
      "duty": "Effective and accurate operation of automated warehouse management software controls, inventory scanning, and management tools."
    },
    {
      "duty": "Safe and efficient loading and unloading of trailers, following internal/external requirements."
    },
    {
      "duty": "Load refrigerated trailers in accordance with customer specifications."
    },
    {
      "duty": "Follow FIFO and inventory control practices and procedures."
    },
    {
      "duty": "Safe and efficient operation of stretch-wrapping and palletizing equipment (if applicable)."
    },
    {
      "duty": "Perform pre and post load inspections of the trailer."
    },
    {
      "duty": "Effective communication with internal and external customers."
    },
    {
      "duty": "Ability to follow standard operating procedures (SOP’s) in detail without deviation."
    },
    {
      "duty": "Perform equipment safety pre-operational inspections."
    },
    {
      "duty": "Accurately and neatly complete warehouse shipping and receiving records and documents."
    },
    {
      "duty": "Perform department environmental and housekeeping controls."
    },
    {
      "duty": "Perform product rework and repack operations to fulfill customer orders."
    },
    {
      "duty": "Support internal and external audits."
    },
    {
      "duty": "Follow all established occupational health and safety procedures."
    },
    {
      "duty": "Follow all established GMP’s and Food Safety requirements."
    },
    {
      "duty": "Cross-train with other departments."
    },
    {
      "duty": "Comply with federal, state, and local dairy food regulations."
    },
    {
      "duty": "Adhere to the Saputo code of ethics and actively apply the Saputo values."
    },
    {
      "duty": "Work together professionally in a team environment with coworkers and other department personnel."
    },
    {
      "duty": "Other duties as required by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent. 1-year demonstrated experience operating a lift truck. Ability to obtain Powered Industrial Truck certification and maintain certification. Experience in warehouse operations in a shipping/receiving role. Food manufacturing experience a plus."
    }
  ]
}