{
  "meta": [
    {
      "job_title": "Director of Operations",
      "job_category": "Operations",
      "job_class": "Director",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage the venue in providing best-in-class service and hospitality for Guests."
    },
    {
      "duty": "Set big-picture direction for the venue and work alongside leaders and teams to ensure Guest satisfaction."
    },
    {
      "duty": "Ensure effective hiring, scheduling, and Associate development to build strong teams and drive team engagement."
    },
    {
      "duty": "Execute flawless operational activities, uphold processes and standards, and maximize financial performance."
    },
    {
      "duty": "Build relationships with the community and grow the brand through business functions."
    },
    {
      "duty": "Supervise venue leaders to provide best-in-class service and drive Associate engagement."
    },
    {
      "duty": "Forecast and control sales and expenses, delegate tasks, and hold direct reports accountable for budgets and spending."
    },
    {
      "duty": "Interact with Guests to check on the quality of their experience and leverage business metrics and trends to drive performance."
    },
    {
      "duty": "Cultivate relationships with community leaders and organizations to ensure strong connections."
    },
    {
      "duty": "Hold leaders accountable for managing venue operations and drive Guest and team safety and satisfaction."
    },
    {
      "duty": "Demonstrate Topgolf’s Core Values: Fun, One Team, Excellence, Edgy Spirit, and Caring."
    }
  ],
  "skills": [
    {
      "skill": "Restaurant, hotel, or golf course management",
      "experience": 15
    },
    {
      "skill": "Multi-unit management",
      "experience": 5
    },
    {
      "skill": "Excellent communication",
      "experience": 5
    },
    {
      "skill": "Time management",
      "experience": 5
    },
    {
      "skill": "Team leadership",
      "experience": 5
    },
    {
      "skill": "Energy and enthusiasm",
      "experience": 5
    },
    {
      "skill": "High level of self-awareness and receptivity to change",
      "experience": 5
    },
    {
      "skill": "Extreme weather condition work",
      "experience": 5
    },
    {
      "skill": "Obtaining required licenses and certifications",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent (Bachelor's degree preferred)"
    }
  ]
}