{
  "meta": [
    {
      "job_title": "Plant Control Electrical Engineer",
      "job_category": "Engineering",
      "job_class": "Control Engineer",
      "sector": "Engineering",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conducts Project Management for plant electrical distribution and PLC improvements."
    },
    {
      "duty": "Develops and modifies control schemes, logic, and algorithms."
    },
    {
      "duty": "Implements control schemes in PLCs, distributed control systems, specialized safety controllers, or hard-wired logic."
    },
    {
      "duty": "Performs in field electrical project, corrective, troubleshooting and preventive work."
    },
    {
      "duty": "Develops, improves and maintains up to date plant electrical drawings and schematics."
    },
    {
      "duty": "Develops project scope, cost estimates, schedule, budget, concept statement, proposal and project plans."
    },
    {
      "duty": "Develops, improves and expands the Electrical Preventive Maintenance Program."
    },
    {
      "duty": "Coordinates with various groups and managers to ensure project scope and schedule meet their requirements."
    },
    {
      "duty": "Performs unplanned/emergency equipment/parts procurement."
    },
    {
      "duty": "Ensures all permit requirements are met as relates to instrumentation and controls calibrations."
    },
    {
      "duty": "Identifies needed electrical corrective/preventive work and creates associated work orders."
    },
    {
      "duty": "Provides support and information for developing electrical standards."
    },
    {
      "duty": "Provides support and information for specialized training needs."
    },
    {
      "duty": "Works indoors and outdoors in a plant environment."
    },
    {
      "duty": "Wears personal protective equipment (PPE) as needed and in accordance with safety policies and procedures."
    },
    {
      "duty": "Enters confined spaces as required and in accordance with safety policies and procedures."
    },
    {
      "duty": "Climbs stairs and scaffoldings as required."
    },
    {
      "duty": "Maintains a safe and clean working environment by complying with procedures, rules, and regulations."
    },
    {
      "duty": "Daily use of advanced PC and business computer applications, zoom conferencing and e-mail."
    },
    {
      "duty": "Performs other job-related duties assigned."
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Electrical Engineering or related field (Master's preferred)"
    }
  ]
}