{
  "meta": [
    {
      "job_title": "Data Scientist",
      "job_category": "Data Science",
      "job_class": "Scientist",
      "sector": "Software Engineering",
      "salary": 200000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Statistics",
      "experience": 5
    },
    {
      "skill": "Data Science",
      "experience": 5
    },
    {
      "skill": "Analytics",
      "experience": 5
    },
    {
      "skill": "Python",
      "experience": 5
    },
    {
      "skill": "R",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "Database Querying",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with stakeholders in cross-projects and team settings to identify and clarify business or product questions to answer."
    },
    {
      "duty": "Provide feedback to translate and refine business questions into tractable analysis, evaluation metrics, or mathematical models."
    },
    {
      "duty": "Use custom data infrastructure or existing data models as appropriate, using specialized knowledge."
    },
    {
      "duty": "Design and evaluate models to mathematically express and solve defined problems with limited precedent."
    },
    {
      "duty": "Gather information, business goals, priorities, and organizational context around the questions to answer, as well as the existing and upcoming data infrastructure."
    },
    {
      "duty": "Own the process of gathering, extracting, and compiling data across sources via relevant tools (e.g., SQL, R, Python). Independently format, re-structure, and/or validate data to ensure quality, and review the dataset to ensure it is ready for analysis."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Statistics, Data Science, Mathematics, Physics, Economics, Operations Research, Engineering, or a related quantitative field (PhD preferred)"
    }
  ]
}