{
  "meta": [
    {
      "job_title": "Senior Business Intelligence Analyst",
      "job_category": "Business Intelligence",
      "job_class": "Analyst",
      "sector": "Business Intelligence",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Business Intelligence",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "CRM Systems",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 3
    },
    {
      "skill": "Data Visualization Tools",
      "experience": 5
    },
    {
      "skill": "PowerPoint",
      "experience": 5
    },
    {
      "skill": "Statistical Programming",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Extract insights from business data to directly impact business unit performance in a repeatable, scalable manner."
    },
    {
      "duty": "Build strong relationships with customer organization team members and cross-functional partners to provide strategic advice on data trends and requirements."
    },
    {
      "duty": "Solve challenging business problems creatively, efficiently, and independently, especially when faced with time and operational constraints or ambiguity."
    },
    {
      "duty": "Work with and manipulate large, complex datasets for analysis and report creation. Create reports, dashboards, metrics, and models that ensure we are focused on the best customer experience and business performance possible."
    },
    {
      "duty": "Deliver on multiple initiatives in the same time frame. Be intellectually curious and have a passion for proactively digging into the data to understand “why” we believe the data is accurate, how the data can be validated and kept fresh."
    },
    {
      "duty": "Make and document recommendations for integrating the data set(s) into a production environment, informing customers about the availability of products at their location."
    },
    {
      "duty": "Identify opportunities to use data to develop new strategies and improve business performance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 100,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Computer Science or related field required. (Master's degree preferred)"
    }
  ]
}