{
  "meta": [
    {
      "job_title": "Construction Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 8
    },
    {
      "skill": "Budget Management",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Team Collaboration",
      "experience": 8
    },
    {
      "skill": "Problem-Solving",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage construction activities for projects, ensuring work/safety/quality programs are followed."
    },
    {
      "duty": "Oversee site construction to ensure projects follow designs, specifications, standards, budget, safety, and schedule requirements."
    },
    {
      "duty": "Complete project reports accurately and timely for each construction project(s) assigned."
    },
    {
      "duty": "Document incidents and participate in incident investigations as required."
    },
    {
      "duty": "Provide leadership for issue resolution during project construction and commissioning phases."
    },
    {
      "duty": "Collaborate with Company Safety Representatives to promote awareness and understanding of safety performance on projects."
    },
    {
      "duty": "Provide technical support to Project Manager during project design and pre-job meetings."
    },
    {
      "duty": "Manage deliverables with key internal and external stakeholders to ensure project goals are met."
    },
    {
      "duty": "Manage 3rd party contract craft inspection staff for each construction project."
    },
    {
      "duty": "Ensure Company environmental policies, safety standards, and federal/local regulations are followed by all construction and inspection personnel."
    },
    {
      "duty": "Coordinate the timely completion of project documentation and close out processes."
    },
    {
      "duty": "Monitor construction progress and initiate corrective action when the contractor deviates from project specifications, requirements, or schedule."
    },
    {
      "duty": "Address any construction non-conformance issues."
    },
    {
      "duty": "Other tasks as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "6 to 10 years of experience and education (engineering discipline) in construction of oil or natural gas infrastructure projects."
    }
  ]
}