{
  "meta": [
    {
      "job_title": "Histotechnician",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Preparation of both unstained and stained slides using microtome, water bath, automated stainer, automated cover slipper, tissue processors, and embedding centers."
    },
    {
      "duty": "Determine appropriate block orientation and alignment, knife angles, and settings to obtain representative sections."
    },
    {
      "duty": "Maintain specimen integrity through proper identification of samples, slides, and folders."
    },
    {
      "duty": "Cut frozen sections using a cryostat, stain samples for pathologists to review."
    },
    {
      "duty": "Collaborate with in-house pathologists and pathology lab coordinators for slide quality review."
    },
    {
      "duty": "Track work completed using a custom Laboratory Information Management System (LIMS)."
    },
    {
      "duty": "Maintain laboratory equipment and record maintenance regularly."
    },
    {
      "duty": "Approach work with safety and diligence and follow safety requirements of the laboratory."
    },
    {
      "duty": "Perform routine workflows without direct guidance."
    },
    {
      "duty": "Reliably produce quality finished products."
    },
    {
      "duty": "Work collaboratively with other members of the Histology team to accomplish daily cutting and staining deadlines."
    },
    {
      "duty": "Communicate effectively with pathologists, members of the histology team, and other associated teams as relates to workflow needs."
    },
    {
      "duty": "Seek assistance from the lead, supervisor, and/or manager when problems or mistakes arise."
    },
    {
      "duty": "Report issues with instrumentation, samples, or the lab itself in a timely manner."
    },
    {
      "duty": "Certification not required. Associates preferred. Previous histology experience preferred. Knowledge of CAP regulations. Experience with pathology laboratory SOPs and protocols. Comfort with laboratory safety and training. Demonstrates problem-solving skills in the laboratory. Good communication and organization skills."
    }
  ],
  "skills": [
    {
      "skill": "Histology",
      "experience": 2
    },
    {
      "skill": "Microtome",
      "experience": 2
    },
    {
      "skill": "Laboratory Information Management System (LIMS)",
      "experience": 2
    },
    {
      "skill": "Tissue Processing",
      "experience": 2
    },
    {
      "skill": "Cryostat",
      "experience": 2
    },
    {
      "skill": "Pathology Laboratory SOPs and Protocols",
      "experience": 2
    },
    {
      "skill": "CAP Regulations",
      "experience": 2
    },
    {
      "skill": "Laboratory Safety and Training",
      "experience": 2
    },
    {
      "skill": "Problem Solving",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Organizational Skills",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "Associates degree in Histotechnology (Bachelor's preferred)"
    }
  ]
}