{
  "meta": [
    {
      "job_title": "Business Intelligence Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Business Intelligence",
      "experience": 7
    },
    {
      "skill": "Supervisory Experience",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Technical Expertise",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Data Management",
      "experience": 7
    },
    {
      "skill": "SQL",
      "experience": 7
    },
    {
      "skill": "BI Platforms",
      "experience": 7
    },
    {
      "skill": "Market Analysis",
      "experience": 7
    },
    {
      "skill": "Product Development",
      "experience": 7
    },
    {
      "skill": "Event Planning",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Market Strategy",
      "experience": 7
    },
    {
      "skill": "Online Presence Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive business intelligence solutions to drive insights and actionable recommendations from complex datasets."
    },
    {
      "duty": "Lead a team of business intelligence analysts and developers, guiding their efforts toward innovative BI solutions and report delivery."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine data strategies."
    },
    {
      "duty": "Manage the company's data architecture and technical strategy, ensuring high-quality BI products align with current business needs."
    },
    {
      "duty": "Plan and oversee technical discussions with the data operations team, ensuring data integrity and proactive efforts to improve data quality."
    },
    {
      "duty": "Measure and report on the performance of BI products, using data-driven insights to continuously improve business intelligence strategies."
    },
    {
      "duty": "Contribute to the development of business intelligence strategy and best practices in data management and BI."
    },
    {
      "duty": "Participate in technical discussions with the data operations team, delivering continual data quality reports and proactive efforts to improve data quality."
    },
    {
      "duty": "Communicate cross-functionality and provide constructive feedback into the design and integration of BI products."
    },
    {
      "duty": "Develop analytic standards for measuring performance within the business unit and lead teams to consensus around analytic approaches."
    },
    {
      "duty": "Monitor and manage requests from the business to the Business Intelligence Group."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or foreign equivalent in Information Technology or business-related field, or equivalent experience (Master’s Degree or MBA preferred)"
    },
    {
      "credential": "Experience with Cable TV, Internet, and/or Phone products & services or other related industry experience is preferred."
    }
  ]
}