{
  "meta": [
    {
      "job_title": "Supply Chain Specialist",
      "job_category": "Supply Chain",
      "job_class": "Specialist",
      "sector": "Supply Chain",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs duties and maintains records in relation to the receiving, distribution, and control of hospital supplies. Ensures adherence to accepted procedures to protect the integrity of all supplies and materials while assuring proper documentation."
    },
    {
      "duty": "Receives, inspects, verifies, and accepts delivered supplies, equipment and materials; processes all associated paperwork and documentation."
    },
    {
      "duty": "Properly stores materials and supplies received, as well as properly places and rotates stock to prevent loss due to deterioration of product quality while in storage."
    },
    {
      "duty": "Assures the daily functionality of the Par Excellence system for patient charging, resolving issues as they arise including downtime, lost charge tracking and system maintenance."
    },
    {
      "duty": "Establishes, implements and monitors par levels and other inventory controls to ensure a secure, efficient and cost-effective supply process."
    },
    {
      "duty": "Responsible for Inventory control in Central Supply via weekly cycle counts."
    },
    {
      "duty": "Prepares and processes inventory documentation and maintains inventory control via hospital-based computer system."
    },
    {
      "duty": "Maintains Central Supply Par Excellence patient charge system."
    },
    {
      "duty": "Trains staff, as needed, to work with the handheld computer, Par Excellence and to operate the Materials Management computer system."
    },
    {
      "duty": "Ensures warehouse cleanliness."
    },
    {
      "duty": "Answers telephones and gives information to callers or routes as appropriate."
    },
    {
      "duty": "Promotes and applies teamwork skills at all times."
    },
    {
      "duty": "Demonstrates System Values in performance and behavior."
    },
    {
      "duty": "Complies with System policies and procedures."
    },
    {
      "duty": "Other duties as may be assigned."
    }
  ],
  "skills": [
    {
      "skill": "Inventory Control",
      "experience": 1
    },
    {
      "skill": "Supply Chain Management",
      "experience": 1
    },
    {
      "skill": "Documentation Management",
      "experience": 1
    },
    {
      "skill": "Inventory Documentation",
      "experience": 1
    },
    {
      "skill": "Record Keeping",
      "experience": 1
    },
    {
      "skill": "Warehouse Management",
      "experience": 1
    },
    {
      "skill": "Teamwork",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Supply Chain Management, Logistics, or a related field"
    }
  ]
}