{
  "meta": [
    {
      "job_title": "2nd Shift Maintenance Supervisor",
      "job_category": "Maintenance",
      "job_class": "Supervisor",
      "sector": "Engineering",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Electrical Control Systems",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Predictive Maintenance",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Technical Training",
      "experience": 5
    },
    {
      "skill": "Process Optimization",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and troubleshoot problems related to bakery equipment and facility, including electrical controls and related components."
    },
    {
      "duty": "Mentor and support the training needs of a team of skilled mechanics and technicians."
    },
    {
      "duty": "Collaborate with managers to optimize plant efficiency and up-time."
    },
    {
      "duty": "Manage project initiatives and troubleshoot plant issues with staff technicians and contractors."
    },
    {
      "duty": "Improve the predictive and preventative maintenance program and staff skills."
    },
    {
      "duty": "Order spare parts, manage budget, and schedule staff and work to be performed."
    },
    {
      "duty": "Train staff in PLC troubleshooting, mechanical and electrical troubleshooting, maintenance and safety practices."
    },
    {
      "duty": "Responsible for proposing cost estimates for projects, upgrades, and rebuilds."
    },
    {
      "duty": "Adhere to and ensure plant personnel are following all safety and quality rules."
    },
    {
      "duty": "Demonstrate behaviors that reflect the vision and mission of the organization and promote continuous improvement."
    },
    {
      "duty": "Work in a safe manner and promptly report hazards in the work environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Technical Degree, Military Training, or BS Degree in Engineering, or related discipline. Extensive proven experience in the food industry will be considered in lieu of a degree."
    }
  ]
}