{
  "meta": [
    {
      "job_title": "Service Account Leader",
      "job_category": "Service",
      "job_class": "Management",
      "sector": "Management",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HVAC",
      "experience": 3
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive strategies for service customer account Leadership, including Labor and Material growth and execution of the Service business, for the team’s customer base."
    },
    {
      "duty": "Lead and manage the execution of assigned Service business to ensure profitability & productivity of the team. Manages customer relationship development and satisfaction."
    },
    {
      "duty": "Responsible for procuring and maintaining fleet and tools inventory, ensuring consistency of delivery systems through supervision and audits of Technicians and Customer Service Agent."
    },
    {
      "duty": "Reviews and approves all Labor and Material quotations, as well as responsible for budgeting, forecasting, accounts payables/receivables."
    },
    {
      "duty": "Responsible for maintaining appropriate staffing levels, hiring, training, and transitioning new employees. Conducts formal performance reviews, and all related issues. Also accountable for safety performance and program compliance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Technical school training or equivalent experience in HVAC or building controls industry. Diploma in Electronic or Mechanical Systems preferred."
    }
  ]
}