{
  "meta": [
    {
      "job_title": "Junior Marketing Coordinator",
      "job_category": "Marketing",
      "job_class": "Coordinator",
      "sector": "Marketing",
      "salary": 38000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 2
    },
    {
      "skill": "Team Leadership",
      "experience": 2
    },
    {
      "skill": "Market Analysis",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Digital Marketing",
      "experience": 2
    },
    {
      "skill": "Social Media Management",
      "experience": 2
    },
    {
      "skill": "Event Planning",
      "experience": 2
    },
    {
      "skill": "Project Management",
      "experience": 2
    },
    {
      "skill": "Adobe Illustrator",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote healthcare education programs."
    },
    {
      "duty": "Collaborate with Admissions, Business Development, and Academic teams to formulate and execute compelling marketing strategies that align with institutional goals."
    },
    {
      "duty": "Analyze market trends and propose modifications to marketing strategies based on insights gathered."
    },
    {
      "duty": "Manage the company's online presence, ensuring uniformity with associated brands, and executing digital marketing campaigns."
    },
    {
      "duty": "Coordinate and execute special events, business meetings, and B2B trade exhibitions as part of marketing strategies."
    },
    {
      "duty": "Orchestrate internal communication protocols to encourage efficient cross-departmental cooperation."
    },
    {
      "duty": "Advocate and augment the visibility of Unitek Learning brands across all marketing channels and materials."
    },
    {
      "duty": "Assist in carrying out project schedules, outcomes, and resources, promoting productivity and responsibility."
    },
    {
      "duty": "Carry out comprehensive market research to uncover potential marketing opportunities and strategize media engagement."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate’s degree in Marketing, Communications, or a related field is preferred but not required (Bachelor's/Master's preferred)"
    }
  ]
}