{
  "meta": [
    {
      "job_title": "Manager, Customer Success Renewal Quoting",
      "job_category": "Customer Success",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 115000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Quoting Analyst Management",
      "experience": 5
    },
    {
      "skill": "Customer Success Operations",
      "experience": 5
    },
    {
      "skill": "Contract Creation",
      "experience": 5
    },
    {
      "skill": "Salesforce",
      "experience": 5
    },
    {
      "skill": "Gainsight",
      "experience": 3
    },
    {
      "skill": "NetSuite",
      "experience": 3
    },
    {
      "skill": "Walk-Me",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team responsible for quote creation and revision, ensuring compliance with company policies and achievement of key metrics."
    },
    {
      "duty": "Provide guidance, training, and evaluation of improvement opportunities for Renewal Quoting Analysts, driving effectiveness and process improvements."
    },
    {
      "duty": "Establish relationships with team leads of adjacent functions, defining roles, responsibilities, and accountability to develop and streamline processes."
    },
    {
      "duty": "Assist with special projects related to the renewal quoting process, striving for efficiency and accuracy."
    },
    {
      "duty": "Drive effectiveness to reduce overall time spent on tasks related to renewal quote creation/revision by identifying improvements in quoting processes and tools."
    },
    {
      "duty": "Ensure renewal pricing follows current policies and procedures, including review and accurate inclusion of historical orders and product migrations by customer."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree, or 5+ years' experience in an Operations, Product, or Specialists role within a B2B organization. Experience in Customer Success Operations, Contract Creation or Review, or similar role. Familiarity with Salesforce, Gainsight, NetSuite, and Walk-Me."
    }
  ]
}