{
  "meta": [
    {
      "job_title": "Case Manager",
      "job_category": "Social Services",
      "job_class": "Manager",
      "sector": "Mental Health",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Case Management",
      "experience": 2
    },
    {
      "skill": "Crisis Intervention",
      "experience": 2
    },
    {
      "skill": "Advocacy",
      "experience": 2
    },
    {
      "skill": "Training",
      "experience": 2
    },
    {
      "skill": "Care Coordination",
      "experience": 2
    },
    {
      "skill": "Clinical Documentation",
      "experience": 2
    },
    {
      "skill": "Client Assessment",
      "experience": 2
    },
    {
      "skill": "Community Resource Assessment",
      "experience": 2
    },
    {
      "skill": "Service Coordination",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Complete screenings and assessments for various populations to provide linkage and referrals to mental health services."
    },
    {
      "duty": "Conduct specialized case management, crisis intervention, advocacy, and training for clients."
    },
    {
      "duty": "Maintain and update clinical knowledge, complete case documentation, and provide care coordination as needed."
    },
    {
      "duty": "Work cooperatively with other disciplines, agencies, and community providers to ensure timely and accurate service provision."
    },
    {
      "duty": "Participate in staff meetings, in-service trainings, and supervision with Clinical Supervisor."
    },
    {
      "duty": "Serves on mental health or community-based committees, assist in measuring the effectiveness of interventions, and participate in peer-driven training of new staff."
    },
    {
      "duty": "Develop effective relationships with service providers, serve on committees, and assist in the measurement of intervention effectiveness."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Psychology, Social Work, Special Education, Counseling, or related field (Master’s preferred)"
    },
    {
      "credential": "Ability to meet credentialing and privileging guidelines"
    },
    {
      "credential": "Possession of a valid driver’s license and operable, insured automobile for authorized travel"
    }
  ]
}