{
  "meta": [
    {
      "job_title": "Account Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Facilitate customer/vendor communication and contribute to relationship management for assigned account portfolio including regular phone calls, on-site visits, site alert notification, and email correspondence."
    },
    {
      "duty": "Estimate costs and quotes associated with service pricing and provide pricing estimates for both SSS, subcontractor, and vendor support."
    },
    {
      "duty": "Conduct review of contractual requirements to ascertain whether services are in/out of contract scope."
    },
    {
      "duty": "Design internal reporting formats and tools for use by office-based and field-based staff."
    },
    {
      "duty": "Contribute to business development activities for add-on scope, extra work, and request for proposal responses (preparation of financial commitments at delegation threshold)."
    },
    {
      "duty": "Coordinate support across field teams, office personnel, and customers to ensure SSS provides the best solutions possible."
    },
    {
      "duty": "Manage, review, analyze, and produce reports for work order tickets; crew work activities; site performance; customer reporting deliverables; and executive-level reporting."
    },
    {
      "duty": "Provide input to training materials and procedures related to Account Management."
    },
    {
      "duty": "Perform other duties as assigned, including back-up support to Account Managers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS or 3-5 years of work experience in related field"
    }
  ]
}