{
  "meta": [
    {
      "job_title": "Vice President, Risk Management",
      "job_category": "Management",
      "job_class": "Vice President",
      "sector": "Finance",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Cybersecurity",
      "experience": 5
    },
    {
      "skill": "Compliance Regulations",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Vendor Risk Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute strategic initiatives to protect Firm and client data sent to third-party service providers and ensure vendors meet Firm risk policies and standards."
    },
    {
      "duty": "Facilitate onboarding of new third-party relationships for Wealth Management."
    },
    {
      "duty": "Identify, develop, and drive implementation of risk measurement techniques and capabilities, including key risk indicators, thresholds, and triggers for response and mitigation."
    },
    {
      "duty": "Assess existing and emerging third-party risks in a rapidly evolving threat environment."
    },
    {
      "duty": "Lead the program to review asset managers and various referral products from an information security perspective to ensure appropriate safeguards are in place to protect Firm and client data."
    },
    {
      "duty": "Review current vendor risk processes and procedures for continuous improvements to reduce risks and increase control efficiencies."
    },
    {
      "duty": "Lead incident response efforts related to vendor incidents, such as data breaches or service outages."
    },
    {
      "duty": "Regularly interact with subject matter experts and senior management to collect and validate inputs for third-party risk initiatives."
    },
    {
      "duty": "Provide status reports and presentations to senior management, auditors, and regulators."
    },
    {
      "duty": "Perform ad hoc analyses and participate in special projects as needed by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 0,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Risk Management, Business, or a related field (Master's preferred)"
    }
  ]
}