{
  "meta": [
    {
      "job_title": "Foundation Database Coordinator",
      "job_category": "Database Administration",
      "job_class": "Coordinator",
      "sector": "Management",
      "salary": 65000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Primary support for Raiser’s Edge (RE) donor database and support to regional fundraising teams in all matters of development related to the database."
    },
    {
      "duty": "Manages the daily operations and maintenance of the Raiser’s Edge database management system."
    },
    {
      "duty": "Maintain and modify data entry procedures to ensure data quality and keep data as current as possible."
    },
    {
      "duty": "Design complex queries, import and export data, create and run reports, and exhibit excellent Excel data manipulation skills."
    },
    {
      "duty": "Investigates and resolves matters of significance on behalf of management with respect to the Foundation system-wide database."
    },
    {
      "duty": "Responsible for training staff in the use of Raiser’s Edge and other fundraising software programs."
    },
    {
      "duty": "Responsible for special projects, organizes and follows through to completion as requested."
    },
    {
      "duty": "Provides expert advice and serves as the subject matter expert for the Foundation Database system wide."
    },
    {
      "duty": "Assist with donor census and wealth screening processes."
    },
    {
      "duty": "Assist with creation, review, and analysis of portfolios and related metrics and dashboards."
    },
    {
      "duty": "Prepare and reconcile annual donor recognition levels and assist with donor wall updates, including planned giving commitment donors."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High school education required. Two-Year College degree or comparable work experience in accounting and/or database management required. Bachelor’s Degree preferred."
    }
  ]
}