{
  "meta": [
    {
      "job_title": "Medical Supervisor",
      "job_category": "Healthcare",
      "job_class": "Supervisor",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for evaluating donor suitability for automated pheresis procedures and administering approved immunizations. Providing limited emergency medical care to donors and staff, including the administration of medication or treatments in accordance with licensure or certification."
    },
    {
      "duty": "Conducting confidential and effective interviews with donors to obtain necessary information regarding suitability to donate plasma."
    },
    {
      "duty": "Assessing results of donor screening and laboratory tests to determine initial and continuing donor suitability, and notifying and counseling donors regarding reactive test results."
    },
    {
      "duty": "Referring donors to community facilities for follow-up and counseling, and explaining informed consent to applicant donors, including potential hazards and response."
    },
    {
      "duty": "Managing employee hepatitis B and influenza immunization program, including administration of immunizations, and overseeing donor immunization programs."
    },
    {
      "duty": "Ensuring accurate recording of donor data in the electronic donor information management system and maintaining a clean, efficient work environment."
    },
    {
      "duty": "Following all Health Safety & Environmental (HSE) and Occupational Safety and Health Administration (OSHA) policies and procedures, as well as promoting safety in all actions."
    },
    {
      "duty": "Conducting routine audits of internal procedures and documentation, maintaining confidentiality of all personnel, donor, and center information, and performing other job-related duties as assigned."
    },
    {
      "duty": "May be cross-trained in other areas to meet the needs of the business, and bilingual skills may be required, at the discretion of the organization, to meet the needs of the business."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 155
    }
  ],
  "education_certification": [
    {
      "credential": "Active state licensure from a paramedic, nursing, physician assistant, chiropractic, naturopathic training program or medical school required OR Completion of a foreign allopathic or osteopathic medical school and only if also currently licensed as a physician or certified as an EMT in the state."
    },
    {
      "credential": "Minimum of one (1) year experience in a health care environment or one year of clinical experience from a vocational or nursing institution."
    },
    {
      "credential": "Experience in a plasma or whole blood collection center or other regulated environment preferred."
    },
    {
      "credential": "Ability to make and analyze a physical assessment of heart, lung sounds, signs of drug use, etc."
    },
    {
      "credential": "Ability to instruct donors, staff, and community regarding the benefit of plasma donation programs."
    },
    {
      "credential": "Different qualifications or responsibilities may apply based on local legal and/or educational requirements. Refer to local job documentation where applicable."
    }
  ]
}