{
  "meta": [
    {
      "job_title": "Tool & Die Repair",
      "job_category": "Manufacturing",
      "job_class": "Repair",
      "sector": "Manufacturing",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain daily maintenance, upkeep, and repair of all dies for a safe, clean, productive, and economical operation that fully supports press production."
    },
    {
      "duty": "Repair, maintenance, and troubleshooting of dies."
    },
    {
      "duty": "Work as a team with the production department on all tooling issues."
    },
    {
      "duty": "Study blueprints, sketches, models, or specifications to plan the sequence of operations for fabricating tools, dies, or assemblies."
    },
    {
      "duty": "Use measuring instruments to conform to specifications such as calipers, gauge blocks, micrometers, and dial indicators to verify dimensions, alignments, and clearances of finished parts."
    },
    {
      "duty": "Set up and operate lathes, milling machines, and bench grinders to cut, bore, grind, and shape parts to specific dimensions."
    },
    {
      "duty": "File, grind, shim, and adjust parts for proper fit."
    },
    {
      "duty": "Experience working with large progressive, transfer, and deep draw dies."
    },
    {
      "duty": "Cut, shape, and trim blanks or blocks to specified lengths or shapes using power and hand tools."
    },
    {
      "duty": "Rework damaged components in a timely manner."
    },
    {
      "duty": "Capable of interacting with fellow team members in a professional manner."
    },
    {
      "duty": "Troubleshoot problems to determine solutions."
    },
    {
      "duty": "Maintain a clean and safe workplace."
    },
    {
      "duty": "Consistently exhibit appropriate attendance habits, working the hours necessary to perform the job."
    },
    {
      "duty": "Organize and maintain efficiency of personal work area."
    },
    {
      "duty": "Provide necessary, accurate, and timely feedback of all pertinent information to co-workers and management."
    },
    {
      "duty": "Effectively communicate with co-workers and management personnel to enhance teamwork and communication initiatives."
    },
    {
      "duty": "Consistently adhere to and support company policies and procedures, including ISO14001, IATF16949, and safety regulations."
    },
    {
      "duty": "Accept instructions and duties in a positive manner."
    },
    {
      "duty": "Treat all co-workers with dignity and respect."
    },
    {
      "duty": "Actively support the E&E values."
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED. Tool and Die apprenticeship or journeyman status. Minimum three (3) years tool and die experience. High-strength steel knowledge and background."
    }
  ]
}