{
  "meta": [
    {
      "job_title": "Interventional Radiology Technologist",
      "job_category": "Medical",
      "job_class": "Technologist",
      "sector": "Healthcare",
      "salary": 59000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Radiologic Technology",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Cardiac Catheterization",
      "experience": 5
    },
    {
      "skill": "Radiation Protection",
      "experience": 5
    },
    {
      "skill": "Medical Imaging",
      "experience": 5
    },
    {
      "skill": "Radiation Safety",
      "experience": 5
    },
    {
      "skill": "PACS/RIS Knowledge",
      "experience": 5
    },
    {
      "skill": "BLS Certification",
      "experience": 5
    },
    {
      "skill": "ACLS Certification",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides patient services using imaging modalities; performs examinations, assists in procedures; applies principles of radiation protection; evaluates images for technical quality; recognizes patient conditions requiring immediate action and initiates life support measures; maintains knowledge of current/developing technology."
    },
    {
      "duty": "Conducts examinations for diagnostic interpretation, evaluates procedures, and makes recommendations for improvement. Integrates previous imaging studies, laboratory results, patient history and medical records to optimize exam."
    },
    {
      "duty": "Administers ionizing radiation for diagnostic and therapeutic purposes. Performs angiographic and cardiac catheterization procedures."
    },
    {
      "duty": "Administers contrast agents as required by specified procedures under the direction of a qualified physician."
    },
    {
      "duty": "Prepare supplies and equip exam room to meet the needs of requested examinations and to meet specific physician requirements for procedures."
    },
    {
      "duty": "Perform most appropriate examination based on patient information through consultation with interpreting physician and/or ordering physician as necessary."
    },
    {
      "duty": "Provide patient education and instruction prior to and after examination. Provide training/education to staff & students as indicated."
    },
    {
      "duty": "Applies ALARA principle to ensure appropriate radiation safety for self, staff and patient. Evaluates patient for pregnancy prior to exam as indicated."
    },
    {
      "duty": "Perform surgical x-ray examinations utilizing appropriate radiation safety measures and adhering to AORN standards."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Graduation from an accredited school of radiologic technology required. Experience in Special Procedures preferred. Experience and demonstrated ability to adapt exam to address problems of patient care as they arise making decisions to appropriately resolve problems. Appropriate knowledge of radiologic principles, physics, anatomy, physiology, positioning and related medical terminology. Demonstrated knowledge of and ability to apply age specific principles of growth and development and life stages to meet each patient's need PACS/RIS knowledge required. ImageCast/CareCast experience preferred ARRT-R certification required. Washington state Radiologic Technologist license required at time of hire. Licensure/Certification/Registration to practice in trained modality as required by the State. Current American Heart Association BLS (Basic Life Support) certification required at date of hire. Current ACLS (Advanced Cardiac Life Support) must be obtained within a standard grace period from hire or transfer, as specified in the PeaceHealth Policy Resuscitation Training Completion Requirements, or upon hire."
    }
  ]
}