{
  "meta": [
    {
      "job_title": "Global Benefits Management Account Manager",
      "job_category": "Account Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support overall delivery services to major multinational clients and play a critical role in growing and retaining Global Benefits Management (GBM) clients."
    },
    {
      "duty": "Contribute to sales pursuit activities and daily client communications regarding services and health consulting as it applies to GBM services."
    },
    {
      "duty": "Act as the liaison between stakeholders and cross-functional consulting teams, deliver GBM services, and achieve successful business outcomes."
    },
    {
      "duty": "Participate in finalist meetings and sales presentations as the GBM Subject Matter Expert."
    },
    {
      "duty": "Handle the implementation of large GBM appointments and ensure local services are delivered in accordance with global mandates."
    },
    {
      "duty": "Monitor employee benefit programs globally and provide aggregated reporting to ensure governance, consistency, and cost-effective solutions."
    },
    {
      "duty": "Execute the business’ ongoing global benefit strategy and global benefit financing strategy."
    },
    {
      "duty": "Design and develop the “GBM Rules of the Road” governance framework and ensure services are in line with it and Service Level Agreements."
    },
    {
      "duty": "Provide ongoing support and coaching to junior GBM team members and local brokerage teams, and contribute to their training and development."
    },
    {
      "duty": "Collaborate with all members of the client team to influence delivery and ensure that all service commitments to the client are met."
    },
    {
      "duty": "Proactively look for process improvements to grow the GBM book and retain GBM clients."
    },
    {
      "duty": "Review and assess escalations and provide resolutions as appropriate, understand and translate analysis to clients and team members, and flag when not in compliance with the client contract."
    },
    {
      "duty": "Responsible for awareness of client profitability and work to increase profitability, as well as develop an area of expertise to serve as a resource for team members."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or foreign equivalent in Business Administration, Management, or a related field plus (5) years of progressive post-baccalaureate experience in the position offered, International Benefits Manager or a related position."
    }
  ]
}