{
  "meta": [
    {
      "job_title": "Senior Internal Auditor",
      "job_category": "Accounting",
      "job_class": "Senior",
      "sector": "Finance",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish, lead and execute complex internal audits across various departments and functions to assess the effectiveness of internal controls, risk management, and compliance with policies, procedures, and regulations."
    },
    {
      "duty": "Plan and coordinate audit engagements, including scoping, risk assessment, audit planning, testing, and reporting."
    },
    {
      "duty": "Perform detailed testing of financial records, operational processes, and internal control systems to identify weaknesses, inefficiencies, and potential areas of improvement."
    },
    {
      "duty": "Review and analyze data, documents, and evidence to draw well-supported conclusions and make recommendations for corrective actions."
    },
    {
      "duty": "Collaborate closely with management to provide actionable recommendations for improving internal controls, operational processes, and risk mitigation strategies."
    },
    {
      "duty": "Prepare comprehensive audit reports that clearly communicate findings, risks, and recommendations to senior management."
    },
    {
      "duty": "Stay up-to-date with industry trends, regulatory changes, and emerging risks to ensure audit methodologies remain current and effective."
    },
    {
      "duty": "Engage in cross-functional initiatives to enhance organizational effectiveness and promote best practices in risk management and internal controls."
    }
  ],
  "skills": [
    {
      "skill": "Internal Audit",
      "experience": 3
    },
    {
      "skill": "Financial Testing",
      "experience": 3
    },
    {
      "skill": "Risk Management",
      "experience": 3
    },
    {
      "skill": "Compliance Evaluation",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Report Preparation",
      "experience": 3
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 3
    },
    {
      "skill": "Cross-functional Collaboration",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting, Finance, Business Administration, or related field. Master's degree or relevant professional certification (e.g., CIA, CPA, CISA) is preferred."
    }
  ]
}