{
  "meta": [
    {
      "job_title": "Customer Care Associate",
      "job_category": "Customer Service",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 45000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain strong and positive relationships with existing customers through effective problem resolution and efficient service delivery."
    },
    {
      "duty": "Serve as single point of contact for key accounts; update job knowledge by participating in trainings, and maintaining professional relationships with the Sales group and other internal departments."
    },
    {
      "duty": "Acts as liaison between the customer, sales, and the company."
    },
    {
      "duty": "Focus on delighting the customer through effective customer service by investigating, analyzing, and resolving outstanding issues to achieve customer satisfaction."
    },
    {
      "duty": "Demonstrate strong problem-solving skills to quickly identify issues and implement solutions."
    },
    {
      "duty": "Handle difficult or unexpected situations."
    },
    {
      "duty": "Gather and analyze customer information skillfully."
    },
    {
      "duty": "Manage multiple projects at a time while paying strict attention to detail."
    },
    {
      "duty": "Receive and maintain high volume of incoming calls and while delivering excellent customer care."
    },
    {
      "duty": "Demonstrate attentiveness, responsiveness and a sense of urgency when dealing with customers."
    },
    {
      "duty": "Respond to internal/external inquiries regarding: order status, quotes, expedites, deliveries, returns, product and warranties, supports accounts end to end."
    },
    {
      "duty": "Keep record of customer interactions, customer issues, expedites, escalations and call logs through the CRM system MS Dynamics and work within SAP to process orders, look up inventory, account information and other account management related tasks."
    },
    {
      "duty": "Resolve problems by identifying the customer's concerns/request; determining the cause of the problem; selecting and explaining the best solution to solve the problem; expediting correction or adjustment; following up to ensure resolution."
    },
    {
      "duty": "Go the extra mile to engage customers and gather accurate information."
    },
    {
      "duty": "Analyze ongoing reports to support the team’s KPIs while proactively resolving issues."
    },
    {
      "duty": "Accept ownership of individual results and meeting call center call quality metrics."
    },
    {
      "duty": "Maintain in-depth working knowledge of systems and processes."
    },
    {
      "duty": "Provide timely feedback to Customer Care Management Team regarding issues being escalated, service failures or customer concerns."
    },
    {
      "duty": "Ensure all processes in department comply with ISO 9001 standards or policies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 20,
      "student_teacher": 40,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Business Administration or a related field preferred. High school diploma or equivalent required."
    }
  ]
}