{
  "meta": [
    {
      "job_title": "Principal Engineer",
      "job_category": "Engineering",
      "job_class": "Principal",
      "sector": "Technology",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 15
    },
    {
      "skill": "Engineering Design",
      "experience": 15
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 15
    },
    {
      "skill": "Materials and Process Research",
      "experience": 15
    },
    {
      "skill": "Leadership and Mentoring",
      "experience": 15
    },
    {
      "skill": "Budget Management",
      "experience": 15
    },
    {
      "skill": "Technical Industry Communication",
      "experience": 15
    },
    {
      "skill": "Quality Management",
      "experience": 15
    },
    {
      "skill": "Semiconductor Industry Knowledge",
      "experience": 15
    },
    {
      "skill": "Lean Manufacturing Principles",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Take ownership of the development and implementation of polyimide flex circuit capabilities, aiming to secure value-add in semiconductor business development and growth."
    },
    {
      "duty": "Lead and mentor a team of engineers and technicians, fostering a collaborative and results-oriented environment."
    },
    {
      "duty": "Collaborate closely with cross-functional teams, including R&D, manufacturing, quality assurance, and supply chain, to ensure seamless integration of new capabilities into our existing processes."
    },
    {
      "duty": "Drive the entire project lifecycle, from initial concept and feasibility studies to design, prototyping, testing, and final production."
    },
    {
      "duty": "Identify and source equipment to support process capabilities."
    },
    {
      "duty": "Conduct thorough research and analysis to identify the most suitable technologies, materials, and processes for polyimide flex circuit manufacturing, balancing cost, quality, and efficiency."
    },
    {
      "duty": "Develop and refine engineering designs, ensuring compliance with industry standards and regulatory requirements."
    },
    {
      "duty": "Plan and execute experiments, perform data analysis, and generate comprehensive reports to guide decision-making and continuous improvement efforts."
    },
    {
      "duty": "Collaborate with external partners, suppliers, and customers to enhance technical capabilities and drive successful project outcomes."
    },
    {
      "duty": "Stay abreast of industry trends, emerging technologies, and best practices, and incorporate them into project planning and execution and growth."
    },
    {
      "duty": "Prepare and manage project budgets."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 170,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Advanced degree in field of specialization, usually at the Ph.D. level, or Bachelor’s degree and 15 or more years of professional experience showing increasing responsibilities. (Ph.D. preferred)"
    }
  ]
}