{
  "meta": [
    {
      "job_title": "Senior Client Relationship Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 225000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement strategies that grow trusted-advisor relationships and facilitate an exceptional client experience."
    },
    {
      "duty": "Serve as the hub of the account team for 1-2 key client accounts, working with the Client Leads to support strategic execution and liaising with the client’s legal operations teams and other key contacts."
    },
    {
      "duty": "Lead and track multiple, complex sets of client relationship activities including RFPs and other new business opportunities, secondments, client events, and custom client marketing efforts."
    },
    {
      "duty": "Collaborate with Client Leads and other team leaders to ensure processes and systems efficiently and effectively deliver an excellent client experience."
    },
    {
      "duty": "Develop and provide regular client relationship reporting focused on key metrics, strategic actions, impact, client satisfaction, etc. for both firm leadership and the client team."
    },
    {
      "duty": "Manage and mentor staff, overseeing personnel issues, workload, and professional development of staff."
    },
    {
      "duty": "Work with finance and pricing teams to understand client requirements, account financial metrics, and pricing arrangements."
    },
    {
      "duty": "Plan and lead recurring internal team meetings, managing agenda preparation and tracking follow-up items."
    },
    {
      "duty": "Develop and maintain onboarding for new attorneys to the client team."
    }
  ],
  "skills": [
    {
      "skill": "Client-first, service-oriented mindset",
      "experience": 10
    },
    {
      "skill": "Strong business/commercial acumen",
      "experience": 10
    },
    {
      "skill": "Excellent judgment",
      "experience": 10
    },
    {
      "skill": "Strong analytical skills",
      "experience": 10
    },
    {
      "skill": "Exceptional organizational and project management skills",
      "experience": 10
    },
    {
      "skill": "Strong communication skills",
      "experience": 10
    },
    {
      "skill": "Self-starter, curious, proactive problem-solver",
      "experience": 10
    },
    {
      "skill": "Strong PowerPoint and Excel skills",
      "experience": 10
    },
    {
      "skill": "Proficient in budgeting, reporting, and application of financial metrics",
      "experience": 10
    },
    {
      "skill": "Operate effectively in a hybrid work environment",
      "experience": 10
    },
    {
      "skill": "Experienced with Salesforce CRM",
      "experience": 10
    },
    {
      "skill": "Financial analysis and pricing skills",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent required. Master’s degree (MBA, MA, MS JD, or other relevant graduate degree) preferred. Minimum of 10 years experience in strategic account management, complex program, and/or direct client service experience in a professional services environment, or similarly relevant business experience is preferred."
    }
  ]
}