{
  "meta": [
    {
      "job_title": "IT Compliance Specialist",
      "job_category": "IT",
      "job_class": "Specialist",
      "sector": "IT",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Cross-Functional Coordination",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "IT Governance",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Participate in the management of compliance projects by monitoring work progress, addressing potential issues, and providing support."
    },
    {
      "duty": "Perform risk evaluations of software solutions based on industry-standard controls and policies."
    },
    {
      "duty": "Analyze compliance documents and report findings."
    },
    {
      "duty": "Communicate compliance requirements."
    },
    {
      "duty": "Monitor and track the Third-Party Vendor Risk Management (TPVRM) program."
    },
    {
      "duty": "Plan, organize, and facilitate cross-functional meetings."
    },
    {
      "duty": "Coordinate with relevant business areas for governance-related matters."
    },
    {
      "duty": "Maintain detailed documentation and records of compliance projects and activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Accredited four (4) year degree or global equivalent in applicable field of study and four (4) years of work-related experience or a combination of education and directly related experience equal to eight (8) years if non-degreed; some locations may have additional or different qualifications in order to comply with local requirements."
    },
    {
      "credential": "Excellent skills in coordination, documentation, and attention to detail."
    },
    {
      "credential": "Self-starter who can work independently, understand assignments, and meet deadlines."
    },
    {
      "credential": "Advanced analytical, problem-solving, and critical thinking skills."
    },
    {
      "credential": "Adaptable and flexible with new situations, people, and changes."
    },
    {
      "credential": "General education and/or knowledge in the field of Information Technology."
    },
    {
      "credential": "Advanced skills with common office tools including Microsoft Office applications (Word, Excel, PowerPoint, Visio), SharePoint, and Teams."
    },
    {
      "credential": "English language written and oral communication skills."
    },
    {
      "credential": "Interpersonal skills to develop and maintain positive relationships with IT staff, internal customers, and auditors."
    },
    {
      "credential": "Proven understanding of best practices in handling confidential information."
    },
    {
      "credential": "Flexibility to adjust work schedule to meet global time zones and deadlines."
    },
    {
      "credential": "Accredited degree or global equivalent in computer science or related technical discipline."
    },
    {
      "credential": "Compliance certificate (CISA, CRISC, or equivalent)."
    },
    {
      "credential": "Previous experience as a compliance specialist or similar position."
    },
    {
      "credential": "Knowledge and experience with governance, audit, and compliance."
    },
    {
      "credential": "Understanding of regulatory requirements including Sarbanes-Oxley and global privacy regulations."
    }
  ]
}