{
  "meta": [
    {
      "job_title": "Investment Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Investment Management",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Investment Management",
      "experience": 3
    },
    {
      "skill": "Portfolio Management",
      "experience": 3
    },
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Client Relationship Management",
      "experience": 2
    },
    {
      "skill": "Research and Analytical Skills",
      "experience": 3
    },
    {
      "skill": "Performance Reporting",
      "experience": 2
    },
    {
      "skill": "Auditing",
      "experience": 2
    },
    {
      "skill": "CFA Program",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Utilize proprietary investment management software to generate customized daily reports used to implement Overlay Services and LDI."
    },
    {
      "duty": "Review various data feeds and activity within client portfolios, acting as the first line of defense to ensure daily reporting accuracy for use within the portfolio management process."
    },
    {
      "duty": "Assist in the production of client-requested research projects in coordination with portfolio managers and a dedicated research team."
    },
    {
      "duty": "Responsible for the creation and accuracy of customized client performance summaries and assists in external performance reviews with clients."
    },
    {
      "duty": "Contribute and adopt ideas to improve efficiency, reduce risk, and enhance the client experience."
    },
    {
      "duty": "Conduct audits on client accounts across the firm to reduce firm risk and develop professional knowledge."
    },
    {
      "duty": "Uphold firm reputation through professionalism, accuracy, responsiveness, and commitment to client service."
    },
    {
      "duty": "Undertake additional professional development such as the CFA program."
    },
    {
      "duty": "Assume other responsibilities as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree Strong interest building a career in Investment Management, working with institutional investment portfolios"
    }
  ]
}