{
  "meta": [
    {
      "job_title": "Operations Team Leader - Night Shift",
      "job_category": "Operations",
      "job_class": "Team Leader",
      "sector": "Operations",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 2
    },
    {
      "skill": "Performance Analysis",
      "experience": 2
    },
    {
      "skill": "Statistical Process Control",
      "experience": 2
    },
    {
      "skill": "Coaching",
      "experience": 2
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 2
    },
    {
      "skill": "Reliability Engineering",
      "experience": 2
    },
    {
      "skill": "Operations Management",
      "experience": 2
    },
    {
      "skill": "Training and Development",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the primary support for the implementation, development, and coaching of the Operation Technicians and Operation team in an effective, value-driven, performance-based environment."
    },
    {
      "duty": "Lead the Operation team to adhere to FP&R (Factory Performance & Reliability) practices and principles to achieve key performance indicators, daily performance goals, and coordinate activity between shifts and departments."
    },
    {
      "duty": "Coordinate the activity of Operation team members, gather data, identify daily strategies that will maximize quality and productivity, and facilitate troubleshooting production issues."
    },
    {
      "duty": "Direct and coordinate the activities of Operation Technicians engaged in the production to increase innovation, technical expertise, analysis, and problem-solving skills."
    },
    {
      "duty": "Establish and maintain effective Key Performance Indicator (KPI) measurement for the plant, tracking and reporting tools, and establish corrective action for continuous improvement."
    },
    {
      "duty": "Establish work schedules, assignments, and production sequences to meet production goals and responsible for data entry into Kronos for vacation, PTO, floating holiday, overtime, and attendance."
    },
    {
      "duty": "Confer with other supervisors to coordinate operations and activities within or between departments and conduct or coordinate Technician training in equipment operations, GMPs, Quality, sanitation, maintenance, productivity or work and safety procedures."
    },
    {
      "duty": "Interpret specifications, job orders, and company policies and procedures for workers and empower teams by way of training, information sharing, coaching, feedback, appraisals, and delegation, to ensure the development of people, skills, teams, and organizational capabilities."
    },
    {
      "duty": "Support the implementation of Quality Assurance and Food Safety initiatives and ensure personnel adhere to Hill’s policies, safety standards, and Good Manufacturing Practices, including Quality Assurance and Food Safety."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Engineering, Supply Chain Management, or Business related field"
    }
  ]
}