{
  "meta": [
    {
      "job_title": "Senior Java Application Developer",
      "job_category": "Software Engineering",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Translate business and technical requirements into solution designs that satisfy the business needs and comply with approved standards."
    },
    {
      "duty": "Ensure development activities are aligned with scope, schedule, priority, and business objectives. Develop and enhance application code, including unit testing to ensure all the functions are performing to specification."
    },
    {
      "duty": "Lead validation efforts by performing and/or assisting others in validating the solution performs as expected, including system integration testing, performance testing, regression testing, and user acceptance testing and defect remediation."
    },
    {
      "duty": "Successfully deploy the new or enhanced software, ensuring user acceptance is strong and functionality is suitable. Also responsible for a smooth transition of the product to the maintenance and enhancement team ensuring complete documentation and communication occurs at transition."
    },
    {
      "duty": "Ensure compliance with applicable federal, state, and local laws and regulations. Complete all required compliance training. Maintain knowledge of and adhere to internal compliance policies and procedures. Take responsibility to keep up to date with changing regulations and policies."
    },
    {
      "duty": "Foster relationships with peers on other teams and work with an existing code from continuous enhancements to occasional troubleshooting."
    }
  ],
  "skills": [
    {
      "skill": "Java Development",
      "experience": 7
    },
    {
      "skill": "Spring Framework",
      "experience": 5
    },
    {
      "skill": "RESTful Integrations",
      "experience": 3
    },
    {
      "skill": "MuleSoft",
      "experience": 3
    },
    {
      "skill": "Agile",
      "experience": 3
    },
    {
      "skill": "SQL and PL/SQL",
      "experience": 3
    },
    {
      "skill": "Technical Writing",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Customer Requirement Interpretation",
      "experience": 3
    },
    {
      "skill": "Version Control",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Adaptability",
      "experience": 3
    },
    {
      "skill": "Cross-functional Coordination",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Computer Science, Business, Engineering, Math or other related field"
    }
  ]
}