{
  "meta": [
    {
      "job_title": "Natural Gas Systems Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Engineering",
      "experience": 3
    },
    {
      "skill": "Gas Engine Knowledge",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Programs",
      "experience": 3
    },
    {
      "skill": "Engineering CAD programs",
      "experience": 3
    },
    {
      "skill": "ASME and CSA Design Standards",
      "experience": 3
    },
    {
      "skill": "Exhaust Emissions Control",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design systems and apply technologies to collaborate with existing engine applications to meet performance targets or retrofit requirements."
    },
    {
      "duty": "Identify design constraints and interpret design specifications."
    },
    {
      "duty": "Perform design and process calculations to develop solutions."
    },
    {
      "duty": "Create Bill of Materials."
    },
    {
      "duty": "Work cooperatively with drafting resources to produce drawing packages and project documentation."
    },
    {
      "duty": "Conduct and support internal/external design reviews and engineering review meetings."
    },
    {
      "duty": "Communicate regularly with project teams to develop and maintain project scope, schedules, and budget."
    },
    {
      "duty": "Provide engineering information and technical advice to customers and internal departments."
    },
    {
      "duty": "Support development and maintenance of internal processes and standard methodologies."
    },
    {
      "duty": "Supervise the work of internal and/or contracted external resources."
    },
    {
      "duty": "Ensure compliance with regional laws and regulations."
    },
    {
      "duty": "Review orders and quotations to verify compliance from a technical, safety, and regulatory viewpoint."
    },
    {
      "duty": "Provide technical support to manufacturing, supply chain, suppliers, and customer technical support department."
    },
    {
      "duty": "Represent Siemens Energy in front of customers and conferences."
    },
    {
      "duty": "Travel to visit clients and suppliers as required."
    },
    {
      "duty": "Support site visits to assess as-built configurations and ancillary systems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree (B.S) in Mechanical or equivalent (Master's preferred)"
    }
  ]
}