{
  "meta": [
    {
      "job_title": "Fleet Manager",
      "job_category": "Supply Chain",
      "job_class": "Manager",
      "sector": "Supply Chain",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "DOT Compliance",
      "experience": 3
    },
    {
      "skill": "Fleet Management",
      "experience": 5
    },
    {
      "skill": "Logistics",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Driver Qualification",
      "experience": 3
    },
    {
      "skill": "Vehicle Inventory Control",
      "experience": 5
    },
    {
      "skill": "Safety Performance Management",
      "experience": 5
    },
    {
      "skill": "Supply Chain Audit",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the US and Canadian AGI fleet of vehicles and drivers, ensuring adherence to the Department of Transportation regulations at the state, province, and federal level."
    },
    {
      "duty": "Work with fleet companies to ensure advantageous contracts for all of our locations, including negotiations of pricing and terms."
    },
    {
      "duty": "Maintain an inventory of vehicles in the facilities as well as over the road."
    },
    {
      "duty": "Oversee protocols like physical exams, drug testing, hours tracking, permitting, and licensing."
    },
    {
      "duty": "Coordinate logging procedures for drive time, maintenance schedules for the vehicles, and will lead and assist in an annual audit of the entire DOT/CTA operation."
    },
    {
      "duty": "Report directly to the VP of Supply Chain and work closely with the HR and Safety staff across North America to facilitate training for compliance with DOT/CTA regulations."
    },
    {
      "duty": "Ensure DOT complianceWork closely with leasing companies to negotiate contracts for road vehicles and manufacturing facility vehicles.Keep inventory control over these vehicles and the locations that they reside in."
    },
    {
      "duty": "Be up to speed on local regulations governing fleet management."
    },
    {
      "duty": "Review driver applications and complete driver qualification paperworkEnsure scheduling of appropriate drug tests, physicals, and other pre-employment activities (DOT/CTA and/or non-DOT/CTA) for drivers."
    },
    {
      "duty": "Verify compliance with FMCSR as it relates to driver qualification filesAudit driver qualification files on a consistent basis to verify DOT/CTA compliance with Driver's Physicals, Certification of Violations, Annual Reviews, etc."
    },
    {
      "duty": "Monitor and audit Records of Duty Status (aka log sheets), including Electronic Logging Devices (ELD).In collaboration with HR, perform DOT/CTA driver on-boarding and orientation and ensure compliance with current standards."
    },
    {
      "duty": "Verify all driver and equipment databases are updated and maintainedReview and update all vehicle and trailer inspection files ensuring all are current."
    },
    {
      "duty": "Renew, update, and maintain all titles and annual registrations. Notify insurance broker of changes/additions to AGI fleet vehicles/drivers, and send insurance cards to employees, as needed."
    },
    {
      "duty": "Complete annual Motor Vehicle Reports for all authorized drivers, and facilitate any required trainingCompile all IFTA information for the fleet and file quarterlyApply for trip permits when requiredPurchase new vehicles and assure vehicles have the appropriate signage (door logos, VIN, DOT/CTA)Record and maintain Incident Report records in the DOT/CTA Accident Register and provide regular reporting on compliance and significant events.Manage safety performance across AGI’s US and Canada fleet drivers and vehicles.Perform additional related duties as assigned or requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Human Resources, Safety Science, Engineering, or related field or equivalent combination of certifications, education, and experience."
    }
  ]
}