{
  "meta": [
    {
      "job_title": "Billing Representative I",
      "job_category": "Healthcare",
      "job_class": "Representative",
      "sector": "Healthcare",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Submits claims, follows-up on unpaid balances (insurance or patient), corrects errors, enters claim information, submits authorization/precertification requests with insurance companies, follows up on denied claims and/or authorizations, and submits appeals as necessary."
    },
    {
      "duty": "Assists with other related tasks including medical record requests, reviewing accounts, and billing projects as a part of the revenue cycle team."
    },
    {
      "duty": "Perform billing tasks assigned by management which may include data entry, claim review, charge review, accounts receivable follow-up, or other related responsibilities."
    },
    {
      "duty": "Participate in workgroups and meetings. Attend all required training classes. Escalate issues to management as needed."
    },
    {
      "duty": "Communicate with providers, patients, coders, or other responsible persons to ensure that claims are correctly processed by third party payers."
    },
    {
      "duty": "Adhere to general practices and FGP guidelines on compliance issues and patient confidentiality."
    },
    {
      "duty": "Utilize CBO Pathways as guide for determining actions needed to resolve unpaid or incorrectly paid claims and/or for authorizing procedures in assigned workqueue(s) using payer websites, billing system information and training within expected timeframe;Follow workflows provided in training classes and request additional training as needed."
    },
    {
      "duty": "Identify payer, provider credentialing, and/or coding issues and address them with management."
    },
    {
      "duty": "Perform daily tasks in assigned work queues and according to manager assignments."
    }
  ],
  "skills": [
    {
      "skill": "Medical Billing",
      "experience": 3
    },
    {
      "skill": "Accounts Receivable",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 3
    },
    {
      "skill": "Claim Review",
      "experience": 3
    },
    {
      "skill": "Healthcare Billing",
      "experience": 3
    },
    {
      "skill": "Insurance Claims",
      "experience": 3
    },
    {
      "skill": "Medical Terminology",
      "experience": 3
    },
    {
      "skill": "CPT and ICD10",
      "experience": 3
    },
    {
      "skill": "Customer Communication",
      "experience": 3
    },
    {
      "skill": "Confidentiality",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED"
    }
  ]
}