{
  "meta": [
    {
      "job_title": "Commissioning & Qualification Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide engineering support for various areas including media preparation, harvest capture, buffer preparation, clean-in-place systems, and manufacturing support equipment."
    },
    {
      "duty": "Participate in Factory Acceptance Testing (FAT) and Commissioning and Qualification (C&Q) throughout the project lifecycle."
    },
    {
      "duty": "Perform systems and P&ID Walkdowns, commission equipment, and provide Equipment Turnover Packages (ETOPs)."
    },
    {
      "duty": "Spray coverage testing, cleaning verification swabbing, and sample submission practices."
    },
    {
      "duty": "Provide process engineering support for clean water systems, CIP, SIP, and pharmaceutical process equipment."
    },
    {
      "duty": "Write and execute Factory Acceptance Tests (FATs), Commissioning, Installation Qualification (IQ), Operational Qualification (OQ), Performance Qualification (PQ), and cycle development protocols."
    },
    {
      "duty": "Assist the project lead in the delivery and project management processes to complete projects within timeline and budget."
    },
    {
      "duty": "Review and modification of standard operating procedures (SOPs) for various equipment."
    },
    {
      "duty": "Manage project documentation such as protocols, reports, calibration certificates, and process trends."
    }
  ],
  "skills": [
    {
      "skill": "Chemical Engineering",
      "experience": 5
    },
    {
      "skill": "Process Engineering",
      "experience": 5
    },
    {
      "skill": "Equipment Commissioning",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Technical Writing",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree or higher in chemical engineering or a related engineering or scientific discipline, or significant related experience."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ]
}