{
  "meta": [
    {
      "job_title": "Construction Project Executive",
      "job_category": "Construction",
      "job_class": "Executive",
      "sector": "Construction",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 20
    },
    {
      "skill": "Project Management",
      "experience": 20
    },
    {
      "skill": "Leadership",
      "experience": 20
    },
    {
      "skill": "Communication Skills",
      "experience": 20
    },
    {
      "skill": "Risk Management",
      "experience": 20
    },
    {
      "skill": "Contract Management",
      "experience": 20
    },
    {
      "skill": "Budget Management",
      "experience": 20
    },
    {
      "skill": "Program Management",
      "experience": 20
    },
    {
      "skill": "Team Leadership",
      "experience": 20
    },
    {
      "skill": "Mentoring",
      "experience": 20
    },
    {
      "skill": "Construction Industry Software",
      "experience": 20
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and drive larger and more sophisticated construction projects, ensuring overall project performance."
    },
    {
      "duty": "Organize program development effort, management plan, and monitor progress against the plan."
    },
    {
      "duty": "Identify and address deviations from the plan, adhering to standardized procedures and processes."
    },
    {
      "duty": "Represent company and ensure customer satisfaction, as well as adherence to safety policies."
    },
    {
      "duty": "Provide primary leadership for the overall program and associated Project Delivery Teams."
    },
    {
      "duty": "Work with Project Sponsors, Business Development, and Project Delivery Teams to identify and deliver program objectives."
    },
    {
      "duty": "Handle risks and establish project recovery plans, as well as mentor project teams and assess training needs."
    },
    {
      "duty": "Ensure accurate and timely reporting of assigned projects, making presentations to Executive Management."
    },
    {
      "duty": "Maintain relationships with subcontractors, coordinate program asset management, and deepen client relationships."
    },
    {
      "duty": "Seek and capitalize upon opportunities to increase customer satisfaction."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Construction, Civil, Mechanical, Electrical Engineering, Construction Management, or Architecture (Master’s degree preferred)"
    },
    {
      "credential": "Certification as a PMI Project Management Professional (PMP) is highly preferred."
    }
  ]
}