{
  "meta": [
    {
      "job_title": "Systems Engineering Director",
      "job_category": "Engineering",
      "job_class": "Director",
      "sector": "Software Engineering",
      "salary": 300000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Security Platform",
      "experience": 8
    },
    {
      "skill": "Application Architecture",
      "experience": 8
    },
    {
      "skill": "Sales",
      "experience": 8
    },
    {
      "skill": "Team Management",
      "experience": 8
    },
    {
      "skill": "Business Skills",
      "experience": 8
    },
    {
      "skill": "Challenger Sales",
      "experience": 8
    },
    {
      "skill": "Industry Knowledge",
      "experience": 8
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 8
    },
    {
      "skill": "Strategic Thinking",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Travel",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of Systems Engineering Managers and provide support to Systems Engineers in generating growth within Major Accounts."
    },
    {
      "duty": "Oversee technical pre-sales operations and achieve revenue generation and organizational quotas."
    },
    {
      "duty": "Interact at a senior level with customers and partners, providing valuable insight into industry trends, customer challenges, and technical evolutions."
    },
    {
      "duty": "Develop and execute outcome-oriented Systems Engineering initiatives that drive pipeline and sales within the Area."
    },
    {
      "duty": "Maintain strong relationships with Palo Alto Networks' partners and lead portfolio expansion initiatives."
    },
    {
      "duty": "Ensure effective account planning is executed across the teams to deliver compelling business-focused solutions that address customers' security needs."
    },
    {
      "duty": "Provide account support through SE assignments, load balancing, continuity, strategic planning with Sales management, Sales Reps, and SEs, and customer meetings."
    },
    {
      "duty": "Operate effectively in a matrix manner with extended teams such as Support, Finance, and Product Management."
    },
    {
      "duty": "Act as an escalation point for pre-sales and post-sales technical issues in the territory."
    },
    {
      "duty": "Develop, mentor, manage, and support reporting sales engineers with technical and organizational leadership."
    },
    {
      "duty": "Manage successful evaluations and timely return of evaluation equipment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "A minimum combination of 8 years of first and/or second line, Systems Engineering management experience preferred. Bachelor's degree in Engineering or a related field (Master's preferred)"
    }
  ]
}