{
  "meta": [
    {
      "job_title": "Commissioning & Qualification Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide engineering support for various areas including media preparation, harvest capture, and clarification, buffer preparation, clean-in-place systems, and manufacturing support equipment."
    },
    {
      "duty": "Perform systems and P&ID Walkdowns, commission equipment, and provide Equipment Turnover Packages (ETOPs)."
    },
    {
      "duty": "Spray coverage testing, cleaning verification swabbing, and sample submission practices."
    },
    {
      "duty": "Write and execute Factory Acceptance Tests (FATs), Commissioning, Installation Qualification (IQ), Operational Qualification (OQ), Performance Qualification (PQ), and cycle development protocols including development of final reports."
    },
    {
      "duty": "Assist the project lead in the delivery and project management processes required to complete the project within timeline and budget."
    },
    {
      "duty": "Review and modify standard operating procedures (SOPs) for various equipment."
    },
    {
      "duty": "Document, monitor, and report on project deliverables."
    },
    {
      "duty": "Manage project documentation such as protocols, reports, calibration certificates, and process trends."
    }
  ],
  "skills": [
    {
      "skill": "Chemical Engineering",
      "experience": 5
    },
    {
      "skill": "Process Engineering",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "CIP and SIP",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree or higher in chemical engineering or a related engineering or scientific discipline, or significant related experience"
    }
  ]
}