{
  "meta": [
    {
      "job_title": "Physical Therapist",
      "job_category": "Healthcare",
      "job_class": "Therapist",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Physical Therapy",
      "experience": 0
    },
    {
      "skill": "Medical Assessment",
      "experience": 0
    },
    {
      "skill": "Patient Education",
      "experience": 0
    },
    {
      "skill": "Home Instructions",
      "experience": 0
    },
    {
      "skill": "Discharge Planning",
      "experience": 0
    },
    {
      "skill": "Documentation",
      "experience": 0
    },
    {
      "skill": "Orthopedics",
      "experience": 0
    },
    {
      "skill": "Rehabilitation",
      "experience": 0
    },
    {
      "skill": "Physical Therapy Techniques",
      "experience": 0
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluates and conducts medically prescribed physical therapy treatment programs to treat movement dysfunction and pain resulting from injury, disease, disability, or other health-related conditions."
    },
    {
      "duty": "Performs initial and on-going assessments of patient's condition."
    },
    {
      "duty": "Establishes, revises and evaluates a plan of care which is appropriate to problems identified and involves the patient/family."
    },
    {
      "duty": "Provides education to patient/family /staff by assessing patient/family educational needs."
    },
    {
      "duty": "Participates in discharge planning with patients, families, and other health care providers as appropriate, providing home instructions to patients and caregivers, recommending and or providing equipment/ home modifications, and recommending appropriate follow-up care if needed."
    },
    {
      "duty": "Oversees activities of physical therapy assistants, students, and other support personnel."
    },
    {
      "duty": "Maintains appropriate documentation that details the patient's response to therapy and the need for skilled intervention as outlined by regulatory bodies."
    },
    {
      "duty": "Works in a constant state of alertness and safe manner."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor's, Master's or Doctorate degree in Physical Therapy, or related as required to obtain licensure in the state of practice"
    }
  ]
}