{
  "meta": [
    {
      "job_title": "Junior Business Analyst",
      "job_category": "Business Analyst",
      "job_class": "Junior",
      "sector": "Information Technology",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 2
    },
    {
      "skill": "Microsoft Project",
      "experience": 2
    },
    {
      "skill": "Microsoft Office Applications",
      "experience": 2
    },
    {
      "skill": "Network Engineering",
      "experience": 2
    },
    {
      "skill": "Agile Project Management",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Overseeing and managing the creation, documentation, and approval process for DARPA Visitor Access Requests, ensuring appropriate access to facilities."
    },
    {
      "duty": "Coordinating with Nakupuna Security Team ensuring compliance with company security standards, helping to review and implement security policies and procedures."
    },
    {
      "duty": "Working directly with DARPA Security to ensure security requirements are submitted and confirmed prior to travel."
    },
    {
      "duty": "Supporting the Project Management Team and Lead Technician in establishing and maintaining all contract deliverables, ensuring they remain current and reflect the most recent project updates and processes."
    },
    {
      "duty": "Assisting in the creation and maintenance of a project management plan, including the risk management plan and risk register."
    },
    {
      "duty": "Assisting in updating historical IT asset records and project management files."
    },
    {
      "duty": "Assisting in the establishment of a physical access plan for government facilities, including creating and managing Visitor Access Requests."
    },
    {
      "duty": "Collaborating on the escalation process to address any denials of access entry to government facilities."
    },
    {
      "duty": "Assisting in the preparation of fact-based deliverables for senior leaders such as project status updates, briefing slides, and staff packages."
    },
    {
      "duty": "Providing support in staff management activities, ensuring personnel proficiency and appropriate access to facilities."
    },
    {
      "duty": "Assisting in the creation and maintenance of an integrated master schedule to track project progress against baseline plans."
    },
    {
      "duty": "Supporting the identification, analysis, and definition of hardware refresh assets."
    },
    {
      "duty": "Assisting in generating Stakeholder Requests for Information and equipment cost quotes."
    },
    {
      "duty": "Supporting the Government in IT hardware or software asset procurement activities, ensuring security and authenticity."
    },
    {
      "duty": "Assisting in providing inventory and asset management support across different network areas of responsibility."
    },
    {
      "duty": "Collaborating in creating and updating asset inventory reports and network architecture diagrams."
    },
    {
      "duty": "Strong interpersonal skills, adept with strategic planning and management, self-starter, exceptional written and oral communication, strong analytical, critical thinking and problem-solving skills, proficient at multi-tasking, and effective organizational skills. Adept at operating in a fast-paced, ambiguous, and often multi-directional work environments."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from an accredited institution as well as a minimum of 2 years of professional experience. The ideal candidate will have an advanced degree or comparative years of professional experience in project management, or a similar field."
    }
  ]
}