{
  "meta": [
    {
      "job_title": "VP - Digital Product Management",
      "job_category": "Management",
      "job_class": "Executive",
      "sector": "Management",
      "salary": 175000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage multiple, concurrent projects in various phases of ideation, execution, and delivery. Drive the overall product strategy and execution for the insurance and digital product performance analytics for the Bluestream, Marsh’s global cloud-based digital insurance distribution."
    },
    {
      "duty": "Carry out the end-to-end delivery of new features and capabilities to advance the platform’s vision and roadmap. Develop digital products and experiences for clients and customers across a breadth of industries; co-creating and co-innovating."
    },
    {
      "duty": "Handle insurance industry’s transformation driven by advanced digital capabilities and powerful data analytics. Drive the vision, strategy, and product roadmap for the Bluestream platform."
    },
    {
      "duty": "Design and develop best-in-class digital insurance experiences by leading roadmap definition, prioritization, backlog writing and grooming, and owning overall product development from concept to launch."
    },
    {
      "duty": "Use qualitative customer research and data analysis to continuously inform, validate, and refine our product strategy. Enable profitable customer relationships through effective application of the data."
    },
    {
      "duty": "Set the standard for analytics and data management and collaborate with Enterprise Architects, Engineers and business teams to support analytics execution. Partner closely on all aspects of product delivery with product owners, designers, engineers, business development, partner management, operations, marketing, legal, compliance, privacy, finance, and other teams."
    },
    {
      "duty": "Serve as subject matter expert on the platform and industry/competitive landscape."
    }
  ],
  "skills": [
    {
      "skill": "Product Management",
      "experience": 7
    },
    {
      "skill": "Product Analytics",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Insurance Industry Knowledge",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Global Project Management",
      "experience": 7
    },
    {
      "skill": "Stakeholder Collaboration",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 125,
      "student_teacher": 85,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Electronic Engineering, Technology, Computer Science, or a related field (Master's preferred)"
    }
  ]
}