{
  "meta": [
    {
      "job_title": "Senior Technology Manager",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Technology",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technology Evaluation",
      "experience": 5
    },
    {
      "skill": "Licensing Strategies",
      "experience": 5
    },
    {
      "skill": "Intellectual Property Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Biomedical Technology Commercialization",
      "experience": 5
    },
    {
      "skill": "IP Strategy",
      "experience": 5
    },
    {
      "skill": "Early-stage Technology Marketing",
      "experience": 5
    },
    {
      "skill": "Legal Compliance",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluate and manage invention disclosures, develop licensing strategies, and conduct outreach to successfully commercialize University-owned intellectual property."
    },
    {
      "duty": "Maintain a close working relationship with other OTM and campus staff to fulfill federal compliance, IP protection, and related needs."
    },
    {
      "duty": "Develop and manage strong relationships with faculty inventors and corporate representatives to build a pipeline of disclosures and business development opportunities."
    },
    {
      "duty": "Provide specialized advice and counsel on technology commercialization, including disclosing inventions, screening and evaluation, intellectual property, and licensing."
    },
    {
      "duty": "Perform licensing and marketing responsibilities, including evaluating and screening disclosures, identifying and qualifying licensees, and drafting business terms for license agreements."
    },
    {
      "duty": "Develop and deliver an annual Action Plan to maintain effective relationships with inventors and licensees for marketing of technologies."
    },
    {
      "duty": "Train and mentor Associate Technology Managers and other support staff as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in related field. Master's or professional degree strongly preferred. Graduate or undergraduate coursework in intellectual property law, or work experience related to analyzing, securing, and licensing intellectual property."
    }
  ]
}