{
  "meta": [
    {
      "job_title": "Health Care Support Assistant",
      "job_category": "Health Care",
      "job_class": "Support",
      "sector": "Health Care",
      "salary": 32000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs a variety of clerical and health related duties in a health care setting, including checking vital signs and obtaining patient's height and weight."
    },
    {
      "duty": "Prepares and collects specimens for laboratory testing and performs specimen screening and testing."
    },
    {
      "duty": "Performs emergency first aid, prepares patients for examinations, and assists medical providers during examinations."
    },
    {
      "duty": "Maintains and processes patients' charts, documents, and performs clerical duties as assigned."
    },
    {
      "duty": "Answers routine inquiries of patients in-person and via telephone and makes appropriate referrals."
    },
    {
      "duty": "Obtains blood specimens for testing by performing venipuncture and/or fingerstick testing."
    }
  ],
  "skills": [
    {
      "skill": "Phlebotomy",
      "experience": 2
    },
    {
      "skill": "Vital Signs Monitoring",
      "experience": 2
    },
    {
      "skill": "Specimen Collection",
      "experience": 2
    },
    {
      "skill": "Emergency First Aid",
      "experience": 2
    },
    {
      "skill": "Medical Charting",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or its educational equivalent, approved by a State’s Department of Education or a recognized accrediting organization."
    },
    {
      "credential": "Successful completion of a NYS Department of Health prescribed training program for Phlebotomy, satisfactory to the Laboratory Director."
    },
    {
      "credential": "Completion of a health care setting-based training program in the performance of electrocardiographs and basic life support procedures including certification in Cardio-Pulmonary Resuscitation."
    },
    {
      "credential": "Assignment to a long-term care facility requires a New York State Nurse’s Aide Certificate."
    }
  ]
}