{
  "meta": [
    {
      "job_title": "Sr Loan Advisor",
      "job_category": "Banking",
      "job_class": "Advisor",
      "sector": "Sales",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Networking",
      "experience": 3
    },
    {
      "skill": "Referral Sales",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Computer Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Proactively identify, develop, and maintain a quality network of business relationships for new mortgage lending opportunities."
    },
    {
      "duty": "Interview new and existing customers to determine their loan needs and advise on appropriate products, terms, and pricing."
    },
    {
      "duty": "Generate complete mortgage applications and ensure compliance with industry and regulatory guidelines."
    },
    {
      "duty": "Achieve sales and referral goals by providing exceptional customer experience and referring clients to other financial products and services."
    },
    {
      "duty": "Market to and manage referral relationships, and participate in community efforts to promote home ownership."
    },
    {
      "duty": "Provide status updates and assist with the collection of any trailing borrower documentation needed to complete loan processing and closing."
    },
    {
      "duty": "Attend required production meetings and complete all industry-required training."
    },
    {
      "duty": "Ensure compliance with applicable laws, regulations, and internal policies."
    },
    {
      "duty": "Keep up to date with changing regulations and policies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "2+ years of demonstrated networking and/or referral sales experience. Mortgage industry experience preferred. Bachelor's degree in a relevant field preferred."
    }
  ]
}