{
  "meta": [
    {
      "job_title": "RVP/Regional Retirement Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Generate qualified retirement plan sales and maintain small and mid-market customer relationships."
    },
    {
      "duty": "Partner with a local RVP in a geographic territory to engage with the financial professionals, consultants, third party administrators and plan sponsors."
    },
    {
      "duty": "Responsible for achieving an annual plan and asset sales goal."
    },
    {
      "duty": "Manage the Request for Proposal (RFP) process and requests for information."
    },
    {
      "duty": "Analyze customer product needs based upon advisor value proposition, plan sponsor requirements, and employee necessities."
    },
    {
      "duty": "Develop Retirement plan pricing, with responsibility for investment research, fund mapping, service model selections, and underwriting."
    },
    {
      "duty": "Engage in proactive advisor outreach, cultivation of advisor relationships and the facilitation of sales finals to plan sponsors."
    },
    {
      "duty": "Handle post sale facilitation and coordination of sales contract documentation for plan submission and implementation."
    },
    {
      "duty": "Stay up to date on dynamic landscape of group retirement space including legislative changes, new competitor offerings, internal product changes, and changes to the way broker-dealer partners want to do business with Transamerica."
    },
    {
      "duty": "Facilitate campaign marketing/advisor communications via outbound call activity to solicit interest in Transamerica Retirement products and services."
    },
    {
      "duty": "Manage post sale service issues that arise and field service and product inquiries from clients; direct traffic to internal support units to solve issues, which includes frequent communication and setting expectations."
    },
    {
      "duty": "Occasional travel to assigned regions to strengthen relationships, attend regional events, broker-dealer partner meetings, and regional events."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 20,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a business field or equivalent experience"
    },
    {
      "credential": "FINRA Series 6 or 7"
    },
    {
      "credential": "FINRA Series 63"
    },
    {
      "credential": "Applicable State Insurance licenses or obtain within 90 days of hire"
    }
  ]
}