{
  "meta": [
    {
      "job_title": "Senior Marketing Technology Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 160000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Marketing Technology",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Data Management",
      "experience": 8
    },
    {
      "skill": "CRM Management",
      "experience": 8
    },
    {
      "skill": "Email Marketing",
      "experience": 8
    },
    {
      "skill": "SEO",
      "experience": 8
    },
    {
      "skill": "Digital Analytics",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the Firm’s marketing technology stack, including website, CRM, ERM, email marketing automation, experience database and social media."
    },
    {
      "duty": "Collaborate with the senior leadership and IT teams to leverage technology tools to support Firm goals."
    },
    {
      "duty": "Serve as a subject matter expert and counselor to professionals in supporting reputation and relationship building activities."
    },
    {
      "duty": "Develop, deploy, and optimize a data-driven understanding of the client journey to drive decision-making on marketing strategies and tactics."
    },
    {
      "duty": "Identify and leverage digital channels to deliver results against strategic priorities that contribute to developing relationships, building pipelines, and increasing brand strength."
    },
    {
      "duty": "Manage the email marketing function, including identifying enhancements to Pardot and improving email planning and deployment processes."
    },
    {
      "duty": "Track and measure performance, ensuring email campaigns are correctly launched, delivered on time, accurately tracked, and continually improved upon."
    },
    {
      "duty": "Provide subject matter expertise on email marketing operations, best practices, and regulation including CAN-SPAM and online privacy."
    },
    {
      "duty": "Manage the Firm’s website, including maintenance, enhancements, and accuracy of content."
    },
    {
      "duty": "Stay abreast of industry trends and competitors’ sites to identify areas for improvement."
    },
    {
      "duty": "Improve search engine optimization and report on website analytics."
    },
    {
      "duty": "Manage the Firm’s experience and contact databases and ensure the maintenance and integrity of the data."
    },
    {
      "duty": "Work as the project manager to oversee and coordinate with vendors and the IT department on database integrations, upgrades and redesigns and ensure content and functionality updates are deployed accurately."
    },
    {
      "duty": "Collaborate with the Communications team to implement and maintain social and new media initiatives; analyze different platforms for use in the Firm’s marketing strategy."
    },
    {
      "duty": "Work with the Marketing Leadership team to develop relevant KPIs, metrics, dashboards and reporting analytics to measure the effectiveness of the marketing channels/tactics and marketing strategies and influence the content strategy."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in computer science, marketing, business or technical communications preferred."
    },
    {
      "credential": "Eight-10 years of experience in a B2B, professional services or law firm environment executing and/or leading digital marketing programs, with a strong focus on campaign management, personalization, data management, systems integrations and digital analytics."
    },
    {
      "credential": "Strong technical skills in website management, search engine optimization, analytics, social media and CRM systems, as well as experience with e-marketing programs."
    },
    {
      "credential": "Applications and programming knowledge desired: Kentico or similar large-scale CMS tool,marketing automation tools, including Pardot; CRM software including Salesforce, SharePoint, advanced HTML, XML, JavaScript, Flash, WordPress, Dreamweaver, all MS Office products (at east intermediate level)."
    },
    {
      "credential": "Expertise in email best practices, including contact strategies, design, A/B testing, delivery and deliverability issues, segmentation, and analytics/performance management."
    },
    {
      "credential": "Familiarity with spam/email blockers and deliverability testing and troubleshooting tools, SEO concepts and techniques, email campaign procedures, CAN-SPAM regulations, and knowledge of or willingness to learn about state and local bar association rules regarding communications with clients and nonclients."
    },
    {
      "credential": "Exceptional ability to gather and analyze large amounts of research information and then synthesize into concise and meaningful actionable reports and recommendations."
    },
    {
      "credential": "Strong organizational skills and time management skills, with high attention to detail and ability to manage multiple priorities."
    },
    {
      "credential": "Skilled at managing resources, including budgets, talent and third-party suppliers, to effectively achieve marketing goals."
    },
    {
      "credential": "Availability to work in-office three days per week (Tuesday, Wednesday and Thursday) and more as needed; willingness to work overtime and weekends as needed"
    }
  ]
}