{
  "meta": [
    {
      "job_title": "Customer Care Associate",
      "job_category": "Customer Service",
      "job_class": "Associate",
      "sector": "Customer Care",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain strong and positive relationships with existing customers through effective problem resolution and efficient service delivery."
    },
    {
      "duty": "Serve as single point of contact for key accounts; update job knowledge by participating in trainings, and maintaining professional relationships with the Sales group and other internal departments."
    },
    {
      "duty": "Focus on delighting the customer through effective customer service by investigating, analyzing, and resolving outstanding issues to achieve customer satisfaction."
    },
    {
      "duty": "Gather and analyze customer information skillfully."
    },
    {
      "duty": "Receive and maintain high volume of incoming calls and while delivering excellent customer care."
    },
    {
      "duty": "Demonstrates attentiveness, responsiveness and a sense of urgency when dealing with customers."
    },
    {
      "duty": "Keep record of customer interactions, customer issues, expedites, escalations and call logs through the CRM system MS Dynamics and work within SAP to process orders, look up inventory, account information and other account management related tasks."
    },
    {
      "duty": "Resolve problems by identifying the customer's concerns/request; determining the cause of the problem; selecting and explaining the best solution to solve the problem; expediting correction or adjustment; following up to ensure resolution."
    },
    {
      "duty": "Go the extra mile to engage customers and gather accurate information."
    },
    {
      "duty": "Analyze ongoing reports to support the team’s KPIs while proactively resolving issues."
    },
    {
      "duty": "Accepts ownership of individual results and meeting call center call quality metrics."
    },
    {
      "duty": "Maintains in-depth working knowledge of systems and processes."
    },
    {
      "duty": "Provides timely feedback to Customer Care Management Team regarding issues being escalated, service failures or customer concerns."
    },
    {
      "duty": "Ensure all processes in department comply with ISO 9001 standards or policies."
    }
  ],
  "skills": [],
  "subjective_elements": []
}