{
  "meta": [
    {
      "job_title": "Systems Engineering Director",
      "job_category": "Engineering",
      "job_class": "Director",
      "sector": "Software Engineering",
      "salary": 320000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Security Platform",
      "experience": 10
    },
    {
      "skill": "Application Architecture",
      "experience": 10
    },
    {
      "skill": "Sales Management",
      "experience": 10
    },
    {
      "skill": "Technical Expertise",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "Challenger Sales",
      "experience": 10
    },
    {
      "skill": "Business Development",
      "experience": 10
    },
    {
      "skill": "Industry Knowledge",
      "experience": 10
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage Systems Engineering Managers to support Systems Engineers in generating growth within Major Accounts."
    },
    {
      "duty": "Partner with the Regional Vice President of Sales to drive enterprise-wide sales-related initiatives within Major Accounts."
    },
    {
      "duty": "Oversee technical pre-sales operations and achieve revenue generation, individual, team, and organizational quotas."
    },
    {
      "duty": "Interact at a senior level with customers and partners and provide valuable insight into industry trends, customer challenges, technical evolutions, and business changes."
    },
    {
      "duty": "Develop outcome-oriented Systems Engineering initiatives that drive pipeline and sales within the Area."
    },
    {
      "duty": "Develop and maintain strong relationships with Palo Alto Networks’ partners and drive initiatives to improve sales productivity through partner leverage."
    },
    {
      "duty": "Ensure the teams develop deep ongoing relationships across their accounts to drive adoption and growth across the portfolio after the initial sale."
    },
    {
      "duty": "Report and make visible the successes and deficiencies of the initiatives within your area."
    },
    {
      "duty": "Provide account support through SE assignments, load balancing, continuity, strategic planning with Sales management, Sales Reps, and SEs."
    },
    {
      "duty": "Operate effectively in a matrix manner with extended teams, such as Support, Finance, WW SE, HR, Product Management, and other relevant organizations."
    },
    {
      "duty": "Manage successful evaluations and timely return of evaluation equipment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "A minimum combination of 8 years of first and/or second line Systems Engineering management experience. Bachelor’s degree in a relevant field (Master's preferred)."
    }
  ]
}