{
  "meta": [
    {
      "job_title": "Project Leader",
      "job_category": "Project Management",
      "job_class": "Leader",
      "sector": "Management",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, execute, and complete projects with assigned customers in a safe and cost-effective manner."
    },
    {
      "duty": "Performs or delegates tasks required to execute and fully complete projects including hardware design, system programming, installation coordination, and project closeout."
    },
    {
      "duty": "Coordinates communication with the customer during all phases of the project."
    },
    {
      "duty": "Provides work direction to subcontractors, electrical installers, technicians, designers, and administration as necessary."
    },
    {
      "duty": "Ensures work performed is in compliance with legal requirements and operates on the job with the highest of ethics."
    },
    {
      "duty": "Completes typical installation hardware design and software programming using established standards as required."
    },
    {
      "duty": "Evaluates the contractual scope of work and the impact of client-issued bulletins, field directives, and/or scheduling changes."
    },
    {
      "duty": "Manages the selection, ordering, budget, and delivery schedule of materials for the projects assigned. Secures pricing and availability from outside vendors and suppliers."
    },
    {
      "duty": "Oversees subcontractor payment and billing processes."
    },
    {
      "duty": "Ensures installation is in accordance with project requirements, manages and completes the loading, device verification, and commissioning of all system controllers as required."
    },
    {
      "duty": "Manages costs, billings, and collections."
    },
    {
      "duty": "Provides coaching, mentoring, and technical assistance to System Technicians, Electrical Installers, and System Designers."
    },
    {
      "duty": "Provides accurate project as-built and commissioning documentation."
    },
    {
      "duty": "Develops project plans and coordinates the required resources to ensure timely and cost-effective installation and completion of assigned projects."
    },
    {
      "duty": "Performs site-specific training for owner/operator on the total system with assistance."
    },
    {
      "duty": "Develops and maintains viable long-term relationships with contractors, clients, consultants, and subcontractors."
    },
    {
      "duty": "Coordinates with Project Engineers on bundled jobs to deliver cost-efficient solutions that exceed customer expectations."
    },
    {
      "duty": "Follows all safety standards and has the highest regard for employee and subcontractor safety."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Technical Associates Degree with four years of field experience or six years of equivalent related field experience in the industry."
    }
  ]
}