{
  "meta": [
    {
      "job_title": "Lead Principal Engineer Analog Design",
      "job_category": "Engineering",
      "job_class": "Lead Principal Engineer",
      "sector": "Automotive",
      "salary": 225000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Analog Design",
      "experience": 12
    },
    {
      "skill": "Mixed Signal Design",
      "experience": 12
    },
    {
      "skill": "Technical Systems Development",
      "experience": 12
    },
    {
      "skill": "Market Research",
      "experience": 12
    },
    {
      "skill": "Product Development",
      "experience": 12
    },
    {
      "skill": "Quality Improvement",
      "experience": 12
    },
    {
      "skill": "Process Optimization",
      "experience": 12
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, develop, modify, and evaluate analog and mixed signal products and modules, components, or integrated circuitry."
    },
    {
      "duty": "Analyze equipment to establish operating data and conduct experimental tests, applying pre-silicon verification and post-silicon validation methods."
    },
    {
      "duty": "Select components and equipment based on analysis of specifications and reliability, as well as review vendor capabilities to support product development."
    },
    {
      "duty": "Develop new and/or enhance existing technical systems (whole systems, parts, components) including software and/or hardware as well as various products."
    },
    {
      "duty": "Responsible for development planning and strategy in close collaboration with other functions (e.g. marketing, operations), and development of generic and market-oriented products."
    },
    {
      "duty": "Ensure developments are based on state-of-the-art research and technology, and apply research based on scientific methods for quality improvement, process optimization, new products, or business areas."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "A 4-year completed study with a particularly extensive subject-specific additional qualification or a relevant completed study with 4+ years to acquire the total knowledge and skills."
    }
  ]
}