{
  "meta": [
    {
      "job_title": "Clinical Resource Director",
      "job_category": "Healthcare",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Value Analysis",
      "experience": 5
    },
    {
      "skill": "Clinical Supply Chain Performance",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Microsoft Word, Excel and PowerPoint",
      "experience": 5
    },
    {
      "skill": "Certified Materials and Resource Professional (CMRP)",
      "experience": 5
    },
    {
      "skill": "Certified Value Analysis Health Professional (CVAHP)",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops and implements facility or division-based strategies or processes to reduce supply expense."
    },
    {
      "duty": "Identifies and implements supply expense margin improvement."
    },
    {
      "duty": "Identifies facility supply expense variances and develops action plans to mitigate supply expense increases."
    },
    {
      "duty": "Collaborates with development team and supply chain team in completion of tasks related to DeNovo, acquisition, and OR Refresh projects."
    },
    {
      "duty": "Performs ongoing mining of expense and purchase history data to identify contracting and expense opportunities."
    },
    {
      "duty": "Review of capital equipment requests to insure accurate pricing and contract terms."
    },
    {
      "duty": "Develops and maintains spreadsheets and database tools to analyze supply expense and process improvement initiatives; and documents savings achieved through the value analysis process."
    },
    {
      "duty": "Develops content for center site visits to include reviewing products and technology for clinical evidence and benefit; understanding financial considerations to include contract compliance, cost and reimbursement; identifying opportunities to standardize products and reduce waste; and maintain or increase product quality and patient outcomes."
    },
    {
      "duty": "Identifies and communicates alternative products during product recalls or backorders."
    },
    {
      "duty": "Builds relationships and increases customer satisfaction with division leadership, supply chain leadership, administrators, and physicians."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Nursing or a graduate of a Professional School of Nursing (Associate Degree or Diploma) with related experiences in healthcare value analysis or clinical supply chain performance, required"
    }
  ]
}