{
  "meta": [
    {
      "job_title": "Employee Relations Consultant",
      "job_category": "Human Resources",
      "job_class": "Consultant",
      "sector": "Human Resources",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Employee Relations",
      "experience": 3
    },
    {
      "skill": "Labor Relations",
      "experience": 3
    },
    {
      "skill": "HR Certification",
      "experience": 2
    },
    {
      "skill": "Investigation",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide Employee Relations support to leaders and employees, administer/interpret policies, and investigate team member concerns."
    },
    {
      "duty": "Make recommendations to promote positive employee relations and ensure consistent interpretation of policies and laws."
    },
    {
      "duty": "Maintain appropriate documentation and records for Employee Relations cases."
    },
    {
      "duty": "Deliver service in a professional and efficient manner, providing prompt assistance and managing expectations for high levels of customer satisfaction."
    },
    {
      "duty": "Conduct thorough investigations of complaints to identify and resolve concerns while reducing the risk of legal action."
    },
    {
      "duty": "Respond to situations that could impact the organization's philosophy on third-party representation and maintain timely and complete documentation of Employee Relations matters."
    },
    {
      "duty": "Establish a presence as a resource to proactively resolve concerns and monitor trends to make recommendations to HR and operational leaders."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resource Management or related field (or equivalent years of related experience in a healthcare setting). HR Certification preferred."
    }
  ]
}