{
  "meta": [
    {
      "job_title": "Maintenance Supervisor, Multifamily",
      "job_category": "Facilities",
      "job_class": "Supervisor",
      "sector": "Property Management",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Maintenance",
      "experience": 3
    },
    {
      "skill": "Plumbing",
      "experience": 3
    },
    {
      "skill": "Electrical Maintenance",
      "experience": 3
    },
    {
      "skill": "Carpentry",
      "experience": 3
    },
    {
      "skill": "Appliance Repair",
      "experience": 3
    },
    {
      "skill": "Facility Maintenance",
      "experience": 3
    },
    {
      "skill": "Groundskeeping",
      "experience": 3
    },
    {
      "skill": "HVAC Maintenance",
      "experience": 3
    },
    {
      "skill": "Safety Procedures",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepares all market-ready apartments, including painting, carpet cleaning/repair, general repairs, and housekeeping to ensure a quality product for residents."
    },
    {
      "duty": "Completes resident service requests in a timely manner."
    },
    {
      "duty": "Knowledge of various maintenance functions including plumbing, pool maintenance, air conditioning, heating, general carpentry skills, appliance repair, electrical maintenance, painting, caulking, snow removal, scheduling, and life safety issues."
    },
    {
      "duty": "Maintains grounds, pools/hot tubs, common areas, and dog parks to keep them clean, free of trash, debris, and other safety issues."
    },
    {
      "duty": "Performs on-call emergency procedures as required."
    },
    {
      "duty": "Reports maintenance issues that affect the budget such as life safety, vacant repairs, property damages, and common area needs to the manager."
    },
    {
      "duty": "Schedules and performs preventative maintenance and records such activities."
    },
    {
      "duty": "Is knowledgeable of state, local, and federal housing laws, codes, policies, and systems regarding maintenance."
    },
    {
      "duty": "Attends and participates in training programs as required by the company and local city and state jurisdictions."
    },
    {
      "duty": "Provides superior customer service and represents the company in a professional manner at all times."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, GED, Trade, Technical, or Vocational school"
    }
  ]
}