{
  "meta": [
    {
      "job_title": "Regional Service Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 135000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Forecasts financial, manpower, and operational requirements for key businesses (start up, warranty, service agreements, paid service). Identifies and pursues service agreement business in conjunction with marketing and sales."
    },
    {
      "duty": "Manages start ups in terms of time and cost requirements. Manages local inventories and RMA procedure. Maintains DSO according to goal. Manages systems start up and warranty cost under reserve."
    },
    {
      "duty": "Ensures customer satisfaction with Company service and system performance."
    },
    {
      "duty": "Interviews, hires, and trains customer engineers as necessary to support regional business."
    },
    {
      "duty": "Ensures employee satisfaction through: communication of business progress and all related action. setting goals and controlling achievements. establishing training and career development plans."
    },
    {
      "duty": "Ensures the appropriate safety practices among customer engineers. Develop CE skills. Spots and develops managerial/other specialist talent."
    },
    {
      "duty": "Escalates system downs according to valid escalation procedure, to ensure earliest possible return to service. Reports in a timely and accurate manner as required."
    },
    {
      "duty": "Achieves guaranteed up time and other parameters as sold to customers."
    },
    {
      "duty": "Promotes quality improvement processes to: reduce cycle time drive continuous improvement of technical performance empower the work force"
    }
  ],
  "skills": [
    {
      "skill": "Financial Forecasting",
      "experience": 7
    },
    {
      "skill": "Operational Leadership",
      "experience": 7
    },
    {
      "skill": "Customer Satisfaction Management",
      "experience": 7
    },
    {
      "skill": "Employee Training and Development",
      "experience": 7
    },
    {
      "skill": "Safety Practices Management",
      "experience": 7
    },
    {
      "skill": "Performance Reporting",
      "experience": 7
    },
    {
      "skill": "Quality Improvement",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 85,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Business, Operations Management, or a related field"
    }
  ]
}