{
  "meta": [
    {
      "job_title": "Oracle Federal Financials Trainer",
      "job_category": "Software Engineering",
      "job_class": "Trainer",
      "sector": "Management",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Training Development",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Oracle Federal Financials R12",
      "experience": 5
    },
    {
      "skill": "E-Learning Development",
      "experience": 5
    },
    {
      "skill": "Public Speaking",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Business Process Re-engineering",
      "experience": 5
    },
    {
      "skill": "User Experience Development",
      "experience": 5
    },
    {
      "skill": "Training Facilitation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute training materials for Oracle Federal Financials R12, including eLearning content and functional user training sessions."
    },
    {
      "duty": "Analyze and support the functional team in designing and documenting system business processes for Oracle-based knowledge support."
    },
    {
      "duty": "Conduct training sessions for end users in a virtual and/or in-person setting, ensuring active participation and engagement."
    },
    {
      "duty": "Manage the training material creation process, mapping business processes, benefits, and change impacts on course content."
    },
    {
      "duty": "Provide support to the Organizational Change Management team in preparation for go-live, including coordinating and executing training sessions with the customer base."
    },
    {
      "duty": "Participate in and support UAT and testing efforts, in conjunction with the functional and technical support counterparts."
    },
    {
      "duty": "Show proficiency in written communication skills and relationship building with client counterparts and the customer base."
    },
    {
      "duty": "Develop and execute training and change initiatives to enable a successful transition to the target state, including developing metrics to measure transition and determine appropriate actions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent related experience"
    }
  ]
}