{
  "meta": [
    {
      "job_title": "Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee a group of Territory Managers (TMs) in the selling of (and may also sell) the company's products and services."
    },
    {
      "duty": "Lead a group of TMs to achieve Division sales, penetration, and churn reduction objectives; research, develop and maintain long and short-range sales plans."
    },
    {
      "duty": "Direct TMs toward high-quality leads, assist in warming leads and closing, and reduce churn."
    },
    {
      "duty": "Submit and administer annual street sales operating plan and operating budget, reviewing and approving street sales-related expenses, credits, donations, and contracts."
    },
    {
      "duty": "Assist in coordinating product cuttings and demonstrations; develop sales and marketing strategies and proposals for customers on products and services."
    },
    {
      "duty": "Understand and utilize the Sales Foundations tools and processes to grow sales, generate additional revenue, and maintain customer service standards."
    },
    {
      "duty": "Recruit, train, and mentor new hires as well as existing TMs, conducting field support/work-with sessions to observe coaching needs and support needs for TM development."
    },
    {
      "duty": "Oversee, manage, and assess TM performance regularly, instituting performance improvement measures as needed."
    },
    {
      "duty": "Maintain current knowledge of industry trends and product developments that affect target markets, establishing and maintaining industry contacts that lead to prospective sales."
    },
    {
      "duty": "Research and develop lists of potential customers, making targeted sales calls to develop relationships and follow up on leads along with sales staff."
    },
    {
      "duty": "Oversee the communication and execution of Company policies within the confines of the sales department."
    },
    {
      "duty": "Ensure that the sales organization is appropriately staffed and managed to minimize turnover."
    },
    {
      "duty": "Other Duties And Responsibilities As Assigned Or Required."
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Territory Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Recruitment and Training",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Sales & Marketing or related field or equivalent experience required."
    }
  ]
}