{
  "meta": [
    {
      "job_title": "Planning Consultant",
      "job_category": "Finance",
      "job_class": "Consultant",
      "sector": "Financial Services",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Planning",
      "experience": 5
    },
    {
      "skill": "Client Relationship Building",
      "experience": 5
    },
    {
      "skill": "Investment Services",
      "experience": 5
    },
    {
      "skill": "Salesforce",
      "experience": 5
    },
    {
      "skill": "Telephone Sales",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide a world-class planning experience and develop an engagement strategy that supports each client’s unique planning needs."
    },
    {
      "duty": "Uncover opportunities to deepen client relationships through consolidation of assets, referrals, and plan implementations."
    },
    {
      "duty": "Work alongside Financial Consultants and/or Wealth Planners in a financial planning capacity, effectively profiling, navigating, and presenting the output of guidance tools."
    },
    {
      "duty": "Conduct joint appointments with clients, educate and plan with clients to uncover opportunities that lead to client’s success, and create and maintain an organized client contact strategy."
    },
    {
      "duty": "Mentor and support the success of peers, build long-lasting, meaningful relationships with clients, and partner with the adviser to develop further planning opportunities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "FINRA Series 7 & 63 licensed; Series 65 or 66 licensed and appropriate state registrations OR ability to acquire series 65/66 upon hire. Financial services experience preferably in financial planning. Degree and/or other professional certifications such as CFP are helpful; if you don’t already have a CFP or degree, our Tuition Reimbursement program can help you obtain one."
    }
  ]
}