{
  "meta": [
    {
      "job_title": "PEIMS Coordinator",
      "job_category": "Data Management",
      "job_class": "Coordinator",
      "sector": "Education",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "PEIMS Management",
      "experience": 5
    },
    {
      "skill": "Data Collection",
      "experience": 5
    },
    {
      "skill": "PowerSchool",
      "experience": 3
    },
    {
      "skill": "State Reporting",
      "experience": 3
    },
    {
      "skill": "Enrollment Data",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the collection and reporting of the District’s Public Education Information Management System (PEIMS) data."
    },
    {
      "duty": "Assist in the collection and reporting of enrollment data and other duties with the support of campus registrars."
    },
    {
      "duty": "Prepare, verify, and manage extensive data to maintain accurate and suitable records."
    },
    {
      "duty": "Collaborate with the campus, business office, and Human Resources staff to collect, organize, and format PEIMS required data for submission in a timely manner."
    },
    {
      "duty": "Prepare and submit complete PEIMS data in TEA’s prescribed format to the Education Service Center (ESC) for processing."
    },
    {
      "duty": "Ensure staff training and support for processing PEIMS data."
    },
    {
      "duty": "Attend all regional PEIMS workshops and distribute information to appropriate staff."
    },
    {
      "duty": "Write, review, update and maintain policy, procedure, and process documentation for accuracy and integrity."
    },
    {
      "duty": "Monitor, verify, and report attendance at each campus to administrators and appropriate stakeholders."
    },
    {
      "duty": "Support campus registrars with enrollment, data collection, and other duties pertinent to their roles."
    },
    {
      "duty": "Provide assistance with school events such as Back to School Night, Meet the Teacher Night, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors Degree preferredMinimum of 3 years experience with PEIMS and state reporting. PowerSchool and SchoolMint experience preferredAbility to travel between schools"
    }
  ]
}