{
  "meta": [
    {
      "job_title": "Outpatient Therapist",
      "job_category": "Therapist",
      "job_class": "Outpatient",
      "sector": "Mental Health",
      "salary": 106500,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Establish positive and trusting rapport with clients and create individualized treatment plans according to patient needs and circumstances."
    },
    {
      "duty": "Provide counseling, treatment, and ongoing assessments of patient progress."
    },
    {
      "duty": "Maintain frequent and close working relationships with program staff and facility team members throughout the organization."
    },
    {
      "duty": "Initiate and maintain strong professional relationships with clients and families, clinical providers, referral partners, and vendors."
    },
    {
      "duty": "Conduct weekly individual therapy and group therapy for each client."
    },
    {
      "duty": "Monitor behavioral interventions for each client and provide skills coaching as needed."
    },
    {
      "duty": "Provide case management and social services for each client."
    },
    {
      "duty": "Record all contacts in progress notes and complete all required reports for each client."
    },
    {
      "duty": "Provide regular updates via phone to collateral contacts (family members, referents, etc.)."
    },
    {
      "duty": "Assist with crisis intervention and special activities as needed."
    },
    {
      "duty": "Collaborate with Clinical Director and Insurance Coordinator for decisions regarding level of care for insurance clients."
    },
    {
      "duty": "Implement all organization rules, policies, and guidelines consistently."
    },
    {
      "duty": "Maintain professional boundaries with clients at all times."
    },
    {
      "duty": "Consult with psychiatrist as needed and provide consultation to milieu staff."
    },
    {
      "duty": "Attend relevant trainings, including in-services, and meet regularly with supervisor(s) to evaluate each client."
    },
    {
      "duty": "Perform all other duties as necessary for the good of the agency as instructed by supervisor."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Social Work, Marriage and Family Therapy or Psychology, California license eligible"
    },
    {
      "credential": "At least one year experience working with clients with substance abuse and/or borderline personality disorder"
    },
    {
      "credential": "Certification or significant experience in providing Dialectical Behavioral Therapy (DBT)"
    },
    {
      "credential": "Valid California Driver's License and insurability by agency's automobile insurance carrier, clearance of TB test, fingerprinting, and state clearance, and any other mandatory state/federal requirements"
    }
  ]
}