{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Construction",
      "job_class": "Supervisor",
      "sector": "Construction",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Safety Compliance",
      "experience": 10
    },
    {
      "skill": "Communication",
      "experience": 10
    },
    {
      "skill": "Problem Solving",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead, manage, and oversee all aspects of ground-up public works projects, ensuring they are completed within budget and on schedule. Build and maintain relationships with subcontractors and manage their work, including scheduling, performance, and quality. Implement and update project schedules, ensuring timely completion of milestones. Collaborate with architects and engineers to address design issues and ensure smooth project progression."
    },
    {
      "duty": "Conduct weekly safety meetings and ensure that all safety practices and procedures are followed. Enforce OSHA guidelines and maintain a safe and clean job site environment. Promptly address and remedy safety violations and ensure trade contractors have effective safety programs."
    },
    {
      "duty": "Establish and maintain open lines of communication with subcontractors, architects, engineers, and project stakeholders. Attend and facilitate site meetings, preconstruction meetings, and coordination meetings. Communicate with clients regularly to provide updates on project progress and address concerns."
    },
    {
      "duty": "Overcome challenges related to owner change orders, design flaws, mistakes, and subcontractor issues. Evaluate alternative construction methods to improve cost-efficiency and quality. Take timely and accurate decisions to resolve issues and keep projects on track."
    },
    {
      "duty": "Lead by example, fostering a positive work environment and maintaining a high level of integrity. Delegate responsibilities to subordinates while ensuring their performance and growth. Collaborate with various stakeholders to ensure a smooth production operation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "5-10 years of supervisory experience in similar type facility construction. Thorough knowledge of construction technology, equipment, methods, and industry standards. Strong communication, organizational, supervisory, and planning skills. Proficiency in reading and interpreting plans and specifications. Familiarity with building codes, zoning ordinances, OSHA requirements, and legal restrictions. Understanding of surveying principles, site-specific topography, and basic materials used in construction. Computer literacy, including word processing, spreadsheets, databases, and scheduling programs. Experience in public works projects, negotiation with private clients, and contract terms. Ability to communicate effectively with owners, architects, and project stakeholders. Knowledge of project scheduling software (P6 experience is a plus). OSHA 40 training and 10-hour certification are helpful."
    }
  ]
}