{
  "meta": [
    {
      "job_title": "Project Manager / Scrum Master",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Technology",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Agile Scrum",
      "experience": 4
    },
    {
      "skill": "Business Analysis",
      "experience": 3
    },
    {
      "skill": "Strategic Planning",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Quality Assurance",
      "experience": 3
    },
    {
      "skill": "Client Engagement",
      "experience": 3
    },
    {
      "skill": "Agile Stories",
      "experience": 3
    },
    {
      "skill": "Requirements Analysis",
      "experience": 3
    },
    {
      "skill": "Agile Development",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead pre-sales efforts to develop the scope for potential engagements."
    },
    {
      "duty": "Prepare and present the statement of work and proposals for project activities in conjunction with account management."
    },
    {
      "duty": "Formulate and define the scope, schedule milestones, tasks, and objectives of projects."
    },
    {
      "duty": "Follow established project life cycle policies to develop project documentation and project plans that specify goals, strategy, staffing, scheduling, risks, contingency plans, and allocation of available resources."
    },
    {
      "duty": "Ensure the development of quality assurance test plans and monitor or direct quality assurance testing as required."
    },
    {
      "duty": "Provide reporting and updates on project status, budget impacts, and status of objectives to management as necessary."
    },
    {
      "duty": "Direct, coordinate and monitor activities of internal and external project resources to ensure projects progress within set parameters, schedule, budget, and goals."
    },
    {
      "duty": "Independently work with clients to understand the end user’s needs and pain points to define the requirements in agile stories for development."
    },
    {
      "duty": "Support the agile team to capture and analyze acceptance criteria clearly and to define and sequence the work (e.g., MVP - minimum viable product and beyond, go-to-market strategy, release schedules)"
    },
    {
      "duty": "Identifying opportunity areas for automation, and the ability to participate in developing final deliverables."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree"
    }
  ]
}