{
  "meta": [
    {
      "job_title": "Academic Advisor",
      "job_category": "Education",
      "job_class": "Advisor",
      "sector": "Education",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Engages in undergraduate student advising with current and incoming undergraduate students, evaluating students’ degree progress/eligibility, assisting with course approvals, developmental and transactional advising, educating and providing guidance concerning degree requirements, programs, academic and professional planning."
    },
    {
      "duty": "Evaluates undergraduate students’ progress in their respective programs, evaluating degree requirements, counseling and providing related guidance and direction. Educates students regarding College, University, and Campus policies and procedures, along with course registration and selection. Interprets and enforces academic policies."
    },
    {
      "duty": "Guides students in navigating the petition process for exceptions to academic policies"
    },
    {
      "duty": "Provides students and prospective with information regarding available College and University resources and opportunities. Educates and informs prospective students and their family/friends about degree programs and opportunities to aid in the recruitment of new students. Attend recruiting events."
    },
    {
      "duty": "Intervenes and refers students to resources throughout the University community as may be needed. Exercises professional discretion and judgment to troubleshoot issues and problems that may arise."
    },
    {
      "duty": "Documents pertinent and required information related to interactions with students. Maintains and updates related databases as needed, to ensure that student records accurately reflect degree progress and academic status."
    },
    {
      "duty": "Assesses transfer courses for equivalency to UIC courses and requirements, updating student records to reflect determined equivalency."
    },
    {
      "duty": "Participates on committees and/or teams as needed and/or assigned."
    },
    {
      "duty": "Assists in the facilitation training and development of new advisors as may be needed."
    },
    {
      "duty": "Proctor exams on occasions when they are administered outside the normal schedule."
    },
    {
      "duty": "Perform other related duties and participate in special projects as assigned."
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required in the area of education, liberal arts and sciences, business, or a related field."
    },
    {
      "credential": "Master's Degree preferred in education, student affairs, liberal arts and sciences, or a related field."
    },
    {
      "credential": "Preference for background in STEM fields"
    },
    {
      "credential": "Familiarity with student development theory and FERPA are preferred."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ]
}