{
  "meta": [
    {
      "job_title": "Claims Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Health Insurance",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Claims Analysis",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Healthcare Industry Experience",
      "experience": 10
    },
    {
      "skill": "PC Proficiency",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads strategy to maximize vendor component of out of network claims negotiation and management."
    },
    {
      "duty": "Manage relationship with vendor, monitoring performance, addressing regulatory changes, facilitating claims file exchanges, understanding claims edits, and administering RFPs."
    },
    {
      "duty": "Lead cross-departmental efforts to evaluate and pursue opportunities through cooperation and communication."
    },
    {
      "duty": "Consult and coordinate with various internal departments, external Blue Plans or business partners, and government agencies."
    },
    {
      "duty": "Identify, investigate, and resolve any issues with vendor processing or provider payments."
    },
    {
      "duty": "Ensure file transfers with vendor are timely, reliable, and as seamless as practical."
    },
    {
      "duty": "Coordinate with Payment Integrity, Payment and Coding Policy, Underwriting, Actuarial, and others as needed to pursue opportunities."
    },
    {
      "duty": "Direct cost benefits analysis to determine if the functions and activities required to identify, pursue, and post overpayments should be internal or outsourced."
    },
    {
      "duty": "Ensure changes in vendor claim directions occur in the systems, including pending, adjusting, and releasing the appropriate claims."
    },
    {
      "duty": "Develop business plans and set financial targets to achieve desired goals."
    },
    {
      "duty": "Plan and lead complex projects from inception to completion."
    },
    {
      "duty": "Perform all other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business, finance, or related field"
    }
  ]
}