{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Nursing Theory",
      "experience": 2
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 2
    },
    {
      "skill": "Analytical Skills",
      "experience": 2
    },
    {
      "skill": "Clinical Proficiency",
      "experience": 2
    },
    {
      "skill": "BLS Certification",
      "experience": 2
    },
    {
      "skill": "ACLS",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collect patient health data by involving the patient, family, and other health care providers."
    },
    {
      "duty": "Perform initial assessment based on the patient's presentation."
    },
    {
      "duty": "Records relevant data on the nursing component of the Interdisciplinary Admission Assessment."
    },
    {
      "duty": "Demonstrate awareness of the special needs of each age group or culture served as well as those patients with disabilities."
    },
    {
      "duty": "Incorporate discharge planning into the admission process."
    },
    {
      "duty": "Analyze the assessment data in determining problem identification."
    },
    {
      "duty": "Identify expected outcomes individualized to the patient."
    },
    {
      "duty": "Demonstrate the ability to combine theoretical knowledge and clinical expertise to anticipate and plan for the identified patient and family care needs."
    },
    {
      "duty": "Analyze the assessment data and identify actual or potential problems that are validated with the patient, family, and other health care providers."
    },
    {
      "duty": "Identify any cultural, ethnic, and spiritual aspects of patient/family dynamics related to the patient's care."
    },
    {
      "duty": "Recognize the patient's comfort/pain management needs that may impact the plan of care and desired outcome."
    },
    {
      "duty": "Identify actual or potential knowledge deficits for the patient and/or family."
    },
    {
      "duty": "Communicate expected outcomes to the patient, family, and other health care providers to promote continuity of care."
    },
    {
      "duty": "Develop a plan of care that prescribes interventions to attain expected outcomes."
    },
    {
      "duty": "Collaborate with the patient, family, and appropriate healthcare providers in developing the plan of care."
    },
    {
      "duty": "Formulate a family-centered plan of care consistent with the assessment of the patient's needs and the physician's treatment plan."
    },
    {
      "duty": "Incorporate teaching and learning principles in the plan of care based on the identified learning needs and developmental level."
    },
    {
      "duty": "Assist the patient and family in identifying and securing services to address health-related needs."
    },
    {
      "duty": "Communicate the plan of care to the patient, family, and other health care providers to promote continuity of care."
    },
    {
      "duty": "Document the initial plan of care and provide updates as required."
    },
    {
      "duty": "Establish realistic goals, set appropriate priorities, and use time efficiently."
    },
    {
      "duty": "Implement the plan of care for each patient and perform appropriate patient monitoring."
    },
    {
      "duty": "Adapt nursing procedures to meet the needs of the individual patient."
    },
    {
      "duty": "Provide education to the patient and family utilizing the educational assessment."
    },
    {
      "duty": "Recognize hazards to patient safety and take action to maintain a safe environment."
    },
    {
      "duty": "Work collaboratively with other team members to implement interventions."
    },
    {
      "duty": "Assign or delegate tasks as defined by the state nurse practice act and according to the knowledge and skills of the caregiver."
    },
    {
      "duty": "Demonstrate knowledge regarding drug administration, incompatibilities, contraindications and adverse effects."
    },
    {
      "duty": "Comply with medication policy and procedure for order transcription/verification, drug administration and documentation."
    },
    {
      "duty": "Evaluate the patient's progress toward the attainment of outcomes."
    },
    {
      "duty": "Document the patient's response to interventions and revisions to the plan of care."
    },
    {
      "duty": "Use ongoing assessment data to revise expected outcomes and the patient plan of care as needed."
    },
    {
      "duty": "Identify barriers to achieving desired patient/family outcomes and use resources to diminish the negative impact on the patient/family."
    },
    {
      "duty": "Communicate with and include the patient, family, and other health care providers in the evaluation process."
    },
    {
      "duty": "Provide care that demonstrates ethical beliefs and respect for patient's rights."
    },
    {
      "duty": "Demonstrate and participate in activities that support customer satisfaction."
    },
    {
      "duty": "Participate in the evaluation of the quality and effectiveness of nursing practices and support measures to improve practice."
    },
    {
      "duty": "Demonstrate the ability to maintain effective interactions with the staff on the unit and in other departments."
    },
    {
      "duty": "Interact with and contributes to the professional development of peers and other health care providers."
    },
    {
      "duty": "Demonstrate the ability to act as a facilitator when dealing with other staff members regarding issues concerning patient care and/or functioning on the unit."
    },
    {
      "duty": "Seek out and utilize the Nurse Manager or Nursing Administrative Supervisor to address issues that require their assistance to resolve."
    },
    {
      "duty": "Accept feedback from peers and management for the purposes of improved patient care and/or unit functioning."
    },
    {
      "duty": "Engage in performance appraisal identifying areas of strength as well as areas where professional development would be beneficial."
    },
    {
      "duty": "Work collaboratively with management to improve the environment of care for patients, families, and personnel."
    },
    {
      "duty": "Demonstrate a working knowledge of the principles, policies, and procedures specific to the assigned nursing service."
    },
    {
      "duty": "Maintain knowledge base through participation in learning situations such as departmental meetings, educational programs, professional association membership, journal review or committee participation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Professional knowledge of nursing theory and practice acquired through completion of a two-year training at an accredited School of Nursing\nCurrent New York State license or Permit as a Registered Professional Nurse\nInterpersonal skills necessary to effectively interact with patients and their families that demonstrate recognition of cultural diversity\nPractice reflects customer service excellence\nAbility to clearly communicate in verbal and written format\nAnalytical ability to assess and develop solutions to clinical situations or unit problems.\nMaintains knowledge and proficiency in the clinical area and age group served.\nBLS certification and de-escalation training\nACLS (ICU, Float pool)\nAbility to frequently lift/carry more than 75 lbs.\nAbility to frequently push/pull more than 100 lbs.\nAbility to frequently bend, squat, kneel, climb steps/ladder and reach above shoulders..\nRequired Licenses: Registered Nurse License-NYS\nQualified candidates must be able to effectively communicate with all levels of the organization."
    }
  ]
}