{
  "meta": [
    {
      "job_title": "Research Associate",
      "job_category": "Research",
      "job_class": "Associate",
      "sector": "Medical",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Biomedical Research",
      "experience": 2
    },
    {
      "skill": "Experiment Design",
      "experience": 3
    },
    {
      "skill": "Grant Writing",
      "experience": 3
    },
    {
      "skill": "Scientific Literature Review",
      "experience": 3
    },
    {
      "skill": "Publications Preparation",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Protocol Modification",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct independent basic science experimentation and build a portfolio of research accomplishments."
    },
    {
      "duty": "Train graduate students and post-doctoral fellows in experimental design and technique."
    },
    {
      "duty": "Participate in editing and proofing grant proposals, annual grant reports, and manuscripts for publication."
    },
    {
      "duty": "Contribute to the preparation of articles on research outcomes and progress for publication."
    },
    {
      "duty": "Read and understand relevant scientific literature and present findings at lab meetings."
    },
    {
      "duty": "Communicate results and collaborate with other professionals in the lab."
    },
    {
      "duty": "Prepare figures and diagrams for presentations and publications."
    },
    {
      "duty": "Record experimental findings, analyze and interpret them, and suggest modifications to protocols based on results."
    },
    {
      "duty": "Develop participant-advocate relationships and assist in identifying community resources for study participants."
    },
    {
      "duty": "Attend staff meetings, case conferences, and individual and group supervision. Observe confidentiality rules and maintain professional standards at all times."
    },
    {
      "duty": "Participate in staff training and development and serve on designated committees within the study when appropriate."
    },
    {
      "duty": "Maintain understanding of clients’ rights policy and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of a Bachelor's degree in Biomedical or Physical Sciences. Placement in position may not exceed three years."
    }
  ]
}