{
  "meta": [
    {
      "job_title": "Salesforce Platform Manager",
      "job_category": "Information Technology",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Salesforce Administration",
      "experience": 6
    },
    {
      "skill": "Business Process Development",
      "experience": 6
    },
    {
      "skill": "Data Management",
      "experience": 6
    },
    {
      "skill": "User Interface Design",
      "experience": 6
    },
    {
      "skill": "Workflow Automation",
      "experience": 6
    },
    {
      "skill": "Report Generation",
      "experience": 6
    },
    {
      "skill": "Change Management",
      "experience": 6
    },
    {
      "skill": "Salesforce Communities",
      "experience": 4
    },
    {
      "skill": "Lightning Web Components",
      "experience": 4
    },
    {
      "skill": "Salesforce Certification",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop deep expertise in assigned Salesforce modules, including learning existing architecture, integrations, and automation to be able to support, maintain and enhance the system."
    },
    {
      "duty": "Become an expert in our business processes to develop and improve Salesforce-powered solutions."
    },
    {
      "duty": "Build and maintain custom applications on the SFDC platform, including data models, business logic, user interface, and workflows."
    },
    {
      "duty": "Perform administrator functions such as user management, profiles, roles, permissions, validation rules, and storage management."
    },
    {
      "duty": "Provide production support and troubleshooting, and generate release notes and contribute to Learning and Development training deliverables."
    },
    {
      "duty": "Complete regular system audits and preparations for upgrades, and stay current with new features and functionality to provide technical guidance and feasibility for system enhancements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "At least 6+ years’ experience administering and configuring SFDC environment with deep knowledge of the declarative (point and click) capabilities or comparable experience as a “Super User” or “Product Owner” of similar Salesforce functionality."
    },
    {
      "credential": "Experience working with business stakeholders to document requirements and translate into Salesforce solutions."
    },
    {
      "credential": "Experience designing and implementing new modules and business processes using the Force.com platform."
    },
    {
      "credential": "Expertise building workflows using standard workflow functionality and advanced process automation techniques utilizing Process Builder and Flow."
    },
    {
      "credential": "Demonstrated expertise leveraging Salesforce debugging functionality and other Dev Console tools."
    },
    {
      "credential": "Experience with Salesforce Experience Sites (formerly called Communities) preferred."
    },
    {
      "credential": "Salesforce Certified Administrator, Salesforce Certified Advanced Administrator, and Platform App Builder Certification."
    }
  ]
}