{
  "meta": [
    {
      "job_title": "Surgery Scheduler",
      "job_category": "Healthcare",
      "job_class": "Other",
      "sector": "Healthcare",
      "salary": 47000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clerical Expertise",
      "experience": 1
    },
    {
      "skill": "Medical Office Experience",
      "experience": 1
    },
    {
      "skill": "BLS Certification",
      "experience": 1
    },
    {
      "skill": "Patient Care",
      "experience": 1
    },
    {
      "skill": "Practice Management",
      "experience": 1
    },
    {
      "skill": "Coordination",
      "experience": 1
    },
    {
      "skill": "HIPAA Compliance",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Obtains CPT and ICD-10 diagnosis codes and other clinical information as required for treatment of the patient from practice staff; seeks assistance from practice and Facility Coders as determined through practice and facility processes."
    },
    {
      "duty": "Prepares documentation for Notification of Non-covered Medicare Services or Advance Beneficiary notices to patients and follows practice procedures to maintain this documentation."
    },
    {
      "duty": "Determines O.R. time needed for the procedure and works with Facility to ensure procedure is scheduled, daily schedule is streamlined and arranges necessary anesthesia coverage, as determined through Facility processes."
    },
    {
      "duty": "Ensures all requirements for the procedure have been obtained and confirmed with the Facility or other parties to include medical/imaging records and needed equipment/instruments."
    },
    {
      "duty": "Ensures scheduling packets are correct and timely."
    },
    {
      "duty": "Obtain patient face sheets from Insurance Verification to obtain necessary authorizations based on insurance types."
    },
    {
      "duty": "Obtains authorization notes from Facility and scans into medical record or practice management system."
    },
    {
      "duty": "Collects necessary and appropriate physician and practice fees associated with the procedure."
    },
    {
      "duty": "Verifies/confirms physician is credentialed at the Center or Facility before scheduling the patient."
    },
    {
      "duty": "Ensures efficient coordination of provider clinic and Facility schedule which could include awareness of provider’s schedule and coordination of provider time-out, travel, meetings, conferences and continuing medical education."
    },
    {
      "duty": "Refers conflicts and procedural questions to Practice Manager or designee as they arise."
    },
    {
      "duty": "Attends required meetings and participates in committees as requested."
    },
    {
      "duty": "Cross-trains as back up to other business office positions as requested."
    },
    {
      "duty": "Performs other general duties as assigned."
    },
    {
      "duty": "Maintain surgery logs or other required practice or case tracking logs."
    },
    {
      "duty": "Supports and adheres to all company and practice policies and procedures."
    },
    {
      "duty": "Supports and adheres to HCA Code of Conduct, related Ethics and Compliance policies, and HIPAA requirements."
    },
    {
      "duty": "Supports and adheres to personnel policies and programs which specify privileges and responsibilities of employment, including compliance with an adverse incident reporting system, quality improvement program, patient safety initiatives, and risk management program."
    },
    {
      "duty": "Displays willingness to speak up about safety issues or change practices to enhance safety; asks for help when needed; enhances teamwork; follows the safety literature/policies"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High school degree preferred Minimum (1) year of experience in a medical office setting highly preferred. (i.e. ambulatory surgery center, hospital, doctors office) preferred.  BLS may be required as per practice standard."
    }
  ]
}