{
  "meta": [
    {
      "job_title": "Registered Nurse Surgical ICU",
      "job_category": "Nursing",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Nursing Care",
      "experience": 5
    },
    {
      "skill": "Interdisciplinary Health Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Patient Assessment",
      "experience": 5
    },
    {
      "skill": "Discharge Planning",
      "experience": 5
    },
    {
      "skill": "Family Centered Care Planning",
      "experience": 5
    },
    {
      "skill": "Medication Administration",
      "experience": 5
    },
    {
      "skill": "Patient Safety Management",
      "experience": 5
    },
    {
      "skill": "Effective Communication",
      "experience": 5
    },
    {
      "skill": "Clinical Proficiency",
      "experience": 5
    },
    {
      "skill": "BLS Certification",
      "experience": 5
    },
    {
      "skill": "ACLS Certification",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute professional nursing care in accordance with physician treatment plans to provide for the comfort and well-being of patients and their families."
    },
    {
      "duty": "Collect patient health data and perform initial assessments based on patient's presentation."
    },
    {
      "duty": "Incorporate discharge planning into the admission process and analyze assessment data for problem identification."
    },
    {
      "duty": "Develop a family centered plan of care consistent with the assessment of the patient's needs and the physician's treatment plan."
    },
    {
      "duty": "Provide education to the patient and family using the educational assessment and recognize hazards to patient safety."
    },
    {
      "duty": "Evaluate patient progress, document response to interventions, and communicate with the patient, family, and healthcare providers."
    },
    {
      "duty": "Participate in the evaluation of the quality and effectiveness of nursing practices, maintaining effective interactions with the staff, and engaging in performance appraisal and professional development."
    },
    {
      "duty": "Maintain knowledge and proficiency in the clinical area and age group served, complying with staff meeting attendance requirement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Professional knowledge of nursing theory and practice acquired through completion of a two-year training at an accredited School of Nursing (Bachelor's degree in Nursing preferred)"
    },
    {
      "credential": "Current New York State license or Permit as a Registered Professional Nurse"
    },
    {
      "credential": "Interpersonal skills necessary to effectively interact with patients and their families, demonstrating recognition of cultural diversity"
    },
    {
      "credential": "Practice that reflects customer service excellence and clear communication in verbal and written format"
    },
    {
      "credential": "Analytical ability to assess and develop solutions to clinical situations or unit problems"
    },
    {
      "credential": "BLS certification and de-escalation training"
    },
    {
      "credential": "ACLS Certification for ICU and Float pool"
    }
  ]
}