{
  "meta": [
    {
      "job_title": "Credit Desk Specialist",
      "job_category": "Credit and Collections",
      "job_class": "Specialist",
      "sector": "Financial Services",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Credit and Collections",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Negotiation",
      "experience": 2
    },
    {
      "skill": "Financial Analysis",
      "experience": 2
    },
    {
      "skill": "Contract Management",
      "experience": 2
    },
    {
      "skill": "Accounting",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Communicates with collection agencies and attorneys to maintain updated records for files placed and recovering accounts receivable through outbound calls and written communication."
    },
    {
      "duty": "Makes regularly scheduled collection calls on all account balances with outside agencies and attorneys, exceeding daily required number of contacts."
    },
    {
      "duty": "Enters system notes for all assigned accounts and maintains a collection history."
    },
    {
      "duty": "Displays a thorough knowledge of service, extras, and repair documentation, including billing, insurance certificates, contracts, lien waivers, etc."
    },
    {
      "duty": "Reads and understands contract language and uses this knowledge in negotiations with collection agencies and attorneys."
    },
    {
      "duty": "Prioritizes multiple responsibilities while being organized and detail oriented with a commitment to superior customer service."
    },
    {
      "duty": "Monitors accounts for potential accounts that will not be recoverable and coordinates monthly conference calls with district personnel."
    },
    {
      "duty": "Meets or exceeds financial targets while filing and tracking property liens and creating collection files for legal action."
    },
    {
      "duty": "Resolves all unclaimed property items assigned and submits refund request into the system after verifying the accuracy of the request and completing the final refund steps once the check is received."
    },
    {
      "duty": "Resolves customer disputes through contract review, negotiation, and escalation and communicates interdepartmentally to achieve financial results."
    },
    {
      "duty": "Performs other duties as assigned, with potential for some travel."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor degree in a Business Discipline is preferred. Associate degree with 1-2 years of previously noted experience."
    }
  ]
}