{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Process",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Interpersonal Relations",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Banking Experience",
      "experience": 5
    },
    {
      "skill": "Supervisory Experience",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve customers at an assigned teller station by processing a variety of transactions in accordance with Company procedure."
    },
    {
      "duty": "Perform balancing and upkeep of branch and responsible offsite ATM(s) when required."
    },
    {
      "duty": "Assist customers by answering questions and obtaining specialized services from other Company departments, referring only extraordinary items to appropriate supervisor for approval."
    },
    {
      "duty": "Respond to inquiries relating to his/her particular area, or to requests from customers, other Company personnel, etc., within given time frames and within established policy."
    },
    {
      "duty": "Complete the documentation and performs point-of-sale processing on all types of new accounts, e.g. loans, deposits, etc."
    },
    {
      "duty": "Solicit new business from present and prospective customers."
    },
    {
      "duty": "Provide sales information on a timely basis in order that this information may be included as part of monthly and year-to-date sales performance reports."
    },
    {
      "duty": "Provide safe deposit box services to customers."
    },
    {
      "duty": "Maintain a thorough knowledge of the features and benefits of all Company products and services."
    },
    {
      "duty": "Provide periodic reports to the Teller Supervisor and other unit supervisors, appropriate groups or individuals."
    },
    {
      "duty": "Work Saturdays, as required."
    },
    {
      "duty": "May open and close branch, office and/or vaults, under dual control. Set alarms, as necessary."
    },
    {
      "duty": "May fill in at other Company branch locations, as required."
    },
    {
      "duty": "May support team, as required."
    },
    {
      "duty": "All other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 150,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED"
    }
  ]
}