{
  "meta": [
    {
      "job_title": "Sales Development Leader",
      "job_category": "Sales",
      "job_class": "Leader",
      "sector": "Sales",
      "salary": 115000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Sales Development",
      "experience": 5
    },
    {
      "skill": "Techstack Platforms",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    },
    {
      "skill": "Hiring",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as an inspiring coach and mentor to the sales development team, providing continuous coaching to increase individual and team effectiveness & productivity."
    },
    {
      "duty": "Work closely with the team to ensure each member consistently meets and overachieves their quota through candid feedback, weekly 1:1 meetings, and developing trusting relationships."
    },
    {
      "duty": "Analyze top-of-the-funnel metrics, meeting & pipeline quality, and revenue impact across the segments supported to drive the execution and achievement of pipeline coverage goals."
    },
    {
      "duty": "Partner & align with Sales Leadership, Marketing, RevOps, Enablement, and Product Marketing on the planning, execution, and success of campaigns & field events, exceeding pipeline targets and ensuring the team masters their understanding of the buyers and the company message."
    },
    {
      "duty": "Attract, hire, train, and retain top-tier sales development talent, producing high-performing team members and building them as the next tier of top-performing Account Executives."
    },
    {
      "duty": "Lead by example, being a source of knowledge & skill on new & emerging prospecting trends that the team can learn and apply."
    },
    {
      "duty": "Produce and execute comprehensive strategies to enhance sales development performance and achieve set goals."
    },
    {
      "duty": "Provide tactical management of reps and shadowing/coaching of calls & written outreach on a daily basis."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Sales, or a related field (Master's preferred)"
    }
  ]
}