{
  "meta": [
    {
      "job_title": "Part Time Teller",
      "job_category": "Banking",
      "job_class": "Teller",
      "sector": "Retail Banking",
      "salary": 32000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Banking Transactions",
      "experience": 1
    },
    {
      "skill": "Technology Education",
      "experience": 1
    },
    {
      "skill": "Product Referral",
      "experience": 1
    },
    {
      "skill": "Financial Wellbeing",
      "experience": 1
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide exceptional customer service and perform high volume customer banking transactions with accuracy."
    },
    {
      "duty": "Educate customers on new technology and develop banking product referral opportunities through strong customer relationship skills."
    },
    {
      "duty": "Identify banking opportunities during customer interactions and make appropriate referrals to branch staff or PNC ecosystem partners."
    },
    {
      "duty": "Perform lobby engagement activities to connect with customers and position PNC products to meet their needs."
    },
    {
      "duty": "Educate customers on options for managing financial transactions by leveraging technology, tools, and resources."
    },
    {
      "duty": "Solve customer problems using product and procedural knowledge."
    },
    {
      "duty": "Adhere to all policies and procedures, demonstrating sound judgment within established limits."
    },
    {
      "duty": "Ensure teller and branch daily operations and maintenance transactions are completed in an efficient and accurate manner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "No Degree required. Prior experience is not required. In lieu of a degree, a comparable combination of education, job specific certification(s), and experience (including military service) may be considered."
    }
  ]
}