{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Retail Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Merchandising",
      "experience": 5
    },
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Inventory Control",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Team Building",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead, direct, and actively participate in freight processing, merchandising, and storeroom organization standards within the store."
    },
    {
      "duty": "Manage and provide direction to store associates in various aspects of the merchandising process, including freight prep, truck unload, stocking, re-lays, financial management, and inventory control."
    },
    {
      "duty": "Lead activities related to truck unload, freight flow, backroom organization, ticketing merchandise, stocking shelves, and reconciliation of inventory transactions."
    },
    {
      "duty": "Establish plans to accomplish merchandising initiatives and achieve defined goals, utilizing company tools, reports, and feedback to effectively analyze trends and refine plans."
    },
    {
      "duty": "Maintain the appearance of the store’s interior and exterior to standards, primarily regarding merchandise presentation and signage."
    },
    {
      "duty": "Participate in the interviewing, selection, hiring, and training of associates, and complete performance evaluations as directed."
    },
    {
      "duty": "Administer appropriate disciplinary action to associates, including recommendations for termination, in partnership with the store leadership and in accordance with company guidelines."
    },
    {
      "duty": "Assist with store scheduling and payroll processes on a daily and weekly basis, and serve in the Manager on Duty role as needed, including opening and closing the store."
    },
    {
      "duty": "Provide leadership and direction to floor associates and ensure that store, merchandising, and customer service standards are continuously met, including merchandise presentation, signage, recovery, and cleanliness."
    },
    {
      "duty": "Drive the customer experience and ensure resolution of customer issues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, GED, or equivalent work experience required."
    }
  ]
}