{
  "meta": [
    {
      "job_title": "Sr. Revenue Accountant",
      "job_category": "Accounting",
      "job_class": "Senior",
      "sector": "Finance",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 5
    },
    {
      "skill": "Revenue Recognition",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Technical Accounting",
      "experience": 5
    },
    {
      "skill": "Netsuite",
      "experience": 5
    },
    {
      "skill": "Auditing",
      "experience": 5
    },
    {
      "skill": "CPA",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform month end close duties, including preparing journal entries, preparing account reconciliations, and reviewing revenue transactions."
    },
    {
      "duty": "Maintain and reconcile all AR and revenue related accounts (trade AR, unbilled AR, AR reserves, revenue and deferred revenue) and prepare monthly flux analysis."
    },
    {
      "duty": "Review sales, license and grant agreements to ensure proper revenue recognition in accordance with US GAAP."
    },
    {
      "duty": "Assist in the development of accounting policies and operations for new accounting initiatives and business processes."
    },
    {
      "duty": "Maintain revenue policy, research and prepare technical accounting memos as required."
    },
    {
      "duty": "Develop relationships within the Finance team to understand the accounting and financial reporting processes and how they integrate with FP&A."
    },
    {
      "duty": "Coordinate with external auditors and technical accounting firms on various projects."
    },
    {
      "duty": "Preparation of quarterly and year-end audit and tax schedules as required."
    },
    {
      "duty": "Build best-in-class processes and systems from the ground up and deliver high quality financial reports."
    },
    {
      "duty": "Join a talented team that will support you at every stage of your growth."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Accounting. CPA a plus."
    }
  ]
}