{
  "meta": [
    {
      "job_title": "Senior Compensation Analyst",
      "job_category": "Human Resources",
      "job_class": "Analyst",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with local human resources, recruiting, management, and other domestic business units on various compensation requests."
    },
    {
      "duty": "Manage the annual merit increase process, salary survey data management, EEO-1 reporting, and data integrity maintenance."
    },
    {
      "duty": "Perform market benchmarking and research to provide offer and promotion recommendations, assign salary grades, validate Fair Labor Standards (FLSA) exemptions, and review minimum qualification recommendations to ensure pay is competitive and compliant with local, state, and federal law."
    },
    {
      "duty": "Assist in updating job descriptions and maintain company-wide job description database."
    },
    {
      "duty": "Communicate, review, and approve the annual merit increase process through Excel spreadsheets to meet payroll deadlines."
    },
    {
      "duty": "Participate in compensation and benefit surveys annually in order to price jobs competitively in the domestic market."
    },
    {
      "duty": "Review job classifications to ensure EEO-1 job categories are updated in accordance with federal regulations."
    },
    {
      "duty": "Assist with data integrity maintenance in the HRIS by running queries and analyzing data."
    },
    {
      "duty": "Benchmark all jobs during specified intervals and recommend annual pay grade adjustments to stay current with the competitive job market."
    },
    {
      "duty": "Develop and manage compensation user procedures, guidelines, and training."
    },
    {
      "duty": "Collaborate with Information Technology, Payroll, and Human Resource team to identify continuous improvement projects."
    },
    {
      "duty": "Perform other duties as required within the nature and level of work."
    }
  ],
  "skills": [
    {
      "skill": "Compensation Analysis",
      "experience": 5
    },
    {
      "skill": "Excel proficiency",
      "experience": 5
    },
    {
      "skill": "Human Resources Regulations",
      "experience": 5
    },
    {
      "skill": "Market Surveying",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "HRIS Management",
      "experience": 5
    },
    {
      "skill": "Benchmarking",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Training Development",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Human Resources, Industrial Organization (IO) Psychology, Finance, or related field. (Master's preferred)"
    }
  ]
}