{
  "meta": [
    {
      "job_title": "Sales Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Sales Planning",
      "experience": 3
    },
    {
      "skill": "Order-Writing",
      "experience": 3
    },
    {
      "skill": "Merchandising",
      "experience": 3
    },
    {
      "skill": "Negotiation",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Retail Experience",
      "experience": 3
    },
    {
      "skill": "Customer Relations",
      "experience": 3
    },
    {
      "skill": "Promotional Techniques",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish and maintain rapport with key store individuals while providing outstanding customer service."
    },
    {
      "duty": "Maximize sales and conduct effective planning & order-writing."
    },
    {
      "duty": "Support and complete activities such as merchandising displays and partnering with nationally recognized customers."
    },
    {
      "duty": "Carry out in-store visits according to Mondelez’ visit method, ensuring Nabisco leading brands are well represented, stocked, and maintained."
    },
    {
      "duty": "Ensure Sales Representative’s negotiations with store managers are being followed and communicate any issues with management team."
    },
    {
      "duty": "Represent Mondelēz International in front of in-store employees and work closely with sales representative to optimize visibility of products on shelves and the construction of promotional displays."
    },
    {
      "duty": "Enhance seasonal sales, seasonal displays, and new product launches."
    },
    {
      "duty": "Work in conjunction with the Merchandisers to ensure inventory is fully stocked, rotated, and presentable at all times."
    },
    {
      "duty": "Identify opportunities to use promotional and merchandising techniques to develop and support customer relations."
    },
    {
      "duty": "Perform physically demanding work such as repetitive lifting, bending, and carrying of products from stock rooms and stocking store shelves."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED required, College degree preferred."
    }
  ]
}