{
  "meta": [
    {
      "job_title": "Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Team Development",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage inside sales staff to include: planning, implementing, and overseeing work assignments, employee training, career development, and performance management."
    },
    {
      "duty": "Responsible for planning and maintaining the policies and procedures that enable and encourage optimum performance by the inside sales group."
    },
    {
      "duty": "Coordinates with other employees and managers from other departments to ensure customer service goals and operational objectives are met."
    },
    {
      "duty": "Assists in the creation of sales proposals, cost estimates, and customer presentations."
    },
    {
      "duty": "Coaches, mentors, and develops staff, including overseeing new employee onboarding and providing career development planning and opportunities."
    },
    {
      "duty": "Tracks and analyzes key performance indicators with the intent of continuously improving the customer experience and operational efficiencies."
    },
    {
      "duty": "Contributes to creating and maintaining best practices to ensure compliance with the company’s Quality Management System."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree 8 years of relevant/technical work experience and 5-8 years of leadership experience OR An additional 3 years of specific work experience in lieu of degree."
    }
  ]
}