{
  "meta": [
    {
      "job_title": "Customer Success Manager",
      "job_category": "Customer Success",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 140000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Help build the foundations of Customer Success at Lark: As an early member of our success team, you'll be instrumental in helping define our vision and culture."
    },
    {
      "duty": "Serve as the customer's trusted advisor and product expert: In addition to training, onboarding, and working sessions, you'll go above and beyond to deeply understand our customers' businesses and dig deep into how Lark can help take them to the next level."
    },
    {
      "duty": "Meaningfully shape our future product: As you engage with customers, you'll gain insights to help us serve them better — and work with product to inform what we do next."
    },
    {
      "duty": "Drive adoption, retention, expansion, and advocacy: Help our customers love Lark, and work with them to share their success with everyone else."
    },
    {
      "duty": "Elevate your skills as we tackle our most impactful challenges: We're here to solve a world-class problem, with the passion and resources to pull it off — and there's so much more to do and learn."
    }
  ],
  "skills": [
    {
      "skill": "Customer Success Management",
      "experience": 5
    },
    {
      "skill": "Product Expertise",
      "experience": 5
    },
    {
      "skill": "Training and Onboarding",
      "experience": 5
    },
    {
      "skill": "Business Understanding",
      "experience": 5
    },
    {
      "skill": "Product Advocacy",
      "experience": 5
    },
    {
      "skill": "Data-Driven Insights",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Marketing, or related field (Masters preferred)"
    }
  ]
}