{
  "meta": [
    {
      "job_title": "Assistant Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Service Culture",
      "experience": 3
    },
    {
      "skill": "Visual Merchandising",
      "experience": 3
    },
    {
      "skill": "Business Operations",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 4
    },
    {
      "skill": "Team Management",
      "experience": 4
    },
    {
      "skill": "Recruiting",
      "experience": 4
    },
    {
      "skill": "Employee Feedback",
      "experience": 4
    },
    {
      "skill": "Inclusivity",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive a service culture through engaging, efficient, and personalized experiences, and interpret Voice of the customer feedback."
    },
    {
      "duty": "Act as a brand representative, partner with Visual Merchandising Manager to create an engaging visual experience, and deliver a seamless, omni channel shopping experience."
    },
    {
      "duty": "Actively participate as the floor service leader, guide the team to prioritize customer experience, and facilitate onboarding for new hires."
    },
    {
      "duty": "Support store management team in daily office procedures, shipment processing, and maintaining visual/display standards; adhere to store’s safety standards and inventory accuracy."
    },
    {
      "duty": "Contribute to an inclusive environment, facilitate the sharing of product knowledge, and communicate feedback to Visual Merchandising Manager and Store Manager."
    },
    {
      "duty": "Protect time to discuss personal growth with direct reports, set goals, and deliver feedback; invest time into ensuring the success of all team members."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Management or related field (Master's preferred)"
    }
  ]
}