{
  "meta": [
    {
      "job_title": "Administrative Assistant",
      "job_category": "Administration",
      "job_class": "Assistant",
      "sector": "Administration",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Office Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Administrative Support",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinates collection and preparation of operating reports, such as time-and-attendance records, terminations, and new hires."
    },
    {
      "duty": "Ensures that the telephone is answered properly, and messages are handled courteously, accurately and in a timely manner."
    },
    {
      "duty": "Initiates preparation of Management Reports, committee reports, meeting notices as applicable and submit for Manager’s review and approval."
    },
    {
      "duty": "Maintains, updates, and coordinates resident information in computer database at a minimum monthly."
    },
    {
      "duty": "Generates and provides this information to the Property Manager, Board of Directors, and valet desk."
    },
    {
      "duty": "Maintains supply closet and requests all office supplies and equipment following established purchasing procedures."
    },
    {
      "duty": "Opens and distributes mail, prepares accounts payable invoices with work orders and receiving tickets."
    },
    {
      "duty": "Prepares any resident information packages that require Board approval."
    },
    {
      "duty": "Coordinates receipt of closing statement or warranty deed to put in the file and send to corporate A/R to change name and address for maintenance coupons."
    },
    {
      "duty": "Maintains inventory of common areas keys, transmitters and key fobs for residents and re-order as needed following established procedures."
    },
    {
      "duty": "Follows safety procedures and maintains a safe work environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Associates degree with concentration in business preferred, or equivalent combination of education and experience."
    }
  ]
}