{
  "meta": [
    {
      "job_title": "Data Center Analyst - IT Operations",
      "job_category": "IT Operations",
      "job_class": "Analyst",
      "sector": "IT",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Become proficient with data center operations (all campuses and sites), including room layouts, MDF’s/IDF’s, UPS & Non-UPS power, ability to identify all breakers on each substation, batteries, AC units and generators, fire and pre-action systems, VESDA advanced smoke detection system, Site Scan/Alber, and vendor Interactions."
    },
    {
      "duty": "Pro-active walkthroughs, including routine physical inspection of rooms and generators, of DC1, DC2, and DC3,DC6 with annual walkthroughs of DC4, DC5, DC7,and DC8."
    },
    {
      "duty": "Accountable for daily datacenter health checks"
    },
    {
      "duty": "Learn how to proper handling of infrastructure issues as they arise, in coordination with infrastructure teams and vendors as appropriate"
    },
    {
      "duty": "Maintain Daily Batch Scheduling"
    },
    {
      "duty": "Be able to use control-M to maintain and complete the daily and nightly batch stream."
    },
    {
      "duty": "Improve accuracy and quality of information provided on the 8:30 call."
    },
    {
      "duty": "Coordinate exceptions and critical activities outside of normal processes."
    },
    {
      "duty": "Use available monitors to maintain visibility of environment health and system schedules and react to issues and concerns appropriately."
    },
    {
      "duty": "Management of Monitoring, Physical Security and Data Center Policies"
    },
    {
      "duty": "Maintain datacenter physical security and policies."
    },
    {
      "duty": "Coordinate the execution of the Rapid Response process"
    },
    {
      "duty": "Coordinate exceptions and critical activities outside of normal processes."
    },
    {
      "duty": "Use available monitors to maintain visibility of environment health and system schedules and react to issues and concerns appropriately."
    },
    {
      "duty": "Completion of a walk thru of infrastructure rooms showing knowledge and proficiency."
    },
    {
      "duty": "Datacenter maintenance and issue resolution activities are handled quickly, efficiently, and proactively where possible, avoiding self-inflicted issues due to failure to maintain/react."
    },
    {
      "duty": "Objective: Performance Daily Batch Schedule"
    },
    {
      "duty": "Zero datacenter physical security or policy breaches."
    },
    {
      "duty": "Help with the execution of RR calls, documentation of RR information."
    },
    {
      "duty": "Provide holistic status of operational performance at any time doing their shift."
    },
    {
      "duty": "Demonstrate knowledge and understanding of all available monitoring."
    },
    {
      "duty": "Successful knowledge and reporting of all Sev-1 events and Disruption and Recap report activities for leadership."
    },
    {
      "duty": "Participate in the Daily Briefing call and post-call discussions."
    },
    {
      "duty": "Demonstrate understanding of the issues discussed on the Daily Briefing call by being able to provide the impact to the business, stores, etc."
    },
    {
      "duty": "Clearly and accurately document information for the Daily Briefing call before the start of the next shift."
    }
  ],
  "skills": [
    {
      "skill": "Data Center Operations",
      "experience": 3
    },
    {
      "skill": "Infrastructure Management",
      "experience": 3
    },
    {
      "skill": "Batch Scheduling",
      "experience": 3
    },
    {
      "skill": "Quality Control",
      "experience": 3
    },
    {
      "skill": "Monitoring",
      "experience": 3
    },
    {
      "skill": "Security Policies",
      "experience": 3
    },
    {
      "skill": "Rapid Response Coordination",
      "experience": 3
    },
    {
      "skill": "Issue Resolution",
      "experience": 3
    },
    {
      "skill": "Reporting",
      "experience": 3
    },
    {
      "skill": "Daily Briefing",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Data Center Management, IT Operations, or a related field (Master's preferred)"
    }
  ]
}