{
  "meta": [
    {
      "job_title": "Assistant Property Manager, Multifamily",
      "job_category": "Property Management",
      "job_class": "Manager",
      "sector": "Real Estate",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensuring the smooth running of our community in a fast-paced environment."
    },
    {
      "duty": "Assist the Property Manager with the overall operations including maintenance, capital improvements, lease administration, budgeting, forecasting, reporting, collections, evictions, vacancy anticipation, marketing, lease renewals, service contracts, expense control, audits, etc."
    },
    {
      "duty": "Assist the Property Manager with providing superior customer service and communication to our residents and prospects to enhance customer satisfaction and increase renewals, revenue, reputation, and profitability."
    },
    {
      "duty": "Complete lease/renewal paperwork to ensure completion to company standards."
    },
    {
      "duty": "Track and evaluate advertising, and all client traffic."
    },
    {
      "duty": "Maintain effective on-site staff through interviewing, hiring, and coaching team as necessary."
    },
    {
      "duty": "Maintain residents' files in accordance with company's standards."
    },
    {
      "duty": "Maintain a positive living environment for community residents through prompt conflict resolution and consistent follow-up."
    },
    {
      "duty": "Manage and maintain all aspects of overall community budget and finances."
    },
    {
      "duty": "Work with leasing staff to ensure that leasing/marketing goals are being met."
    },
    {
      "duty": "Determine leasing opportunities of staff and work on goal setting – improving the performance of each staff member."
    },
    {
      "duty": "Supervise day-to-day operations of team, ensuring that all C&W policies and procedures are being followed."
    },
    {
      "duty": "Be able to manage a team."
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree preferred, High School Diploma, GED, Technical or Vocational school required"
    }
  ]
}