{
  "meta": [
    {
      "job_title": "Senior Mobility Consultant I",
      "job_category": "Consulting",
      "job_class": "Senior Consultant",
      "sector": "Consulting",
      "salary": 145000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Global Talent Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "RFP Project Management",
      "experience": 5
    },
    {
      "skill": "Instructional Design",
      "experience": 5
    },
    {
      "skill": "Content Design",
      "experience": 5
    },
    {
      "skill": "Mobility Technology Platforms",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and execute strategies and programs to help clients optimize their global talent investment, develop global leaders, and manage their expatriate programs."
    },
    {
      "duty": "Provide expertise on global mobility policy development, advice on global mobility compensation data, and consulting on ad-hoc mobility projects including cost modeling and talent management."
    },
    {
      "duty": "Support large client accounts and manage the existing mobility client portfolio which involves regular service calls, account reviews, and managing the renewal process."
    },
    {
      "duty": "Ensure clients are connected to Mercer’s full range of Mobility offerings and serve as a technical reviewer for client deliverables related to Mobility."
    },
    {
      "duty": "Lead complex projects including large scale program design and policy reviews, and manage major RFPs as well as vendor reviews."
    },
    {
      "duty": "Collaborate with Mobility Production Group to improve the design and delivery of mobility data."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Human Resource Management, International Studies, Economics, or related field (Master's preferred)"
    }
  ]
}