{
  "meta": [
    {
      "job_title": "Vice President of Surgical Services",
      "job_category": "Healthcare",
      "job_class": "Executive",
      "sector": "Healthcare",
      "salary": 180000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drives operational excellence throughout the surgical services area and leads growth of service line volume within facility, development of new programs and advancement of existing ones."
    },
    {
      "duty": "Partners with senior administrators, executives and professional staff to distinguish his/her facilities' services and experience in the eyes of the physician, patient and consumers."
    },
    {
      "duty": "Scans the competitive environment, leads business planning process and provides strategies to drive profitable service line growth while reducing costs per case."
    },
    {
      "duty": "Partners closely with senior executives, sales and marketing executives, and service line management to enable growth strategies."
    },
    {
      "duty": "Develops business case, including financials, for new program development and capital projects."
    },
    {
      "duty": "Identifies and drives new physician and volume opportunities for the hospital ensuring alignment with clinical leaders."
    },
    {
      "duty": "Collaborates with physicians to develop and foster positive working relationships."
    },
    {
      "duty": "Monitors key operational and financial metrics for improvement opportunities."
    },
    {
      "duty": "Drives process improvement within the service line to increase employee engagement and physician satisfaction."
    },
    {
      "duty": "Works with hospital administrative team and department director(s) for program development, implementation, execution monitoring and evaluation of services at the hospital."
    },
    {
      "duty": "Ensures physician and professional staff have the necessary equipment to perform."
    },
    {
      "duty": "Participates in hospital annual budgeting process related to service line."
    },
    {
      "duty": "Engages with national, division and facility service lines leaders to obtain and share best practices in service line."
    },
    {
      "duty": "Supports the recruitment process to secure staffing talent."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 0,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree required, 3+ years of experience in healthcare, 3+ years of experience in business development, 3+ years of experience in a leadership role or equivalent combination of education and/or experience"
    }
  ]
}