{
  "meta": [
    {
      "job_title": "Food and Nutrition Services Team Member",
      "job_category": "Healthcare",
      "job_class": "Support",
      "sector": "Nutrition Services",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Food Service",
      "experience": 1
    },
    {
      "skill": "Hospital Food Services",
      "experience": 1
    },
    {
      "skill": "Nutrition Support",
      "experience": 1
    },
    {
      "skill": "Sanitation Guidelines",
      "experience": 1
    },
    {
      "skill": "English Language",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs routine duties related to preparation and serving of food."
    },
    {
      "duty": "Prepares food for cooking by washing, peeling, shredding, slicing, and mixing various food items."
    },
    {
      "duty": "Operates dishwasher or assists with washing/sterilizing dishes, glassware, silverware, utensils, pots, pans, etc."
    },
    {
      "duty": "Cleans kitchen work areas, collects and disposes of garbage."
    },
    {
      "duty": "May assist with food stocking."
    },
    {
      "duty": "Serves food in cafeteria for visitors and staff and in patients room following dietary, sanitary and safety guidelines."
    },
    {
      "duty": "Clears patients' dirty trays and works in dish room when needed."
    },
    {
      "duty": "Works on patient tray assembly line following menu directives for determining food items for each tray."
    },
    {
      "duty": "Delivers food trays to patient areas."
    },
    {
      "duty": "Follows Standard Precautions using personal protective equipment as required."
    },
    {
      "duty": "High school diploma or GED preferredAbility to read, write, speak and understand English preferred6 months food service experience required; previous experience in hospital food services preferred. This role requires you to be fully vaccinated for COVID-19 based on local, state and /or federal law or regulations (unless a medical or religious exemption is approved)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 50,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED preferred, English language proficiency"
    }
  ]
}