{
  "meta": [
    {
      "job_title": "Billing Specialist Research",
      "job_category": "Administrative",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Billing",
      "experience": 1
    },
    {
      "skill": "Cash Application",
      "experience": 1
    },
    {
      "skill": "Financial Accounting",
      "experience": 1
    },
    {
      "skill": "Data Analysis",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Organizational Skills",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for all invoicing and cash application functions within the finance department, and will provide administrative and organizational support."
    },
    {
      "duty": "Create back-up and invoicing for monthly and quarterly patient earnings revenue."
    },
    {
      "duty": "Review invoices for compliance with contract terms."
    },
    {
      "duty": "Review and process invoices for study related costs per contact terms."
    },
    {
      "duty": "Update and maintain various logs used for monitoring invoice requests."
    },
    {
      "duty": "Transactional line item cash posting into proprietary systems based on remittance detail provided by payers."
    },
    {
      "duty": "Ensure accuracy of cash postings by contacting payers to verify payment remittance detail."
    },
    {
      "duty": "Review, interpret, and discuss remittances from clients for data accuracy."
    },
    {
      "duty": "Work with collections staff to ensure accuracy of postings."
    },
    {
      "duty": "Assist operations with financial information requests and questions."
    },
    {
      "duty": "Files correspondence from sponsors, checks, and other documents as necessary."
    },
    {
      "duty": "Maintains files in an organized and accessible manner to include updating information, purging files on a regular basis and creating new filing systems as needed."
    },
    {
      "duty": "Ensure that all processing and reporting deadlines are consistently achieved."
    },
    {
      "duty": "Respond to requests for information from Corporate, Internal Audit and other internal management."
    },
    {
      "duty": "Practice and adhere to the 'Code of Conduct' philosophy and 'Mission and Value Statement'."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 50,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma (GED)"
    }
  ]
}