{
  "meta": [
    {
      "job_title": "Cyber Risk Manager",
      "job_category": "Cybersecurity",
      "job_class": "Manager",
      "sector": "Legal",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Governance and Risk Management",
      "experience": 5
    },
    {
      "skill": "Cybersecurity",
      "experience": 5
    },
    {
      "skill": "InfoSec Policies",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Privacy Compliance",
      "experience": 5
    },
    {
      "skill": "Compliance Reporting",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Stakeholder Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist with the development, implementation, and management of the governance and risk strategic plan and roadmap, including evolving the reporting structure and frequency to InfoSec stakeholders."
    },
    {
      "duty": "Evolve, develop, and manage the development, maintenance, and evaluation of organizational InfoSec governance and risk procedures, processes, and guidelines in accordance with Firm and Client requirements."
    },
    {
      "duty": "Serve as a key contributor in identifying, managing, and communicating governance and risk across InfoSec policy domains, providing expertise to prioritize and manage risk, while facilitating the adoption in conjunction with the Controls Manager of IT Risk policies, standards, and guidelines across the enterprise."
    },
    {
      "duty": "Manage the Cyber risk and issue registers and remediations; track IT risk registers and perform risk(s) to policy domain to control(s) mapping to provide prioritization and transparency into control and policy domains requiring remediation."
    },
    {
      "duty": "Work with the Controls Manager and other stakeholders to identify, validate, and document deficiencies in ITRM governance, processes, and risk management practices, propose remediations, and enforce cross-functional POAM initiatives and status reporting requirements in accordance with prioritization requirements."
    },
    {
      "duty": "Assist InfoSec’s TPRM and Client InfoSec Assessments, including assessment activities (completion and quality control reviews) and support reporting efforts to InfoSec leadership and stakeholders."
    },
    {
      "duty": "Evolve risk methodologies, as well as conduct and support risk assessments to support InfoSec the identification of risk across policy domains, identify opportunities for control enhancement and risk mitigation."
    },
    {
      "duty": "Facilitate the definition and maintenance of InfoSec governance and risk measures and metrics; and Handle additional related projects as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Cybersecurity, Information Technology, or a related field (Master's preferred)"
    }
  ]
}