{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Warehouse Operations",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Analytics",
      "experience": 7
    },
    {
      "skill": "Supply Chain Management",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Inventory Management",
      "experience": 7
    },
    {
      "skill": "Operational Planning",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead cross-functional projects to uncover optimization opportunities and guide strategic decisions."
    },
    {
      "duty": "Conduct analysis/extraction, providing insights, turnaround plans, and monitoring of operational performance."
    },
    {
      "duty": "Build relationships with internal operational teams to understand their needs for actionable insight into the business."
    },
    {
      "duty": "Ensure consistency and integrity of reported data."
    },
    {
      "duty": "Develop, implement, and assess operational markers to identify areas of concern and trends."
    },
    {
      "duty": "Track progress of initiatives and improvements, and identify gaps or course corrections."
    },
    {
      "duty": "Improve performance by developing presentations of analytic findings."
    },
    {
      "duty": "Assist in coordinating cost savings and initiative impacts into the budgeting process."
    },
    {
      "duty": "Lead the creation, articulation, and interpretation of reporting insights to drive business outcomes."
    },
    {
      "duty": "Manage day-to-day operation of warehouse, including planning, organizing, and monitoring activities of support teams."
    },
    {
      "duty": "Analyze and implement corrective actions when inventory results are outside the normal range on key metrics."
    },
    {
      "duty": "Develop executive level presentations to provide compelling insights."
    },
    {
      "duty": "Work cross functionally with business groups to identify value proposition and impact of business objectives."
    },
    {
      "duty": "Develop, monitor, and improve data, tools, and reports required for Senior Leadership, including forecasting, planning, budgeting, and performance management processes."
    },
    {
      "duty": "Provide ongoing operational support as needed."
    },
    {
      "duty": "Lead profit improvement initiatives."
    },
    {
      "duty": "Coordinate the development, implementation, and continuous assessment of operational markers."
    },
    {
      "duty": "Manage the day-to-day operational and tactical aspects of warehouse operation."
    },
    {
      "duty": "Provide ongoing operational support as needed."
    },
    {
      "duty": "Assist in budgeting, forecasting, and ad-hoc requests."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 70,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Logistics, Supply Chain, Operations Management, or Analytics preferred"
    },
    {
      "credential": "Lean Six Sigma training and certification"
    }
  ]
}