{
  "meta": [
    {
      "job_title": "Senior Sales Engineer",
      "job_category": "Sales",
      "job_class": "Senior Engineer",
      "sector": "Sales",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Sales Process Knowledge",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Power Point",
      "experience": 5
    },
    {
      "skill": "Power BI",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Proactive and ongoing selling activity with customers to understand their needs and position Smart Care to win $1-$4M of project business, with service agreements attached."
    },
    {
      "duty": "Builds personal relationships with customers based on trust and respect seeking to be a trusted advisor."
    },
    {
      "duty": "Navigates customer organizations to build advocates and awareness across multiple functional areas and regional/local leaders."
    },
    {
      "duty": "Develops solid Pipeline for work in development, and delivers signed contracts as Forecasted."
    },
    {
      "duty": "Provides complete project information to the Operations teams ensuring adherence to customer requirements, scope, schedule, budgets and service-level agreements."
    },
    {
      "duty": "Works cross-functionally internally to resolve customer complaints / escalations and improves processes and communications to prevent future issues."
    },
    {
      "duty": "Analyzes customer repair and maintenance data to learn more about customer needs, satisfaction, and growth opportunity areas."
    },
    {
      "duty": "Creates annual strategic plans for assigned accounts including growth plans and budgets."
    },
    {
      "duty": "Creates and conducts quarterly business reviews on Smart Care performance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s or Associates Degree in Business or related field"
    }
  ]
}