{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "General Nursing Care",
      "experience": 5
    },
    {
      "skill": "Clinical Supervision",
      "experience": 5
    },
    {
      "skill": "Delegation",
      "experience": 5
    },
    {
      "skill": "Medication Administration",
      "experience": 5
    },
    {
      "skill": "Clinical Chart Review",
      "experience": 5
    },
    {
      "skill": "Point-of-Care Testing",
      "experience": 5
    },
    {
      "skill": "In-Basket Management",
      "experience": 5
    },
    {
      "skill": "Clinical Liaison",
      "experience": 5
    },
    {
      "skill": "Patient Triage",
      "experience": 5
    },
    {
      "skill": "Work-up Coordination",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide general nursing care to patients and administer prescribed medications and treatments in accordance with nursing standards and per orders."
    },
    {
      "duty": "Organize and provide clinical supervision to the patient care team, including delegation of responsibilities, mentoring, evaluating, educating, scheduling, and counseling the care team staff."
    },
    {
      "duty": "Assist with daily/weekly Care Team scheduling and delegate tasks appropriately according to the scope of licensure."
    },
    {
      "duty": "Prepare and manage materials, deliverables, and review patient charts for missing labs, reports, and/or open orders."
    },
    {
      "duty": "Coordinate outpatient work-up and treatment plans when required, and prepare prescriptions or medication refills for review and signature by provider."
    },
    {
      "duty": "Facilitate clinical messages and chronic condition management education to patients, document progress notes in electronic health record within 24 hours, and manage in-basket requests and respond to all requests in a timely manner."
    },
    {
      "duty": "Serve as a clinical liaison between the call center and medical office, triage urgent same day or double-booked appointment requests, and identify patients who may need point-of-care testing as well as patients with special needs."
    },
    {
      "duty": "Verify chief complaint and take vital signs as requested, review the electronic health record active medication list with patients, and conduct and document point-of-care tests based on protocol."
    },
    {
      "duty": "Contact patients with test results, provide recommendations on cases per physician determination and/or standards of care, and add recommendations to individualized care plans and review After Visit Summary with patient."
    },
    {
      "duty": "Prepare equipment and aid physician during treatment, examination, and testing of patients, and pend tests and procedure orders for physician approval and co-signature."
    },
    {
      "duty": "Assist with new hire orientation, staff training, providing feedback for performance evaluations, and providing information related to employee discipline and termination of staff."
    },
    {
      "duty": "Coordinate and manage daily huddles, review materials and deliverables, and perform other job-related duties as required, including participation in nursing practice work groups and committees."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an accredited school of nursing"
    },
    {
      "credential": "Bachelor’s Degree in Nursing"
    },
    {
      "credential": "Current unencumbered New York State Registered Nurse license"
    },
    {
      "credential": "BLS"
    }
  ]
}