{
  "meta": [
    {
      "job_title": "Concierge",
      "job_category": "Hospitality",
      "job_class": "Front Office",
      "sector": "Hospitality",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Works with guests pre-arrival and in-house to ascertain preferences and provide insightful recommendations."
    },
    {
      "duty": "Conducts pre-arrival process to contact all future guests to arrange services including but not limited to Wine Tastings, Dining Reservations, shipping packages, various Transportation methods, and researching different vendors and service providers."
    },
    {
      "duty": "Handles all guest interactions with the highest level of hospitality and professionalism, accommodating special requests whenever possible; resolves customer complaints; assists customers in all inquiries in connection with hotel services, hours of operations, key hotel personnel, in-house events, directions, etc."
    },
    {
      "duty": "Utilize a variety of software programs. Communicate with internal personnel and departments via radio, Hotsos and phones. Chat guests via messenger application and utilize Four Seasons guest recognition program."
    },
    {
      "duty": "Assure that desk collateral and information for local attractions are updated and current. Know what activities are available in the Valley and establish close contacts with vendors in these areas to provide information, ticketing, and reservations for guests."
    },
    {
      "duty": "Works harmoniously and professionally with co-workers and supervisors."
    },
    {
      "duty": "Assists with responsibilities and duties in the absence of or due to heavy volume in areas of Guest Services, lobby coverage, and phone coverage for ResComm."
    },
    {
      "duty": "Provides basic troubleshooting support for in-room services such as internet, TV movies, games, and Web service."
    },
    {
      "duty": "Works closely with Guest Service staff to ensure smooth handling of guest luggage, guest escorts, deliveries, and special requests."
    },
    {
      "duty": "Perform other tasks or projects as assigned by management."
    }
  ],
  "skills": [
    {
      "skill": "Hospitality Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Reservation Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Conflict Resolution",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 80,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent"
    }
  ]
}