{
  "meta": [
    {
      "job_title": "Registered Radiologic Assistant",
      "job_category": "Allied Health",
      "job_class": "Radiology",
      "sector": "Healthcare",
      "remote": false,
      "salary": 80000
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for medical histories, patient monitoring, and diagnostic tests."
    },
    {
      "duty": "Performs patient risk assessment geared towards the relevant data needed pertinent to the patients radiologic exam."
    },
    {
      "duty": "Monitors patients under the care of the Supervising Physician during radiologic exams."
    },
    {
      "duty": "Recognizes and responds to medical emergencies (e.g., drug reactions, cardiac arrest, and hypoglycemia) and activates emergency response systems."
    },
    {
      "duty": "Verifies appropriateness of radiologic diagnostic procedures in accordance with criteria established by the Department of Radiology and the supervising physician."
    },
    {
      "duty": "Attends conferences as assigned."
    },
    {
      "duty": "Participates in the development and monitoring of patient outcomes per established practice protocols for purposes of quality and performance improvement."
    },
    {
      "duty": "Uses evidence-based health care literature to advise and support appropriate practice changes within the designated service."
    },
    {
      "duty": "Obtains and evaluates vital signs."
    },
    {
      "duty": "Reviews the patients medical record (including previous reports) to verify the appropriateness of a specific exam or procedure and report significant findings to radiologist."
    },
    {
      "duty": "Explains procedure to patient or significant others, including a description of risks, benefits, alternatives, and follow-up."
    },
    {
      "duty": "Documents any adverse occurrence, reaction, extravasation on department forms and in the computer."
    },
    {
      "duty": "Reports any adverse reaction to an Attending Radiologist and to the patient's referring Physician."
    },
    {
      "duty": "Recognizes and initiates treatment for anaphylaxis."
    },
    {
      "duty": "Able to recognize signs and symptoms of IV contrast reactions and respond to contrast reactions including and up to cardiovascular collapse."
    },
    {
      "duty": "Monitors patients during radiologic exams and responds to medical emergencies."
    },
    {
      "duty": "Participates in quality improvement activities within radiology practice."
    },
    {
      "duty": "Provides physician-prescribed post care instructions to patients."
    },
    {
      "duty": "Reviews imaging studies (diagnostic, US, CT, MR), makes initial observations and communicates observations only to the radiologist."
    },
    {
      "duty": "Operates a fixed/mobile fluoroscopic unit and evaluates images for completeness and diagnostic quality."
    },
    {
      "duty": "Performs certain procedures including contrast media administration and needle or catheter placement."
    },
    {
      "duty": "Administers contrast agents and radiopharmaceuticals as prescribed by the radiologist."
    },
    {
      "duty": "Monitors patient for side effects or complications of the pharmaceutical."
    },
    {
      "duty": "Ensures proper documentation of all procedures in the medical record."
    },
    {
      "duty": "Pursues a planned program of professional growth through continuing education conferences."
    },
    {
      "duty": "Serves as a clinical expert and resource for the education of peers and other health professionals."
    },
    {
      "duty": "Monitors and trends the cost effectiveness of the position."
    },
    {
      "duty": "Coordinates implementation of clinical research studies or clinical trials."
    },
    {
      "duty": "Assists in the preparation, implementation, and evaluation of research protocols when applicable."
    },
    {
      "duty": "Works collaboratively with nursing and other disciplines in the development and implementation of clinical studies within the area of expertise."
    }
  ],
  "skills": [
    {
      "skill": "Patient Monitoring",
      "experience": 5
    },
    {
      "skill": "Diagnostic Tests",
      "experience": 5
    },
    {
      "skill": "Medical Emergency Response",
      "experience": 5
    },
    {
      "skill": "Medical Record Review",
      "experience": 5
    },
    {
      "skill": "Adverse Reaction Management",
      "experience": 5
    },
    {
      "skill": "Clinical Procedure Performance",
      "experience": 5
    },
    {
      "skill": "Radiologic Exam Assistance",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Imaging Study Review",
      "experience": 5
    },
    {
      "skill": "Fluoroscopic Unit Operation",
      "experience": 5
    },
    {
      "skill": "Contrast Media Administration",
      "experience": 5
    },
    {
      "skill": "Clinical Research Coordination",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an A.R.R.T. approved Registered Radiologist Assistant Program; current license by the New York State Department of Education as a Specialist Assistant in Radiology"
    }
  ]
}