{
  "meta": [
    {
      "job_title": "Sales Development Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Outbound Calling",
      "experience": 3
    },
    {
      "skill": "Qualification",
      "experience": 3
    },
    {
      "skill": "Consultative Selling",
      "experience": 3
    },
    {
      "skill": "CRM Management",
      "experience": 3
    },
    {
      "skill": "Lead Generation",
      "experience": 3
    },
    {
      "skill": "Rapport Building",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "CRM Reporting",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive top-of-the-funnel lead generation for account executives and sales managers with a daily target of 50+ calls per day."
    },
    {
      "duty": "Qualify all leads within budget, authority, need, and timeline (B.A.N.T.) to ensure all discovery questions are derived before passing leads over to Sales."
    },
    {
      "duty": "For leads not ready to commit to sales, build rapport with contacts by offering resources (webinar invitations, white papers, relevant blog articles, etc.) and understanding where the prospect is in the buying process."
    },
    {
      "duty": "Gather key information, update the CRM system, and develop a contact/opportunities follow-up strategy."
    },
    {
      "duty": "Update and manage all Marketing-generated leads and ensure all sales activity is reported in the CRM are disseminated to the Sales representative for that territory or deal size."
    },
    {
      "duty": "Consistently achieve a monthly quota of qualified leads for Sales."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    },
    {
      "credential": "2-4 years of experience in marketing, sales, or technology field."
    },
    {
      "credential": "Proven record of engaging in Enterprise level accounts and C-level titles."
    },
    {
      "credential": "Experience with Salesforce.com or similar CRM a plus."
    },
    {
      "credential": "Experience with HubSpot CRM and automation platforms preferred."
    },
    {
      "credential": "Prior experience working for data center provider, cloud provider, or software/technology firm, strongly desired. Relevant training in sales and marketing."
    }
  ]
}