{
  "meta": [
    {
      "job_title": "Maintenance Assistant, Multifamily",
      "job_category": "Maintenance",
      "job_class": "Assistant",
      "sector": "Real Estate",
      "salary": 45000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Maintenance Functions",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Apartment Maintenance",
      "experience": 3
    },
    {
      "skill": "General Repairs",
      "experience": 3
    },
    {
      "skill": "HVAC System",
      "experience": 3
    },
    {
      "skill": "Groundskeeping",
      "experience": 3
    },
    {
      "skill": "Carpentry",
      "experience": 3
    },
    {
      "skill": "Plumbing",
      "experience": 3
    },
    {
      "skill": "Electrical Repairs",
      "experience": 3
    },
    {
      "skill": "Snow Removal",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepares Market Ready apartments, including painting, carpet repairs, cleaning, general repairs, housekeeping duties, and any necessary duties for a quality move-in experience for residents."
    },
    {
      "duty": "Responds to resident requests in a timely and professional manner, with knowledge of maintenance functions such as plumbing, HVAC, basic electric, general carpentry skills, painting, and snow removal."
    },
    {
      "duty": "Maintains grounds, pools/hot tubs, common areas, and dog park amenities to keep clean, operational, and safe for residents."
    },
    {
      "duty": "Reports any maintenance concerns on vacant units, models, and common areas to the Maintenance Supervisor, and performs scheduled maintenance as required."
    },
    {
      "duty": "Attends training programs as required, delivers superior customer service, maintains company tools and equipment, and complies with safety policies and procedures."
    },
    {
      "duty": "Dresses per company appearance standards, maintains and safeguards company tools and equipment, and performs any other related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, GED, Trade, Technical, or Vocational school"
    }
  ]
}