{
  "meta": [
    {
      "job_title": "Payroll and Benefits Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Human Resources",
      "salary": 50000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Payroll Processing",
      "experience": 2
    },
    {
      "skill": "Employee Benefits Management",
      "experience": 3
    },
    {
      "skill": "Personnel Record Keeping",
      "experience": 3
    },
    {
      "skill": "HR Policy Development",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Microsoft Excel",
      "experience": 3
    },
    {
      "skill": "Benefit Counseling",
      "experience": 3
    },
    {
      "skill": "Payroll Auditing",
      "experience": 2
    },
    {
      "skill": "Workplace Diversity",
      "experience": 2
    },
    {
      "skill": "Work Schedule Management",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Processes payroll, receives employee payroll changes, and provides routine human resources information to one or more work units in order to ensure timely and accurate payroll transaction processing."
    },
    {
      "duty": "Maintains personnel records and assists with work unit operational policy development."
    },
    {
      "duty": "Provides accurate, timely, and comprehensive benefit information and counseling to employees to assist audiences in understanding benefits eligibility, selection, and enrollment rules."
    },
    {
      "duty": "Prepares, organizes, disseminates, and processes payroll and benefit resources, communications, and materials for one or more work units through various mediums under general supervision."
    },
    {
      "duty": "Prepares and audits standard work unit payrolls, and completes payroll transactions and changes adhering to established policies and procedures to meet anticipated deadlines."
    },
    {
      "duty": "Counsels new, existing, and terminating employees on payroll and benefit options, timelines, taxes, and deductions."
    },
    {
      "duty": "Assists employees with the completion of benefit enrollments, changes, and maintenance of employee records according to established policies and procedures."
    },
    {
      "duty": "Represents unit/program at payroll workshops, informational meetings, and training sessions."
    },
    {
      "duty": "Contributes to the development, implementation, interpretation, and revision of work unit Human Resources policies and procedures according to institutional and legal rules and regulations."
    },
    {
      "duty": "Drafts and sends offer letters to incoming and returning graduate students, honorary and employee-in-training appointments for unit."
    },
    {
      "duty": "Serves as unit coordinator for visa applications."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's Degree (Preferred)"
    }
  ]
}