{
  "meta": [
    {
      "job_title": "Systems Engineering Director",
      "job_category": "Software Engineering",
      "job_class": "Director",
      "sector": "Software Engineering",
      "salary": 320000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Management",
      "experience": 8
    },
    {
      "skill": "Technical Expertise",
      "experience": 8
    },
    {
      "skill": "Sales Support",
      "experience": 8
    },
    {
      "skill": "Business Acumen",
      "experience": 8
    },
    {
      "skill": "Team Management",
      "experience": 8
    },
    {
      "skill": "Security Platform Knowledge",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Communication",
      "experience": 8
    },
    {
      "skill": "Problem Resolution",
      "experience": 8
    },
    {
      "skill": "Mentoring",
      "experience": 8
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 8
    },
    {
      "skill": "Industry Knowledge",
      "experience": 8
    },
    {
      "skill": "Travel Management",
      "experience": 8
    },
    {
      "skill": "Matrix Management",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of Systems Engineering Managers and provide support to Systems Engineers (SE) to drive growth within Major Accounts."
    },
    {
      "duty": "Develop and execute technical pre-sales operations and achieve revenue generation, individual, team, and organizational quotas."
    },
    {
      "duty": "Interact at a senior level with customers and partners to provide valuable insight into industry trends, customer challenges, technical evolutions, and business changes."
    },
    {
      "duty": "Ensure effective account planning is being executed and deliver compelling business-focused solutions that address customers' security needs."
    },
    {
      "duty": "Develop and maintain strong relationships with company partners and drive initiatives to improve sales productivity through partner leverage."
    },
    {
      "duty": "Lead portfolio expansion initiatives, upsell subscriptions, and ensure metric-based results are evident across all areas of focus."
    },
    {
      "duty": "Provide account support through SE assignments, load balancing, continuity, strategic planning, and customer meetings including sales calls, relationship building, and problem resolution."
    },
    {
      "duty": "Operate effectively in a matrix manner with extended teams, such as Support, Finance, WW SE, HR, Product Management, and other relevant organizations."
    },
    {
      "duty": "Act as an escalation point for pre-sales and post-sales technical issues in the territory."
    },
    {
      "duty": "Develop, mentor, manage, and support reporting sales engineers with technical and organizational leadership."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 30,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "A minimum of 8 years of first and/or second line, Systems Engineering management experience preferred"
    }
  ]
}