{
  "meta": [
    {
      "job_title": "Customer Service Associate",
      "job_category": "Customer Service",
      "job_class": "Entry-Level",
      "sector": "Hospitality",
      "salary": 32000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Cashiering",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Teamwork",
      "experience": 1
    },
    {
      "skill": "Cleaning",
      "experience": 1
    },
    {
      "skill": "Food Handling",
      "experience": 1
    },
    {
      "skill": "Training",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Providing great customer service, taking orders in the drive-thru, assembling orders, delivering food to customers, and cleaning the dining room."
    },
    {
      "duty": "Thrive in a fast-paced environment and work shifts including opening and closing shifts."
    },
    {
      "duty": "Opportunity to earn hourly pay increase through additional training, certifications, and performance evaluations."
    },
    {
      "duty": "Lift and carry, push or pull heavy objects up to 50 pounds, kneel, bend, twist or stoop, ascend or descend stairs, reach and grasp objects, demonstrate excellent verbal and written communication, show up to scheduled shifts on time, clean tables, floors and other areas of the Restaurant, take orders from Customers, process payments efficiently, and follow proper safety procedures when handling and/or preparing food."
    },
    {
      "duty": "Must be 16 years of age or older, provide quick and friendly service to Customers, work together as a team, assist other Crewmembers, work under pressure and at a fast pace, take initiative, and comply with Company policies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "No formal education required, paid training provided for every new Customer Service Associate on the team."
    }
  ]
}