{
  "meta": [
    {
      "job_title": "Project Leader",
      "job_category": "Engineering",
      "job_class": "Project Leader",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Technical Skills",
      "experience": 5
    },
    {
      "skill": "Safety Standards Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, execute, and complete projects with assigned customers in a safe and cost-effective manner."
    },
    {
      "duty": "Manage project financial results, costs, billings, and collections."
    },
    {
      "duty": "Provide work direction to subcontractors, electrical installers, technicians, and designers."
    },
    {
      "duty": "Ensure compliance with all legal requirements and safety standards."
    },
    {
      "duty": "Complete installation hardware design and software programming using established standards."
    },
    {
      "duty": "Manage the selection, ordering, budget, and delivery schedule of materials for the projects assigned."
    },
    {
      "duty": "Provide jobsite coordination for panel and field device physical locations."
    },
    {
      "duty": "Manage and complete the loading, device verification, and commissioning of all system controllers."
    },
    {
      "duty": "Validate complete system functionality and resolve issues with subcontractors to ensure proper operation."
    },
    {
      "duty": "Provide accurate project as-built and commissioning documentation."
    },
    {
      "duty": "Develop project plans and coordinate the required resources to ensure timely and cost-effective installation and completion of assigned projects."
    },
    {
      "duty": "Perform site-specific training for owner/operator on the total system."
    },
    {
      "duty": "Develop and maintain viable long-term relationships with contractors, clients, consultants, and subcontractors."
    },
    {
      "duty": "Attend job progress meetings as required."
    },
    {
      "duty": "Follow all safety standards and have the highest regard for employee and subcontractor safety."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of a technical Associates Degree with two years of field experience or four years of equivalent related field experience. Must have applicable Building Automation Systems design and commissioning experience. Must have appropriate licensing, certifications, and relevant hands-on experience."
    }
  ]
}