{
  "meta": [
    {
      "job_title": "Environmental Compliance Inspection Program Manager",
      "job_category": "Environmental Compliance",
      "job_class": "Program Manager",
      "sector": "Environmental",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Environmental Compliance",
      "experience": 7
    },
    {
      "skill": "Program Management",
      "experience": 7
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 7
    },
    {
      "skill": "Environmental Science",
      "experience": 7
    },
    {
      "skill": "Technical Training",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Negotiation",
      "experience": 7
    },
    {
      "skill": "Environmental Auditing",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage, develop, coordinate, and direct the Environmental Compliance Inspection Program."
    },
    {
      "duty": "Provide expert analysis to ensure environmental liabilities and risks are minimized through evaluation of environmental compliance and commitments."
    },
    {
      "duty": "Establish and communicate compliance program policies and procedures to internal and external customers by providing program guidance, training, direction and assistance."
    },
    {
      "duty": "Establish, organize, manage and coordinate statewide environmental compliance and commitment assessment and assistance programs."
    },
    {
      "duty": "Provide quality control of program activities to ensure compliance with applicable state and federal laws and regulations."
    },
    {
      "duty": "Develop tools for compliance and commitment assessment, quality control, and performance tracking."
    },
    {
      "duty": "Provide environmental compliance program technical guidance, assistance, training, and support to internal and external customers."
    },
    {
      "duty": "Monitor legal, regulatory, or technological resources to ensure compliance and best practices."
    },
    {
      "duty": "Participate on committees and serve as a representative in areas of specialization."
    },
    {
      "duty": "Obtain Virginia Erosion and Sediment Control Inspector Certification within 12 months of employment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Environmental Science, Geology, Chemistry, Environmental Engineering or related field (Master's preferred)"
    },
    {
      "credential": "Virginia Erosion and Sediment Control Inspector Certification"
    }
  ]
}