{
  "meta": [
    {
      "job_title": "Quality Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Adheres to Integer Core Beliefs and all safety and quality requirements including, but not limited to: Quality Management Systems (QMS), Environmental Management Systems (EMS), U.S. Food and Drug Administration (FDA) regulations, Company policies and operating procedures, and other regulatory requirements."
    },
    {
      "duty": "Support regulatory and agency inspections, audits, investigations, and inquiries regarding the control and assessment of product design and manufacturing quality."
    },
    {
      "duty": "Monitor manufacturing of assigned products, assuring compliance with DMR while providing deviation/waiver guidance and assuring complete and correct Device History Records are maintained."
    },
    {
      "duty": "Leads and implements various product and process improvement methodologies."
    },
    {
      "duty": "Review the adequacy and correctness of changes to Bill of Materials (BOM’s), Assembly Procedures, Drawings, Component Specification, FMEAs, Control Plans, etc."
    },
    {
      "duty": "Leads in the completion and maintenance of risk analysis."
    },
    {
      "duty": "Leads generation and completion of protocols and reports for test method validations."
    },
    {
      "duty": "Interfaces with Manufacturing Engineers to review processes for new and existing products and coordinate process validations and capability studies. Recommends process monitoring devices where applicable."
    },
    {
      "duty": "Develops various inspection techniques and procedures to ensure product integrity to design specifications. Responsible for the writing, approval and implementation of Incoming, In-Process and Final Inspection procedures."
    },
    {
      "duty": "Ensures that the disposition of non-conforming materials meet all necessary regulatory requirements and assure adequacy of corrective actions to prevent re-occurrence."
    },
    {
      "duty": "Effectively communicate and interact with customers."
    },
    {
      "duty": "Leads and manages complaint investigations."
    },
    {
      "duty": "Acts as a lead in plant CAPA activities, including analysis of data and trends in complaints, supplier quality, nonconforming material, training effectiveness, and root causes analysis."
    },
    {
      "duty": "Assist with product transfers."
    },
    {
      "duty": "Works with suppliers, management, Engineers and Manufacturing associates in the resolution of quality problems. Also, assists each of these groups with capability studies and the application of statistical quality control which include Cpk, DOE, Hypotheses Testing, etc."
    },
    {
      "duty": "Provides support to other quality engineers."
    },
    {
      "duty": "Performs Other Functions As Required."
    }
  ],
  "skills": [
    {
      "skill": "Quality Management Systems",
      "experience": 7
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 7
    },
    {
      "skill": "Product and Process Improvement",
      "experience": 7
    },
    {
      "skill": "Risk Analysis",
      "experience": 7
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 7
    },
    {
      "skill": "Manufacturing Process Validation",
      "experience": 7
    },
    {
      "skill": "Customer Interaction",
      "experience": 7
    },
    {
      "skill": "Complaint Investigations",
      "experience": 7
    },
    {
      "skill": "Statistical Quality Control",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in engineering, equivalent degree or extensive work experience"
    }
  ]
}