{
  "meta": [
    {
      "job_title": "UX Program Manager",
      "job_category": "Program Management",
      "job_class": "Manager",
      "sector": "Technology",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "UX Design",
      "experience": 4
    },
    {
      "skill": "User Research",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Risk Management",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide operational excellence across UX teams, while building strong collaborative relationships with appropriate stakeholders across program work."
    },
    {
      "duty": "Develop a plan to assess continuous improvement opportunities for UX programs and processes. Decide on the method to collect data, analyze the data for insights, propose improvements and test them with stakeholders."
    },
    {
      "duty": "Provide input to defining metrics that drive a culture of user-centered development and demonstrate UX impact based on program needs, and facilitate alignment within UX. Execute plans to establish baselines, track and report on UX metrics."
    },
    {
      "duty": "Scale, prioritize and independently execute project plans end-to-end, thinking about how to optimize resourcing, time, and funding investment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent practical experience. 4 years of program management experience within design or UX organizations.4 years of experience with UX related projects and UX design, user research, and/or user centered development tools and methodologies."
    },
    {
      "credential": "Experience with the product development lifecycle. Experience analyzing data and delivering recommendations for improvement. Experience managing risks (e.g. operational, product, team health).Knowledge of technology trends and issues.Ability to work across organizational boundaries to define, manage, and prioritize work.Excellent communication, presentation, and analytical skills; ability to communicate complex interaction concepts clearly and persuasively across different audiences and varying levels of the organization."
    }
  ]
}