{
  "meta": [
    {
      "job_title": "Sales Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Passionately represents products and services by sharing and demonstrating product and sales know-how with customers."
    },
    {
      "duty": "Provides product demonstrations to educate customers on full product capabilities to maximize their experience."
    },
    {
      "duty": "Takes a customer-first approach with all customer interactions. Listens and evaluates customer needs and provides appropriate solutions."
    },
    {
      "duty": "Achieves sales and customer experience goals and objectives."
    },
    {
      "duty": "Provides comprehensive customer onboarding activities and ensures customers fully understand how to use and manage all company products/services and gains their consent."
    },
    {
      "duty": "Performs operational and administrative tasks."
    },
    {
      "duty": "Partners with customer care to resolve customer issues, as appropriate."
    },
    {
      "duty": "Consistently demonstrates sales excellence and professionalism with integrity and a warm and friendly demeanor to customers and teammates."
    },
    {
      "duty": "Complies with all company and retail operational policies and procedures."
    },
    {
      "duty": "Completes training requirements and actively engage in team huddles and learning."
    },
    {
      "duty": "Knows and understands sales compensation plan and its key elements."
    },
    {
      "duty": "Must be able to work a flexible schedule that includes evenings, weekends, holidays, variable schedule(s) and overtime as needed. May be asked to work in alternate stores outside of home base store. Regular, consistent and punctual attendance."
    },
    {
      "duty": "Must be able to carry and lift up to 25 pound boxes, stand and move about the store constantly."
    },
    {
      "duty": "Other duties and responsibilities as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Product Demonstration",
      "experience": 3
    },
    {
      "skill": "Customer Onboarding",
      "experience": 3
    },
    {
      "skill": "Operational Tasks",
      "experience": 3
    },
    {
      "skill": "Administrative Tasks",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma / GED"
    }
  ]
}