{
  "meta": [
    {
      "job_title": "Administrative and Financial Coordinator",
      "job_category": "Administration",
      "job_class": "Coordinator",
      "sector": "Finance",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Utilize and create effective tracking and management systems, follow up on open issues, and carry tasks through to successful completion."
    },
    {
      "duty": "Process transactions in the invoicing cycle, including tracking invoice submission dates, creating and sending invoices, and supporting documentation and A/R management."
    },
    {
      "duty": "Respond to inquiries via email or telephone while providing relevant information and/or routing to appropriate staff."
    },
    {
      "duty": "Coordinate and support client's shared Washington DC office, including office use by partners office partner agreements, and the recruitment and onboarding of office partners."
    },
    {
      "duty": "Coordinate and support client's shared Washington DC office, including office use by partners office partner agreements, and the recruitment and onboarding of office partners."
    },
    {
      "duty": "Support onboarding of new employees, annual benefits open enrollment, and other HR activities."
    },
    {
      "duty": "Provide administrative, record keeping, and planning support to the Board of Trustees."
    },
    {
      "duty": "Coordinate and maintain the organizational and general areas of the client website."
    },
    {
      "duty": "Maintain and manage conference room reservations and technology needs."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree and a minimum of 2-3 years of related experience. Overall equivalent experience will also be considered. Familiarity with accounting and administrative procedures. Experience with the accounting software Intacct, QuickBooks, and bill.com is (preferred). Strong Excel and database skills with a demonstrated proficiency in other Office products (Windows, Microsoft Word, PowerPoint, and Outlook). Experience with and an interest in IT solutions will be an asset."
    }
  ]
}