{
  "meta": [
    {
      "job_title": "Facilities Technician",
      "job_category": "Maintenance",
      "job_class": "Technician",
      "sector": "Energy",
      "salary": 68000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Facility Maintenance",
      "experience": 5
    },
    {
      "skill": "Mechanical Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Warehouse Management",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Pipeline Maintenance",
      "experience": 5
    },
    {
      "skill": "Valve and Regulator Inspection",
      "experience": 5
    },
    {
      "skill": "SAP Data Entry",
      "experience": 5
    },
    {
      "skill": "Heavy Lifting",
      "experience": 5
    },
    {
      "skill": "Driving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Troubleshoot, operate, and maintain gas-fired large-bore reciprocating engines, gas compressors, standby generator engines, centrifugal and diaphragm pumps, low pressure boilers, oil coolers, air compressors, large-bank cooler fans and gear boxes, large diameter valves and operators, and other auxiliary equipment."
    },
    {
      "duty": "Perform facility checks, housekeeping, and grounds maintenance."
    },
    {
      "duty": "Manage warehouse and project inventory, assemble material needs for upcoming scheduled jobs and projects to ensure reliability needs are met, and mitigate material waste inventory and disposal."
    },
    {
      "duty": "Handle shipping & receiving (at times to other facilities) and conduct safety and compliance related inspections."
    },
    {
      "duty": "Provide assistance with other Mechanic tasks and assist in full or partial large-bore reciprocating engine/gas compressor overhauls."
    },
    {
      "duty": "Operate compressor engines and support equipment, maintain and repair pipeline, and operate and maintain valves and operators."
    },
    {
      "duty": "Inspect, repair, and set regulators and relief valves, blow down, purge, and pressurize pipelines and/or stations, and perform storage field facility operations and maintenance."
    },
    {
      "duty": "Perform line locates on company pipelines and/or utility line patrols and associated right-of-way maintenance."
    },
    {
      "duty": "Plan, coordinate, and perform mechanical maintenance activities, complete work orders, enter data into job plans, and create new work orders, etc. in SAP."
    },
    {
      "duty": "Other tasks as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent"
    }
  ]
}