{
  "meta": [
    {
      "job_title": "Senior Financial Business Intelligence Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Tableau",
      "experience": 5
    },
    {
      "skill": "Power BI",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "SSAS",
      "experience": 5
    },
    {
      "skill": "SSRS",
      "experience": 5
    },
    {
      "skill": "MS Excel",
      "experience": 5
    },
    {
      "skill": "MS PowerPoint",
      "experience": 5
    },
    {
      "skill": "3E Accounting Software",
      "experience": 3
    },
    {
      "skill": "General Accounting Principles",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Developing reports for financial analysis, production, data and process control using Tableau/Power BI, SQL, SSAS, Excel, and other tools that access the firm’s financial databases."
    },
    {
      "duty": "Driving advancements in the Firm’s reporting, data visualization and analysis capabilities."
    },
    {
      "duty": "Performing in-depth analysis using critical thinking skills to provide accurate financial insights in a format that is useful and meaningful to the audience."
    },
    {
      "duty": "Providing financial reports, data visualizations, and reporting packages for Firm leadership and management to use in decision making."
    },
    {
      "duty": "Summarize analytical results and effectively communicate with various levels of stakeholders."
    },
    {
      "duty": "Interpret data needs and design, develop, and deploy analytical tools to improve and optimize business decisions and performance."
    },
    {
      "duty": "Balancing and prioritizing tasks and projects based on deadlines or the importance and urgency."
    },
    {
      "duty": "Experience working in a Law Firm (strongly preferred)."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business Administration, or a related field (Master's preferred)"
    }
  ]
}