{
  "meta": [
    {
      "job_title": "Baking Technology Specialist",
      "job_category": "Engineering",
      "job_class": "Specialist",
      "sector": "Food Science",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Baking Process Evaluation",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "MS Excel",
      "experience": 5
    },
    {
      "skill": "MS Word",
      "experience": 5
    },
    {
      "skill": "PowerPoint",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide technical support to bakeries in the areas of ingredient, formula, and process baking technology, with a focus on finished product quality and safety."
    },
    {
      "duty": "Troubleshoot bakery issues and provide support to ensure corrective actions are taken by bakery teams."
    },
    {
      "duty": "Coordinate with Operations teams to drive the scale-up and commercialization of new products, cost savings projects, and product reformulations."
    },
    {
      "duty": "Address product quality concerns, consumer complaints, waste reduction efforts, and other initiatives using continuous improvement and statistical tools."
    },
    {
      "duty": "Participate as a key technical resource with Engineering and Operations teams on process and equipment modifications to maintain overall quality."
    },
    {
      "duty": "Complete and post updated product code books for key launches and conduct formula audits using internal database."
    },
    {
      "duty": "Lead productivity initiatives and summarize results with key follow-ups to Operations team."
    },
    {
      "duty": "Domestic travel approximately 80-90% of the time, with occasional weekend work."
    },
    {
      "duty": "Other assignments as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Food Science, Food Engineering, or a related field. A combination of education, training, and experience demonstrating competency to perform the work may be substituted."
    }
  ]
}