{
  "meta": [
    {
      "job_title": "Graphic Designer",
      "job_category": "Design",
      "job_class": "Designer",
      "sector": "Design",
      "salary": 35000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Graphic Design",
      "experience": 5
    },
    {
      "skill": "Illustration",
      "experience": 5
    },
    {
      "skill": "Brand Marketing",
      "experience": 5
    },
    {
      "skill": "Print Collateral",
      "experience": 5
    },
    {
      "skill": "Digital Assets",
      "experience": 5
    },
    {
      "skill": "Social Media Graphics",
      "experience": 5
    },
    {
      "skill": "Email Design",
      "experience": 5
    },
    {
      "skill": "Web Banners",
      "experience": 5
    },
    {
      "skill": "Tradeshow Collaterals",
      "experience": 5
    },
    {
      "skill": "InDesign",
      "experience": 5
    },
    {
      "skill": "Illustrator",
      "experience": 5
    },
    {
      "skill": "Dreamweaver",
      "experience": 5
    },
    {
      "skill": "Photoshop",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design consumer-packaged goods within the candy industry and assist in brainstorming and sketching ideas."
    },
    {
      "duty": "Work with procurement to create prototypes and refine prototypes based on feedback from clients, consumers, and operations."
    },
    {
      "duty": "Work closely with the department leader on a range of creative projects and develop different graphic designs across the business."
    },
    {
      "duty": "Provide production support by executing various changes across the portfolio of brands with the goal to inspire and attract the target audience."
    },
    {
      "duty": "Handle preflight formatting of collateral and collecting, processing, checking, and uploading files and conducting prepress checks as needed."
    },
    {
      "duty": "Supply artwork to advertising publications and print suppliers for production."
    },
    {
      "duty": "Check grammar, punctuation, and accuracy on printed and online material."
    },
    {
      "duty": "Collaborate, develop and manage timelines with external partners on projects."
    },
    {
      "duty": "Responsible for physical and digital mockups requested as needed for marketing, sales, trade events, etc."
    },
    {
      "duty": "Ensure all deliverables remain true to brand guidelines."
    },
    {
      "duty": "Maintain the confidentiality of sensitive information and high ethical standards in the workplace."
    },
    {
      "duty": "Maintain good communication with other managers, staff, and outside contacts."
    },
    {
      "duty": "Assist in developing assets including print collaterals, digital assets, social media graphics, emails, web banners, tradeshow collaterals, and branded items upon request."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 20,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Graphic Design. Certified Graphic Designer or Certified Professional in Graphic Design preferred."
    }
  ]
}