{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Primarily responsible for freight processing and merchandising functions within the store and is accountable for merchandising and storeroom organization standards."
    },
    {
      "duty": "Leads, directs, and at times, actively participates in various aspects of the merchandising process, including freight prep, truck unload, stocking, re-lays, financial management, and inventory control."
    },
    {
      "duty": "When serving as Manager on Duty, leads and provides direction to store associates performing all cashiering, customer service, recovery, and furniture-related activities on the sales floor."
    },
    {
      "duty": "Establishes plans to accomplish merchandising initiatives and achieve defined goals. Utilizes company tools, reports, and feedback to effectively analyze trends and refine plans."
    },
    {
      "duty": "Participates in the interviewing, selection, hiring, and training of associates in collaboration with store leadership."
    },
    {
      "duty": "Assists with store scheduling and payroll processes on a daily and weekly basis."
    },
    {
      "duty": "Serves in the Manager on Duty role as needed including opening and closing the store. When serving in this role, provides leadership and direction to floor associates and ensures that store, merchandising, and customer service standards are continuously met, including merchandise presentation, signage, recovery, and cleanliness."
    },
    {
      "duty": "Drives the customer experience and ensures resolution of customer issues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, GED, or equivalent work experience required."
    },
    {
      "credential": "Must be 18 years of age."
    },
    {
      "credential": "Minimum three years retail management experience preferred."
    },
    {
      "credential": "Ability to lift, carry, push, and pull a minimum of 50 pounds required."
    },
    {
      "credential": "Ability to unload freight, to move product on and off store shelves, to walk, stand, bend, stoop, or kneel for long periods of time, and to move freely throughout store on a continual basis required."
    },
    {
      "credential": "Availability to work a variable schedule of at least 40 to 45 hours per week, including nights, weekends, and holidays required."
    },
    {
      "credential": "Ability to travel between stores with some overnight stays required."
    },
    {
      "credential": "Demonstrated visual merchandising skills required."
    },
    {
      "credential": "Basic English literacy, math, and PC skills required."
    }
  ]
}