{
  "meta": [
    {
      "job_title": "Project Manager/Constructions",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Be the primary point of contact between the customer and the sales team, managing projects from launch to completion."
    },
    {
      "duty": "Utilize lumber and building materials knowledge to facilitate the construction process."
    },
    {
      "duty": "Effectively organize shifting priorities and work within time-sensitive deadlines with a sense of urgency."
    },
    {
      "duty": "Learn and implement appropriate prioritization of tasks and focus on the most important to management’s objectives."
    },
    {
      "duty": "Maintain positive, proactive, and energetic attitude, working well on a team and demonstrating strong business ethics."
    },
    {
      "duty": "Use advanced level of Microsoft Word, Excel, and Outlook, while also demonstrating a strong aptitude for learning proprietary software and building on other software skills."
    },
    {
      "duty": "Demonstrate strong math skills, including measurement calculation, math problem-solving, and analytical ability."
    },
    {
      "duty": "Be capable of working independently and as part of a team, with strong follow-up skills and excellent customer service skills."
    },
    {
      "duty": "Maintain attention to detail and assert oneself in an effective manner."
    },
    {
      "duty": "Manage health insurance, health savings account, dental insurance, vision insurance, paid time off, discretionary bonus, 401(k) plan with Company stock option, life insurance, and flexible spending account benefits."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Construction Management or a related field (Master's preferred)"
    }
  ]
}