{
  "meta": [
    {
      "job_title": "Senior HR Business Systems Analyst",
      "job_category": "HR",
      "job_class": "Systems Analyst",
      "sector": "Human Resources",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Workday HCM",
      "experience": 5
    },
    {
      "skill": "HR Processes",
      "experience": 5
    },
    {
      "skill": "Business Requirements Analysis",
      "experience": 5
    },
    {
      "skill": "System Testing",
      "experience": 5
    },
    {
      "skill": "Use Case Documentation",
      "experience": 5
    },
    {
      "skill": "Data Quality Management",
      "experience": 5
    },
    {
      "skill": "User Acceptance Testing",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Consultative Approach",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Demonstrate knowledge and experience with Workday HCM and HR processes, including HCM, Payroll, Timekeeping, Benefits, Compensation, and Talent."
    },
    {
      "duty": "Align business goals with HR technology/Workday capabilities and partner with business owners and users to understand and refine business requirements."
    },
    {
      "duty": "Translate business requirements into documented use cases, refine and maintain the product feature/enhancements prioritization and tracking, and serve as the liaison between business teams and IT team."
    },
    {
      "duty": "Assist in the review, testing, and implementation of system upgrades and patches, and architect the Workday solution in collaboration with the IT team."
    },
    {
      "duty": "Lead and execute user acceptance testing for feature and functional delivery, assess new features available, make recommendations, and drive new feature adoption."
    },
    {
      "duty": "Support ongoing process improvement activities to bring greater efficiency to Workday processes, recommend customer service improvements, innovative solutions, policy changes, and/or major variations from established policy."
    },
    {
      "duty": "Engage in regular audits of Workday data with a focus on data quality and completeness, prepare files, and load data while ensuring accuracy, and manage and resolve case escalations within SLA."
    },
    {
      "duty": "Provide HR Tier 2 support for Workday, including researching and troubleshooting unexpected results or process flaws, as well as participating in special projects and performing other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in a work-related discipline/field from an accredited college or university. At least two (2) years of Workday experience with emphasis in Core and Advanced Compensation, and Talent. At least two (2) years supporting HR Compensation and Talent Programs. Healthcare Industry experience a plus."
    }
  ]
}