{
  "meta": [
    {
      "job_title": "Personal/Executive Assistant",
      "job_category": "Administration",
      "job_class": "Assistant",
      "sector": "Management",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Administrative Tasks",
      "experience": 5
    },
    {
      "skill": "Calendar Management",
      "experience": 5
    },
    {
      "skill": "Event Coordination",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Travel Arrangements",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform diverse administrative tasks, including data entry, ordering, reporting weekly company credit card balances, reconciling monthly vendor accounts, researching vendor discrepancies, and implementing organizational structures across departments."
    },
    {
      "duty": "Maintain CEO's inbox organization and flag important emails."
    },
    {
      "duty": "Supervise and schedule window cleaning, coordinate deep cleaning for stores, and manage billings with chemical providers."
    },
    {
      "duty": "Maintain and update calendars by scheduling appointments, meetings, and personal commitments."
    },
    {
      "duty": "Schedule and coordinate meetings, encompassing personal and professional spheres, while ensuring all requisite materials are prepared."
    },
    {
      "duty": "Draft, proofread, and edit correspondence and documents to uphold a high standard of communication."
    },
    {
      "duty": "Assist in planning and coordinating personal events, gatherings, and special occasions."
    },
    {
      "duty": "Manage and track guest lists, and provide comprehensive event schedules to relevant parties."
    },
    {
      "duty": "Process and track essential payments, such as utilities, parking, tuition, medical and insurance premiums, and taxes."
    },
    {
      "duty": "Assist in reviewing and approving investor statements and administrative fees for other company ventures."
    },
    {
      "duty": "Provide aid in maintaining entities and compiling annual tax documents."
    },
    {
      "duty": "Submit personal staff payroll through Quickbooks, overseeing hours and reimbursements."
    },
    {
      "duty": "Arrange travel, including flights, accommodations, and transportation, while accounting for personal preferences and business necessities."
    },
    {
      "duty": "Collaborate closely with household staff for efficient luggage packing."
    },
    {
      "duty": "Ensure thorough travel preparedness, handling check-ins, updating phone plans for international travel, and verifying all required documents."
    },
    {
      "duty": "Stand ready to take notes when required and diligently follow up on action items."
    },
    {
      "duty": "Provide daily schedules and end-of-day summaries."
    },
    {
      "duty": "Manage incoming communications, comprising emails, calls, and messages, and offer responses on behalf of the individual as appropriate."
    },
    {
      "duty": "Collaborate with external vendors/contractors and oversee operational projects as needed."
    },
    {
      "duty": "Fulfill personal errands when required, such as prescription refills and returns."
    },
    {
      "duty": "Serve as a liaison between various parties, ensuring smooth communication and coordination."
    },
    {
      "duty": "Maintain up-to-date contact information and add new contacts as necessary."
    },
    {
      "duty": "Support the merchandising team by facilitating ordering and communication processes, ensuring consistent store fridge and display maintenance."
    },
    {
      "duty": "Assist in managing social media and organizing events."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 20,
      "introvert_extrovert": 20
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Management, or a related field"
    }
  ]
}