{
  "meta": [
    {
      "job_title": "Project Leader",
      "job_category": "Project Management",
      "job_class": "Leadership",
      "sector": "Management",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as the on-site project leader to plan, execute, and complete projects with assigned customers in a safe and cost-effective manner."
    },
    {
      "duty": "Perform or delegate tasks required to execute and fully complete assigned projects including hardware design, system programming, installation coordination, system and network commissioning, and project closeout."
    },
    {
      "duty": "Responsible for overall financial results of assigned projects including costs, project billings, and collections."
    },
    {
      "duty": "Maintain customer satisfaction and profitable and accurate project financial results."
    },
    {
      "duty": "Provide work direction to subcontractors, electrical installers, technicians, designers, and administration as necessary."
    },
    {
      "duty": "Ensure work performed is in compliance with legal requirements and operates with the highest ethics."
    },
    {
      "duty": "Complete typical installation hardware design and software programming using established standards."
    },
    {
      "duty": "Communicate both technical and business-related issues with clients."
    },
    {
      "duty": "Manage the selection, ordering, budget, and delivery schedule of materials to be procured for the projects assigned."
    },
    {
      "duty": "Oversee subcontractor payment and billing processes."
    },
    {
      "duty": "Provide jobsite coordination for panel and field device physical locations."
    },
    {
      "duty": "Ensure installation is in accordance with project requirements and standards."
    },
    {
      "duty": "Complete project billings in a timely and accurate format to the client. Maintain profitability goals and positive cash flow."
    },
    {
      "duty": "Provide coaching, mentoring, and technical assistance to System Technicians, Electrical Installers, and System Designers."
    },
    {
      "duty": "Develop project plans and coordinates required resources to ensure timely and cost-effective installation and completion of assigned projects."
    },
    {
      "duty": "Perform site-specific training for owner/operator on the total system."
    },
    {
      "duty": "Develop and maintain viable long-term relationships with contractors, clients, consultants, and subcontractors."
    },
    {
      "duty": "Attend job progress meetings as required."
    },
    {
      "duty": "Follow all safety standards and have the highest regard for employee and subcontractor safety."
    }
  ],
  "skills": [
    {
      "skill": "Project Leadership",
      "experience": 4
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Technical Expertise",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of a technical Associates Degree with four years of field experience or six years of equivalent related field experience in the industry."
    }
  ]
}