{
  "meta": [
    {
      "job_title": "Pharmacy Technician",
      "job_category": "Pharmacy",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 36000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "High School graduate or equivalentNational certification as a Pharmacy Tech (CPhT) preferredState certification as a Pharmacy TechPrevious pharmacy tech preferred with a minimum of 1-year experience in a hospital setting",
      "experience": 1
    },
    {
      "skill": "Pharmacy knowledge including medical terminology and prescription drug names",
      "experience": 2
    },
    {
      "skill": "Customer service abilities including effective listening skills",
      "experience": 3
    },
    {
      "skill": "Critical thinking skills, decisive judgment and the ability to work with minimal supervision in a fast-paced environment",
      "experience": 4
    },
    {
      "skill": "Ability to perform work that requires frequent standing, bending, reaching, squatting, kneeling, moving, lifting of patients and/or equipment up to 50 lbs",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepare and dispense drugs in accordance with the standard procedures."
    },
    {
      "duty": "Document and maintain appropriate records."
    },
    {
      "duty": "Count, package, and label unit does for inspection by pharmacist."
    },
    {
      "duty": "Assist pharmacists as directed, including filling orders and preparing labels."
    },
    {
      "duty": "Perform quality control and auditing functions to ensure that all medications are appropriately available to caregivers."
    },
    {
      "duty": "Prepare I.V. mixtures and operates automated systems."
    },
    {
      "duty": "Maintain pharmacy inventory and performs clerical duties."
    },
    {
      "duty": "Actively contribute to work toward hospital improvement meeting the core measures and service excellence goals."
    },
    {
      "duty": "Follow established guidelines for reporting a significant medical error or unanticipated outcome in the patients care which results in patient harm."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School graduate or equivalentNational certification as a Pharmacy Tech (CPhT) preferredState certification as a Pharmacy TechPrevious pharmacy tech preferred with a minimum of 1-year experience in a hospital setting"
    }
  ]
}