{
  "meta": [
    {
      "job_title": "Office Manager, Rheumatology",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Office Oversight",
      "experience": 5
    },
    {
      "skill": "Personnel Management",
      "experience": 5
    },
    {
      "skill": "EMR Experience",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage daily activities of a multi-physician office to ensure efficient office operations, including planning, organizing, and directing the overall clinic administrative operations."
    },
    {
      "duty": "Oversee the daily administrative operations of the assigned office(s) and interact regularly with the leadership team."
    },
    {
      "duty": "Conduct staff performance evaluations and wage increase determinations for office staff."
    },
    {
      "duty": "Review annual patient satisfaction surveys and make recommendations as appropriate."
    },
    {
      "duty": "Continually research and introduce process improvement measures and present suggestions to leadership for consideration."
    },
    {
      "duty": "Interact regularly with physicians to ensure operational efficiencies are being met and maintain compliance with governmental regulations and industry requirements."
    },
    {
      "duty": "Serve as a liaison between leadership team and office staff to enhance communication, resolve issues, and best practice to work towards company’s common goal."
    },
    {
      "duty": "Complete daily and monthly financial reconciliation and perform banking duties to include remote checking and bank location deposits."
    },
    {
      "duty": "Conduct scheduled and unscheduled audits on clinic operational effectiveness to ensure compliance with industry standards."
    },
    {
      "duty": "Stay up-to-date with healthcare regulations and perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from an accredited university in healthcare administration, business administration, public administration, or related field preferred"
    }
  ]
}