{
  "meta": [
    {
      "job_title": "Certified Surgical Tech",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 74000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Surgical Technology",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Aseptic Techniques",
      "experience": 5
    },
    {
      "skill": "Operating Room Turnover",
      "experience": 5
    },
    {
      "skill": "Medical Record Keeping",
      "experience": 5
    },
    {
      "skill": "Surgical Equipment Maintenance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in preparing the operative suite for surgery by checking and gathering supplies, equipment, and instruments."
    },
    {
      "duty": "Ensure that surgical asepsis is maintained in the handling of instruments, sponges, sutures, drains, needles, and dressings."
    },
    {
      "duty": "Assist in the turnover of the operating room suites between cases, disposing of trash and linens, and cleaning of equipment and environmental surfaces."
    },
    {
      "duty": "Demonstrate necessary practical, technical, or specialized skills required for the role of the surgical technician in accordance with the Association of Surgical Technologists."
    },
    {
      "duty": "Prepare procedure room for use the following day by bringing in equipment, setting up, and reporting to supervisor items that are needed and not available."
    },
    {
      "duty": "Collection and recording of pertinent clinical data in the medical record and consistent collaboration with the Registered Nurse in clinical decision making."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an accredited Surgical Technology program as required per facility practice and state regulatory requirement; otherwise preferred."
    },
    {
      "credential": "Surgical Tech Certification"
    },
    {
      "credential": "One year experience in an operating room setting (preferably in an ambulatory surgery center)"
    },
    {
      "credential": "Valid BCLS Certification upon employment (Online certification not acceptable)"
    }
  ]
}