{
  "meta": [
    {
      "job_title": "Manager for Customer Success Renewal Quoting",
      "job_category": "Customer Success",
      "job_class": "Manager",
      "sector": "Customer Success",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Success Operations",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Contract Creation and Review",
      "experience": 5
    },
    {
      "skill": "Salesforce (or similar CRM)",
      "experience": 5
    },
    {
      "skill": "Gainsight",
      "experience": 5
    },
    {
      "skill": "NetSuite",
      "experience": 5
    },
    {
      "skill": "Business Collaboration Tools",
      "experience": 5
    },
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage quoting analysts responsible for quote creation and revision to execute on a predefined set of key performance indicators."
    },
    {
      "duty": "Lead a team to grow and drive on-time renewals and work along with other positions within the Customer Success and Sales organizations."
    },
    {
      "duty": "Support and provide guidance to the renewal quoting analyst team with quote creation, revision, and nonstandard term approval."
    },
    {
      "duty": "Select, develop, and evaluate personnel to ensure the efficient operation of the function."
    },
    {
      "duty": "Establish relationships with team leads of adjacent functions, defining roles, responsibilities, and accountability to develop and streamline processes."
    },
    {
      "duty": "Assist with special projects related to the renewal quoting process and function."
    },
    {
      "duty": "Drive effectiveness to reduce overall time spent on tasks related to renewal quote creation/revision by identifying improvements to the quoting processes and tools."
    },
    {
      "duty": "Ensure achievement of on time, accurate, and actionable renewal quote creation, revisions, and other key metrics."
    },
    {
      "duty": "Ensure renewal pricing follows current policies, rules, and procedures based on configuration of the offering and instance, including review and accurate inclusion of historical orders and product migrations by customer."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree, or 5+ years' experience in an Operations, Product, or Specialists role within a B2B organization"
    }
  ]
}