{
  "meta": [
    {
      "job_title": "Senior Client Relationship Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 231730,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Account Management",
      "experience": 10
    },
    {
      "skill": "Client Service",
      "experience": 10
    },
    {
      "skill": "Relationship Management",
      "experience": 10
    },
    {
      "skill": "Service Planning",
      "experience": 10
    },
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Business Acumen",
      "experience": 10
    },
    {
      "skill": "Marketing Strategy",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement strategies to grow trusted-advisor relationships and facilitate an exceptional client experience."
    },
    {
      "duty": "Serve as the hub of the account team for key client accounts, working with Client Leads to support strategic execution."
    },
    {
      "duty": "Lead and track multiple, complex sets of client relationship activities including RFPs, new business opportunities, client events, and custom client marketing efforts."
    },
    {
      "duty": "Plan and lead recurring internal team meetings, managing agenda preparation and tracking follow-up items."
    },
    {
      "duty": "Develop and provide regular client relationship reporting focused on key metrics, strategic actions, and impact."
    },
    {
      "duty": "Activate, organize, and oversee the coordination of supporting Business Services teams to maximize the firm’s resources to the benefit of the client and firm."
    },
    {
      "duty": "Work with finance and pricing teams to understand client requirements, account financial metrics, and pricing arrangements."
    },
    {
      "duty": "Facilitate process and discussions on rate negotiations and financial analyses in collaboration with Client and Matter Leads, LPM, and Pricing teams."
    },
    {
      "duty": "Review, analyze, understand, and report key client account data including financial, diversity, and other metrics."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent required. Master’s degree (MBA, MA, MS JD, or other relevant graduate degree) preferred."
    }
  ]
}