{
  "meta": [
    {
      "job_title": "Export Compliance Analyst",
      "job_category": "Compliance",
      "job_class": "Analyst",
      "sector": "Business Services",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Export Control Regulations",
      "experience": 3
    },
    {
      "skill": "Technical Classification",
      "experience": 3
    },
    {
      "skill": "Licensing and Compliance",
      "experience": 3
    },
    {
      "skill": "Foreign Policy",
      "experience": 3
    },
    {
      "skill": "Compliance Programs",
      "experience": 3
    },
    {
      "skill": "Data Evaluation",
      "experience": 3
    },
    {
      "skill": "International Business",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Facilitate the execution of research and development of the Idaho National Laboratory under the guidance of the Export Compliance Manager and other senior analysts."
    },
    {
      "duty": "Evaluate technology, technical data, and software using U.S. export control requirements and regulations."
    },
    {
      "duty": "Identify and mitigate export compliance risks and educate and train INL employees on export compliance."
    },
    {
      "duty": "Develop and implement export compliance risk mitigation, auditing, and training programs."
    },
    {
      "duty": "Represent the company and communicate effectively orally and in writing with regulatory bodies including Department of Energy, Department of Commerce, Nuclear Regulatory Commission, Department of State, and Office of Foreign Asset Control."
    },
    {
      "duty": "Focus on program improvements and implementations and follow and address regulatory changes."
    },
    {
      "duty": "Mentor other export compliance staff and act as an interface for other Laboratory organizations."
    },
    {
      "duty": "Technical classification of technologies, technical data, and software, applying for export licenses or other approvals, maintaining various certifications granted by the Department of Commerce (DOC), and supporting the export control needs of international programs and initiatives as required under Federal laws, regulations and DOE directives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree plus 2-5+ years experience or an Advanced degree plus 1-3+ year of relevant experience. An engineering, science, or other technical degree is preferred."
    },
    {
      "credential": "Knowledge of export control regulations, applications, licensing and compliance programs in one or more of the following: the Export Administration Regulations (EAR), International Traffic in Arms Regulations (ITAR), Arms Export Control Act (AECA), Bureau of Industry and Security (BIS) requirements and other export compliance program requirements."
    },
    {
      "credential": "Knowledge of government laboratory operations at INL. Previous knowledge and experience with 10 CFR 810 regulations beneficial."
    },
    {
      "credential": "Experience in sciences including nuclear, chemistry, or engineering are strongly encouraged to apply."
    },
    {
      "credential": "Ability to obtain and maintain a Department of Energy 'Q' clearance, which requires US Citizenship."
    },
    {
      "credential": "Experience in compliance programs, regulatory matters, or technical policy implementation. Prior experience engaging with Federal entities a plus."
    }
  ]
}