{
  "meta": [
    {
      "job_title": "Compensation Consulting Engagement Leader",
      "job_category": "Consulting",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 8
    },
    {
      "skill": "Compensation Practices",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Bachelor’s Degree",
      "experience": 8
    },
    {
      "skill": "RFP Development",
      "experience": 6
    },
    {
      "skill": "Market Research",
      "experience": 6
    },
    {
      "skill": "Team Management",
      "experience": 8
    },
    {
      "skill": "Customer Relations",
      "experience": 8
    },
    {
      "skill": "Problem-Solving",
      "experience": 8
    },
    {
      "skill": "Cross Selling",
      "experience": 6
    },
    {
      "skill": "Advanced Excel",
      "experience": 6
    },
    {
      "skill": "RFP Development",
      "experience": 6
    },
    {
      "skill": "MarketPayCCP Certification",
      "experience": 4
    },
    {
      "skill": "Masters or MBA Degree",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify prospects through public speaking engagements, writing articles, and networking."
    },
    {
      "duty": "Listen to a prospective client’s issues, understand their situation, identify potential needs, and produce a solution while costing our proposal fees."
    },
    {
      "duty": "Liaise with the client and lead teams working on assigned projects to ensure completion with a high level of technical and professional accuracy."
    },
    {
      "duty": "Oversee the development of project deliverables such as market pricings, pay structure design, and cost impact models."
    },
    {
      "duty": "Partner with team members related to researching on difficult questions or escalated issues and ensure project deliverables are understood and accepted."
    },
    {
      "duty": "Work towards resolutions in response to escalated client issues and demonstrate a proactive solution-based approach to enhance client relations."
    },
    {
      "duty": "Support client consulting projects through management of teams performing market pricing, job evaluation, regression analysis, pay structure design, cost impact models, and report preparation."
    },
    {
      "duty": "Ensure team members meet very high standards for customer service, technical, and communication skills."
    },
    {
      "duty": "Generate revenue through the development of new client relationships while building and maintaining strong client relationships, which will ideally lead to opportunities for project extensions, cross-selling, and referrals to new prospects."
    },
    {
      "duty": "Design short-term and long-term incentive programs that reinforce the clients' strategic objectives."
    },
    {
      "duty": "Develop RFP (Request for Proposal) for new clients and existing cross-selling opportunities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience."
    },
    {
      "credential": "7+ years of experience in compensation or compensation-related consulting (with specific experience in workforce compensation and/or executive compensation)."
    },
    {
      "credential": "Preferred (but not required) skills for this role are: Experience with MarketPayCCP Certification, Masters or MBA degree."
    }
  ]
}