{
  "meta": [
    {
      "job_title": "Route Driver",
      "job_category": "Logistics",
      "job_class": "Driver",
      "sector": "Operations",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Directly interface with customers and while doing so, may perform routine customer service tasks including order entry duties and identifying opportunities for other or additional company products and services."
    },
    {
      "duty": "Maintains routes and accounts for proper routing sequence, and helps with collections and minimum delivery requirements set by the store."
    },
    {
      "duty": "Responsible for vehicle inspections, including DVIR and monthly commercial vehicle inspections."
    },
    {
      "duty": "Delivers/exchanges all types of P/E tanks, bottle water, salt, chemicals and filters as required on routes."
    },
    {
      "duty": "Collect and document receipt of money from customers and complete all paperwork in a legible manner, including delivery tickets and route books."
    },
    {
      "duty": "Ability to operate carts, dollies, fork lifts, lift gates, hand trucks and hand tools."
    },
    {
      "duty": "Must be able to work overtime if required to finish the route."
    },
    {
      "duty": "Must abide by all company policies as contained in the company employee handbook."
    },
    {
      "duty": "Perform all duties in conformance to appropriate safety and security standards and wear all safety equipment as required by the position."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Route Planning",
      "experience": 3
    },
    {
      "skill": "Vehicle Inspection",
      "experience": 3
    },
    {
      "skill": "Cash Handling",
      "experience": 3
    },
    {
      "skill": "Manual Handling",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150
    },
    {
      "student_teacher": 60
    },
    {
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Valid driver’s license (in some cases CDL)"
    },
    {
      "credential": "Knowledge of the city area you would be working in"
    }
  ]
}