{
  "meta": [
    {
      "job_title": "Infrastructure Systems Administrator",
      "job_category": "Information Technology",
      "job_class": "Administrator",
      "sector": "IT",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Windows Desktop Operating Systems",
      "experience": 5
    },
    {
      "skill": "Dell Hardware",
      "experience": 5
    },
    {
      "skill": "Microsoft Outlook",
      "experience": 5
    },
    {
      "skill": "Network Communications",
      "experience": 5
    },
    {
      "skill": "Written and Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Security Plus Training",
      "experience": 5
    },
    {
      "skill": "Security Certification (TSCI/SCI w/Poly)",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Image, configure, and deploy physical and virtual desktops; troubleshoot and repair hardware including desktops, laptops, zero clients, monitors, and docking stations; manage OS, BIOS, disk and data encryption."
    },
    {
      "duty": "Install and troubleshoot end user apps and certificates. Repair and restore data files, decrypt inaccessible files, migrate data for projects, apply and troubleshoot permissions."
    },
    {
      "duty": "Properly document actions in trouble tickets and meet all SLAs. Patch network ports, trace lines, install network switches."
    },
    {
      "duty": "Configure and maintain UPS devices and batteries, troubleshoot failure, coordinate vendor visits, plan and coordinate downtime with customers."
    },
    {
      "duty": "Install and configure VOIP phones and voicemail, troubleshoot phone issues. Configure print, scan, and fax features on multifunction devices, coordinate multi-step replacements with vendor, troubleshoot communication issues."
    },
    {
      "duty": "Plan for user moves, including connectivity, computers, and phones. Maintain and troubleshoot local security/badging systems. Prepare obsolete assets for disposal. Assist other IT teams as needed. Support unclassified and classified systems. This role will support multiple sites across the country via remote support. Occasional travel may be requested."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent and at least five years of relevant experience. Must already possess or pass Security Plus training within 3 months of start date. Must be able to obtain and maintain poly Must must have a minimum TS/SCI clearance"
    }
  ]
}