{
  "meta": [
    {
      "job_title": "Field Service Representative",
      "job_category": "Engineering",
      "job_class": "Representative",
      "sector": "Engineering",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Electrical and Hydraulic Experience",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Bi-lingual Capability",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Travel to customer sites throughout North America, as well as possible travel to Central and South America, to service plastic injection molding machines."
    },
    {
      "duty": "Provide telephone service support to customers when in the office."
    },
    {
      "duty": "Assist with modification and re-assembly of in-house machines as required."
    },
    {
      "duty": "Be “on-call” for emergency dispatch to customer sites as required."
    },
    {
      "duty": "Any other duties and tasks, consistent with your experience and abilities, which may be assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "At least five (5) years of experience servicing plastic injection molding machines."
    },
    {
      "credential": "Bi-lingual capability, English / Spanish/ Japanese."
    },
    {
      "credential": "Valid passport for travel to and from the U.S., and the willingness to do so."
    },
    {
      "credential": "Excellent customer service skills and proven ability in developing and maintaining effective internal and external working relationships."
    },
    {
      "credential": "Valid unrestricted driver’s license with a driving record free of serious incidents."
    },
    {
      "credential": "Sufficient credit or other financial resources to permit unrestricted domestic and international travel pending expense report reimbursement of legitimate business expenses."
    },
    {
      "credential": "The ability to safely lift 70 pounds and work in awkward positions such as; kneeling, bending, reaching."
    }
  ]
}