{
  "meta": [
    {
      "job_title": "Patient Care Tech PRN - Ortho PRN",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 3
    },
    {
      "skill": "Basic Cardiac Life Support",
      "experience": 1
    },
    {
      "skill": "Satori Alternatives Manag Aggr",
      "experience": 1
    },
    {
      "skill": "Nursing Care",
      "experience": 3
    },
    {
      "skill": "Specimen Collection",
      "experience": 2
    },
    {
      "skill": "Monitor/Telemetry Tech",
      "experience": 2
    },
    {
      "skill": "Vital Signs Recording",
      "experience": 3
    },
    {
      "skill": "Body Mechanics",
      "experience": 3
    },
    {
      "skill": "Activities of Daily Living",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver high quality, patient-centered care by performing a variety of delegated basic patient care services related to common nursing functions and activities of daily living."
    },
    {
      "duty": "Assist nursing staff in providing patient care in accordance with the PCT’s skills/training and the needs of the Department."
    },
    {
      "duty": "Compliance with all hospital policies/procedures and observes the State Board of Nursing rules for unlicensed personnel."
    },
    {
      "duty": "Participate in the implementation of nursing care plans by performing direct and indirect patient care under the supervision of the licensed nurse."
    },
    {
      "duty": "Obtain and record initial and ongoing patient information throughout the cycle of care, including admissions data, vital signs, height and weight, blood pressure, oxygen saturation, intake and output, calorie counts, and other patient information as outlined by policy."
    },
    {
      "duty": "Assist with mobility by regular turning and positioning, dangling, and ambulating patients. Assist with use of walkers, crutches, canes, and wheelchairs."
    },
    {
      "duty": "Transfer patients to and from other units, departments, or entities. Assist with discharges."
    },
    {
      "duty": "Assist in the collection of specimens for diagnostic or waived tests. Ensure accuracy of all labels and timely transfer of specimen."
    },
    {
      "duty": "Assist patients with activities of daily living to include eating and drinking, bathing, shaving, oral care, grooming, and elimination."
    },
    {
      "duty": "Serve as Monitor/Telemetry Tech for the unit as needed."
    },
    {
      "duty": "Engage in evidence-based best practices that enhance the patient experience, including SAFETY rounding, communication fundamentals/AIDET, Teach-Back, Narrating Care, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Basic Cardiac Life Support must be obtained within 30 days of employment start date, Satori Alternatives Manag Aggr must be obtained within 30 days of employment start date, Candidates with experience working as a CNA, caregiver, or Patient Care Tech in an ortho or hospital setting are strongly preferred"
    }
  ]
}