{
  "meta": [
    {
      "job_title": "Program Director",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Consulting",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Program Coordination",
      "experience": 5
    },
    {
      "skill": "Business Plan Development",
      "experience": 5
    },
    {
      "skill": "Marketing Plan Development",
      "experience": 5
    },
    {
      "skill": "Financial Statement Analysis",
      "experience": 5
    },
    {
      "skill": "Government Contracting Assistance",
      "experience": 5
    },
    {
      "skill": "Entrepreneurship",
      "experience": 5
    },
    {
      "skill": "Veteran Outreach",
      "experience": 5
    },
    {
      "skill": "Small Business Programs",
      "experience": 5
    },
    {
      "skill": "Resource Coordination",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and plan the activities of the UTA Veteran Business Outreach Center as the program director."
    },
    {
      "duty": "Advise the US Small Business Administration Office of Veterans Business Development (OVBD) and district offices on matters affecting the Program."
    },
    {
      "duty": "Oversee the delivery of the Boots to Business and the Boots to Business Reboot curriculum throughout the assigned coverage area."
    },
    {
      "duty": "Provide one-on-one business startup consultation and support, including business plan development, marketing plan development, financial statement analysis, business formation, access to capital, government contracting assistance, and other small business initiatives."
    },
    {
      "duty": "Coordinate and collaborate with national and local resource partners to conduct outreach activities to maximize the availability, applicability, and usability of small business programs for Veterans, Service-Disabled Veterans, Reserve Component Members, and their dependents or survivors."
    },
    {
      "duty": "Act as the primary referral source for Veterans, Service-Disabled Veterans, Reserve Component Members, and their dependents or survivors seeking to start or grow a business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor Degree or equivalent of one (1) year of experience consulting with or advising entrepreneurs in the small business startup process. Proven presentation skills. Prior experience presenting the Boots to Business and Boots to Business Reboot curriculum. Understanding of the US Small Business Administration programs and resources for veterans. Ability to secure entry onto US military installations throughout the assigned coverage area. Experience working with veterans and veteran-related service organizations."
    },
    {
      "credential": "Preferred: Masters Degree or equivalent of two (2) years' experience consulting with or advising veterans in the small business startup process. US military veteran or military spouse is a plus. Existing working relationship with US Small Business Administration local resource partners, including SBA district office representatives, SBDC advisors, SCORE mentors, APEX Accelerator advisors (PTAC), WBC counselors, etc. Knowledge of the Department of Labor Transition Assistance Program (TAP) is a plus. Prior small business ownership is a plus."
    }
  ]
}