{
  "meta": [
    {
      "job_title": "Teacher of the Deaf",
      "job_category": "Education",
      "job_class": "Teacher",
      "sector": "Education",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "American Sign Language",
      "experience": 3
    },
    {
      "skill": "Curriculum Development",
      "experience": 3
    },
    {
      "skill": "Individual Education Plan (IEP) Development",
      "experience": 3
    },
    {
      "skill": "Parent Communication",
      "experience": 3
    },
    {
      "skill": "Classroom Management",
      "experience": 3
    },
    {
      "skill": "Emergency Response",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and prepare lessons and instructional materials following curriculum guidelines in American Sign Language and English."
    },
    {
      "duty": "Instruct students in various subjects using American Sign Language and English."
    },
    {
      "duty": "Confer with parents, testing specialists, and other administrators to develop individual educational plans for students."
    },
    {
      "duty": "Prepare, administer, and score academic tests and records results."
    },
    {
      "duty": "Meet and confer with parents and supervisors to discuss students' academic and behavioral attitudes and achievements."
    },
    {
      "duty": "Assist in selecting appropriate textbooks and learning materials."
    },
    {
      "duty": "Participate in curriculum development and maintain updated lesson plans as prescribed by the curriculum."
    },
    {
      "duty": "Intercede in emergency situations as required and maintain order in the classroom."
    },
    {
      "duty": "Attend departmental and faculty meetings and perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Special Education Certification and Master's degree in Deaf Education or childhood education preferred."
    },
    {
      "credential": "Eligibility for NYS certification as a Teacher of the Deaf; Special Needs."
    },
    {
      "credential": "Ability to successfully complete a Sign Language Proficiency Interview (SLPI) at the proficiency level defined for each job position as determined by SMSD."
    },
    {
      "credential": "Successful training in behavior management programs including TCI (Therapeutic Crisis Intervention)."
    },
    {
      "credential": "Working With Disabled/Medically Fragile Children and Working With Children specialized training."
    }
  ]
}