{
  "meta": [
    {
      "job_title": "Associate I - Catastrophe Risk Management",
      "job_category": "Risk Management",
      "job_class": "Associate",
      "sector": "Risk Management",
      "salary": 145000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Catastrophe Risk Management",
      "experience": 3
    },
    {
      "skill": "Quantitative Analysis",
      "experience": 3
    },
    {
      "skill": "Underwriting",
      "experience": 3
    },
    {
      "skill": "Risk Modelling",
      "experience": 3
    },
    {
      "skill": "Natural Hazards Research",
      "experience": 3
    },
    {
      "skill": "Data Processing",
      "experience": 3
    },
    {
      "skill": "Research and Analysis",
      "experience": 3
    },
    {
      "skill": "Scientific Writing",
      "experience": 3
    },
    {
      "skill": "Spatial Visualization",
      "experience": 3
    },
    {
      "skill": "Client Communication",
      "experience": 3
    },
    {
      "skill": "Portfolio Management",
      "experience": 3
    },
    {
      "skill": "Training and Leadership",
      "experience": 3
    },
    {
      "skill": "Parametric Solutions Design",
      "experience": 3
    },
    {
      "skill": "Market Analysis",
      "experience": 3
    },
    {
      "skill": "Data Visualization",
      "experience": 3
    },
    {
      "skill": "Technical Presentation",
      "experience": 3
    },
    {
      "skill": "Scientific Collaboration",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist catastrophe reinsurance underwriting activity with quantitative analysis on construction projects under the guidance of senior project team members to evaluate modeling loss results, calculate risk exposure and potential loss that may occur due to natural and man-made catastrophes."
    },
    {
      "duty": "Conduct research and collected scientific datasets pertaining to natural hazards risks, including earthquakes, tropical cyclones, and floods to support catastrophe reinsurance underwriting."
    },
    {
      "duty": "Develop critical understanding of risk modelling methodologies to inform reinsurance underwriting activity."
    },
    {
      "duty": "Draft and review reinsurance contracts, considering the perils of earthquake, hurricane, and wildfire."
    },
    {
      "duty": "Collect, validate, and analyze catastrophe exposure and hazard data from clients to forecast losses using both commercial catastrophe models as well as scientific judgement and methods developed internally, and make appropriate recommendations."
    },
    {
      "duty": "Develop algorithms for the optimal design of parametric solutions designed to reduce the protection gap in risk prone areas, (earthquake, hurricane, and wildfire.)"
    },
    {
      "duty": "Monitor and analyze organization product lines and industry conditions to identify significant considerations that insurers should address in designing reinsurance programs."
    },
    {
      "duty": "Liaise with brokers to better understand clients’ needs/goals."
    },
    {
      "duty": "Lead and/or support the interview process for new members and their training to achieve their efficiency in designing all parametric solutions as pertinent."
    },
    {
      "duty": "Inform clients of potential loss estimates from given events as well as monetary recovery resulting from potential triggering of parametric insurance."
    },
    {
      "duty": "Prepare summaries, presentations, and reports for complex client projects to summarize potential risks and loss results for the client."
    },
    {
      "duty": "Conduct research tasks on the optimal design of parametric solutions to advance the development of state-of-the-art insurance solutions for our clients."
    },
    {
      "duty": "Liaise and collaborate with scientific and academic research centers to advance the development of state-of-the-art parametric solutions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100
    },
    {
      "student_teacher": 80
    },
    {
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or foreign equivalent in Civil or Structural Engineering, or a related field plus three (3) years of experience in the position offered, as an Analyst II – Catastrophe Risk Management, Structural Engineering Graduate Research and Teaching Assistant, or a related position. Must have three (3) years of experience with: Leveraging structural engineering skills to understand the vulnerability module of catastrophe models; Leveraging hazard analysis skills in the area of seismology to understand the hazard module of catastrophe models. Preparing peer-reviewed scientific papers/publications about technical and/or research topics in the fields of Science, Technology, Engineering, and/or Math; Presenting technical concepts to internal and external audiences; Collecting, organizing, analyzing and interpreting processed and raw data from multiple sources; Identifying limitations and shortcomings of current practices, and proposing, testing and validating novel ideas, concepts, methodologies and formulations; Handling large amount of processed and raw data via database software to create, edit, and maintain database files and records; Processing ideas, concepts, solutions and transforming them into instructions, algorithms and codes, using programming platforms and languages, such as MATLAB, Python, Fortran, and R; Establishing, coordinating and executing a training protocol to bring trainee(s) to an agreed standard of proficiency, ability and competence by practice and instruction; Providing scientific and technical feedback on articles, papers, presentations and publications, suggesting improvements, changes, edits, and making recommendation about whether to accept, reject, or revise the work object of review; and Summarizing results, findings, and processes to promote and support collaboration and content sharing."
    }
  ]
}