{
  "meta": [
    {
      "job_title": "Grant Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Works as part of a highly matrixed team, interacting with team members within GMG and Global Medical Operations Platform Services (GMOPS), as well as with stakeholders from inside and outside of the company to ensure all grants are processed and managed in an effective and compliant manner."
    },
    {
      "duty": "Manage drug supply responsibilities."
    },
    {
      "duty": "Manage the grant system user access roles."
    },
    {
      "duty": "Serve as escalation point of contact within GMG for operational queries that arise related to Independent Medical Grants (IMGs)."
    },
    {
      "duty": "Manage the global competitive grant program."
    },
    {
      "duty": "Facilitate resolution of complex research issues, including drug supply and safety."
    },
    {
      "duty": "Assist with budget forecasting and tracking of grant payments."
    },
    {
      "duty": "Assist Grant Officer (GO) with identifying and managing emerging changes and opportunities; driving iterations of the plans collaboratively with the team to make updates in the project schedule."
    },
    {
      "duty": "Serves as Project Manager for all assigned Competitive Programs."
    },
    {
      "duty": "Closely monitors grants program to ensure operational efficiency and raises anomalies to GO, including, but not limited to, reviewing monitoring reports and flagging overdue actions."
    },
    {
      "duty": "Organizing and managing various document repositories and communication/collaboration channels."
    },
    {
      "duty": "Collaborates with internal and external partners and stakeholders."
    },
    {
      "duty": "Engage with Country Office and Regional colleagues for management of GMG tactics globally."
    },
    {
      "duty": "Support internal and external stakeholders in using the internal grant system and dashboards, including, but not limited to, providing training on system functionality, assisting applicants in troubleshooting issues, etc."
    },
    {
      "duty": "Facilitate escalation of operational issues with internal stakeholders."
    },
    {
      "duty": "Monitors process and educational needs."
    },
    {
      "duty": "Adheres to applicable SOPs, written standards, working practices, and implementation guidelines for the Research Collaboration (RC)/IMG process, as required, and contributes to their development."
    },
    {
      "duty": "Serves as a trainer for new GMs on policies, procedures, and systems."
    },
    {
      "duty": "Identifies training opportunities for internal stakeholders including Medical Affairs, Clinical Development, and/or Research Unit business(es) and executes training plans, such as GMG Dashboards, grant system, and budget process."
    },
    {
      "duty": "Assist GO with Outcomes Assessment by generating customized ad hoc reports of data points not captured in dashboards for both internal and external materials, such as, internal presentations, brochures for external audiences, and reports submitted to regulatory agencies."
    },
    {
      "duty": "Work closely with GO to set up the timeline for each Request for Proposal (RFP), develop and execute the communication plan."
    },
    {
      "duty": "Manage the Expert Review Panel: contracting, user access, reviewer instructions, conduct training calls, and schedule review meetings for all competitive grant program types."
    },
    {
      "duty": "Coordinate with GMG Communications Lead to plan and execute social media strategy in conjunction with Business Unit (BU) Communications Lead."
    },
    {
      "duty": "Compile review panel feedback and coordinate with Grant Administrators to disseminate to applicants."
    },
    {
      "duty": "Assist with virtual review panel meetings."
    },
    {
      "duty": "Partnership Management."
    },
    {
      "duty": "Executes collaboration process (e.g., FRF process) and ensures collaboration agreement in place for partner-projects/RFPs."
    },
    {
      "duty": "Involved in discussions with new partners/new initiatives from the start."
    },
    {
      "duty": "Coordinates payments to Partners and Sunshine Act forms distribution/collection."
    },
    {
      "duty": "Assist Grant Officer (GO) and key stakeholders with additional activities, as requested."
    },
    {
      "duty": "Assisting GO and RC Leads in the planning process with internal stakeholders including Medical Affairs, Clinical Development, and/or Research Unit business(es) to ensure alignment with the overall asset/business development and lifecycle plan."
    },
    {
      "duty": "Assisting GO with planning, including identifying appropriate Partners/Collaborators and options for execution, risk management, internal/external communication, and stakeholder management strategies."
    },
    {
      "duty": "May also act as a Subject Matter Expert (SME), in conjunction with and under the guidance of a Senior Grant Manager SME, within their assigned subject matter area and is responsible for providing direction and expertise to the team of Grant Managers."
    },
    {
      "duty": "Work closely with Business Process Owners of RC and IMG SOPs to implement and communicate process updates."
    },
    {
      "duty": "Review and maintain various document repositories and communication/collaboration channels, such as, process guidance documentation, agreement templates, and Teams channels."
    },
    {
      "duty": "Provide support during corporate audits and ensure remediation plan(s) are developed."
    },
    {
      "duty": "Represent Medical Operations and the role of a Grant Manager on any continuous quality improvement projects related to the GMG program such as the development and implementation of a new grant system."
    },
    {
      "duty": "Serve as the overall manager for drug related submissions and queries globally for research grants, consolidating the responsibility of existing Grant Managers."
    },
    {
      "duty": "Partner with Global Clinical Supply (GCS) colleagues to establish high level supply chain strategies to ensure appropriate supply is available to support research across all Therapeutic Areas."
    },
    {
      "duty": "Provide key input in review process for clinical research, giving feedback to teams related to availability/feasibility of providing drug supply as requested by investigators."
    },
    {
      "duty": "Issue guidance with GCS and Global Supply and ensures appropriate documentation is provided to sites for regulatory submission."
    },
    {
      "duty": "Monitor study milestones and timelines to ensure adequate drug coverage for the duration of the research studies."
    },
    {
      "duty": "Oversee the user access request process for the Medical Grant system- review access requests, determine the appropriate level of access required and work with Business Operations to implement."
    },
    {
      "duty": "Coordinate with stakeholders in GMG, GMOPS, the grant system vendor, and BT to review the process for system workflow changes/customization and to manage the logistics for such implementations."
    },
    {
      "duty": "Work closely with platform integrations team to help document, test, and validate system enhancements."
    },
    {
      "duty": "Monitor and respond to system-related queries sent to the GMG Mailbox."
    },
    {
      "duty": "Oversee colleagues (through matrix model) in Wuhan, China that provide transactional support for the system."
    },
    {
      "duty": "Provide guidance, work instruction, and feedback as necessary."
    },
    {
      "duty": "Serve as the main point of contact within GMG for any Safety related queries that arise related to research."
    },
    {
      "duty": "Partner with Safety colleagues to manage any safety reporting deviations, which includes participation in scheduled Pharmacovigilance Policy Committee meetings, as required."
    },
    {
      "duty": "Work closely with internal safety contacts to stay abreast of current policy and procedure as it relates to reporting Serious Adverse Events for research."
    }
  ],
  "skills": [
    {
      "skill": "Independent Research",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Continuing Medical Education",
      "experience": 5
    },
    {
      "skill": "Continuing Education",
      "experience": 5
    },
    {
      "skill": "Continuing Professional Development",
      "experience": 5
    },
    {
      "skill": "Global Experience",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Consulting Skills",
      "experience": 5
    },
    {
      "skill": "Political Savvy",
      "experience": 5
    },
    {
      "skill": "Process Management",
      "experience": 5
    },
    {
      "skill": "Matrix Team Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree requiredMaster’s Degree in a clinical background a plus"
    }
  ]
}