{
  "meta": [
    {
      "job_title": "Shop Foreman",
      "job_category": "Manufacturing",
      "job_class": "Supervisor",
      "sector": "Fleet Maintenance",
      "salary": 67000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage service and repair personnel by assigning and directing activities, following up on repairs being made, perform repairs as needed and appraise performance of shop personnel."
    },
    {
      "duty": "Confer with Maintenance Manager/General Manager to arrange for equipment such as motor vehicles, compaction equipment, support equipment and other equipment utilized by the division to be released from service for inspection, service or repair."
    },
    {
      "duty": "Plan and schedule repairs in TMW planner and procure all parts for successful plan."
    },
    {
      "duty": "Oversee all aspects of the tire program and attend all tire scrap outs."
    },
    {
      "duty": "Manage PO’s on the monthly basis and reconcile TMW with Corporate Purchasing Card."
    },
    {
      "duty": "Manage month end close consisting of all EOM reports and inventory integrity."
    },
    {
      "duty": "Authorize and arrange purchase of supplies, tools, uniforms and machinery and contracts for repair services not performed in shop with Maintenance Manager/General Manager approval."
    },
    {
      "duty": "Follow policies for inspection, maintenance and repair of vehicles."
    },
    {
      "duty": "Investigate and evaluate cause and extent of damage to vehicles or property as a result of accidents."
    },
    {
      "duty": "Assist Maintenance Manager/General Manager with hiring, training and monitoring performance of service and repair personnel."
    },
    {
      "duty": "Identify, direct or perform ongoing training of service and repair personnel."
    },
    {
      "duty": "Maintain all vehicle inspections, maintenance and safety records required by federal, state or local agencies and company policies."
    },
    {
      "duty": "Act as the backup for the Shop Supervisor/Maintenance Manager if there is not one at the location."
    },
    {
      "duty": "Perform other job-related duties as assigned"
    }
  ],
  "skills": [
    {
      "skill": "Vehicle Inspection Program",
      "experience": 5
    },
    {
      "skill": "Strong mechanical and troubleshooting abilities",
      "experience": 5
    },
    {
      "skill": "Computer Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Management",
      "experience": 5
    },
    {
      "skill": "Procurement",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Valid driver's license"
    }
  ]
}