{
  "meta": [
    {
      "job_title": "Support Account Manager",
      "job_category": "Support",
      "job_class": "Manager",
      "sector": "Customer Service & Support",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deeply understand customer business strategies, challenges and IT landscape. Possess the ability to deliver business value by aligning ServiceNow solutions to address the customer’s short and long-term support needs."
    },
    {
      "duty": "Coordinate internal resources, including technical and customer support, professional services and management to meet account performance objectives and customers’ expectations."
    },
    {
      "duty": "Ability to build credibility through action and responsiveness resulting in the perception that no matter what the issue, you are the customer’s go to champion within ServiceNow."
    },
    {
      "duty": "Participate in regularly scheduled conference calls and onsite meetings to ensure the continual flow of information with timely updates on all open issues and ongoing projects."
    },
    {
      "duty": "Facilitate weekly summary status reports; quarterly services reviews and detailed review of root cause analysis findings when applicable."
    },
    {
      "duty": "Manage, document and report on performance against service level agreements (SLA's) and where SLA's are not being met document and oversee an action plan that will result in meeting and exceeding those commitments routinely."
    },
    {
      "duty": "Review open incidents, problems and enhancement requests communicating proper priority and direction to responsible ServiceNow teams to ensure a timely customer satisfying result."
    },
    {
      "duty": "Act as an escalation point and advocate for critical customer issues. Understand and explain ServiceNow application, features and benefits as it relates to customer needs."
    },
    {
      "duty": "Manage special projects as assigned by management to meet customer and cross-functional team needs."
    }
  ],
  "skills": [
    {
      "skill": "IT Service Management (ITSM)",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Service Level Agreement (SLA) Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in IT, Computer Science, or a related field (Master's preferred)"
    }
  ]
}