{
  "meta": [
    {
      "job_title": "Senior Power Resources Manager or Power Resources Manager",
      "job_category": "Energy",
      "job_class": "Manager",
      "sector": "Energy",
      "salary": 145000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage energy procurement activities, including contract origination and negotiations, contract management, invoice and renewable energy credit review, and monitoring of California Independent System Operator (CAISO) market participation."
    },
    {
      "duty": "Coordinate with MCE’s Policy team and MCE consultants, and ensure timely submission of data requests from regulatory bodies such as California Public Utilities Commission (CPUC) and CAISO."
    },
    {
      "duty": "Lead or assist in the administration of the Request for Offer Processes, MCE’s Open Season procurement process, ongoing correspondence with counterparties, and contract development and performance tracking."
    },
    {
      "duty": "Work closely with external counterparties, government representatives, and regulatory bodies, effectively communicating with different audiences - including internal and external stakeholders."
    },
    {
      "duty": "Determine procurement needs, evaluate projects for economics and viability, assess project development and interconnection risk, and make recommendations to senior management."
    },
    {
      "duty": "Lead, track, and manage all aspects of the contract lifecycle, coordinate with Portfolio Managers, and monitor energy deliveries for assigned contracts."
    },
    {
      "duty": "Work with developers and the MCE scheduling coordinator to integrate resources into CAISO markets and develop bidding strategies to optimize dispatch in CAISO markets."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Energy Management, Engineering, or related field (Master's preferred)"
    }
  ]
}