{
  "meta": [
    {
      "job_title": "Sr. Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads and coordinates IT, departmental and vendor resources for projects in accordance with the project plan."
    },
    {
      "duty": "Prepares presentation materials for meetings; documents and follows up on actions and decisions from meetings."
    },
    {
      "duty": "Analyzes, validates, and documents business processes and system requirements using standard Business Analysis tools and methodologies for the development or procurement of software systems."
    },
    {
      "duty": "Evaluates and monitors cost acquisition of applications, scripting, and reporting tools related items to obtain the best results, meet budget guidelines, and ensure system compatibility."
    },
    {
      "duty": "Conducts design sessions and develops or reviews vendor developed design documents."
    },
    {
      "duty": "Manages the Design, documentation, development, coding, testing, and debugging applications and interfaces."
    },
    {
      "duty": "Designs, documents and develops extract, transform, load (ETL) processes to ensure accessibility of data from business systems for reports or use by other systems."
    },
    {
      "duty": "Ensures the development and completion of technical system documentation, training materials, and training of users and support staff."
    },
    {
      "duty": "Assists in the development and operations of the IT Strategic Plan (ITSP). Provides input and recommendations on new technology and solicits technical specifications."
    },
    {
      "duty": "Oversees the creation of operational procedure manuals."
    },
    {
      "duty": "Sets timelines and expectations for tasks within project plans."
    },
    {
      "duty": "Provides guidance to team members."
    },
    {
      "duty": "Acts as a liaison between the various divisions within the department along with the client departments."
    },
    {
      "duty": "Provides subject-matter expertise on complex technical issues."
    },
    {
      "duty": "Prepare complex project reports using business intelligence tools; convert data into project information"
    },
    {
      "duty": "Provide emergency response to reduce downtime, correct errors or monitor vendor activity surrounding critical system failures, off-hours scheduled maintenance downtime or work on call on a scheduled and as needed basis."
    },
    {
      "duty": "Provide services in different geographical locations throughout the City as requested by users or needed."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Cost-Benefit Analysis",
      "experience": 5
    },
    {
      "skill": "System Development Lifecycle",
      "experience": 5
    },
    {
      "skill": "Technical Documentation",
      "experience": 5
    },
    {
      "skill": "IT Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Business Intelligence",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Project Management, Business, or a related field (Master's preferred)"
    }
  ]
}