{
  "meta": [
    {
      "job_title": "Maintenance Technician",
      "job_category": "Maintenance",
      "job_class": "Technician",
      "sector": "Maintenance",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Maintenance",
      "experience": 2
    },
    {
      "skill": "Plumbing",
      "experience": 2
    },
    {
      "skill": "Electrical Systems",
      "experience": 2
    },
    {
      "skill": "Carpentry",
      "experience": 2
    },
    {
      "skill": "HVAC",
      "experience": 2
    },
    {
      "skill": "Welding",
      "experience": 2
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 2
    },
    {
      "skill": "Blueprint Interpretation",
      "experience": 2
    },
    {
      "skill": "Electric Circuit Knowledge",
      "experience": 2
    },
    {
      "skill": "Hand and Eye Coordination",
      "experience": 2
    },
    {
      "skill": "Physical Activity",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform preventative maintenance, repairs, and installations of materials to ensure proper operation and upkeep of facilities, general electric, and plumbing systems."
    },
    {
      "duty": "Perform regularly scheduled preventative maintenance on electrical and plumbing systems to ensure proper upkeep of equipment."
    },
    {
      "duty": "Perform general carpentry, painting, electrical, welding, plumbing, and HVAC installations as required."
    },
    {
      "duty": "Install and repair DC storage racks as required."
    },
    {
      "duty": "Assist with mechanical and electrical maintenance and repair of a variety of powered material handling equipment."
    },
    {
      "duty": "Maintain and complete various maintenance-related documents including work order requests, preventative maintenance, and daily job breakdown summaries."
    },
    {
      "duty": "Exhibit reasonable care and operation of powered material handling equipment."
    },
    {
      "duty": "Maintain the integrity of the Mission, Vision, and Values statement while performing daily job duties."
    }
  ],
  "subjective_elements": null,
  "education_certification": [
    {
      "credential": "One to two years of maintenance-related experience required."
    },
    {
      "credential": "Strong mechanical, carpentry, plumbing, and A.C. electrical circuitry knowledge of 120V through 440, 3-phase required."
    },
    {
      "credential": "Excellent hand and eye coordination required."
    },
    {
      "credential": "Ability to interpret blueprints, schematics, and utilize basic hand tools and electrical and/or electronic test equipment including volt/ohm meters and amp probes strongly preferred."
    },
    {
      "credential": "Ability to handle multiple tasks, be detail-oriented, meet department standards, and perform duties without immediate and constant supervision."
    },
    {
      "credential": "Ability to perform physical activity at a sustained pace within the Distribution Center environment including walking, bending, and lifting is required."
    },
    {
      "credential": "Bachelor's degree in Maintenance, Engineering, or a related field (preferred)"
    }
  ]
}