{
  "meta": [
    {
      "job_title": "Systems Engineering Director",
      "job_category": "Engineering",
      "job_class": "Director",
      "sector": "Software Engineering",
      "salary": 315000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 8
    },
    {
      "skill": "Security Platform",
      "experience": 8
    },
    {
      "skill": "Application Architecture",
      "experience": 8
    },
    {
      "skill": "Business Acumen",
      "experience": 8
    },
    {
      "skill": "Technical Expertise",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of Systems Engineering Managers and support Systems Engineers (SE) to drive growth within Major Accounts."
    },
    {
      "duty": "Oversee technical pre-sales operations and achieve revenue generation, individual, team, and organizational quotas."
    },
    {
      "duty": "Interact with customers and partners at a senior level and provide valuable insight into industry trends, customer challenges, and technical evolutions."
    },
    {
      "duty": "Develop and own outcome-oriented Systems Engineering initiatives that drive pipeline and sales with AVP, RVPs, Systems Engineering Managers (SEMs) and SEs."
    },
    {
      "duty": "Maintain strong relationships with Palo Alto Networks’ partners and drive initiatives to improve sales productivity through partner leverage."
    },
    {
      "duty": "Lead portfolio expansion initiatives, upselling subscriptions and strategic solutions."
    },
    {
      "duty": "Ensure metric-based results across all areas of focus and make visible the successes and deficiencies of the initiatives within the area."
    },
    {
      "duty": "Provide account support through SE assignments, load balancing, continuity, and strategic planning with Sales management, Sales Reps, and SEs."
    },
    {
      "duty": "Operate effectively in a matrix manner with extended teams, such as Support, Finance, WW SE, HR, Product Management, and other relevant organizations."
    },
    {
      "duty": "Act as an escalation point for pre-sales and post-sales technical issues that arise in the territory."
    },
    {
      "duty": "Develop, mentor, manage, and support reporting sales engineers with technical and organizational leadership."
    },
    {
      "duty": "Manage successful evaluations and timely return of evaluation equipment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "A minimum combination of 8 years of first and/or second line, Systems Engineering management experience preferred. Bachelor's degree in Engineering or related field (Master's preferred)."
    }
  ]
}