{
  "meta": [
    {
      "job_title": "Manager, Commissions Systems Delivery",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 105000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "IT Data Management",
      "experience": 5
    },
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Test Planning",
      "experience": 5
    },
    {
      "skill": "Database Configuration",
      "experience": 5
    },
    {
      "skill": "System Design",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Software Testing",
      "experience": 5
    },
    {
      "skill": "CRM System Design",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee business requirements and maintain project management execution for Charter’s Commission Systems team, including supporting project implementation, requirement gathering, and testing/confirmation."
    },
    {
      "duty": "Perform strategic development and implementation of assigned projects."
    },
    {
      "duty": "Provide consultative support to business stakeholders to identify and prioritize competing requests and make recommendations for solutions that deliver realistic estimates for task completion."
    },
    {
      "duty": "Assist in resolving roadblocks and mitigating risks to ensure successful on-time project delivery."
    },
    {
      "duty": "Prioritize and align resources to ensure successful completion of work."
    },
    {
      "duty": "Hire, train and manage performance and development of direct reports."
    },
    {
      "duty": "Manage detailed application requirements and collaborate with cross-functional teams to ensure quality function, features, and user experience."
    },
    {
      "duty": "Develop test plans and perform software testing to ensure efficient execution and adherence to business specifications and technical requirements."
    },
    {
      "duty": "Support IT data management including database and system configurations, datasets, and programing in Oracle, SQL, or other RDBMs; IT system configuration including business and data analysis, test planning and execution, system/process design, and development of data extraction and transformation components."
    },
    {
      "duty": "Support commission system configuration management and design including Callidus Cloud, Optymyze, Xactly Incent, Iconixx Sales, or Oracle Incentive Compensation module; and major billing and CRM system design including Salesforce, Siebel, or CSG."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree (or foreign equivalent) in Computer Science, Management Information Systems, Business, or a related field"
    }
  ]
}