{
  "meta": [
    {
      "job_title": "Conductor",
      "job_category": "Transportation",
      "job_class": "Conductor",
      "sector": "Transportation",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Train Operations",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Equipment Inspection",
      "experience": 5
    },
    {
      "skill": "Workplace Safety",
      "experience": 5
    },
    {
      "skill": "Shift Management",
      "experience": 5
    },
    {
      "skill": "Reliability",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Safely switch railcars and ensure safe movement of trains."
    },
    {
      "duty": "Obtain and act on oral or written instructions via various communication devices."
    },
    {
      "duty": "Operate track switches and derails to change train routing within yards or on the road."
    },
    {
      "duty": "Inspect equipment and monitor track conditions to ensure safety and compliance with regulations."
    },
    {
      "duty": "Work in extreme all-weather conditions, safety-sensitive environments, and perform duties on and around heavy machinery."
    },
    {
      "duty": "Report on the performance of train operations and observe passing train conditions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "At least 18 years of age, or will be by the start date listed above."
    },
    {
      "credential": "Ability to report for duty at the designated work location."
    },
    {
      "credential": "Ability to work safely in the specified working conditions."
    },
    {
      "credential": "Ability to work the specified shifts/hours."
    },
    {
      "credential": "Ability to meet the specified travel requirements."
    },
    {
      "credential": "Ability to read, write, and communicate in English."
    },
    {
      "credential": "Ability to visually distinguish colors and sounds, and perform various physical activities."
    },
    {
      "credential": "Training for this position is company-paid on-the-job and classroom training for up to 17 weeks may include travel to BNSF's Training Center in Norman, OK."
    },
    {
      "credential": "Relocation assistance is not available."
    },
    {
      "credential": "SMART-TD or BLET Dues required per union agreement."
    },
    {
      "credential": "Probationary period of 60 days."
    },
    {
      "credential": "Transfer eligibility varies by location and may require up to 3 years’ employment and General Manager approval."
    },
    {
      "credential": "Pre-employment background verification, medical review, and drug screening required."
    },
    {
      "credential": "TWIC is a condition of employment for positions requiring unescorted access to secure areas of port facilities."
    },
    {
      "credential": "BNSF Railway is an Equal Opportunity Employer."
    }
  ]
}