{
  "meta": [
    {
      "job_title": "Nurse Practitioner",
      "job_category": "Healthcare",
      "job_class": "Practitioner",
      "sector": "Healthcare",
      "salary": 125000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and organize care to meet individual patient needs and ensure appropriate clinical resource utilization."
    },
    {
      "duty": "Diagnose illnesses, physical conditions, and perform therapeutic, corrective, and prescriptive measures for inpatient and outpatient populations."
    },
    {
      "duty": "Assist in the preparation, implementation, and evaluation of research protocols."
    },
    {
      "duty": "Collaborate with nursing and other disciplines in the development and implementation of clinical studies."
    },
    {
      "duty": "Use evidence-based health care literature to advise and support appropriate practice changes."
    },
    {
      "duty": "Participate in the development and monitoring of patient outcomes for quality and performance improvement."
    },
    {
      "duty": "Serve as a clinical expert and resource for the education of peers and other health professionals."
    },
    {
      "duty": "Maintain current expertise in area of practice and promote professional growth and development."
    },
    {
      "duty": "Evaluate treatment and health care plans for effectiveness and modify per clinical standards and practice protocols."
    },
    {
      "duty": "Prescribe medical equipment, devices, physical and occupational therapy, and home health services per practice protocol."
    },
    {
      "duty": "Prescribe in-patient and discharge medications according to New York State law."
    },
    {
      "duty": "Formulate the plan of care based on expected goals of care with the attending physician and patient/family."
    },
    {
      "duty": "Order customary laboratory, radiological, and diagnostic studies per practice protocols and differentiate between normal/abnormal findings."
    },
    {
      "duty": "Perform complete health history, physical examination, and psychosocial assessment of patients."
    },
    {
      "duty": "Facilitate continuity of care across the continuum of services and provide consultation about the therapeutic regimen."
    },
    {
      "duty": "Work collaboratively with the interdisciplinary team to develop and implement the therapeutic plan of care for patients."
    },
    {
      "duty": "Adhere to the ACHD accreditation requirements with an Administrative component."
    }
  ],
  "skills": [
    {
      "skill": "Clinical Nursing",
      "experience": 5
    },
    {
      "skill": "Nurse Practitioner Practice",
      "experience": 5
    },
    {
      "skill": "Research Protocol Implementation",
      "experience": 5
    },
    {
      "skill": "Clinical Studies Development",
      "experience": 5
    },
    {
      "skill": "Health Care Literature Analysis",
      "experience": 5
    },
    {
      "skill": "Quality and Performance Improvement",
      "experience": 5
    },
    {
      "skill": "Educational Leadership",
      "experience": 5
    },
    {
      "skill": "Prescription and Treatment Management",
      "experience": 5
    },
    {
      "skill": "Health Assessment",
      "experience": 5
    },
    {
      "skill": "Patient Care Collaboration",
      "experience": 5
    },
    {
      "skill": "Therapeutic Plan Development",
      "experience": 5
    },
    {
      "skill": "Consultation Skills",
      "experience": 5
    },
    {
      "skill": "ACHD Accreditation Compliance",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Master's Degree in Nursing, current registration as Professional Nurse in New York, and Registration as Nurse Practitioner in New York. Board Certification from a specialty organization that certifies Nurse Practitioners in a clinical area of practice. ACLS, PALS, NRP Provider, NALS per delineation of privileges."
    }
  ]
}