{
  "meta": [
    {
      "job_title": "Claims Examiner Sr",
      "job_category": "Claims Administration",
      "job_class": "Examiner",
      "sector": "Claims Administration",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Claims Processing",
      "experience": 3
    },
    {
      "skill": "Research and Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Medical Billing",
      "experience": 3
    },
    {
      "skill": "Medi-Cal and Medicare Claims",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Participates in a mission driven culture of high-quality performance, with a member focus on customer service, consistency, dignity and accountability."
    },
    {
      "duty": "Assists the team in carrying out department responsibilities and collaborates with others to support short and long-term goals/priorities for the department."
    },
    {
      "duty": "Conducts research and problem solves the more complex claims."
    },
    {
      "duty": "Processes professional and institutional claim types."
    },
    {
      "duty": "Performs thorough review of pending claims for billing errors and questionable billing practices that might include duplicate billing and unbundling of services."
    },
    {
      "duty": "Corrects system-generated errors manually prior to final claims adjudication."
    },
    {
      "duty": "Processes claims based upon CalOptima Health’s contractual agreements or pricing agreements, applicable regulatory legislation, claims processing guidelines and CalOptima Health’s policies and procedures."
    },
    {
      "duty": "Analyzes and validates Medi-Cal pricing; researches, adjusts and adjudicates claims; reviews services for accurate charges, utilizing billing code sets and/or authorization guidelines as a reference."
    },
    {
      "duty": "Processes claim exception reports as assigned."
    },
    {
      "duty": "Completes other projects and duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent required. 3 years of experience processing online claims in a managed care environment required. An equivalent combination of education and experience sufficient to successfully perform the essential duties of the position such as those listed above is also qualifying."
    },
    {
      "credential": "Experience processing Medi-Cal and/or Medicare claims."
    }
  ]
}