{
  "meta": [
    {
      "job_title": "Senior CMC Operations Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "CMC Operations",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Process Development",
      "experience": 5
    },
    {
      "skill": "CMC Operations",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Technical Leadership",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Project Planning",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive the adjuvant at CDMOs for development and scale up, cGMP manufacturing, process characterization, and qualification for Phase 3 clinical studies and commercial supply."
    },
    {
      "duty": "Lead the technical team at CMDO for late phase adjuvant production, including tech transfer, scale up, gap/risk analysis, process characterization/qualification, and cGMP manufacturing."
    },
    {
      "duty": "Provide technical guidance and keep projects on time and in compliance with cGMP regulations."
    },
    {
      "duty": "Review and approve controlled documents including batch records, SOPs, protocols, and reports related to process development and characterization."
    },
    {
      "duty": "Work closely with QA/QC to identify and evaluate deviations, CAPA, and change control."
    },
    {
      "duty": "Lead and direct the work of partner organizations and consultants."
    },
    {
      "duty": "Build strong communications and relationships with partner organizations and consultants."
    },
    {
      "duty": "Ensure compliance with both internal Curevo process and policy and with regional regulatory requirements."
    },
    {
      "duty": "Collaborate with CDMO for health authority inspection."
    },
    {
      "duty": "Responsible for assigned project/timeline planning and tracking of commitments."
    },
    {
      "duty": "Actively participate as a member of Curevo supporting product and new business development."
    },
    {
      "duty": "Participate for US and International specific documentation supporting development and maintenance of products and ensuring filings meet local regulatory requirements."
    },
    {
      "duty": "Adhere to all company policies, procedures, and safety rules."
    },
    {
      "duty": "Willing to perform a wide range of duties in a smaller organization on an independent level and as a team player."
    },
    {
      "duty": "Excellent oral and written communication skills; ability to communicate effectively with co-workers and Health Authorities."
    },
    {
      "duty": "Proficiency in MS Office [Excel, Word, PowerPoint, MS Project], JMP statistical software, and Adobe Acrobat."
    },
    {
      "duty": "Ability to travel as required by projects (10-25% of time, US and International)."
    },
    {
      "duty": "Ability to work flexible hours for collaboration with international CDMOs/partners."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "University level science degree and/or equivalent qualification."
    }
  ]
}