{
  "meta": [
    {
      "job_title": "Registered Client Service Associate",
      "job_category": "Client Services",
      "job_class": "Associate",
      "sector": "Financial Services",
      "salary": 50000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Client Relationship Management (CRM) software",
      "experience": 3
    },
    {
      "skill": "Goal planning software",
      "experience": 3
    },
    {
      "skill": "Excel",
      "experience": 3
    },
    {
      "skill": "Effective communication across multiple client interactive platforms",
      "experience": 3
    },
    {
      "skill": "General office practices",
      "experience": 3
    },
    {
      "skill": "Investment concepts, practices, and procedures in the securities industry",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serves as first point of contact to service a high volume of daily interactions, including basic inquiries, providing quotes and scheduling of meetings, with prospective and existing clients on the phone, in-person, virtually and through mailings."
    },
    {
      "duty": "Works both independently and within a dynamic team environment to provide crucial support to the financial advisors and branch office."
    },
    {
      "duty": "Onboards new clients, opens new client accounts and researches client and security information using internal databases and other technologies."
    },
    {
      "duty": "Ensures key client information and documentation is current with firm and industry requirements, rules and regulations."
    },
    {
      "duty": "Processes and monitors the transfer of assets to ensure all assets and cost basis were successfully received."
    },
    {
      "duty": "Monitors available cash awaiting investment, including running weekly cash and cash equivalent reports and contacting clients with investment opportunities to maximize returns."
    },
    {
      "duty": "Reviews, assesses and responds to all corporate action items and client account alerts."
    },
    {
      "duty": "Prepares financial reports, spreadsheets and other materials for client meetings."
    },
    {
      "duty": "Inputs orders and rebalances portfolios on behalf of the Financial Advisors."
    },
    {
      "duty": "Creates and maintains records and files utilizing Client Relationship Management (CRM) software."
    },
    {
      "duty": "Assists Financial Advisors with marketing efforts including seminars and other client-facing events."
    },
    {
      "duty": "Actively engages in available training/cross-training and educational and/or professional development opportunities to remain current on firm and industry policies and procedures."
    },
    {
      "duty": "Performs other duties and responsibilities as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent and one (1) or more years securities industry or related work experience preferred."
    },
    {
      "credential": "SIE required provided that an exemption or grandfathering cannot be applied. Series 7 required. Series 63, 65 and/or 66 as required by state."
    }
  ]
}