{
  "meta": [
    {
      "job_title": "Driveline & Axles Product Development Support",
      "job_category": "Engineering",
      "job_class": "Professional",
      "sector": "Engineering",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Product Engineering",
      "experience": 5
    },
    {
      "skill": "Design Review",
      "experience": 5
    },
    {
      "skill": "NX Software",
      "experience": 5
    },
    {
      "skill": "Teamcenter",
      "experience": 5
    },
    {
      "skill": "DFMEA",
      "experience": 5
    },
    {
      "skill": "DVP&R",
      "experience": 5
    },
    {
      "skill": "CAE",
      "experience": 5
    },
    {
      "skill": "Supplier Collaboration",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with the engineering team to develop and refine customer products. Generate detailed designs, perform feasibility studies, and ensure compliance with industry standards and regulations."
    },
    {
      "duty": "Develop Design Failure Mode and Effects Analysis (DFMEA) documents. Evaluate designs for potential failure modes and recommend design improvements to improve product reliability and safety."
    },
    {
      "duty": "Contribute to the creation of DVP&R documents outlining testing and validation procedures. Work with test team to ensure successful execution and documentation of verification tests."
    },
    {
      "duty": "Participate in CAE (Computer-Aided Engineering) reviews, mentor, evaluate simulations, and contribute to refining designs based on CAE analysis."
    },
    {
      "duty": "Work closely with the purchasing department to review the sourcing of components and materials required for the products. Ensure timely availability of resources while adhering to cost and quality considerations."
    },
    {
      "duty": "Support technical reviews with suppliers to ensure alignment on design specifications, manufacturing processes, and quality standards. Address any technical concerns and collaborate on resolution."
    },
    {
      "duty": "Manage and facilitate the processes, ensuring that design changes are accurately evaluated, detailed, and implemented while minimizing disruptions."
    },
    {
      "duty": "Participate in tooling kick-off meetings to ensure accurate and timely development of required manufacturing tools and equipment."
    },
    {
      "duty": "Collaborate with multiple teams to ensure readiness for production, addressing any last-minute design or engineering adjustments."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Mechanical Engineering or related field. Advanced degree is a plus."
    }
  ]
}