{
  "meta": [
    {
      "job_title": "Warehouse Worker",
      "job_category": "Warehouse",
      "job_class": "Worker",
      "sector": "Logistics",
      "salary": 19,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Accurately selecting product according to the customer’s order specifications. Load and unload product onto or from delivery vehicles, pallets, etc."
    },
    {
      "duty": "Pulling and preparing product for shipment, ensuring that the exact number and type of product is loaded and shipped."
    },
    {
      "duty": "Perform picking/packing duties in an efficient manner that meets customer service standards."
    },
    {
      "duty": "Move product and materials using a pallet jack, electric pallet jack or other equipment."
    },
    {
      "duty": "Ensure SOP’s are followed in fulfilling customer orders for shipment."
    },
    {
      "duty": "Operation Radio Frequency (RF) terminals for various functions including picking, quality, inventory, shipping, etc."
    },
    {
      "duty": "Determine the appropriate destination of product by scanning packages, reading labels and charts, verifying numbers and sort packages accordingly."
    },
    {
      "duty": "Maintain the facility’s equipment and materials in a neat, clean, and orderly fashion."
    },
    {
      "duty": "Keep appropriate records and reports to guarantee accuracy of inventory."
    },
    {
      "duty": "Participate in physical inventories and cycle counts."
    },
    {
      "duty": "Check or count products for accuracy and or damage/infestation."
    },
    {
      "duty": "Become knowledgeable of the responsibilities, procedures and duties of other areas of the warehouse if necessary."
    },
    {
      "duty": "Perform labeling, sorting, wrapping, packing, and repacking as needed."
    },
    {
      "duty": "May or may not be responsible for operating warehouse and computer equipment."
    },
    {
      "duty": "Perform work in a safe and efficient manner."
    }
  ],
  "skills": [
    {
      "skill": "Warehouse Management Systems (WMS)",
      "experience": 3
    },
    {
      "skill": "Radio Frequency (RF) Experience",
      "experience": 3
    },
    {
      "skill": "Material Handling Equipment Operation",
      "experience": 3
    },
    {
      "skill": "Pallet Jack",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent"
    }
  ]
}