{
  "meta": [
    {
      "job_title": "VIP and Video Conferencing Technician",
      "job_category": "Information Technology",
      "job_class": "Technician",
      "sector": "IT",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mobile Device Management",
      "experience": 5
    },
    {
      "skill": "Windows Operating System",
      "experience": 5
    },
    {
      "skill": "Microsoft Office 365",
      "experience": 5
    },
    {
      "skill": "Hardware Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Mac Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Network Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Microsoft Intune",
      "experience": 5
    },
    {
      "skill": "Printers",
      "experience": 5
    },
    {
      "skill": "Teams Video Conferencing Support",
      "experience": 5
    },
    {
      "skill": "Azure MFA Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Desktop Imaging",
      "experience": 5
    },
    {
      "skill": "Business Writing",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving Skills",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Business Knowledge",
      "experience": 5
    },
    {
      "skill": "Consultancy",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide primary desktop support for Windows Operating System, Mobile Device Management Infrastructure, Video Conferencing systems, and IT-to-IT support for all of Chevron’s Workforce Enablement product."
    },
    {
      "duty": "Ensure consistent processes, procedures, and technologies are utilized across the Chevron enterprise environment."
    },
    {
      "duty": "Understand and follow direction provided by the team leads and managers of different Chevron products and towers."
    },
    {
      "duty": "Document recurring issues in the Chevron Knowledge Base and in detail case status and tasks/work completed with end users in the Chevron ITSM system."
    },
    {
      "duty": "Provide white glove VC technical support for C-suite and high-level management and high-profile events."
    },
    {
      "duty": "Follow Chevron required safety protocols and complete regular training on safety and compliance."
    },
    {
      "duty": "Lead through influence and partner with geographically dispersed colleagues; build alignment using appropriate methods."
    },
    {
      "duty": "Foster an inclusive, collaborative style to ensure results are obtained and supported. Liaise with cross-functional teams leading lean sigma process improvement initiatives."
    },
    {
      "duty": "Analyze given situations, develop mental models of complex problems, and identify and recommend approaches to solving them."
    },
    {
      "duty": "Develop and communicate a compelling business case for the use of IT through a strong understanding of Chevron business drivers and opportunities."
    },
    {
      "duty": "Demonstrate the ability to see the bigger picture, denote how processes/tools will impact other processes/tools. Communicate with transparency the impact and risks with mitigation."
    },
    {
      "duty": "Lead and conduct business requirements, process flows, and technical specifications for the implementation of IT solutions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in IT or Computer Science preferred (Master's preferred)"
    }
  ]
}