{
  "meta": [
    {
      "job_title": "Unit Manager of Central Processing",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Management",
      "experience": 5
    },
    {
      "skill": "Healthcare Regulation Compliance",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Staff Development",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Sterilization Processes",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the personnel in the department in decontaminating, cleaning, packaging and sterilizing all instruments, equipment and other supplies used in the hospital."
    },
    {
      "duty": "Plan and provide sterile processing services for the OR and other departments."
    },
    {
      "duty": "Maintain equipment and ensure appropriate documentation is available."
    },
    {
      "duty": "Implement staffing patterns, work schedules, and call schedules."
    },
    {
      "duty": "Analyze sterilization logs for accuracy and completion to verify conformity to standards of sterilization and safety, meeting regulatory requirements."
    },
    {
      "duty": "Provide positive leadership through orientation, counseling, coaching, and development of staff to effect performance improvement and create good employee morale."
    },
    {
      "duty": "Collaborate and communicate effectively with leadership concerning clinical and staff issues, department status, and specific projects."
    },
    {
      "duty": "Demonstrate awareness and compliance with applicable AAMI, OSHA, AORN, Joint Commission, Federal, State and agency laws, regulations, guidelines and professional standards."
    },
    {
      "duty": "Participate in developing and implementing policies and procedures based on laws, regulations, and professional standards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED, Certified Sterile Processing Technician - The Certification Board for Sterile Processing and Distribution, Inc"
    }
  ]
}