{
  "meta": [
    {
      "job_title": "People Business Advisor",
      "job_category": "Human Resources",
      "job_class": "Advisor",
      "sector": "Human Resources",
      "salary": 79000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HR Consultation",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Business Partnering",
      "experience": 5
    },
    {
      "skill": "Labor Law Compliance",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Organizational Development",
      "experience": 5
    },
    {
      "skill": "Diversity Management",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide experienced advice, coaching, and counsel to leaders and employees on People programs, policy and procedures, employment/labor laws, performance management, conflict resolution, change management, diversity, and organizational development and design to promote a fair and equitable work environment."
    },
    {
      "duty": "Act as a consultant and effectively partner with the staffing process to ensure talent needs and diversity considerations are fulfilled."
    },
    {
      "duty": "Collaborate with Strategic People Business Partners on overall People strategies that support the culture, company direction, and the growth needs of the business and employees."
    },
    {
      "duty": "Partner with specialist groups to ensure the effective development of programs and tools to drive business goals; provides feedback on implementation and utilization of tools to ensure flawless execution; responsible for representing the client's needs and providing client feedback to the Specialist teams."
    },
    {
      "duty": "Participate in building the capability of managers through training, development, and coaching."
    },
    {
      "duty": "Participate in process improvement activities such as mapping, analyzing, and documenting."
    },
    {
      "duty": "Participate in medium complexity projects and may be asked to lead low complexity projects."
    },
    {
      "duty": "Performs other related duties as required and assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree and/or 3 - 5 years of progressive Human Resources generalist experience required. HR Professional certification and PHR/SPHR/CPHR considered an asset."
    }
  ]
}