{
  "meta": [
    {
      "job_title": "Key Account Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 115000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Account Management",
      "experience": 7
    },
    {
      "skill": "Customer Service",
      "experience": 7
    },
    {
      "skill": "Sales Training",
      "experience": 7
    },
    {
      "skill": "Business Development",
      "experience": 7
    },
    {
      "skill": "Technical Sales",
      "experience": 7
    },
    {
      "skill": "Field Support",
      "experience": 7
    },
    {
      "skill": "Relationship Building",
      "experience": 7
    },
    {
      "skill": "Sales Systems Management",
      "experience": 7
    },
    {
      "skill": "Product Knowledge",
      "experience": 7
    },
    {
      "skill": "Team Leadership Coaching",
      "experience": 7
    },
    {
      "skill": "Influence and Persuasion",
      "experience": 7
    },
    {
      "skill": "Microsoft Office",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leverage industry and product knowledge to drive key accounts and encourage, support, and develop field sales resources."
    },
    {
      "duty": "Develop high, wide, and deep relationships with the largest and most complex customers and key stakeholders to increase revenue and drive brand loyalty."
    },
    {
      "duty": "Pursue relationships with potential new key accounts and seek business expansion opportunities with current customers."
    },
    {
      "duty": "Provide direction and guidance for key accounts, meet or exceed annual sales targets or quotas, and suggest product improvements or expanding sales channels."
    },
    {
      "duty": "Visit customer locations and work sites periodically to ensure customer satisfaction, promote ongoing business, and expand reach within commercial and residential build projects."
    },
    {
      "duty": "Collaborate with sales leadership to identify key opportunities for revenue growth and product targets within assigned region for inclusion in annual sales compensation planning."
    },
    {
      "duty": "Analyze customer's technical specifications, recommend the best product configuration and installation process, and estimate implementation effort, time, and resources."
    },
    {
      "duty": "Use technical knowledge of product offerings to advise and support sales teams with pricing estimates, sales quotations, requests for proposals, and implementation guidance based on customer requirements."
    },
    {
      "duty": "Work with the Learning department to implement sales training and onboarding programs to prepare salespeople to discuss products and engage with potential customers or opportunities."
    },
    {
      "duty": "Design and deliver training sessions on company products, business practices, industry context, competitive information, and other topics as needed."
    },
    {
      "duty": "Coach field sales representatives on product categories technical value, proper execution of strategies, value proposition, and general best practices."
    },
    {
      "duty": "Participate in progress evaluations for field sales representatives tasked with driving the specialized scope."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in engineering, building construction, sales/marketing, or other related field preferred; or experience in lieu of degree. Minimum High School Diploma or GED with 7 years of construction or industry experience."
    }
  ]
}