{
  "meta": [
    {
      "job_title": "Case Manager Supervisor",
      "job_category": "Social Work",
      "job_class": "Supervisor",
      "sector": "Health and Human Services",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Assess and evaluate the needs of children and families in the childcare facility."
    },
    {
      "duty": "Develop individualized care plans and interventions to support each child's development, growth, and emotional well-being."
    },
    {
      "duty": "Ensure the safety and security of all children in the facility. Report and address any instances of abuse, neglect, or other concerning behaviors."
    },
    {
      "duty": "Engage with parents and guardians to understand their needs and concerns. Provide support, resources, and guidance to families to strengthen their relationships with their children and improve the overall family environment."
    },
    {
      "duty": "Work collaboratively with childcare staff, including teachers, counselors, social workers, and healthcare professionals, to coordinate services and ensure a holistic approach to child development and support."
    },
    {
      "duty": "Maintain accurate and up-to-date case files for each child, documenting progress, assessments, and interventions. Adhere to confidentiality protocols when handling sensitive information."
    },
    {
      "duty": "Serve as an advocate for children and families, ensuring that their rights and best interests are protected and respected. Connect families with community resources and services as needed."
    },
    {
      "duty": "Handle crises and emergencies in childcare facilities, implementing appropriate protocols to maintain the safety and well-being of all involved parties."
    },
    {
      "duty": "Contribute to the development and implementation of childcare programs and initiatives aimed at enhancing children's learning, emotional development, and social skills."
    },
    {
      "duty": "Ensure compliance with all relevant regulations, policies, and licensing requirements for childcare facilities."
    },
    {
      "duty": "Stay up-to-date with current childcare practices, relevant laws, and best practices in child development, attending training and workshops to enhance professional knowledge and skills."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Social Work, Psychology, Child Development, or a related field + 6 Years of related experience in child welfare and/or social work (Master's degree preferred)"
    }
  ]
}