{
  "meta": [
    {
      "job_title": "Staff Hydrogeologist",
      "job_category": "Engineering",
      "job_class": "Staff",
      "sector": "Engineering",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Geology",
      "experience": 3
    },
    {
      "skill": "Technical Writing",
      "experience": 3
    },
    {
      "skill": "Field Work",
      "experience": 3
    },
    {
      "skill": "MS Office",
      "experience": 3
    },
    {
      "skill": "ArcGIS",
      "experience": 3
    },
    {
      "skill": "Groundwater Analysis",
      "experience": 3
    },
    {
      "skill": "Hydrological Data Collection",
      "experience": 3
    },
    {
      "skill": "Bachelor's Degree",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct routine data collection, synthesis, and analysis using approved procedures appropriate for their discipline."
    },
    {
      "duty": "Assist in identifying technical issues and approaches for evaluation."
    },
    {
      "duty": "Become familiar with local, state, and federal regulations."
    },
    {
      "duty": "Oversee investigation activities including drilling, well construction, field mapping, and environmental sampling of different media."
    },
    {
      "duty": "Perform other routine fieldwork activities including lithologic descriptions, pump testing, and surface water measurements."
    },
    {
      "duty": "Document project-related activities in the field and office using electronic and written documentation."
    },
    {
      "duty": "Draft technical sections of project communications, work plans, and reports."
    },
    {
      "duty": "Perform all work in accordance with company and client Health & Safety protocols."
    },
    {
      "duty": "Comply with the Guiding Principles and Code of Behavior articulated in our Company Charter."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Geology. 0-3 years of related field work experience. "
    },
    {
      "credential": "GIT or RG license within 2 years of hire date preferred"
    },
    {
      "credential": "Computer Skills – Strong computer literacy skills including proficiency in all MS Office software and ArcGIS is a plus. "
    },
    {
      "credential": "Experience with groundwater, surface water, and soil sampling. "
    },
    {
      "credential": "Experience with drilling and construction of water wells and monitoring wells. "
    },
    {
      "credential": "Experience with field hydrological data collection, aquifer testing, slug testing, and groundwater analysis."
    },
    {
      "credential": "Experience with industry standard groundwater modeling software is a plus."
    },
    {
      "credential": "OSHA 40-hour HAZWOPER training preferred"
    }
  ]
}