{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Energy",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Construction Management",
      "experience": 2
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Document Management",
      "experience": 5
    },
    {
      "skill": "Quality Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with Sales, Engineering, Development, construction, and Portfolio Management for the successful development and implementation of EV projects."
    },
    {
      "duty": "Manage the process for delivery of projects and programs for various clients across the USA, involving a variety of scopes: engineering, procurement, construction, commissioning support, and software deployment coordination."
    },
    {
      "duty": "Implement project management best practices and control systems at the project level, including project process control, Management of Change, Contract Management, Stakeholder Management, Risk Management, Cost & Schedule Management, Quality Management, Document Management, Project Reporting, and Progress Management."
    },
    {
      "duty": "Be accountable for process gap remediation, schedule, and quality performance on projects and programs during delivery."
    },
    {
      "duty": "Track and report project milestones and deliverables."
    },
    {
      "duty": "Develop full-scale project plans and associated communications documents."
    },
    {
      "duty": "Delegate tasks and responsibilities to appropriate personnel."
    },
    {
      "duty": "Identify and resolve issues and conflicts within the project/process."
    },
    {
      "duty": "Identify and manage project dependencies and critical path."
    },
    {
      "duty": "Plan and schedule project timelines and milestones using appropriate tools."
    },
    {
      "duty": "Develop and deliver progress reports, proposals, requirements documentation, and presentations."
    },
    {
      "duty": "Define project scope, goals, and deliverables to meet the business goals."
    },
    {
      "duty": "Administrate the different contracts and fulfill the contract provisions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Electrical Engineering or related field (Master's preferred)"
    },
    {
      "credential": "In-field construction management experience a plus"
    }
  ]
}