{
  "meta": [
    {
      "job_title": "Public Affairs Specialist",
      "job_category": "Public Affairs",
      "job_class": "Specialist",
      "sector": "Public Affairs",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Strategic Communications",
      "experience": 6
    },
    {
      "skill": "Public Affairs",
      "experience": 6
    },
    {
      "skill": "Media Engagement",
      "experience": 6
    },
    {
      "skill": "Content Development",
      "experience": 6
    },
    {
      "skill": "Event Management",
      "experience": 6
    },
    {
      "skill": "Customer Service",
      "experience": 6
    },
    {
      "skill": "Written Communication",
      "experience": 6
    },
    {
      "skill": "Organization",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide public affairs and strategic communications support for a DoD client, developing and implementing a variety of deliverables including articles, public affairs guidance, talking points, and draft press releases."
    },
    {
      "duty": "Support external media engagement efforts for leadership."
    },
    {
      "duty": "Research, develop, and write bi-weekly workforce messages and weekly newsletters, which are subject to change based on mission needs."
    },
    {
      "duty": "Assist with planning, managing, and coordinating agency events and activities and provide onsite management of the event to include scheduling, advertising, setting up, and day of event management."
    },
    {
      "duty": "Provide support for media engagements and developing talking points, provide content management support for intranet and internet sites, and demonstrate professional customer service to mission partners."
    },
    {
      "duty": "Develop and produce public affairs guidance and related materials, draft and update fact sheets, talking points, briefing materials, and the client’s webpage, and coordinate with other staff offices for responses to client-related media and legislative queries."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "HS diploma or GED"
    }
  ]
}