{
  "meta": [
    {
      "job_title": "Pharmacy Technician",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Medication Preparation",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Pharmacy Operations",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Receive and process prescription requests, and enter prescriptions into a computer database for dispensing."
    },
    {
      "duty": "Assist clients at the cash register and work with insurance companies for medication coverage."
    },
    {
      "duty": "Maintain inventory, profile prescriptions, and prepare medication for dispensing."
    },
    {
      "duty": "Communicate effectively and respectfully with customers and co-workers, ensuring accurate and timely information transmission."
    },
    {
      "duty": "Adhere to established policies and procedures related to communications and engage in accurate verbal and written communication."
    },
    {
      "duty": "Manage workload effectively, set priorities appropriately, and ensure accurate and efficient services through coordination with team members."
    },
    {
      "duty": "Demonstrate understanding of and compliance with policies and procedures, and maintain up-to-date knowledge of pharmacy operations."
    },
    {
      "duty": "Participate in quality assurance activities to ensure high-quality outcomes and meet customer needs consistently."
    },
    {
      "duty": "Maintain work environment and equipment according to established policies and procedures to produce safe and effective products."
    },
    {
      "duty": "Complete required training and maintain on-going certification for pharmacy-related activities."
    },
    {
      "duty": "Follow guidelines set forth in Legacy’s Values in Action and maintain current applicable state Pharmacy Technician Licensure."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent required. Prior pharmacy tech/clerk experience or current pharmacy tech student or program graduate preferred. Basic familiarity with computers preferred."
    }
  ]
}