{
  "meta": [
    {
      "job_title": "Leader, Logistics Project",
      "job_category": "Logistics",
      "job_class": "Leader",
      "sector": "Logistics",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Logistics Operations",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee freight audit operations to ensure accurate and timely payment processing for all inbound and outbound shipments."
    },
    {
      "duty": "Collaborate with logistics, sourcing, and finance teams to verify and reconcile invoices for accuracy and compliance with contract terms."
    },
    {
      "duty": "Resolve payment discrepancies and maintain positive relationships with logistics providers."
    },
    {
      "duty": "Identify opportunities for process improvement and implement best practices in freight audit procedures."
    },
    {
      "duty": "Develop data analytics to monitor key performance indicators and provide regular reports on metrics to management."
    },
    {
      "duty": "Maintain strong relationships with logistics providers and freight audit vendors to ensure smooth audit processes."
    },
    {
      "duty": "Stay up-to-date with industry regulations, payment policies, and market trends to ensure compliance."
    },
    {
      "duty": "Work closely with other departments to improve overall supply chain performance."
    },
    {
      "duty": "Coach and mentor team members, fostering a supportive and high-performing work environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree from an accredited university or college or a high school diploma/GED and minimum 6 years of relevant experience."
    },
    {
      "credential": "Proficient in data analysis and reporting using relevant tools to make data-driven decisions."
    }
  ]
}