{
  "meta": [
    {
      "job_title": "Sales Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Product Knowledge",
      "experience": 3
    },
    {
      "skill": "Customer Interaction",
      "experience": 3
    },
    {
      "skill": "Sales Excellence",
      "experience": 3
    },
    {
      "skill": "Customer Onboarding",
      "experience": 3
    },
    {
      "skill": "Operational Tasks",
      "experience": 3
    },
    {
      "skill": "Customer Issue Resolution",
      "experience": 3
    },
    {
      "skill": "Sales Compensation Plans",
      "experience": 3
    },
    {
      "skill": "Flexible Schedule",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assisting and consulting with customers on products and services by utilizing knowledge, skills, and technology to achieve a world-class sales and service experience."
    },
    {
      "duty": "Demonstrating product and sales know-how with customers and providing product demonstrations to educate customers on full product capabilities."
    },
    {
      "duty": "Listening and evaluating customer needs, providing appropriate solutions, and achieving sales and customer experience goals and objectives."
    },
    {
      "duty": "Facilitating comprehensive customer onboarding activities and ensuring customers fully understand how to use and manage all company products/services."
    },
    {
      "duty": "Performing operational and administrative tasks and resolving customer issues in partnership with customer care."
    },
    {
      "duty": "Demonstrating sales excellence and professionalism with integrity and a warm and friendly demeanor to customers and teammates."
    },
    {
      "duty": "Complying with all company and retail operational policies and procedures, completing training requirements, and engaging in team huddles and learning."
    },
    {
      "duty": "Understanding sales compensation plan and its key elements, and working a flexible schedule that includes evenings, weekends, holidays, and overtime as needed."
    },
    {
      "duty": "Being able to carry and lift up to 25-pound boxes, stand and move about the store constantly, and perform other duties and responsibilities as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma / GED"
    }
  ]
}