{
  "meta": [
    {
      "job_title": "Client Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 61000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Client Management",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Communications",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Insurance Knowledge",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Personal Responsibility",
      "experience": 5
    },
    {
      "skill": "Renewal Processes",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and maintain excellent relationships with partners, carriers, and vendors."
    },
    {
      "duty": "Manage incoming email, mail, and calls from clients, lenders, and insurance company personnel."
    },
    {
      "duty": "Process changes, follow up with clients via email, and maintain client profiles and policies in the client management system."
    },
    {
      "duty": "Process policies as new business, renewals, or rewrites, and obtain quotes from a company to present to the client."
    },
    {
      "duty": "Accept payments from insureds, counsel clients on coverage and limits, and provide proactive risk management support."
    },
    {
      "duty": "Provide renewal summaries of insurance, check new policies for accuracy, and follow up on late payments."
    },
    {
      "duty": "Review monthly statements from accounting and contact clients if late for agency bill policies."
    },
    {
      "duty": "Cover the desk of those on vacation or out sick for time-sensitive work, volunteer assistance to others in the department, and work efficiently in a team environment."
    },
    {
      "duty": "Project a positive attitude toward company goals, apply problem solving techniques to various issues, and utilize intuitive behaviors to work with various personalities and styles."
    },
    {
      "duty": "Pursue a program for professional development consistent with the position."
    },
    {
      "duty": "Visit clients at home or office on larger accounts, when necessary, and cover other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Property & Casualty Insurance License required"
    },
    {
      "credential": "CISR designation or other advanced designation preferred"
    }
  ]
}