{
  "meta": [
    {
      "job_title": "Sr. Project Manager",
      "job_category": "Management",
      "job_class": "Project Manager",
      "sector": "Real Estate",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 12
    },
    {
      "skill": "Client Management",
      "experience": 12
    },
    {
      "skill": "Financial Management",
      "experience": 12
    },
    {
      "skill": "Vendor Management",
      "experience": 12
    },
    {
      "skill": "Team Leadership",
      "experience": 12
    },
    {
      "skill": "Negotiation",
      "experience": 12
    },
    {
      "skill": "PDS Technology",
      "experience": 12
    },
    {
      "skill": "Microsoft Office",
      "experience": 12
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Regular interface with internal and external clients to ensure successful delivery of project management services."
    },
    {
      "duty": "Act with fiduciary responsibility to client projects, including complete financial management of project."
    },
    {
      "duty": "Management of due diligence, programming, design, entitlements, bidding, permitting, procurement, design team selection, schedule creation/management, contractor selection, vendor selection, sustainability, and post-construction services."
    },
    {
      "duty": "Negotiate contracts with selected vendor(s) and manage performance of all contracted vendors, consultants, etc."
    },
    {
      "duty": "Identify and address areas of concern regarding potential liabilities and risk with GOS PDS Director."
    },
    {
      "duty": "Provide an appropriate level of on-site supervision to ensure proper performance criteria are being met."
    },
    {
      "duty": "Active management of PDS staff, including adherence to company policy/procedures, staff development, performance management, and team motivation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Architecture, Engineering, Construction Management, Business Administration, or related field (Master's degree preferred)"
    },
    {
      "credential": "Certification preferred"
    }
  ]
}