{
  "meta": [
    {
      "job_title": "Selling Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive store sales and growth by personally selling to customers."
    },
    {
      "duty": "Proactively engage with customers, read cues, and respond effectively."
    },
    {
      "duty": "Provide customers with the perfect fit by asking effective questions."
    },
    {
      "duty": "Deliver a friendly and efficient cash wrap experience, processing customer transactions accurately and efficiently at the Point of Sale."
    },
    {
      "duty": "Reinforce customer buying decisions at checkout and encourage purchase of additional items."
    },
    {
      "duty": "Recover cash wrap selling zone and “go-backs”."
    },
    {
      "duty": "Process merchandise to be floor-ready and maintain back room and under stock to brand standards."
    },
    {
      "duty": "Replenish merchandise to brand standards to ensure product is placed on the sales floor and available for purchase."
    },
    {
      "duty": "Assist with floorset activity and maintenance of back room and under stock, including merchandise and non-merchandise, to brand standards to enable efficient replenishment."
    },
    {
      "duty": "Drive top line store sales results and grow the business through action and productivity."
    },
    {
      "duty": "Maintain a focus on bras as the premier product differentiator, to build loyalty and support the 'Best at Bras' culture."
    },
    {
      "duty": "Create customer awareness of programs available to them (i.e. Victoria’s Secret Angel Card, phone and email capture) to build customer loyalty."
    },
    {
      "duty": "Set personal goals and track individual and team performance to the goals."
    },
    {
      "duty": "Prepare for each shift by maintaining awareness of all sales, promotions, and applicable ringing procedures."
    },
    {
      "duty": "Take initiative to recover and replenish merchandise so it is available to sell."
    },
    {
      "duty": "Understand and adhere to visual merchandising brand standards."
    },
    {
      "duty": "Assist in housekeeping of the sales floor and communicate maintenance issues."
    },
    {
      "duty": "Keep an awareness of, and build personal capability in, loss prevention."
    },
    {
      "duty": "Reinforce store strategy to reduce shrink."
    },
    {
      "duty": "Support all activities related to providing a safe working environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent"
    }
  ]
}