{
  "meta": [
    {
      "job_title": "Faculty Group Practice Secretary",
      "job_category": "Administrative",
      "job_class": "Entry Level",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Appointment Scheduling",
      "experience": 2
    },
    {
      "skill": "Medical Records Management",
      "experience": 2
    },
    {
      "skill": "Insurance Verification",
      "experience": 2
    },
    {
      "skill": "HIPAA Compliance",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Front Desk Operations",
      "experience": 2
    },
    {
      "skill": "Healthcare Software (Epic)",
      "experience": 2
    },
    {
      "skill": "Office Inventory Management",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Greet patients professionally in person and on the phone, while answering patient questions and referring them to the appropriate contact."
    },
    {
      "duty": "Optimize provider schedules and patient access by efficient scheduling and promoting a positive patient experience."
    },
    {
      "duty": "Retrieve and update patient records to ensure availability of treatment information and verify insurance information for billing."
    },
    {
      "duty": "Perform front-end administrative tasks including registration, forms collection, and co-payment collection."
    },
    {
      "duty": "Monitor patient appointment reports, insurance eligibility, and Department Appointment Report for checkmate “kick-outs”."
    },
    {
      "duty": "Gather patient demographic data, obtain insurance information, and advise patients on financial documentation for visits."
    },
    {
      "duty": "Promote the utilization of Check Mate kiosks, scan necessary documents into Epic, and monitor waiting areas to identify and communicate wait times."
    },
    {
      "duty": "Performs check-out functions, schedules routine appointments and follow-ups, and promotes the use and sign-up of MyChart."
    },
    {
      "duty": "Maintain office inventory and equipment, ensure scanned documents are uploaded correctly in Epic, and complete administrative in-basket messages in a timely manner."
    },
    {
      "duty": "Remain current on best practices, clinic protocols, FOCUS trainings, maintain cleanliness of patient space, and maintain professional relationships with staff."
    },
    {
      "duty": "Communicate effectively with all levels of the organization, prioritize assignments, and provide appropriate materials for patient and provider needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma"
    }
  ]
}