{
  "meta": [
    {
      "job_title": "Relationship Manager",
      "job_category": "Client Services",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Customer Satisfaction",
      "experience": 5
    },
    {
      "skill": "Sales Coordination",
      "experience": 5
    },
    {
      "skill": "Strategic Business Partnerships",
      "experience": 5
    },
    {
      "skill": "Consultative Support",
      "experience": 5
    },
    {
      "skill": "Sales Education",
      "experience": 5
    },
    {
      "skill": "Client Advocacy",
      "experience": 5
    },
    {
      "skill": "Ethical Standards",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the primary point of contact for Comprehensive Human Resources clients and act as a liaison between the client and ADP."
    },
    {
      "duty": "Maintain client satisfaction, retention, and oversee the entire client experience by offering best practices, consultative support, guidance, and advice on Human Resources."
    },
    {
      "duty": "Develop and enhance strategic business partnerships to understand client's financial position, business and strategic objectives, and requirements."
    },
    {
      "duty": "Partner with implementation, service, and other support teams to deliver a seamless client experience and champion regulatory changes, process improvement, and more."
    },
    {
      "duty": "Proactively ensure client satisfaction through regular conference calls and periodic client visits, striving to exceed client expectations in every interaction."
    },
    {
      "duty": "Leverage ADP product and services knowledge to solve issues and questions that help clients understand the products' value. Also, take client input and turn it into recommendations on best practices and solutions training."
    },
    {
      "duty": "Thrive in a structured environment that requires setting priorities, organizing your day, multi-tasking, changing direction, and providing prompt follow-up."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma with a preference for candidates with a college degree or military experience"
    }
  ]
}