{
  "meta": [
    {
      "job_title": "Laboratory Assistant - IVF",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Written Communication",
      "experience": 3
    },
    {
      "skill": "Spoken Communication",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Empathy",
      "experience": 3
    },
    {
      "skill": "Organization",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage administrative tasks and provide patient support services in a non-diagnostic laboratory setting."
    },
    {
      "duty": "Interact directly with patients to provide updates and answer questions related to their individual case."
    },
    {
      "duty": "Adhere to School of Medicine and Departmental guidelines concerning conduct, safety, and patient confidentiality."
    },
    {
      "duty": "Maintain a professional appearance and provide proper notification of absences or tardiness."
    },
    {
      "duty": "Demonstrate alertness and adaptability to changes in schedule and work conditions, respond appropriately, and complete assigned tasks effectively."
    },
    {
      "duty": "Assume responsibility for on-going professional development and continuing education, and maintain a clean and safe working environment."
    },
    {
      "duty": "Seek information and ask for assistance from senior personnel when necessary regarding difficult or questionable clinical results."
    },
    {
      "duty": "Dispose of biological specimens in designated hazard containers, report malfunctions promptly, and perform tasks utilizing universal precautions for bloodborne pathogens."
    },
    {
      "duty": "Check Andrology lab emails, greetings andrology patients, and perform additional tasks as required to support the lab."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High School or equivalent (Bachelor's degree preferred)"
    }
  ]
}