{
  "meta": [
    {
      "job_title": "Operations Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Integrated Supply Chain",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Engineering/IT",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "ETL Tools",
      "experience": 5
    },
    {
      "skill": "Tableau",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Facilitation",
      "experience": 5
    },
    {
      "skill": "Project/Program Management",
      "experience": 5
    },
    {
      "skill": "Team Building",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Web Development",
      "experience": 5
    },
    {
      "skill": "SQL Server Analysis Services",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and direct operations at Honeywell Aerospace and be part of overseeing and directing operations for world-class integrated supply chain projects."
    },
    {
      "duty": "Assess project issues and develop enhanced resolutions to meet or exceed productivity, quality, and customer satisfaction goals and objectives."
    },
    {
      "duty": "Develop mechanisms for monitoring project progress and for intervention and problem solving with key stakeholders."
    },
    {
      "duty": "Work collaboratively with members of ISC functions, sites, and leadership to build relationships and better understand areas that inhibit their productivity and effectiveness and develop solutions to address those issues."
    },
    {
      "duty": "Manage the activities to support the data load process, current analytics projects, and dashboards with team members."
    },
    {
      "duty": "Lead projects technically and improve the skill sets of team members and demonstrate the advancement of analytical capabilities of each of the ISC functions."
    },
    {
      "duty": "Develop and enable delivery mechanisms for comprehensive, actionable analytics that identify improvement opportunities for all functions of ISC."
    },
    {
      "duty": "Process standardization and documentation across all projects."
    },
    {
      "duty": "Monthly connect, newsletter, focus training for users, tableau subscriptions for every function, and functional training for team members."
    },
    {
      "duty": "Due to compliance with U.S. export control laws and regulations, the candidate must be a U.S. citizen, U.S. permanent resident, or have asylum or refugee status in the U.S."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Engineering or Business. A certification in Project/Program Management techniques is preferred, e.g. PMP or similar. "
    },
    {
      "credential": "5+ years of experience in data analytics and dashboard developments."
    },
    {
      "credential": "Communication skills both verbal and written including the ability to interface effectively with all levels of leadership."
    }
  ]
}