{
  "meta": [
    {
      "job_title": "Payroll Specialist",
      "job_category": "Accounting",
      "job_class": "Specialist",
      "sector": "Accounting",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Payroll Processing",
      "experience": 4
    },
    {
      "skill": "Accounting",
      "experience": 3
    },
    {
      "skill": "Financial Reporting",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 4
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 4
    },
    {
      "skill": "MS Office Suite",
      "experience": 4
    },
    {
      "skill": "Ceridian Dayforce",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Accurate and timely processing of payrolls, performing a detailed reconciliation and balancing to identify and resolve any discrepancies."
    },
    {
      "duty": "Maintain accurate and timely payroll records for all employees."
    },
    {
      "duty": "Ensure timekeeping data, hours worked, and wage adjustments are accurate to ensure precise payroll calculations."
    },
    {
      "duty": "Address and resolve any payroll-related inquiries from employees."
    },
    {
      "duty": "Generate payroll reports for management and accounting purposes."
    },
    {
      "duty": "Provide accurate payroll data for audits and financial reporting."
    },
    {
      "duty": "Ensure compliance with labor laws, tax codes, and company policies related to payroll processing."
    },
    {
      "duty": "Stay up-to-date with federal, state, and local payroll laws and regulations."
    },
    {
      "duty": "Develop an understanding of pay rules to validate payroll system calculations."
    },
    {
      "duty": "Contribute to any payroll related upgrade, implementation, or cross functional working team."
    },
    {
      "duty": "Assist in preparing annual tax forms, such as W-2s, to employees."
    },
    {
      "duty": "Cultivate a diverse and inclusive culture where associates can thrive, make us better and fuel ideas/innovations to ensure our long-term success."
    },
    {
      "duty": "Lead, influence and empower the organization to fulfill our purpose (living our legacy, shaping our future, and winning as one)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 40,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED required"
    },
    {
      "credential": "Associate degree in Business Administration or Accounting preferred"
    },
    {
      "credential": "Accredited payroll certification a plus"
    }
  ]
}