{
  "meta": [
    {
      "job_title": "Public Policy Manager",
      "job_category": "Public Policy",
      "job_class": "Manager",
      "sector": "Government Relations",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Public Policy Analysis",
      "experience": 10
    },
    {
      "skill": "Government Relations",
      "experience": 10
    },
    {
      "skill": "Strategic Advocacy",
      "experience": 10
    },
    {
      "skill": "Policy Development",
      "experience": 10
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Track key energy, environmental, Indigenous, and business policy issues, and analyze potential legislation and regulation that could impact the organization."
    },
    {
      "duty": "Lead the development of advocacy strategies to influence public policy and political discourse in Canada and the United States."
    },
    {
      "duty": "Engage with the business to develop strategies for grants, subsidies, and incentives from all levels of government."
    },
    {
      "duty": "Coordinate with internal and external teams to define organizational positions on key policy issues and drive strategies for policy implementation."
    },
    {
      "duty": "Build and maintain partnerships and alliances to support corporate initiatives and projects."
    },
    {
      "duty": "Direct research and impact analysis on policy, legislative, and regulatory issues affecting the organization."
    },
    {
      "duty": "Improve access to government grants, subsidies, and incentives to support the energy transition."
    },
    {
      "duty": "Ensure preparation of Briefing Notes for organizational representatives and senior leadership for effective advocacy."
    },
    {
      "duty": "Collaborate with internal and external stakeholders to align on key messages and support business development efforts."
    },
    {
      "duty": "Track and summarize policy developments at state, provincial, and federal levels and ensure their inclusion in briefings to leadership."
    },
    {
      "duty": "Manage strategic engagement with third parties and industry groups, including advocacy plans."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "University degree in public relations, political science, business, or a related field"
    }
  ]
}