{
  "meta": [
    {
      "job_title": "Industrial Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Industrial Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Industrial Engineering",
      "experience": 6
    },
    {
      "skill": "Supply Chain Management",
      "experience": 4
    },
    {
      "skill": "Labor Management",
      "experience": 4
    },
    {
      "skill": "Process Simulation",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Union Relations",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Implements new and modifies existing engineered labor standards in warehouse receiving, put-aways replenishment, selection, and loading."
    },
    {
      "duty": "Supports regional operations projects in warehouse automation, slotting, facility layout, transportation, labor incentive plans, etc."
    },
    {
      "duty": "Partners with Excellence leaders, Optimizers, and division staff to train warehouse and delivery staff in efficient and safe work methods."
    },
    {
      "duty": "Performs process simulations before deploying new labors standards to assess impact on labor productivity and applicable incentive programs."
    },
    {
      "duty": "Serves as a subject matter expert in work methods, labor standards, efficiency techniques and labor management software."
    },
    {
      "duty": "Functions as a mentor and adviser to divisional personnel within these areas."
    },
    {
      "duty": "Consistently monitors and analyzes warehouse and delivery operations within assigned divisions to measure warehouse productivity metrics, ensure successful implementation and identify new opportunities for efficiencies."
    },
    {
      "duty": "Maintains high level relations with vendors throughout the course of the implementation and on a go forward basis to maintain the relationship."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Engineering, required (Industrial Engineering degree preferred)."
    }
  ]
}