{
  "meta": [
    {
      "job_title": "Staff Nurse",
      "job_category": "Nursing",
      "job_class": "Staff",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Promotes a positive and pleasant attitude conducive to the workplace, which enhances the Mission, Vision and Value Statement of the Network."
    },
    {
      "duty": "Initiates and completes patient admission history and assessment according to established guidelines."
    },
    {
      "duty": "Observes symptoms or changes in patient status and responds promptly, exercising reasonable judgment."
    },
    {
      "duty": "Plans care for patient based on identified problems/needs."
    },
    {
      "duty": "Communicates pertinent patient information to head nurse, co-workers, medical staff and other health team members."
    },
    {
      "duty": "Coordinates patient care assignments."
    },
    {
      "duty": "Delegates assignments for nursing personnel based on patient acuity and employee skill level."
    },
    {
      "duty": "Directs and coordinates the activities of the licensed practical nurse and ancillary personnel involved in the care of assigned patients."
    }
  ],
  "skills": [
    {
      "skill": "Medical/Surgical Nursing",
      "experience": 5
    },
    {
      "skill": "Patient Assessment",
      "experience": 5
    },
    {
      "skill": "Care Planning",
      "experience": 5
    },
    {
      "skill": "Therapeutic Regimen Management",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Nursing or higher (or other nursing degree, as identified by NYS Education Department including Master of Science in Nursing, Doctor of Nursing Practice, Doctor of Philosophy Degree in Nursing or Doctor of Nursing Science) from an accredited college or university, registered with the NYSED; or obtains a Bachelor's degree in Nursing or higher within ten (10) years of the date of initial licensure; and Valid and current certification in Basic Life Support (BLS) through the American Heart Association (AHA)."
    }
  ]
}