{
  "meta": [
    {
      "job_title": "Research Director / Vice President",
      "job_category": "Marketing",
      "job_class": "Director / Vice President",
      "sector": "Marketing",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Market Research",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Market Analytics",
      "experience": 8
    },
    {
      "skill": "Client Relationship Management",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Public Relations",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Social Media Analytics",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and oversee end-to-end execution of research projects while cultivating strong relationships with clients and working cross-functionally with internal resources."
    },
    {
      "duty": "Manage multiple project teams simultaneously as they collect relevant data, analyze data, produce research reports, and present findings and conclusions to clients, ensuring established processes are followed and maintaining required documentation to deliver results that meet the highest quality standards."
    },
    {
      "duty": "Employ a wide range of social media and traditional media platforms to conduct necessary research (e.g., competitive intelligence, audience analytics, sector analysis, customer journey mapping, issues monitoring, business development, etc.)."
    },
    {
      "duty": "Provide guidance to teams on QC plans for projects."
    },
    {
      "duty": "Lead development of narratives for research findings; drafting of proposals and statements of work for new opportunities with existing clients."
    },
    {
      "duty": "Develop pricing for proposed measurement and secondary research projects."
    },
    {
      "duty": "Engage client stakeholders to understand how measurement will address business needs and ensure client success; lead design of research and measurement programs based on client business requirements."
    },
    {
      "duty": "Manage staffing and budgets for active projects."
    },
    {
      "duty": "Actively contribute to business development efforts, including supporting the agency on strategic RFP opportunities and proactively engaging with internal stakeholders to identify and monetize opportunities for organic account growth via research and intelligence capabilities."
    },
    {
      "duty": "Mentor junior and mid-level staff, fostering a collaborative team environment."
    },
    {
      "duty": "Escalate issues that impact the timeline, budget, or data quality in a timely manner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}