{
  "meta": [
    {
      "job_title": "Logistics Specialist",
      "job_category": "Logistics",
      "job_class": "Specialist",
      "sector": "Logistics",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform on site physical inspections of inventory as directed by NAVSUP personnel, collect key documentation, information, data, and actions relevant to the execution of the NAVSUP inventory plan; consolidate and deliver individual site inspection results to NAVSUP and Nakupuna support team"
    },
    {
      "duty": "Conduct internal inventory testing and analysis to ensure adequate inventory controls and processes are in place"
    },
    {
      "duty": "Identify and document inventory deficiencies"
    },
    {
      "duty": "Assist with testing and analyzing the NWCF inventory control and deficiencies"
    },
    {
      "duty": "Assist in making recommendations to NAVSUP Inventory Operations Center (IOC) personnel on any improvements that could be made to improve inventory management and control practices"
    },
    {
      "duty": "Prepare and complete all required site visit documentation in accordance with applicable DoD guidelines"
    },
    {
      "duty": "Participate in and document Inventory Audit (IA) interviews"
    },
    {
      "duty": "Maintain user confidence and protects operations by keeping information confidential"
    },
    {
      "duty": "Keep Nakupuna team abreast of any issues of potential impact to achievement of client mission"
    }
  ],
  "skills": [
    {
      "skill": "Inventory Audits",
      "experience": 2
    },
    {
      "skill": "Attention to Detail",
      "experience": 2
    },
    {
      "skill": "Computer Competencies",
      "experience": 2
    },
    {
      "skill": "Math Competencies",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from an accredited institution or years equivalent experience. 2 years of NAVSUP Supply Chain Process (desired). Must be U.S. Citizen and need to pass background investigation to qualify for and obtain a base access pass. Must be able to obtain a favorable National Security Agency Check (NACI) including a FBI fingerprint check."
    }
  ]
}