{
  "meta": [
    {
      "job_title": "Business Analyst",
      "job_category": "Business",
      "job_class": "Analyst",
      "sector": "Management",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Energy Efficiency",
      "experience": 7
    },
    {
      "skill": "Market Research",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Analytics Tools",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Customer Communication",
      "experience": 5
    },
    {
      "skill": "Travel Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Compile and analyze program and project level data such as energy savings, incentives, and application status."
    },
    {
      "duty": "Develop and run reports, processes, graphs, and dashboards to track key program performance metrics."
    },
    {
      "duty": "Develop, streamline, document, and automate program processes."
    },
    {
      "duty": "Perform a critical analysis of program data to identify operational and data anomalies and exceptions."
    },
    {
      "duty": "Quickly translate data and accompanying analysis into internal, client, and management presentations."
    },
    {
      "duty": "Manage backend processes to provide cadence reporting to the client and in-house finance and accounting teams."
    },
    {
      "duty": "Assist with trade ally management."
    },
    {
      "duty": "Manage small initiatives to completion."
    },
    {
      "duty": "Continuous improvement of backend tools and client deliverables."
    },
    {
      "duty": "Other tasks as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in the analytic discipline. Three to Five years of experience compiling and analyzing data and producing data-intensive reports. High attention to detail and reporting precision. Understanding of and management within large utility-client bureaucracies. A proven and demonstrable grasp of data analysis tools such as Power BI, Oracle, SQL Server, Excel or equivalent. High Degree of Proficiency with Excel inclusive of Pivot Tables, Data Management Tools, and advanced formulas and functions. Demonstrated analytical abilities to develop and implement resolutions for business challenges and issues. Willingness and ability to travel, via airplane, as required up to approximately 10% of the year."
    }
  ]
}