{
  "meta": [
    {
      "job_title": "Sr. Events Manager",
      "job_category": "Events",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Event Planning",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Client Management",
      "experience": 7
    },
    {
      "skill": "Graphic Design",
      "experience": 7
    },
    {
      "skill": "RFP Process",
      "experience": 7
    },
    {
      "skill": "Budget Management",
      "experience": 7
    },
    {
      "skill": "Marketing Strategies",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Own specific deliverables/components for a client event and drive them to fruition, utilizing best practices, appropriate resources, and vendor partnerships, while managing tasks according to project timelines."
    },
    {
      "duty": "Responsible for design-related digital and print needs."
    },
    {
      "duty": "Serve as a valued resource for assigned clients."
    },
    {
      "duty": "Manage the RFP process for vendors."
    },
    {
      "duty": "Collaborate with other team members to create project plans, production schedules, project estimates, and meeting agendas; facilitate project planning meetings."
    },
    {
      "duty": "Provide proactive consultation to clients and teammates to manage the expectations on the timing of deliverables."
    },
    {
      "duty": "Conduct venue selection and site inspections; make recommendations to support event requirements."
    },
    {
      "duty": "Work with the sales team to fulfill relevant contracted exhibitor and sponsor deliverables, as outlined in their prospectuses and sales agreements."
    },
    {
      "duty": "Manage assignment-related portions of master event timeline; meet deadlines."
    },
    {
      "duty": "Utilize internal resources to seek assistance and direction; escalate when needed to resolve potential client or project issues."
    },
    {
      "duty": "Collaborate with leadership to ensure that project consultation and recommendations are aligned with client expectations."
    },
    {
      "duty": "Interface directly with clients, vendors, internal departments, and client leadership teams. Coordinate and attend meetings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in management, marketing, business, or another related discipline."
    }
  ]
}