{
  "meta": [
    {
      "job_title": "Loan Originator",
      "job_category": "Financial Services",
      "job_class": "Sales",
      "sector": "Sales",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and maintain relationships with potential borrowers, real estate agents, and referral partners to generate a consistent pipeline of loan applications."
    },
    {
      "duty": "Conduct thorough interviews with borrowers to assess their financial status, goals, and preferences, while carefully analyzing their credit reports and financial documents."
    },
    {
      "duty": "Educate clients on various loan products, interest rates, and terms, explaining the advantages and disadvantages of each option, and assisting in selecting the most suitable loan program."
    },
    {
      "duty": "Guide borrowers through the loan application process, ensuring all required documentation is collected accurately and efficiently."
    },
    {
      "duty": "Collaborate with the processing team to ensure timely and accurate submission of loan files, while proactively addressing any potential issues or challenges."
    },
    {
      "duty": "Maintain a comprehensive understanding of mortgage industry regulations and guidelines, staying up-to-date with any changes that may impact loan origination."
    },
    {
      "duty": "Provide exceptional customer service throughout the loan process, promptly addressing client inquiries and concerns, and ensuring a smooth and positive experience."
    },
    {
      "duty": "Achieve individual and team sales targets, while consistently meeting or exceeding performance goals."
    }
  ],
  "skills": [
    {
      "skill": "Loan Origination",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Documentation Management",
      "experience": 5
    },
    {
      "skill": "Sales Target Achievement",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, or related field (Master's preferred)"
    },
    {
      "credential": "Active state-specific mortgage loan originator license or willingness to obtain one"
    }
  ]
}