{
  "meta": [
    {
      "job_title": "Clinical Specialist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 103304,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Expertise",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Clinical Training",
      "experience": 5
    },
    {
      "skill": "Case Management",
      "experience": 5
    },
    {
      "skill": "Education",
      "experience": 5
    },
    {
      "skill": "Research",
      "experience": 5
    },
    {
      "skill": "Performance Improvement",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Coordination",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Demonstrate leadership in specialized clinical expertise and communication within a specialty area of practice."
    },
    {
      "duty": "Provide direct involvement with clinical training and in-service education, recognizing the need for help by others and providing clinical guidance to enhance performance."
    },
    {
      "duty": "Assist in identifying new programmatic needs to respond to changing patient care needs and the healthcare delivery system."
    },
    {
      "duty": "Enhance case management responsibilities for patients within the unit to improve throughput, recognizing patient needs for discharge."
    },
    {
      "duty": "Work in conjunction with staff and management on performance improvement and clinical research projects benefiting the unit and/or the department."
    },
    {
      "duty": "Assist in developing goals, standards, and evaluation criteria for performance improvement projects."
    },
    {
      "duty": "Collect data, solicit feedback from staff, and provide recommendations for performance improvement projects with regards to clinical practice to enhance outcomes."
    },
    {
      "duty": "Suggest ideas, methodology, and rationale for research projects and participate directly in the collection of data and monitoring of the project."
    },
    {
      "duty": "Submit articles for publication or presentation at clinical conferences."
    },
    {
      "duty": "Provide direct involvement with clinical training of staff and interns, preparing and presenting educational information for various audiences."
    },
    {
      "duty": "Develop resource material to enhance the quality and scope of patient care, and coordinate patient care in the area of specialized clinical expertise."
    },
    {
      "duty": "Assist in evaluations and development of treatment plans for patients, providing feedback to staff and identifying new equipment that will enhance patient care."
    },
    {
      "duty": "Assist with equipment and unit maintenance, performing other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Advanced Degree in Physical Therapy, Occupational Therapy, or Speech-Language Pathology."
    },
    {
      "credential": "Clinical Specialist Certification in area of expertise."
    }
  ]
}