{
  "meta": [
    {
      "job_title": "Interiors Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Real Estate",
      "salary": 100000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver workplace projects on time and within budget, including design, construction, budgeting, and maintaining internal stakeholder communication."
    },
    {
      "duty": "Coordinate efforts across project consultants, including architects, engineers, and general contractors."
    },
    {
      "duty": "Manage project budgets, including timely review and processing of payments and change orders."
    },
    {
      "duty": "Create and maintain project schedules, collaborating with architects, contractors, and Workplace and IT teams."
    },
    {
      "duty": "Establish systems and controls to manage projects by conducting weekly status meetings, preparing reports, and maintaining facilities documentation."
    },
    {
      "duty": "Provide oversight for furniture contract administration, including procurement of furniture, review of vendor proposals, and ensuring conformance with design intent."
    },
    {
      "duty": "Conduct site visits to direct and/or review installations and create punch lists for remaining work or modifications."
    },
    {
      "duty": "Assist in the successful close-out of existing projects, including managing punch list items, coordinating with specific subcontractors for required site visits, and working with the facilities team to ensure proper documentation and handover to the operational teams."
    },
    {
      "duty": "Ensure successful close-out and transition of projects to Workplace, Internal IT, and other regional teams for operational management."
    },
    {
      "duty": "Assist in managing all phases of corporate interiors projects, including project set-up, design, and construction administration."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Construction Supervision",
      "experience": 7
    },
    {
      "skill": "Interior Design",
      "experience": 7
    },
    {
      "skill": "Budgeting",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Organizational Skills",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Project Management, Architecture, Interior Design, or a related field (Master's preferred)"
    }
  ]
}