{
  "meta": [
    {
      "job_title": "Director of Internal Audit",
      "job_category": "Audit",
      "job_class": "Director",
      "sector": "Internal Audit",
      "salary": 160000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Internal Audit",
      "experience": 8
    },
    {
      "skill": "Banking Regulations",
      "experience": 8
    },
    {
      "skill": "Risk Management",
      "experience": 8
    },
    {
      "skill": "Compliance",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Communication",
      "experience": 8
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 8
    },
    {
      "skill": "CPA",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute an effective, comprehensive internal audit plan based on a risk assessment process."
    },
    {
      "duty": "Help oversee and support risk assessments of Bank processes and the evaluation of risks impacting the Bank based on Firmwide inter-dependencies."
    },
    {
      "duty": "Support the development of quarterly Bank Audit Committee materials and responses to regulatory requests impacting the U.S. Banks."
    },
    {
      "duty": "Identify and assess areas of critical and high risks, including the evaluation of the U.S. Banks' risk profiles and emerging risks."
    },
    {
      "duty": "Maintain effective working relationships with business units and internally within the Internal Audit Department, including business and functional support teams."
    },
    {
      "duty": "Participate in discussions with stakeholders on Bank topics/matters and provide valuable insights on risks impacting the Banks."
    },
    {
      "duty": "Foster focus on high-quality assurance to ensure compliance with U.S. Bank specific policies, procedures, and processes based on applicable regulatory and industry guidance."
    },
    {
      "duty": "Develop clear messaging of risks and controls to the Bank stakeholders, including Senior Management & Committees, Regulators, and Audit Committee."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "College degree (or equivalent) required, CPA and/or Certified Internal Auditor (CIA) a plus"
    }
  ]
}