{
  "meta": [
    {
      "job_title": "QA Tester",
      "job_category": "Software Engineering",
      "job_class": "Tester",
      "sector": "Software Engineering",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "User Acceptance Testing",
      "experience": 5
    },
    {
      "skill": "Robotic Process Automation",
      "experience": 3
    },
    {
      "skill": "Process Design",
      "experience": 4
    },
    {
      "skill": "Multitasking",
      "experience": 5
    },
    {
      "skill": "Software Testing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Adaptability",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create User Stories and translate them into clear and comprehensive user stories for effective testing."
    },
    {
      "duty": "Collaborate with development teams to ensure the testing process is well-integrated into the software development life cycle."
    },
    {
      "duty": "Participate in User Acceptance Testing to gain first-hand experience of end-users' perspectives and validate software functionality against business requirements."
    },
    {
      "duty": "Perform thorough testing of software applications, including functional, regression, and performance testing, to identify defects and ensure high-quality deliverables."
    },
    {
      "duty": "Contribute to the testing of automated processes and workflows by possessing a foundational understanding of RPA concepts and tools."
    },
    {
      "duty": "Contribute to the development of efficient and effective testing strategies through strong process design principles."
    },
    {
      "duty": "Efficiently manage multiple testing tasks, prioritize workloads, and provide regular status updates to relevant stakeholders."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Engineering, or a related field (or equivalent work experience)"
    }
  ]
}