{
  "meta": [
    {
      "job_title": "Research Specialist I",
      "job_category": "Clinical Research",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 42367,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Regulatory Compliance",
      "experience": 2
    },
    {
      "skill": "Clinical Research Coordination",
      "experience": 2
    },
    {
      "skill": "IRB Application",
      "experience": 2
    },
    {
      "skill": "FDA Application",
      "experience": 2
    },
    {
      "skill": "ClinicalTrials.gov",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Stakeholder Communication",
      "experience": 2
    },
    {
      "skill": "Marketing Collaboration",
      "experience": 2
    },
    {
      "skill": "Problem-Solving",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Preparing initial and ongoing UCF IRB, central IRB, FDA applications, and ClinicalTrials.gov applications for new COM clinical research projects."
    },
    {
      "duty": "Interacting with COM faculty and staff regarding regulatory requirements."
    },
    {
      "duty": "Data entry of de-identified information into electronic case report forms."
    },
    {
      "duty": "Working with stakeholders to resolve issues and communicate progress."
    },
    {
      "duty": "Doing study coordination as needed; including informed consent sessions; study data collection; communicating with study participants; scheduling study visits; and data entry into the electronic medical records."
    },
    {
      "duty": "Working with UCF COM marketing to produce research flyers and keep the clinical research webpages updated."
    },
    {
      "duty": "Other activities as assigned by the Clinical Research Manager or the study principal investigator including maintenance of training and required certifications; attending meetings as assigned; and other assigned administrative duties."
    },
    {
      "duty": "Timely completion of required university and college training and updates."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in a relevant field"
    }
  ]
}