{
  "meta": [
    {
      "job_title": "Security Officer",
      "job_category": "Safety & Security",
      "job_class": "Officer",
      "sector": "Safety & Security",
      "salary": 22.84,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patrol and Security Management",
      "experience": 3
    },
    {
      "skill": "Incident Reporting",
      "experience": 3
    },
    {
      "skill": "Security Protocol Adherence",
      "experience": 3
    },
    {
      "skill": "Emergency Response",
      "experience": 3
    },
    {
      "skill": "Risk Assessment",
      "experience": 3
    },
    {
      "skill": "Safety and Hazard Reporting",
      "experience": 3
    },
    {
      "skill": "Conflict Resolution",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Patrol hospital buildings and premises to prevent fire, theft, vandalism, and intruders."
    },
    {
      "duty": "Monitor conduct of visitors on hospital premises and confront unauthorized persons for questioning as needed."
    },
    {
      "duty": "Report safety and fire hazards or security violations."
    },
    {
      "duty": "Respond to inquiries for advice or assistance from hospital personnel and visitors."
    },
    {
      "duty": "Maintain records and prepare incident reports and other documents pertinent to security activities."
    },
    {
      "duty": "Secure and unlock offices and facilities as required."
    },
    {
      "duty": "Secure patient valuables or lost and found articles and maintain logs of items received."
    },
    {
      "duty": "Maintain established hospital and department policies and procedures, objectives, quality assurance, safety, environmental and infection control."
    },
    {
      "duty": "Maintain department supplies and equipment in working order and requisition supplies and equipment as needed or inform supervisor of needed equipment."
    },
    {
      "duty": "Use hospital vehicles in the event of an emergency to secure emergency supplies of life-saving equipment outside the institution."
    },
    {
      "duty": "Provide restraints of psychiatric patients as needed and escort personnel to parking lots and hospital buildings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120
    },
    {
      "student_teacher": 80
    },
    {
      "introvert_extrovert": 190
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent. Basic life support (BLS) training preferred."
    }
  ]
}