{
  "meta": [
    {
      "job_title": "Warehouse Storage Associate II",
      "job_category": "Logistics",
      "job_class": "Associate",
      "sector": "Supply Chain",
      "salary": 48000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Warehouse Operations",
      "experience": 3
    },
    {
      "skill": "Material Handling",
      "experience": 3
    },
    {
      "skill": "Quality Assurance",
      "experience": 3
    },
    {
      "skill": "Inventory Control",
      "experience": 3
    },
    {
      "skill": "Shipping and Receiving",
      "experience": 3
    },
    {
      "skill": "Forklift Operation",
      "experience": 3
    },
    {
      "skill": "Basic Computer Skills",
      "experience": 3
    },
    {
      "skill": "Pharmaceutical Regulations",
      "experience": 3
    },
    {
      "skill": "Supply Chain Coordination",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Receive, inspect, deplete, manage, and ship inventory for commercial operations in coordination with Operations and Supply Chain."
    },
    {
      "duty": "Provide support to material management groups and quality assurance, with a focus on becoming the SME for Storage and Distribution of Development and Analytical Solutions."
    },
    {
      "duty": "Utilize RF scanners, computers, and QTRAC processes for inventory management, shipping, and material handling techniques."
    },
    {
      "duty": "Stage supplies for Manufacturing groups, communicate with third-party warehouses and vendors, and perform monthly inventory checks to ensure accuracy."
    },
    {
      "duty": "Drive productivity improvements through Lean, 5S, and process improvement tools while maintaining high-quality standards."
    },
    {
      "duty": "Ensure proper documentation, review, and approval of batch documents and steps performed by other operators, while adhering to GMP conditions and applicable SOPs."
    },
    {
      "duty": "Participate in monthly waste events and follow proper protocols for pharmaceutical destruction processes."
    },
    {
      "duty": "Work collectively with Quality Assurance, Operations, Supply Chain, and other necessary areas to ensure timelines are met and results are achieved."
    },
    {
      "duty": "Perform other duties as assigned, including assisting in special projects and process improvement initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma/GED minimum, plus 3+ years of relatable experience in distribution or shipping. Forklift experience and thorough knowledge of cGMP, FDA, and DEA guidelines preferred."
    }
  ]
}