{
  "meta": [
    {
      "job_title": "Safety Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Manufacturing",
      "salary": 109000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "EHS Program Management",
      "experience": 6
    },
    {
      "skill": "Hazardous Substance Control",
      "experience": 6
    },
    {
      "skill": "Radiation Program Management",
      "experience": 6
    },
    {
      "skill": "Indoor Air Quality Investigation",
      "experience": 6
    },
    {
      "skill": "PPE Assessments",
      "experience": 6
    },
    {
      "skill": "Incident Investigations",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Specify, provide and manage Safety support on specified projects in accordance with company policies and government regulations to control hazards to personnel and equipment."
    },
    {
      "duty": "Develop and implement programs to minimize risk to employees, customers, and the environment, ensuring compliance with EHS regulations."
    },
    {
      "duty": "Coordinate safety aspects of operations and engineering within the company, with customers, and other related organizations."
    },
    {
      "duty": "Report and present safety-related status and issues to EH&S team and business groups."
    },
    {
      "duty": "Evaluate and specify work methods, design requirements, procedures, and policies, ensuring regulatory compliance."
    },
    {
      "duty": "Facilitate job hazard assessments and qualitative exposure assessments for equipment and tools, ensuring safety requirements are considered and implemented."
    },
    {
      "duty": "Manage 3rd party Product Safety tool assessments and drive corrective actions within internal organizations."
    },
    {
      "duty": "Provide technical guidance on EHS/IH issues to the site manufacturing and engineering organizations, and contribute to the development of site-wide EH&S standards and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. level degree or equivalent in Occupational Safety, Industrial Hygiene, or a related science/engineering discipline."
    }
  ]
}