{
  "meta": [
    {
      "job_title": "Technical Program Manager",
      "job_category": "Program Management",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 10
    },
    {
      "skill": "Product Management",
      "experience": 10
    },
    {
      "skill": "Technical Risk Management",
      "experience": 10
    },
    {
      "skill": "Analytics",
      "experience": 10
    },
    {
      "skill": "Business Strategy",
      "experience": 10
    },
    {
      "skill": "Vendor Management",
      "experience": 10
    },
    {
      "skill": "Security and Compliance",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Innovation",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build a world-class team of program and product managers to drive business engagement and expand core product management capabilities."
    },
    {
      "duty": "Manage product releases and prioritize delivery based on business strategy."
    },
    {
      "duty": "Develop product cost models and analytics to benchmark services vs the market."
    },
    {
      "duty": "Provide governance, process, and program management for work intake into service pillars."
    },
    {
      "duty": "Proactively identify and mitigate technical risks throughout the delivery lifecycle."
    },
    {
      "duty": "Lead business discussions and strategy alignment for global workload service direction."
    },
    {
      "duty": "Develop and maintain relationships with external vendors and service providers."
    },
    {
      "duty": "Partner with security and compliance functions to ensure products meet all security requirements."
    },
    {
      "duty": "Participate in the development and review of IT budgets."
    },
    {
      "duty": "Provide leadership, supervision, coaching, and guidance across the team in the achievement of internal priorities and goals."
    },
    {
      "duty": "Partner with IT leadership, business unit leaders, and service providers to provide strategic solutions and operational efficiencies."
    },
    {
      "duty": "Work with product owners across the businesses to understand market needs and vision; quickly translate that vision into capabilities."
    },
    {
      "duty": "Drive increased efficiency across the teams, eliminating duplication, leveraging product and technology reuse."
    },
    {
      "duty": "Establish vision, identify and champion best practices, tools, and ideas to improve execution and quality."
    },
    {
      "duty": "Drive an organization of efficiency, accountability, and ownership."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in computer science or in “STEM” Majors (Science, Technology, Engineering and Math) or related."
    },
    {
      "credential": "Master’s degree with 6 years of experience."
    },
    {
      "credential": "Minimum 5 years of experience in a product leadership/management role."
    },
    {
      "credential": "GE Leadership Program Graduates will get credit towards relevant work experience."
    }
  ]
}