{
  "meta": [
    {
      "job_title": "Accountant for Government Programs",
      "job_category": "Accounting",
      "job_class": "Accountant",
      "sector": "Business",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Government Program Compliance",
      "experience": 4
    },
    {
      "skill": "Financial Reporting",
      "experience": 4
    },
    {
      "skill": "Government Program Invoicing",
      "experience": 4
    },
    {
      "skill": "Financial Analysis",
      "experience": 4
    },
    {
      "skill": "Account Reconciliation",
      "experience": 4
    },
    {
      "skill": "Regulatory Affairs",
      "experience": 4
    },
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Journal Entries",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Administer all aspects of Government Program funding and invoicing processes."
    },
    {
      "duty": "Communicate with government program applicants and government entities on inquiries in a timely and professional manner."
    },
    {
      "duty": "Assist in the preparation of monthly, quarterly and ad-hoc reporting to support Comcast regulatory affairs, government affairs, and compliance requests."
    },
    {
      "duty": "Prepare financial reports analyzing data for management review."
    },
    {
      "duty": "Interpret accounting data, analyze reports and recommend action to be taken."
    },
    {
      "duty": "Ensure the balance sheet accounts are accurately stated based on compiled reconciliation procedures and agreement with source documents."
    },
    {
      "duty": "Maintain government program receivables ledger and prepare variance explanations."
    },
    {
      "duty": "Enter monthly journal entries to properly record accounting transactions, ensuring that journal entries have proper backup to substantiate the entry."
    },
    {
      "duty": "Research ways of streamlining and standardizing processes."
    },
    {
      "duty": "Prepare financial reports analyzing data for management review."
    },
    {
      "duty": "Calculate payments to regulatory authorities based on a review of contracts and regulations."
    },
    {
      "duty": "Review financial statements for operating trends and results."
    },
    {
      "duty": "Consistent exercise of independent judgment and discretion in matters of significance."
    },
    {
      "duty": "Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) and overtime as necessary."
    },
    {
      "duty": "Other duties and responsibilities as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Accounting, Finance, or a related field (Master's preferred)"
    }
  ]
}