{
  "meta": [
    {
      "job_title": "Epic BI Developer",
      "job_category": "Software Engineering",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Business Intelligence Development",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "System Integration",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Technical Consulting",
      "experience": 5
    },
    {
      "skill": "Epic Certification",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for all stages of the business intelligence development lifecycle, from understanding business objectives to designing and developing reports or dashboards."
    },
    {
      "duty": "Collaborates with business and technology departments to understand system data, validate data analysis, and provide support around data integration."
    },
    {
      "duty": "Monitors production systems for issues and resolves them independently or escalates for resolution."
    },
    {
      "duty": "Develops advanced knowledge of system capabilities, applications, and processes to function effectively as an educator and expert for system users."
    },
    {
      "duty": "Leads delivery of technical consulting and 24x7 support services and solutions with some management input."
    },
    {
      "duty": "Participates actively in routine meetings with department heads and/or superusers to identify, document, and prioritize their needs."
    },
    {
      "duty": "Provides assessment, coordination, documentation, release note review, testing, and implementation of programming, upgrade, and project requests."
    },
    {
      "duty": "Ensures compliance with regulatory guidelines, policies, and procedures, and provides system solutions in accordance with them."
    },
    {
      "duty": "Advocates user perspective and focuses on ensuring a comprehensive support plan and documentation."
    },
    {
      "duty": "Provides on-call coverage as scheduled and responds to support calls within designated times according to priority."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree from a recognized college or university with major course work in engineering, physics, computer sciences, math, information systems, statistics, or equivalent related experience. A minimum of 5 years of progressive experience in clinical, business, or other healthcare operational areas or 7 years with no degree. This position requires that the appropriate Epic certification be successfully obtained for a specific area of assigned responsibility within the first 90 days of employment."
    }
  ]
}