{
  "meta": [
    {
      "job_title": "Registered Nurse Operating Room",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 3
    },
    {
      "skill": "Assessment and Documentation",
      "experience": 3
    },
    {
      "skill": "Discharge Planning",
      "experience": 3
    },
    {
      "skill": "Medication Administration",
      "experience": 3
    },
    {
      "skill": "Patient Education",
      "experience": 3
    },
    {
      "skill": "Interdisciplinary Collaboration",
      "experience": 3
    },
    {
      "skill": "Emergency Response",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collect patient health data by involving the patient, family, and other health care providers."
    },
    {
      "duty": "Perform initial assessment based on patient's presentation and records relevant data on the nursing component of the Interdisciplinary Admission Assessment."
    },
    {
      "duty": "Incorporate discharge planning into the admission process and analyze the assessment data in determining problem identification."
    },
    {
      "duty": "Communicate expected outcomes to the patient, family, and other health care providers to promote continuity of care and develop a plan of care that prescribes interventions to attain expected outcome."
    },
    {
      "duty": "Identify actual or potential knowledge deficits for the patient and/or family, and recognize hazards to patient safety."
    },
    {
      "duty": "Provide care that demonstrates ethical beliefs and respect for patient's rights and interacts with and contributes to the professional development of peers and other health care providers."
    },
    {
      "duty": "Participate in the evaluation of the quality and effectiveness of nursing practices and demonstrate the ability to maintain effective interactions with the staff on the unit and in other departments."
    },
    {
      "duty": "Maintain knowledge base through participation in learning situations such as departmental meetings, educational programs, professional association membership, journal review, or committee participation."
    },
    {
      "duty": "Comply with staff meeting attendance requirement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Professional knowledge of nursing theory and practice acquired through completion of a two-year training at an accredited School of Nursing."
    },
    {
      "credential": "Current New York State license or Permit as a Registered Professional Nurse."
    },
    {
      "credential": "Interpersonal skills necessary to effectively interact with patients and their families that demonstrate recognition of cultural diversity."
    },
    {
      "credential": "Practice reflects customer service excellence."
    },
    {
      "credential": "Ability to clearly communicate in verbal and written format."
    },
    {
      "credential": "Analytical ability to assess and develop solutions to clinical situations or unit problems."
    },
    {
      "credential": "Maintains knowledge and proficiency in the clinical area and age group served."
    },
    {
      "credential": "BLS certification and de-escalation training."
    },
    {
      "credential": "ACLS (ICU, Float pool)"
    },
    {
      "credential": "Registered Nurse License-NYS"
    }
  ]
}