{
  "meta": [
    {
      "job_title": "Clinical Histology Tech",
      "job_category": "Healthcare",
      "job_class": "Tech",
      "sector": "Healthcare",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Laboratory Science",
      "experience": 2
    },
    {
      "skill": "Laboratory Quality Control",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Critical Thinking",
      "experience": 4
    },
    {
      "skill": "Data Reporting",
      "experience": 4
    },
    {
      "skill": "Analytical Skills",
      "experience": 4
    },
    {
      "skill": "Computer Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Aids in the detection, diagnosis, and treatment of disease using the latest computerized interfaced biomedical instruments to generate accurate, reliable results."
    },
    {
      "duty": "Analyzes blood, body fluids, and tissues. Examines specimens to detect various disease states."
    },
    {
      "duty": "Correlates and interprets clinical laboratory tests using independent judgment and responsibilities."
    },
    {
      "duty": "Monitors quality, recognizes testing errors, and resolves problematic specimens."
    },
    {
      "duty": "Disseminates clinical laboratory test information to clinicians. Evaluates clinical laboratory testing for each individual patient."
    },
    {
      "duty": "Responsible for training and teaching students, residents, and staff."
    },
    {
      "duty": "Adheres to the laboratory's Quality Control policies and procedures, instrumentation maintenance procedures, and instrument troubleshooting protocols."
    },
    {
      "duty": "Participates in unit-based quality improvement initiatives."
    },
    {
      "duty": "Coaches, mentors, and trains Medical Technology Students, Residents, and other Technologists and Technicians."
    },
    {
      "duty": "Notifies appropriate personnel in the case of any unacceptable samples and records in the departmental call log all specific information."
    },
    {
      "duty": "Calls critical values to the appropriate person, requires verification of results, and documents in the departmental call log all specific information."
    },
    {
      "duty": "Recognizes system failures and takes effective corrective action."
    },
    {
      "duty": "Determines whether the patient/test sample integrity is acceptable."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Associate Degree OR licensed by NYS Department of Education as a Clinical Laboratory Technologist Required as per NYS Dept Education Clinical Lab Technologist grandfathering provision. Current New York State Dept of Education Clinical Laboratory Technologist License or limited permit Required."
    },
    {
      "credential": "ClinicalLabTechnolgst-NYSPermit, Clinical Lab Technologist-NYS"
    }
  ]
}