{
  "meta": [
    {
      "job_title": "Corporate Hospitality Service Manager",
      "job_category": "Hospitality",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Client Service",
      "experience": 4
    },
    {
      "skill": "Relationship Management",
      "experience": 4
    },
    {
      "skill": "Revenue Generation",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Event Management",
      "experience": 4
    },
    {
      "skill": "CRM Management",
      "experience": 4
    },
    {
      "skill": "Excel",
      "experience": 4
    },
    {
      "skill": "Word",
      "experience": 4
    },
    {
      "skill": "PowerPoint",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as primary contact for Madison Square Garden suite clients."
    },
    {
      "duty": "Assist in managing suite lease renewal campaign."
    },
    {
      "duty": "Conduct outbound calls, face-to-face appointments, and in-arena meetings with suite license and single event suite clients."
    },
    {
      "duty": "Develop and strengthen relationships with current suite license clients to increase renewal and sales opportunities and deepen their engagement with Madison Square Garden’s brands."
    },
    {
      "duty": "Meet or exceed established annual revenue targets."
    },
    {
      "duty": "Exceed customer expectations as it relates to pre-event service, event-day execution, and post-event follow-up."
    },
    {
      "duty": "Ensure that all catering orders are processed with excellence and all ticketing (suite pass, host pass, SRO, barstool, etc.) is accurately managed and properly billed."
    },
    {
      "duty": "Input and maintain all client information, touch points, client preferences, interactions, visits, calls, and appointments in CRM."
    },
    {
      "duty": "Manage timely client invoice distribution in conjunction with an assigned Account Coordinator."
    },
    {
      "duty": "Work closely with other team members to provide broad support for all suite clients and their guests."
    },
    {
      "duty": "Assist with Madison Square Garden promotions and suite holder events by extending invitations to clients and providing staffing support."
    },
    {
      "duty": "Work games and events as well as departmental and team events as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "3-4 years’ experience in high-end client service environment, preferably in sports and entertainment; in-market team or venue a plus"
    }
  ]
}