{
  "meta": [
    {
      "job_title": "Associate Director of Regulatory Affairs",
      "job_category": "Regulatory Affairs",
      "job_class": "Director",
      "sector": "Pharmaceutical/Biotechnology",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Regulatory Affairs",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Regulatory Submissions",
      "experience": 8
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 6
    },
    {
      "skill": "Regulatory Research",
      "experience": 6
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Science Background",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execution of regulatory strategies to support the global development of oncology and hematology portfolio."
    },
    {
      "duty": "Assess applications for completeness and conformity with relevant regulations."
    },
    {
      "duty": "Oversee the maintenance of regulatory applications (IND/CTA, NDA) to ensure compliance with applicable regulations."
    },
    {
      "duty": "Prepare and manage regulatory documents and other submissions."
    },
    {
      "duty": "Offer regulatory guidance and support to cross-functional project teams."
    },
    {
      "duty": "Perform regulatory review of submission materials to ensure timeliness, accuracy, and alignment with business goals and regulations."
    },
    {
      "duty": "Collaborate with internal and external stakeholders to ensure effective planning and execution of submissions."
    },
    {
      "duty": "Ensure proper archiving of correspondence and submissions."
    },
    {
      "duty": "Conduct regulatory research and intelligence to keep project teams informed about the evolving regulatory environment and potential strategic implications."
    },
    {
      "duty": "Facilitate interactions with regulatory authorities and contribute to the formulation of overall regulatory strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum bachelor’s degree in a science or related field."
    },
    {
      "credential": "8+ years of experience in the pharmaceutical/biotechnology industry."
    },
    {
      "credential": "Experience in oncology, orphan-drug, NDA, and commercial regulatory affairs is advantageous."
    },
    {
      "credential": "Profound understanding of the US and EU regulatory landscape."
    },
    {
      "credential": "Demonstrated ability to critically analyze scientific information with meticulous attention to detail."
    },
    {
      "credential": "Takes ownership of outcomes within and beyond the assigned responsibilities."
    },
    {
      "credential": "Capable of professional influence and negotiation at various levels within project teams and with external partners."
    }
  ]
}