{
  "meta": [
    {
      "job_title": "SaaS Manager",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Case Management",
      "experience": 3
    },
    {
      "skill": "Absence and Disability Management",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Client Relationship Management",
      "experience": 3
    },
    {
      "skill": "Customer Focus",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Technology Aptitude",
      "experience": 3
    },
    {
      "skill": "Problem-solving",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and oversee SaaS client implementations and internal and external projects."
    },
    {
      "duty": "Manage the lifecycle of SaaS implementations from beginning to end, including developing implementation plans, leading meetings, and ensuring tasks are completed on time."
    },
    {
      "duty": "Conduct needs assessment with clients to understand their program needs, identify gaps, and determine appropriate project timelines."
    },
    {
      "duty": "Serve as the main point of contact for clients, workstream leads, and project support throughout the implementation and post-implementation."
    },
    {
      "duty": "Develop efficient processes to support ongoing client management and prepare training materials for client training."
    },
    {
      "duty": "Work with the IT Project Team to manage business deliverables such as requirements gathering and user acceptance testing."
    },
    {
      "duty": "Evaluate client escalations and requests related to system and IT issues."
    },
    {
      "duty": "Maintain a positive working relationship with all departments and contribute to fostering a positive work environment."
    },
    {
      "duty": "May provide additional project support for various projects involving the Implementation and Development Team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "2-3 years of case management experience in FMLA, STD and ADA"
    }
  ]
}