{
  "meta": [
    {
      "job_title": "Body Shop Estimator",
      "job_category": "Automotive",
      "job_class": "Estimator",
      "sector": "Vehicle Service",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Automotive Collision Damage Estimating",
      "experience": 5
    },
    {
      "skill": "Insurance procedures and requirements",
      "experience": 5
    },
    {
      "skill": "Verbal and written communication",
      "experience": 5
    },
    {
      "skill": "I-CAR certification",
      "experience": 5
    },
    {
      "skill": "Computer proficiency (CCC, Audatex, or Mitchell Estimating Software)",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Automotive knowledge/background",
      "experience": 5
    },
    {
      "skill": "Cross training in management roles",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create repair estimates for Collision Damaged Tesla Model S, Model X, and Model 3 vehicles that arrive for repair (Technical estimating, no sales estimating). Build Repair Plans in accordance with Tesla specific repair procedures."
    },
    {
      "duty": "Bill work in accordance with industry accepted Insurance standards. Document all damages requiring repair or parts replacement with photos."
    },
    {
      "duty": "Direct disassembly technicians as to the pace and scope of disassembly to expose all damages up front. Order all replacement parts from Tesla Warehouse."
    },
    {
      "duty": "Monitor parts delivery. Communicate with insurance company to submit claim and billing."
    },
    {
      "duty": "Direct Body Techs to perform repair attempts where Repair Vs Replace is not clear. Manage Time in order to meet daily requirement of fully Blueprinted vehicles."
    },
    {
      "duty": "Update Customer on vehicle progress. Close billing and delivery of vehicle."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "5+ years of automotive collision damage estimating experience. Knowledge of insurance procedures and requirements. Excellent verbal and written communication skills. I-CAR certification preferred. Proficient with Computers, as well as CCC, Audatex, or Mitchell Estimating Software. Excellent Customer Service skills. Automotive knowledge/background. Excellent Prior work references. Willingness to be cross trained in career advancing management roles as needed. Must be 18 years or older."
    }
  ]
}