{
  "meta": [
    {
      "job_title": "Systems Engineer Controls",
      "job_category": "Engineering",
      "job_class": "Systems Engineer",
      "sector": "Software Engineering",
      "salary": 105000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Systems Engineering",
      "experience": 5
    },
    {
      "skill": "Technical Project Management",
      "experience": 5
    },
    {
      "skill": "Electrical Engineering",
      "experience": 5
    },
    {
      "skill": "Software Integration",
      "experience": 5
    },
    {
      "skill": "Feature Systems Design",
      "experience": 5
    },
    {
      "skill": "Automotive Systems",
      "experience": 5
    },
    {
      "skill": "Technical Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute a Systems Engineering approach to new feature systems design to meet customer needs through integration of hardware, software, sensors, and actuators in electrical and electromechanical feature/function systems."
    },
    {
      "duty": "Lead development of new feature/function at the systems engineering level from early feature development to production and manage feature upgrade and migration plan."
    },
    {
      "duty": "Drive development of high-level network, wiring, and power distribution topologies/schematics/block diagrams."
    },
    {
      "duty": "Develop feature systems specifications, feature systems Failure Mode Avoidance documentation, feature verification plan, feature functional safety plan, systems-level cybersecurity plan, etc."
    },
    {
      "duty": "Review existing system designs to find new opportunities for cost or quality improvement."
    },
    {
      "duty": "Interact with program teams, core engineers, and functional areas to create balanced solutions to competing requirements."
    },
    {
      "duty": "Develop relationships with the supply base to learn about the latest technologies and possible implementations."
    },
    {
      "duty": "Analyze complex cross-functional systems and implement innovative solutions."
    },
    {
      "duty": "Lead trade-off discussions with cross-functional teams."
    },
    {
      "duty": "Communicate complex systems, issues, and resolutions in a clear and concise manner."
    },
    {
      "duty": "Apply Model Based Systems Engineering approach to define Feature requirement and Architecture diagrams with model as the source of truth for feature/function systems design."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 150,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Engineering or other technical degree. Electrical Engineer or Computer Science. Technical project management. Technical problem solving. Project management or engineering experience."
    }
  ]
}