{
  "meta": [
    {
      "job_title": "Fire Alarm Technician",
      "job_category": "Engineering",
      "job_class": "Technician",
      "sector": "Engineering",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Fire Alarm Equipment",
      "experience": 5
    },
    {
      "skill": "Low Voltage Systems",
      "experience": 7
    },
    {
      "skill": "Installation",
      "experience": 7
    },
    {
      "skill": "Commissioning",
      "experience": 7
    },
    {
      "skill": "Troubleshooting",
      "experience": 7
    },
    {
      "skill": "Programming",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Customer Communication",
      "experience": 7
    },
    {
      "skill": "Blueprint Interpretation",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Installation of fire life safety and other low voltage systems in medium and large commercial buildings."
    },
    {
      "duty": "Program or are experienced with programing low voltage systems including fire alarm, nurse call, access control, security, or CCTV."
    },
    {
      "duty": "Execute the installation project plan provided and resolve field problems through research of alternatives."
    },
    {
      "duty": "Coordinate project activities with other trades at the work locations to optimize installation time and meet code requirements."
    },
    {
      "duty": "Communicate and effectively interact with other contractors and building owners and assist customers on-site with questions and concerns."
    },
    {
      "duty": "Read and interpret blueprints, diagrams, submittals, specifications, software/systems programs, schematics, and operational product manuals."
    },
    {
      "duty": "Identify out of scope requests by the contractor or customer and notify management of pending changes."
    },
    {
      "duty": "Assist with suggested solutions for an efficient installation to complete scope and effectively communicate project status to management."
    },
    {
      "duty": "Complete all appropriate company paperwork as required."
    },
    {
      "duty": "Meet requirements in relation to background and driving record and proficient in the use and application of industry-related equipment including MS Office."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Industry related FASA/BASA is preferred."
    }
  ]
}