{
  "meta": [
    {
      "job_title": "Lab Support Associate",
      "job_category": "Life Sciences",
      "job_class": "Associate",
      "sector": "Biotechnology",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mammalian Cell Cultivation",
      "experience": 3
    },
    {
      "skill": "Aseptic Technique",
      "experience": 3
    },
    {
      "skill": "Bioreactor Operation",
      "experience": 3
    },
    {
      "skill": "Laboratory Troubleshooting",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "SOP Compliance",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Scientific Knowledge",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Cultivation of mammalian cells using aseptic technique in bench and pilot scale bioreactors for the production of monoclonal antibodies."
    },
    {
      "duty": "Sterilization, sanitization, and operation of bench and pilot scale bioreactors."
    },
    {
      "duty": "Daily sampling of bench and pilot scale bioreactors."
    },
    {
      "duty": "Troubleshoots equipment malfunctions and acts as subject matter expert on various lab equipment."
    },
    {
      "duty": "Hydrates and maintains array of medium and buffer inventory."
    },
    {
      "duty": "Supports technology development and improvement initiatives. Identifies value adding opportunities for improvement and proposes potential solutions."
    },
    {
      "duty": "Production of various nonclinical reagents in support of Research and Development activities."
    },
    {
      "duty": "Responsible for maintaining state-of-the-art laboratory environment and/or product inventory. Maintains accurate and complete records consistent with company policy and legal requirements."
    },
    {
      "duty": "Contributes to lab equipment maintenance and safety to help create a safe, effective, and efficient working environment."
    },
    {
      "duty": "Anticipates and recognizes potential problems with laboratory supplies / equipment and acts to prevent and solve problems."
    },
    {
      "duty": "Keep up with SOP training and/or compliance responsibilities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Biotechnology, Life Sciences, or a related field (Master's preferred)"
    }
  ]
}