{
  "meta": [
    {
      "job_title": "Technical Lead",
      "job_category": "Technology",
      "job_class": "Lead",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Confident in a client-facing role and possess the ability to manage multiple stakeholders."
    },
    {
      "duty": "Coordinate and perform release planning, development, testing, and releases on multiple agencies IVR enhancements."
    },
    {
      "duty": "Build Call flow designs, Chat, and integration to backend systems using application program interfaces (API)."
    },
    {
      "duty": "Manage NICE BU and provide Subject Matter Expertise (SME) input into solution design, and optimization for network solutions."
    },
    {
      "duty": "Skills-based routing design and implementation for voice, chat, email, and SMS contact center technology."
    },
    {
      "duty": "Works with the Architecture team to design, develop, and deploy APIs, consume APIs."
    },
    {
      "duty": "Understand business requirements with the ability to translate to technical requirements."
    },
    {
      "duty": "Prepare design documents based on business requirements for the application development."
    },
    {
      "duty": "Experience with cloud-based SaaS/PaaS/IaaS providers and working with virtualized systems, including application servers, databases, and networking infrastructure."
    },
    {
      "duty": "Coordinate issue communication and resolution with multiple other tech teams in the event of a problem."
    },
    {
      "duty": "Review support tickets with agency leadership and oversee any support questions from other team members that might be working on one of those agencies’ tickets."
    },
    {
      "duty": "Act as an SME accessible by other team members to discuss and work through possible ways to achieve or design a requested IVR enhancement."
    }
  ],
  "skills": [
    {
      "skill": "Client Management",
      "experience": 5
    },
    {
      "skill": "Release Planning",
      "experience": 5
    },
    {
      "skill": "Call Flow Design",
      "experience": 5
    },
    {
      "skill": "API Integration",
      "experience": 5
    },
    {
      "skill": "Subject Matter Expertise",
      "experience": 5
    },
    {
      "skill": "Skills-based Routing",
      "experience": 5
    },
    {
      "skill": "API Development",
      "experience": 5
    },
    {
      "skill": "Business Requirement Analysis",
      "experience": 5
    },
    {
      "skill": "Cloud-based Solutions",
      "experience": 5
    },
    {
      "skill": "Issue Resolution",
      "experience": 5
    },
    {
      "skill": "Support Ticket Review",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Software Engineering, or a related field (Master's preferred)"
    }
  ],
  "salary": 130000
}