{
  "meta": [
    {
      "job_title": "Branch Banker",
      "job_category": "Banking",
      "job_class": "Customer Service",
      "sector": "Sales",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Financial Solutions",
      "experience": 5
    },
    {
      "skill": "Sales Process",
      "experience": 5
    },
    {
      "skill": "Teller Interactions",
      "experience": 5
    },
    {
      "skill": "Banking Products",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Digital Awareness",
      "experience": 5
    },
    {
      "skill": "Effective Communications",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Matrix Management",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Retail Lending",
      "experience": 5
    },
    {
      "skill": "Understanding Customer Needs",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Acquire and deepen the branch customer base through proactive sales and service activities."
    },
    {
      "duty": "Manage the customer experience by identifying opportunities to improve the customer's financial wellbeing."
    },
    {
      "duty": "Collaborate with ecosystem partners to grow customer's share of wallet."
    },
    {
      "duty": "Drive proactive sales conversations through internal and outbound interactions with a defined sales process including outbound calling, service to sales, teller interactions, appointment setting and effective lobby engagement."
    },
    {
      "duty": "Deliver a full PNC conversation with every client interaction to identify appropriate PNC solutions."
    },
    {
      "duty": "Leverage ecosystem partnerships as well as community Centers of Influence to acquire, expand and retain relationships."
    },
    {
      "duty": "Create customer loyalty and grow customer share of wallet through a differentiated customer experience."
    },
    {
      "duty": "Perform lobby engagement activities to connect with customers and position PNC products to meet their needs."
    },
    {
      "duty": "Educate customers on options for managing financial transactions by leveraging technology, tools and resources."
    },
    {
      "duty": "Apply product and procedural knowledge to identify, mitigate and solve customer problems effectively to drive customer loyalty."
    },
    {
      "duty": "Manage risk through adherence to all policies and procedures, demonstrating sound judgment within established limits."
    },
    {
      "duty": "Participate in branch daily operations, ensuring they are completed in an efficient and accurate manner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Related experience or product knowledge to accomplish primary duties (Degree preferred)"
    }
  ]
}