{
  "meta": [
    {
      "job_title": "Per Diem Nurse Practitioner",
      "job_category": "Healthcare",
      "job_class": "Nurse Practitioner",
      "sector": "Healthcare",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Nursing Process",
      "experience": 5
    },
    {
      "skill": "Therapeutic Skills",
      "experience": 5
    },
    {
      "skill": "Patient Care Coordination",
      "experience": 5
    },
    {
      "skill": "Clinical Studies",
      "experience": 5
    },
    {
      "skill": "Healthcare Literature",
      "experience": 5
    },
    {
      "skill": "Professional Growth",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Group Processes",
      "experience": 5
    },
    {
      "skill": "Physical Examination",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide, coordinate, and assure comprehensive nursing care using nursing process and pertinent standards of care."
    },
    {
      "duty": "Diagnose illness and physical conditions, and perform therapeutic, corrective, and prescriptive measures of the designated inpatient or outpatient patient population."
    },
    {
      "duty": "Monitor and trend cost-effectiveness of the position and assist in the preparation, implementation, and evaluation of research protocols."
    },
    {
      "duty": "Develop and implement clinical studies within the area of expertise and advise and support appropriate practice changes using evidence-based healthcare literature."
    },
    {
      "duty": "Participate in the development and monitoring of patient outcomes per established practice protocols for quality and performance improvement."
    },
    {
      "duty": "Serve as a clinical expert and resource for the education of peers and other health professionals and maintain current expertise in area of practice."
    },
    {
      "duty": "Promote own professional growth and development in clinical and managerial role and consider needs and behaviors of specific patient age and cultural groups in all patient care."
    },
    {
      "duty": "Evaluate treatment and healthcare plans for effectiveness, modify per clinical standards and practice protocols, and practice as a member of the allied health staff according to the rules and regulations of the Medical Staff and bylaws."
    },
    {
      "duty": "Prescribe medical equipment, devices, physical and occupational therapy, and home health services per practice protocol and in-patient and discharge medications according to New York State law."
    },
    {
      "duty": "Work collaboratively with the attending physician, consulting physicians, and other disciplines to develop and implement an appropriate plan of care and formulate the plan of care based on expected goals of care and length of stay."
    },
    {
      "duty": "Order customary laboratory, radiological, and diagnostic studies per practice protocols, and perform complete health history, physical examination, and psychosocial assessment of patients."
    },
    {
      "duty": "Facilitate the continuity of care across the continuum of services, provide consultation about the therapeutic regimen to the nursing staff, and ensure timely communications with the nursing staff."
    },
    {
      "duty": "Maintain timely and appropriate communication with family members, housestaff, other disciplines, and ancillary services, and participate in the development and revision of interdisciplinary and nursing standards, patient and family education materials."
    },
    {
      "duty": "Develop and implement the therapeutic plan of care for a group of patients and ensure communication with family members."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Master's Degree in Nursing, ANCC Certification, and ACLS, PALS, NRP Provider, NALS Certification"
    }
  ]
}