{
  "meta": [
    {
      "job_title": "Greeter",
      "job_category": "Customer Service",
      "job_class": "Entry Level",
      "sector": "Retail",
      "salary": 28000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs various Customer Service activities, to include greeting and acknowledging all customers in a prompt and friendly manner, handling merchandise with care, providing information and direction to customers."
    },
    {
      "duty": "Supports a strong commitment to world class customer service and ensures a pleasant and productive shopping experience for all customers."
    },
    {
      "duty": "Greets all customers as they enter the store in a friendly and outgoing manner."
    },
    {
      "duty": "Provides a legendary experience for every customer, every time by assisting customers in making buying decisions."
    },
    {
      "duty": "Identifying and evaluating customers' needs, making product recommendations based off of this analysis, promoting programs including, but not limited to CLUB Membership, VOC and In-Store Pick-up."
    },
    {
      "duty": "Checks in all customer's merchandise for return."
    },
    {
      "duty": "Checks in all Vendor representatives, completing the necessary visitor log information and controlling the visitor badges."
    },
    {
      "duty": "Secures all firearms brought into the store with trigger locks."
    },
    {
      "duty": "Remains product knowledgeable."
    },
    {
      "duty": "Remains aware of all \"Special events\" in the store."
    },
    {
      "duty": "Performs all other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Verbal Communication",
      "experience": 3
    },
    {
      "skill": "Written Communication",
      "experience": 3
    },
    {
      "skill": "Adaptability",
      "experience": 3
    },
    {
      "skill": "Initiative",
      "experience": 3
    },
    {
      "skill": "Firearm Handling",
      "experience": 1
    }
  ]
}