{
  "meta": [
    {
      "job_title": "District General Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Sales Planning",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Business Growth",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Organizational Culture Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Visit the offices in the district to ensure operational excellence and continuous business growth by leading a team and establishing strategic sales plans and project management."
    },
    {
      "duty": "Execute policies and procedures in each office to increase revenues, control expenses, and promote client satisfaction."
    },
    {
      "duty": "Accelerate business growth through the implementation of a business plan, marketing, and identification of growth opportunities."
    },
    {
      "duty": "Recruit and onboard high-caliber seasonal tax office talent and leadership for key district positions."
    },
    {
      "duty": "Efficiently manage labor to ensure maximum productivity and profitability."
    },
    {
      "duty": "Lead and support office leaders with end-to-end performance management of office-level associates."
    },
    {
      "duty": "Ensure all office associates are focused on connecting with clients to provide a welcoming and personalized service."
    },
    {
      "duty": "Foster a culture that values critical thinking, problem-solving, constructive feedback, engagement, inclusion, and diversity."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a related field or the equivalent through a combination of education and related work experience."
    }
  ]
}