{
  "meta": [
    {
      "job_title": "Patient Care Tech Short Stay",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 38000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Basic Cardiac Life Support",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver high quality, patient-centered care by performing a variety of delegated basic patient care services related to common nursing functions and activities of daily living."
    },
    {
      "duty": "Assist with mobility by regular turning and positioning, dangling, and ambulating patients. Assist with use of walkers, crutches, canes, and wheelchairs."
    },
    {
      "duty": "Transfers patients to and from other units, departments, or entities. Assists with discharges."
    },
    {
      "duty": "Obtains and records initial and ongoing patient information throughout the cycle of care, including admissions data, vital signs, height and weight, blood pressure, oxygen saturation, intake and output, calorie counts, and other patient information as outlined by policy."
    },
    {
      "duty": "Assists with the collection of specimens for diagnostic or waived tests. Changes bed linens as needed."
    },
    {
      "duty": "Serves as Monitor/Telemetry Tech for the unit as needed. Engages in evidence-based best practices that enhance the patient experience, including SAFETY rounding, communication fundamentals/AIDET, Teach-Back, Narrating Care, etc."
    },
    {
      "duty": "Ensures accuracy of all labels and timely transfer of specimen."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Basic Cardiac Life Support must be obtained within 30 days of employment start date"
    },
    {
      "credential": "Vaccination for COVID-19 required based on local, state and /or federal law or regulations (unless a medical or religious exemption is approved)."
    }
  ]
}