{
  "meta": [
    {
      "job_title": "Technical Writer",
      "job_category": "Writing",
      "job_class": "Technical",
      "sector": "Engineering and Technology",
      "salary": 72000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technical Writing",
      "experience": 3
    },
    {
      "skill": "Document Editing",
      "experience": 3
    },
    {
      "skill": "Research Methodology",
      "experience": 3
    },
    {
      "skill": "Engineering Knowledge",
      "experience": 3
    },
    {
      "skill": "Language Proficiency in English",
      "experience": 3
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Desktop Publishing",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Research, develop, organize, write, edit, standardize, and maintain technical content for manuals and technical documents"
    },
    {
      "duty": "Build working relationships and solicit technical feedback from internal and external subject matter experts to verify technical accuracy of documentation"
    },
    {
      "duty": "Write technical procedures, reports, and correspondence"
    },
    {
      "duty": "Gather and document machine descriptions and system requirements with moderate to high complexity"
    },
    {
      "duty": "Provide technical and copywriting assistance to internal departments, peers, and customers"
    },
    {
      "duty": "Revise previously published materials and create/modify illustrations for instruction manuals"
    },
    {
      "duty": "Adhere to company style guide, review and copy-edit the work of peers, and revise content according to editorial feedback"
    },
    {
      "duty": "Observe and execute all job responsibilities in accordance with established company policies and procedures. Manage individual documentation projects and contribute to team business process improvements"
    },
    {
      "duty": "Promote a culture of personal and team safety in alignment with operational activities"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in technical communication, journalism, or English, or in a technical or scientific discipline with related writing experience. Recent college graduate or up to three years of previous experience working as a technical writer. Candidates with an equivalent combination of education and experience may be considered"
    }
  ]
}