{
  "meta": [
    {
      "job_title": "Health Center Support",
      "job_category": "Healthcare",
      "job_class": "Support",
      "sector": "Healthcare",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Support",
      "experience": 2
    },
    {
      "skill": "Technical Support",
      "experience": 2
    },
    {
      "skill": "Supply Management",
      "experience": 2
    },
    {
      "skill": "Patient Enrollment",
      "experience": 2
    },
    {
      "skill": "Billing",
      "experience": 2
    },
    {
      "skill": "Patient Service",
      "experience": 2
    },
    {
      "skill": "Medical Coding",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "OSHA Compliance",
      "experience": 2
    },
    {
      "skill": "Inventory Monitoring",
      "experience": 2
    },
    {
      "skill": "Continuous Improvement",
      "experience": 2
    },
    {
      "skill": "Safety Management",
      "experience": 2
    },
    {
      "skill": "Meeting Facilitation",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide clinical and technical support for school based health center (SBHC) medical providers."
    },
    {
      "duty": "Ensure appropriate supplies and equipment are stocked in the SBHC and perform clinical testing according to OSHA and CLIA standards."
    },
    {
      "duty": "Enroll patients in the SBHC and bill for services rendered."
    },
    {
      "duty": "Greet patients, parents, school faculty, and staff, and identify uninsured and underinsured patients."
    },
    {
      "duty": "Escort patients to room, obtain chief complaint, and document appropriately in electronic medical record."
    },
    {
      "duty": "Perform CLIA waived laboratory tests in accordance with established policy and procedures."
    },
    {
      "duty": "Set up clinical operatory and provide assistance required by provider."
    },
    {
      "duty": "Ensure adequate level of clinical supplies and materials through monitoring of clinical inventory and timely restocking."
    },
    {
      "duty": "Maintain daily log books for all CLIA waived procedures and ensure timely billing of medical and behavioral health services."
    },
    {
      "duty": "Support communication among clinical team members by accurately taking phone messages and relaying them in a timely manner."
    },
    {
      "duty": "Maintain universal precautions within the clinical setting at all times and participates in continuous performance improvement activities."
    },
    {
      "duty": "Serve as facilities Safety Officer and lead or participate in special projects."
    },
    {
      "duty": "Meet regularly with Regional Directors, Nurse Managers, and Program Managers to discuss operational issues and problem solve."
    },
    {
      "duty": "Assist in creating agenda for regular SBHC MA meetings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalency, completion of a Medical Assistant course from an accredited/recognized school, and current American Red Cross CPR for the Professional Rescuer and AED (CPR/FPR/AED) certification. Prior demonstrated excellent communication and customer service skills."
    }
  ]
}