{
  "meta": [
    {
      "job_title": "Estimator",
      "job_category": "Construction",
      "job_class": "Estimator",
      "sector": "Construction",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Estimation",
      "experience": 5
    },
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Reading Blueprints",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Decision-making",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Read and comprehend all contract documents including specifications, project scopes, drawings, and standards to prepare accurate project cost estimates."
    },
    {
      "duty": "Assemble scoped RFPs for vendors and subcontractors to obtain pricing, analyze, compare, and select the best-value vendor and subcontractor proposals for inclusion in cost estimates."
    },
    {
      "duty": "Prepare schedules for proposal submission and attend pre-bid meetings and site walk-downs to understand project scope, conditions, physical restrictions, etc."
    },
    {
      "duty": "Escort subcontractors on-site visits, walking them through the scope of work to obtain the most accurate pricing and attend in-house project turnover meetings from estimating to project management."
    },
    {
      "duty": "Understand and appropriately estimate the costs associated with safety and other project location-specific work rules and utilize historical cost data to develop cost estimates."
    },
    {
      "duty": "Maintain quality service by following organization standards and maintain continuity among corporate, division, and local work teams by documenting and communicating actions, irregularities, and continuing needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Construction Management, Engineering, or a related field"
    }
  ]
}