{
  "meta": [
    {
      "job_title": "Sales and Support Generalist",
      "job_category": "Sales",
      "job_class": "Generalist",
      "sector": "Sales",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drives store sales and growth by personally selling to customers, engaging with customers, and responding effectively to their cues."
    },
    {
      "duty": "Delivers a friendly and efficient cash wrap experience, processing customer transactions accurately and efficiently."
    },
    {
      "duty": "Processes merchandise and maintains back room and under stock to brand standards, replenishes merchandise to brand standards, including markdowns, re-tickets, and the mark-out of stock process."
    },
    {
      "duty": "Assists with floorset activity, executes floor set proficiently, and understands and adheres to brand standards."
    },
    {
      "duty": "Drives top-line store sales results and maintains a focus on bras as the premier product differentiator."
    },
    {
      "duty": "Creates customer awareness of programs available to them, and sets personal goals while tracking individual and team performance to the goals."
    },
    {
      "duty": "Maintains awareness of all sales, promotions, applicable ringing procedures, and takes initiative to recover and replenish merchandise."
    },
    {
      "duty": "Adheres to visual merchandising brand standards, assists in housekeeping of the sales floor, and communicates maintenance issues."
    },
    {
      "duty": "Builds personal capability in loss prevention and reinforces store strategy to reduce shrink."
    },
    {
      "duty": "Supports all activities related to providing a safe working environment and demonstrates Company values."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Merchandising",
      "experience": 2
    },
    {
      "skill": "Cash Handling",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": []
}