{
  "meta": [
    {
      "job_title": "Building Service Attendant",
      "job_category": "Maintenance",
      "job_class": "Attendant",
      "sector": "Maintenance",
      "salary": 21.58,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cleaning",
      "experience": 2
    },
    {
      "skill": "Sanitation",
      "experience": 2
    },
    {
      "skill": "Facility Maintenance",
      "experience": 2
    },
    {
      "skill": "MSDS & Chemical Labels",
      "experience": 2
    },
    {
      "skill": "Communication",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the maintenance of an approved level of cleanliness and sanitary conditions of the areas assigned within the Medical Center."
    },
    {
      "duty": "Sweeps, mops, vacuums, collects trash, polishes floors, performs high dusting, spot washes and doors, removes marks, cleans and makes beds, spot wall washing, washes toilets, cleans furniture, empties trash receptacles, cleans Venetian blinds and shades, radiators, railings, stairways, lights, vents, doors, and more."
    },
    {
      "duty": "Uses telephone and pager for Bed Tracking, maintains adequate supplies, and performs a complete and thorough cleaning of the assigned area according to departmental procedures."
    },
    {
      "duty": "Empties trash receptacles, sweeps and mops hard floor surfaces, vacuums carpeted areas, polishes floors, sets up discharge rooms for admission, proficient in the operation of the computer Bed Tracking System, knowledge in hospital safety and infection control protocols, maintains established safety guidelines, and performs other duties as assigned."
    },
    {
      "duty": "Must be able to communicate and understand simple directions in English, and read MSDS & chemical labels."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 20,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Must be able to communicate and understand simple directions in English. Must be able to read MSDS & chemical labels."
    },
    {
      "credential": "One to two years experience cleaning in a Health Care environment preferred, but not required."
    }
  ]
}