{
  "meta": [
    {
      "job_title": "R&D Engineer II",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 105000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Engineering",
      "experience": 3
    },
    {
      "skill": "Biomedical Engineering",
      "experience": 3
    },
    {
      "skill": "Materials Selection",
      "experience": 3
    },
    {
      "skill": "Medical Device Knowledge",
      "experience": 3
    },
    {
      "skill": "Product Development",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Quality Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop innovative medical devices to treat peripheral, coronary, and heart valve diseases."
    },
    {
      "duty": "Provide oversight to pilot manufacturing/testing and facilitate the transition of products from development to full production."
    },
    {
      "duty": "Participate in cross-functional development teams for process optimization and design support."
    },
    {
      "duty": "Collaborate with research/development, operations, regulatory, and quality teams to develop, validate, and implement various processes."
    },
    {
      "duty": "Analyze, evaluate, and coordinate the procurement of new materials to support prototyping and pilot operation."
    },
    {
      "duty": "Support pilot manufacturing by performing process-related design tasks and ensuring proper documentation."
    },
    {
      "duty": "Identify suppliers, maintain relationships, and ensure component and assembly documentation for new products being developed."
    },
    {
      "duty": "Support company goals and objectives, policies and procedures, Quality Systems, and FDA regulations."
    },
    {
      "duty": "Perform product verification and validation testing, write protocols/reports, and ensure lab notebooks are documented."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Mechanical or Biomedical Engineering with 3+ years’ experience in engineering. Master’s degree with 1 year of engineering experience preferred."
    }
  ]
}