{
  "meta": [
    {
      "job_title": "Safety Manager",
      "job_category": "Safety",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Safety Management",
      "experience": 7
    },
    {
      "skill": "OSHA Regulations",
      "experience": 7
    },
    {
      "skill": "Safety Training",
      "experience": 7
    },
    {
      "skill": "Risk Assessment",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitor job site activity for all inspections and administrative tasks, and document site conditions focusing on safety items through photographs and written reports."
    },
    {
      "duty": "Implement an effective and proactive positive safety culture as part of the Project Management Team."
    },
    {
      "duty": "Conduct special employee site safety training meetings for safety or risk concerns specific to the project and provide detailed reports of each meeting to the site project team and corporate safety director."
    },
    {
      "duty": "Hold specialty training, such as respirator fit tests, and monthly supervisor and foreman safety training meetings."
    },
    {
      "duty": "Review site safety conditions, develop improvement plans with project leadership team, and assist in developing plans for improvements, as well as assist in compiling the information and data for the job activity hazard analysis."
    },
    {
      "duty": "Ensure compliance with all federal, state, and company safety standards on all jobsites."
    },
    {
      "duty": "Ensure job site orientation is conducted for every new employee, review job hazard analysis and pre-task planning documents, and assist in any safety or risk issues identified as the project progresses."
    },
    {
      "duty": "Respond to safety concerns and incidents, conduct accident investigations, and assist in providing additional investigative analysis."
    },
    {
      "duty": "Perform other duties and responsibilities as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred and/or at least 5-7 years of construction safety experience. Certified Safety Professional (CSP), Associated Safety Professional (ASP), Construction Health, and Safety Technician (CHST) or other safety certifications are desirable. Valid Driver’s License"
    }
  ]
}