{
  "meta": [
    {
      "job_title": "Salesforce Platform Manager",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Salesforce Administration",
      "experience": 6
    },
    {
      "skill": "Salesforce Configuration",
      "experience": 6
    },
    {
      "skill": "Business Process Automation",
      "experience": 6
    },
    {
      "skill": "Data Model Architecture",
      "experience": 6
    },
    {
      "skill": "Workflow Design",
      "experience": 6
    },
    {
      "skill": "Salesforce Reporting",
      "experience": 6
    },
    {
      "skill": "Salesforce Data Loader",
      "experience": 6
    },
    {
      "skill": "AppExchange Apps Review",
      "experience": 6
    },
    {
      "skill": "Lightning Web Components (LWC)",
      "experience": 6
    },
    {
      "skill": "Salesforce Debugging",
      "experience": 6
    },
    {
      "skill": "Change Management",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop deep expertise in assigned Salesforce modules, including learning existing architecture, integrations, and automation to be able to support, maintain, and enhance the system."
    },
    {
      "duty": "Become an expert in business processes to develop and improve Salesforce-powered solutions."
    },
    {
      "duty": "Build and maintain custom applications on the SFDC platform, including data models, business logic, user interface, and workflows."
    },
    {
      "duty": "Perform Salesforce administrator functions such as user management, profiles, roles, permissions, validation rules, assignment rules, queues, licenses, etc."
    },
    {
      "duty": "Provide production support, troubleshooting, testing of new functionality, and SFDC seasonal releases."
    },
    {
      "duty": "Complete regular system audits and preparations for upgrades. Stay current with new features and functionality to provide technical guidance and feasibility for system enhancements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "At least 6+ years’ experience administering and configuring SFDC environment with deep knowledge of the declarative (point and click) capabilities or comparable experience as a “Super User” or “Product Owner” of similar Salesforce functionality."
    },
    {
      "credential": "Experience working with business stakeholders to document requirements and translate into Salesforce solutions."
    },
    {
      "credential": "Salesforce Certified Administrator, Salesforce Certified Advanced Administrator, and Platform App Builder Certification."
    }
  ]
}