{
  "meta": [
    {
      "job_title": "Registered Nurse Medical Surgical Telemetry",
      "job_category": "Nursing",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Health Data Collection",
      "experience": 3
    },
    {
      "skill": "Patient Assessment",
      "experience": 3
    },
    {
      "skill": "Discharge Planning",
      "experience": 3
    },
    {
      "skill": "Healthcare Communication",
      "experience": 3
    },
    {
      "skill": "Interdisciplinary Collaboration",
      "experience": 3
    },
    {
      "skill": "Patient Education",
      "experience": 3
    },
    {
      "skill": "Patient Safety Management",
      "experience": 3
    },
    {
      "skill": "Medication Administration",
      "experience": 3
    },
    {
      "skill": "Clinical Assessment",
      "experience": 3
    },
    {
      "skill": "Customer Service Excellence",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collect patient health data, perform initial assessment based on patient's presentation, and record relevant data."
    },
    {
      "duty": "Develop and implement a plan of care, analyze assessment data, and identify expected outcomes for the patient."
    },
    {
      "duty": "Incorporate discharge planning into the admission process and communicate the plan of care to promote continuity of care."
    },
    {
      "duty": "Assist patients and families in identifying and securing services to address health-related needs."
    },
    {
      "duty": "Recognize hazards to patient safety, take action to maintain a safe environment, and provide education to the patient and family."
    },
    {
      "duty": "Document the initial plan of care, provide updates as required, and evaluate the patient's progress toward attainment of outcomes."
    },
    {
      "duty": "Demonstrate ethical beliefs and respect for patient's rights, and participate in the evaluation of the quality and effectiveness of nursing practices."
    },
    {
      "duty": "Maintain knowledge and proficiency in the clinical area and age group served, and comply with staff meeting attendance requirement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Professional knowledge of nursing theory and practice acquired through completion of a two-year training at an accredited School of Nursing, and a current New York State license or permit as a Registered Professional Nurse."
    }
  ]
}