{
  "meta": [
    {
      "job_title": "Customer Service Associate",
      "job_category": "Customer Service",
      "job_class": "Associate",
      "sector": "Hospitality",
      "salary": 28000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Cashiering",
      "experience": 1
    },
    {
      "skill": "Food Service",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Team Work",
      "experience": 1
    },
    {
      "skill": "Order Processing",
      "experience": 1
    },
    {
      "skill": "Cleaning",
      "experience": 1
    },
    {
      "skill": "Payment Processing",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide great customer service by taking orders, assembling orders, delivering food to customers, and cleaning the dining room."
    },
    {
      "duty": "Thrive in an upbeat and fast-paced environment by working all shifts: opening shifts, closing shifts, and everything in between."
    },
    {
      "duty": "Offer entry-level position with paid training for every new Customer Service Associate on the team."
    },
    {
      "duty": "Earn pay increases through additional training, certifications, and performance evaluations within the first year of working in the Restaurant."
    },
    {
      "duty": "Demonstrate qualities of an awesome Canes Customer Service Associate: Team player, Excellent communicator, Happy, Courteous, Enthusiastic, Hard working, Responsible, Dependable, Authentic, Genuine, and Takes pride in doing a good job."
    },
    {
      "duty": "Clean tables, floors, and other areas of the Restaurant, take orders from Customers, process payments efficiently, and follow proper safety procedures when handling and/or preparing food."
    },
    {
      "duty": "Show up to scheduled shifts on time and work together as a team, assisting other Crewmembers in completion of tasks and assignments to ensure continuity of service."
    },
    {
      "duty": "Align with Raising Cane’s culture by balancing Working Hard and Having Fun, take initiative, and comply with Company policies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "No formal education requirements, entry-level position"
    }
  ]
}