{
  "meta": [
    {
      "job_title": "Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Sales Forecasting",
      "experience": 5
    },
    {
      "skill": "Product Training",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "CRM Software",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive sales strategies to increase market share and penetrate new markets with motion control products."
    },
    {
      "duty": "Lead and mentor a team of sales professionals, providing guidance and support to achieve sales targets."
    },
    {
      "duty": "Analyze market potential and prepare annual sales forecasts and district plans as required by Sales management."
    },
    {
      "duty": "Maintain a healthy pipeline of opportunities with a target revenue of $500K, ensuring a 34% win rate and closure within 127 days."
    },
    {
      "duty": "Collaborate with OEM’s, MRO accounts, and Industrial Distributors for sales, specification, and training efforts."
    },
    {
      "duty": "Proactively work with Distribution focusing on training, joint target account efforts, and national corporate programs."
    },
    {
      "duty": "Keep supervisor informed on key activities and actions in the marketplace that may impact the business."
    },
    {
      "duty": "Ensure controlled and effective use of expenses through planning and efficient coverage of District and accounts."
    },
    {
      "duty": "Follow Regal’s Ethics and Safety Programs, State and Federal Environmental Compliance Programs, and Export, Import, and Supply Chain Security Policy requirements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS Degree, 4 Years of Outside Sales Experience (Industrial Sales Preferred), Mechanical Aptitude"
    }
  ]
}