{
  "meta": [
    {
      "job_title": "Billing Representative II",
      "job_category": "Healthcare",
      "job_class": "Representative",
      "sector": "Healthcare",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Under general direction submits claims. Follows-up on unpaid balances (insurance or patient), corrects errors, enters claim information, submits authorization/precertification requests with insurance companies, follows up on denied claims and/or authorizations, and submits appeals as necessary as a part of the revenue cycle team."
    },
    {
      "duty": "Perform other duties as needed.Perform billing tasks assigned by management which may include data entry, claim review, charge review, accounts receivable follow-up, or other related responsibilities.Provide input on system edits, processes, policies, and billing procedures to ensure maximization of revenues."
    },
    {
      "duty": "Perform daily tasks in assigned work queues and according to manager assignments.Identify payer, provider credentialing, and/or coding issues and address them with management.Follow workflows provided in training classes and request additional training as needed."
    },
    {
      "duty": "Utilize CBO Pathways as guide for determining actions needed to resolve unpaid or incorrectly paid claims and/or for authorizing procedures in assigned workqueue(s) using payer websites, billing system information and training within expected timeframe."
    },
    {
      "duty": "Review reports to identify revenue opportunities and unpaid claims.Adhere to general practices and FGP guidelines on compliance issues and patient confidentiality."
    },
    {
      "duty": "Communicate with providers, patients, coders, or other responsible persons to ensure that claims are correctly processed by third party payers.Work following operational policies and procedures, and regulatory requirements.Participate in workgroups and meetings. Attend all required training classes. Escalate issues to management as needed. Maintain confidentiality. Read and apply policies and procedures to make appropriate decisions. Coordinate functions and work cooperatively with others. Explain processes and procedures to others; performs other related duties as assigned."
    },
    {
      "duty": "Responsible for assisting the professional billing staff within the CBO with difficult and escalated issues.Appeal complex denials through review of payer policies, coding, contracts, and medical records. Utilize subject matter experts as needed.Make appropriate corrections to system to satisfy/edit payer requirements and re-submit claims as needed.Cross cover other areas in the office as assigned by management including Accounts Receivable/Denials, Customer Service or Authorizations."
    }
  ],
  "skills": [
    {
      "skill": "Medical Billing",
      "experience": 3
    },
    {
      "skill": "Accounts Receivable",
      "experience": 3
    },
    {
      "skill": "CPT and ICD10",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 3
    },
    {
      "skill": "Claim Review",
      "experience": 3
    },
    {
      "skill": "Accounts Receivable Follow-Up",
      "experience": 3
    },
    {
      "skill": "Insurance Knowledge",
      "experience": 3
    },
    {
      "skill": "English Usage",
      "experience": 3
    },
    {
      "skill": "Mathematics",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED"
    },
    {
      "credential": "2 years experience in a similar role"
    }
  ]
}