{
  "meta": [
    {
      "job_title": "Patient Service Associate/Patient Access",
      "job_category": "Healthcare",
      "job_class": "Associate",
      "sector": "Healthcare",
      "salary": 24,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "MS Excel",
      "experience": 2
    },
    {
      "skill": "MS Word",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform diversified clerical functions in Registration/Information, Appointments, Patient Care modules, Cashiering, and Medical Records."
    },
    {
      "duty": "Maintain the security and confidentiality of patient information at all times."
    },
    {
      "duty": "Greet and assist patients, family, and other individuals while maintaining excellent customer service at all times."
    },
    {
      "duty": "Perform electronic health record (eHR) competencies, including scanning insurance cards, capturing patient photos for the eHR, and facilitating patient flow."
    },
    {
      "duty": "Work in conjunction with the healthcare team, participating in site improvement efforts, accepting coverage assignments, and providing translation assistance."
    },
    {
      "duty": "Report problems with workflow, conflicts, further skill training, and other related concerns to supervisory staff."
    },
    {
      "duty": "Provide translation assistance as needed to facilitate patient and provider interaction."
    },
    {
      "duty": "Demonstrate awareness of and respect for coworkers/patients cultural backgrounds."
    },
    {
      "duty": "Perform registration functions, including visit registration, translation needs & documentation, verification of demographic information, verification of primary care provider, obtain consent for treatment, offer new patient packages, etc."
    },
    {
      "duty": "Perform financial functions, including insurance eligibility verification, collect co-pays and deductibles, determine eligibility for financial programs, and perform cashiering tasks."
    },
    {
      "duty": "Perform telephone functions, including answering phones, identifying the nature of the call, taking messages, and confirmation calls for upcoming appointments."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent required"
    }
  ]
}