{
  "meta": [
    {
      "job_title": "Plant Operations and Maintenance Director",
      "job_category": "Engineering",
      "job_class": "Director",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Budget Management",
      "experience": 7
    },
    {
      "skill": "Policy Development",
      "experience": 7
    },
    {
      "skill": "Health and Safety Compliance",
      "experience": 7
    },
    {
      "skill": "Supply Chain Management",
      "experience": 7
    },
    {
      "skill": "Facility Maintenance Management",
      "experience": 7
    },
    {
      "skill": "People Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and lead plant operations and maintenance functions for one or more ministry or departments within a business unit, or ministry region with a wide latitude of authority in determining operations and maintenance strategies, work plans, budgets and staffing."
    },
    {
      "duty": "Plan staffing levels, development and growth, recruitment, supervision, and disciplinary process. Provides strategic vision, manages and leads plant operations and maintenance services to meet the expectations of all customers served."
    },
    {
      "duty": "Develops, submits and manages annual capital and operating budgets."
    },
    {
      "duty": "Plans, develops, and directs a strategic plan for plant operations and maintenance services for all buildings and grounds, ensuring alignment with system level strategic initiatives."
    },
    {
      "duty": "Develops, reviews and revises policies and procedures that align with department and over-all locations operations."
    },
    {
      "duty": "Develops strategic plans for the maintenance of the physical environment of care with the polices of the organization, The Joint Commission (TJC), Occupational Safety and Health Administration (OSHA), National Fire Protection Association (NFPA), Environmental Protection Agency (EPA), and any other applicable federal, state and local statutes and administrative codes."
    },
    {
      "duty": "Develops strategic plans for the management and purchase of supplies, equipment and services ensuring uninterrupted service to multiple ministries or departments within a business unit or ministry region of responsibility."
    },
    {
      "duty": "Works in a constant state of alertness and safe manner. Performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in engineering, business or related field, or equivalent years of experience and education (Master's preferred)"
    }
  ]
}