{
  "meta": [
    {
      "job_title": "Account Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 67500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 2
    },
    {
      "skill": "Tax Returns",
      "experience": 1
    },
    {
      "skill": "Business Finance",
      "experience": 2
    },
    {
      "skill": "Marketing",
      "experience": 3
    },
    {
      "skill": "Entrepreneurship",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Business Development",
      "experience": 3
    },
    {
      "skill": "Presentation Skills",
      "experience": 3
    },
    {
      "skill": "Small Business Support",
      "experience": 3
    },
    {
      "skill": "Relationship Building",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver the NYC Business Solutions set services to small businesses to ensure the team is regularly exceeding goals set by the New York City Department of Small Business Services and Next Street leadership."
    },
    {
      "duty": "Collaborate with senior team members to present and make strategic recommendations to small businesses regarding their financial standing."
    },
    {
      "duty": "Serve as a trusted advisor for entrepreneurs by using best practices to uncover needs, make recommendations for support, and connect to relevant small business services, resources, and tools."
    },
    {
      "duty": "Respond to all customer inquiries in a timely and appropriate manner, in accordance with quality assurance best practices and Center standards."
    },
    {
      "duty": "Facilitate and present webinars to provide entrepreneurs with relevant training and resources."
    },
    {
      "duty": "Drive business development and marketing efforts to attract and retain clients and partners."
    },
    {
      "duty": "Cultivate relationships with different community-based organizations, community boards, Business Improvement Districts, and other stakeholders interested in helping entrepreneurs gain access to support services."
    },
    {
      "duty": "Provide support, as needed, for Next Street’s business development opportunities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting, Finance, Business Administration, or a related field (Master's preferred)"
    }
  ]
}