{
  "meta": [
    {
      "job_title": "Human Resources Consultant Sr",
      "job_category": "Human Resources",
      "job_class": "Consultant",
      "sector": "Human Resources",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide advanced level professional HR consultation to all levels of management and employees on a broad scope of HR programs including compensation, classification, talent acquisition, employee relations, and performance management."
    },
    {
      "duty": "Consult with VDOT’s Salem District managers/employees on policy interpretation; ensure compliance with legal requirements; advise managers on performance planning, evaluation, and staffing."
    },
    {
      "duty": "Demonstrate knowledge and skill in the areas of talent acquisition, compensation, classification, employee relations, staff and management development, and coaching."
    },
    {
      "duty": "Work well with diverse audiences and customers from every level within the Agency and organization to include, but not limited to district and department leadership, general public, other State agencies, and private sector agencies."
    },
    {
      "duty": "Mitigate employee relations issues, manage and lead employee relation investigations."
    },
    {
      "duty": "Coach managers and supervisors on increasing employee engagement and development."
    },
    {
      "duty": "Provide training on human resources related topics, to include talent acquisition, performance management, classification, compensation, grievance processes, discipline practices, coaching, and employee development."
    },
    {
      "duty": "Conduct job classification reviews, position audits, and review organization structure changes."
    },
    {
      "duty": "Perform the full scope of talent acquisition responsibilities to include compensation consultation."
    },
    {
      "duty": "Ensure compliance with legal requirements and Federal and State regulations related to human resources functions."
    },
    {
      "duty": "Develop strategies to improve customer services, program efficiency and effectiveness, and function as a team member with other HR staff."
    },
    {
      "duty": "Analyze data and reach conclusions which are logical and legally supportable, counsel, and advise managers and employees in the resolution of HR issues."
    },
    {
      "duty": "Consult with management teams to implement organizational change and to identify strategic issues and organizational needs."
    },
    {
      "duty": "Balance multiple priorities, lead meetings, make effective business decisions, and meet project-based deadlines."
    },
    {
      "duty": "Communicate effectively orally and in writing with internal and external customers."
    },
    {
      "duty": "Collect, assemble, process and file information using manual and automated systems."
    },
    {
      "duty": "Maintain confidentiality at all times."
    },
    {
      "duty": "Design, analyze and implement policies, procedures, and programs."
    },
    {
      "duty": "Engage in infrequent, in-state overnight travel."
    }
  ],
  "skills": [
    {
      "skill": "HR Management",
      "experience": 5
    },
    {
      "skill": "Talent Acquisition",
      "experience": 5
    },
    {
      "skill": "Compensation Management",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Staff Development",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Legal Compliance",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources Management, Organizational Development or related field (Master's preferred)"
    },
    {
      "credential": "Professional certification (SHRM-CP/SHRM-SCP/PHR/SPHR)"
    }
  ]
}