{
  "meta": [
    {
      "job_title": "Team Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the scheduling of patient visits to provide outstanding service delivery while improving the patient experience."
    },
    {
      "duty": "Collaborate with all team members to achieve exceptional clinical, quality, and financial outcomes."
    },
    {
      "duty": "Performs duties with compliance to regulatory agencies as evidenced by ability to apply Agency policies resulting in deficiency free surveys."
    },
    {
      "duty": "Schedules nursing, therapy & social work visits."
    },
    {
      "duty": "Facilitates the timely initiation of care through problem-solving accurate scheduled and tasking of requested services along with a critical thinking approach to work."
    },
    {
      "duty": "Triages incoming calls using critical thinking/prioritization and Superior customer service skills."
    },
    {
      "duty": "Coordinates and consults with Supervisors and team members regarding patient information, data management, and regulatory compliance statuses."
    },
    {
      "duty": "Utilizes and manages electronic and paper data and coordinates specific administrative/organizational functions to ensure accurate, efficient, and timely flow of information and financial data for interdisciplinary care teams."
    },
    {
      "duty": "Provides administrative and clerical support to care management team electronically and manually."
    },
    {
      "duty": "Demonstrates proficiency in computer navigation and medical/financial databases communications."
    },
    {
      "duty": "Electronically assigns and de-assigns Clinical Staff to patients by accurately utilizing system permissions."
    },
    {
      "duty": "Coordinates initial admission services and acts as a liaison for clinical team."
    },
    {
      "duty": "Demonstrates effective communication, organizational, and time management skills."
    },
    {
      "duty": "Complies with agency established processes to maintain standards and ensure standardization."
    },
    {
      "duty": "Organizes daily work and information to maintain efficiency and confidentiality."
    },
    {
      "duty": "Responsible for ensuring required information is provided and flowed timely to complete the functions of billing, payroll, admissions, and care delivery."
    }
  ],
  "skills": [
    {
      "skill": "Office procedures",
      "experience": 3
    },
    {
      "skill": "Computer proficiency",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent; Associate's Degree with medical secretarial background preferred"
    }
  ]
}