{
  "meta": [
    {
      "job_title": "SmileShop Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 52000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Retail Management",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Dental Industry Knowledge",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of retail associates, fostering collaboration and guiding their efforts towards providing a 5-star experience for customers."
    },
    {
      "duty": "Explain product offerings and guide customers through the process, ensuring a high level of service across all service channels."
    },
    {
      "duty": "Use technology to create 3D scans of customer's teeth for review by Licensed Dental Professionals, and provide guidance on payment plans."
    },
    {
      "duty": "Collaborate with dental partners to drive patient referrals and grow the book of business."
    },
    {
      "duty": "Manage the operational aspects of the SmileShop, setting expectations, monitoring compliance, and achieving desired goals."
    },
    {
      "duty": "Provide complimentary whitening and guidance on dental care to customers, creating a positive and high-energy atmosphere."
    },
    {
      "duty": "Plan and lead initiatives to drive sales and operations, including scheduling, training, and preparing reports."
    },
    {
      "duty": "Act as a brand ambassador, forming genuine relationships with on-site Partner Network Practice Team Members and alerting Leadership of potential conflicts or concerns."
    },
    {
      "duty": "Additional responsibilities as needed to set the SmileShop up for success."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Sales and Customer Service experience, preferably in a retail sales setting"
    }
  ]
}