{
  "meta": [
    {
      "job_title": "Team Leader",
      "job_category": "Retail",
      "job_class": "Team Leader",
      "sector": "Retail",
      "salary": 28000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Retail Experience",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Performance Measurement",
      "experience": 3
    },
    {
      "skill": "People Development",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Hiring, onboarding, training, leading, managing, and developing the Smaland co-workers in the store."
    },
    {
      "duty": "Overseeing the daily operation of Smaland area and the daily restocking of shopping tools throughout the store."
    },
    {
      "duty": "Ensuring greeter is in place at the store entrance to actively guide and answer customers' questions."
    },
    {
      "duty": "Supporting Checkout & Payment area and other Customer Experience areas as needed."
    },
    {
      "duty": "Following procedures and ensuring adherence to all safety processes and standards."
    },
    {
      "duty": "Reviewing schedule and making needed changes accordingly."
    },
    {
      "duty": "Training co-workers and other Customer Experience Leaders on Smaland processes and safety requirements."
    },
    {
      "duty": "Building emotional connections through meaningful and empathetic interactions with customers, setting the example and coaching others on how to do the same."
    },
    {
      "duty": "Partnering with Safety and Security to ensure adherence to policies regarding Smaland, rules as well as ASR guidelines around cash handling."
    },
    {
      "duty": "Ensuring “How To Shop” and Services communication is up to date, In Shape As New (ISAN) and meets Commercial Review Standards."
    },
    {
      "duty": "Leading, attending, and contributing to store meetings and forums as applicable."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "3 years of experience in retail. Experience in retail, preferably in the home furnishing sector. Experience planning, driving output, and measuring performance (business). Experience leading and developing people, preferably in a retail environment."
    }
  ]
}