{
  "meta": [
    {
      "job_title": "Quality Food Safety Manager",
      "job_category": "Quality Assurance",
      "job_class": "Manager",
      "sector": "Food Safety",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Quality and Food Safety Management",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Food Safety Auditing",
      "experience": 7
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 7
    },
    {
      "skill": "Documentation Control",
      "experience": 7
    },
    {
      "skill": "Third-Party Audit Leadership",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides leadership to the bakery’s Quality Food Safety department through coaching and development of front-line associates, driving a culture of safety, inclusion, engagement and accountability."
    },
    {
      "duty": "Promotes a culture of Food Safety among all bakery associates through education and policy enforcement along with fellow department leaders."
    },
    {
      "duty": "Ensures that our customer’s receive the highest quality product in a food safe environment."
    },
    {
      "duty": "Provides oversight of Quality, Food Safety and Sanitation programs and evaluates for compliance through regular audits, inspections and risk assessments, ensuring that Corrective Actions are performed for any non-conformance."
    },
    {
      "duty": "Leads all third-party audits including SQF (Safe Quality Foods) and AIB (American Institute of Baking)."
    },
    {
      "duty": "Drives continuous improvement by ensuring that LEAN tools and 5S are practiced."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Food Science or related scientific major preferred. A combination of education, training and experience that results in demonstrated competency to perform the work may be substituted. GFSI (SQF, BRC, FSSC 22000, IFS, etc), PCQI, Food Defense and HACCP certifications strongly preferred."
    }
  ]
}