{
  "meta": [
    {
      "job_title": "CARE Liaison",
      "job_category": "Community and Social Services",
      "job_class": "Liaison",
      "sector": "Education",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Community Engagement",
      "experience": 2
    },
    {
      "skill": "Resource Coordination",
      "experience": 2
    },
    {
      "skill": "Bilingual Communication",
      "experience": 2
    },
    {
      "skill": "Data Collection",
      "experience": 2
    },
    {
      "skill": "Family Support Services",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as a liaison for student caregivers to provide assistance, access to information, resources and supports."
    },
    {
      "duty": "Assist with School Student Support Services team and educators with organizing events for parents/caregivers and family members."
    },
    {
      "duty": "Support community school facilitator and/or principal in developing interest and involvement among families/caregivers in the school by encouraging participation in engagement activities."
    },
    {
      "duty": "Develop rapport with students, their caregivers and school staff in the interest of promoting the progress of the students."
    },
    {
      "duty": "Serves as the contact person for caregivers to share their feedback or concerns about the School Progress Plan, Family Engagement Plan and/or grant budget."
    },
    {
      "duty": "Assist the school attendance team with providing families/caregivers with access to resources that support students and families/caregivers with resources to address barriers to student attendance."
    },
    {
      "duty": "Collaborate to develop the school-based Family Engagement Plan and the school-level Home to School Compact as well as distributes the Title I District Level Family Engagement Plan."
    },
    {
      "duty": "Attend required meetings, professional learning, and workshops."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Possession of a high school diploma or appropriate equivalent."
    },
    {
      "credential": "Two years of experience providing services to children and families or related community experience. Bilingual skills preferred."
    }
  ]
}