{
  "meta": [
    {
      "job_title": "Program Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 47500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Training",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Operations Management",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Person-Centered Care",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and train the team to support programmatic initiatives, goals, and daily routines for individuals with disabilities."
    },
    {
      "duty": "Manage staff schedules, ensure shifts are adequately staffed, and provide training on daily routines including cleaning, cooking, and medication administration."
    },
    {
      "duty": "Manage team performance through effective communication, training, performance management, and employee recognition."
    },
    {
      "duty": "Develop and implement activity programs including the Meaningful Day curriculum and update Individual Support Plans with the interdisciplinary team."
    },
    {
      "duty": "Ensure individuals are supported per their Individual Support Plans including medication management, meal planning, and behavior management."
    },
    {
      "duty": "Ensure program documentation and billable records are completed accurately and timely, and assist with monitoring the finances of individuals."
    },
    {
      "duty": "Monitor the health and medical needs of individuals and manage relationships with their families and guardians."
    },
    {
      "duty": "Ensure work locations and vehicles are clean, well-maintained, and stocked with necessary supplies."
    },
    {
      "duty": "May be required to fill shifts when staffing issues arise and cooperate with inspection, inquiry, or investigation by department staff."
    },
    {
      "duty": "Additional tasks and responsibilities may be assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree Preferred"
    }
  ]
}