{
  "meta": [
    {
      "job_title": "Account Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Consumer Insights",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and grow the client relationship with a strategic multi-industry retailer, driving actionable insights and revenue growth."
    },
    {
      "duty": "Respond to client requests for insights using existing databases, industry knowledge, and internal collaboration."
    },
    {
      "duty": "Demonstrate usage of retail point-of-sale scanner data and consumer panel data to partner with the retailer."
    },
    {
      "duty": "Improve ongoing reporting to provide increased value and efficiencies while integrating data into the client’s decision-making processes."
    },
    {
      "duty": "Evaluate how products and services can address key business issues and introduce new products to clients."
    },
    {
      "duty": "Leverage industry analysts, practice area counterparts, and corporate resources to improve insights derived from data."
    },
    {
      "duty": "Conduct engaging and impactful presentations to deliver value to the client and listen to the customer's needs."
    },
    {
      "duty": "Build relationships throughout the customer's organization and manage time and activities effectively."
    },
    {
      "duty": "Embrace opportunity and customer management processes and systems, demonstrating a strong work ethic and attention to detail."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Marketing, or related field (Master's preferred)"
    }
  ]
}