{
  "meta": [
    {
      "job_title": "Cardiac Sonographer",
      "job_category": "Healthcare",
      "job_class": "Diagnostic",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Diagnostic Procedures",
      "experience": 5
    },
    {
      "skill": "Echosonography",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Image Quality Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Healthcare Provider CPR",
      "experience": 5
    },
    {
      "skill": "Cardiac Sonography",
      "experience": 5
    },
    {
      "skill": "Medical Imaging",
      "experience": 5
    },
    {
      "skill": "Anatomy",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs diagnostic procedures to assess cardiac structures and hemodynamics in accordance with accepted protocols."
    },
    {
      "duty": "Records patient test results and reports results, ensuring prompt submission of high-quality images and documents. "
    },
    {
      "duty": "Monitors patient comfort and safety during tests, alerting physicians to abnormalities or changes in patient responses."
    },
    {
      "duty": "Assists in maintaining a clean and orderly department, including procedure rooms, storage areas, dressing rooms, and film storage area."
    },
    {
      "duty": "Works in a constant state of alertness and safe manner. Performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 110,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree or equivalent years of experience and education."
    },
    {
      "credential": "Basic Life Support HealthCare Provider (BLS HCP) - American Heart Association (AHA)"
    },
    {
      "credential": "Future - Basic Life Support Healthcare Provider (BLS HCP) within 90 days - American Heart Association (AHA)"
    },
    {
      "credential": "Future - Registered Cardiac Sonographer (RCS) within 12 months - Cardiovascular Credentialing International (CCI)"
    },
    {
      "credential": "Future - Registered Cardiovascular Invasive Specialist (RCIS) within 12 months - Cardiovascular Credentialing International (CCI)"
    },
    {
      "credential": "Future - Registered Congenital Cardiac Sonographer (RCCS) within 12 months - Cardiovascular Credentialing International (CCI)"
    },
    {
      "credential": "Future - Registered Diagnostic Cardiac Sonographer (RDCS) with Adult Echocardiography (AE) Specialty within 12 months - American Registry for Diagnostic Medical Sonography (ARDMS)"
    },
    {
      "credential": "Future - Registered Diagnostic Cardiac Sonographer (RDCS) with Pediatric Echocardiography (PE) Specialty within 12 months - American Registry for Diagnostic Medical Sonography (ARDMS)"
    },
    {
      "credential": "Registered Cardiac Sonographer (RCS) - Cardiovascular Credentialing International (CCI)"
    },
    {
      "credential": "Registered Cardiovascular Invasive Specialist (RCIS) - Cardiovascular Credentialing International (CCI)"
    },
    {
      "credential": "Registered Congenital Cardiac Sonographer (RCCS) - Cardiovascular Credentialing International (CCI)"
    },
    {
      "credential": "Registered Diagnostic Cardiac Sonographer (RDCS) with Adult Echocardiography (AE) Specialty - American Registry for Diagnostic Medical Sonography (ARDMS)"
    },
    {
      "credential": "Registered Diagnostic Cardiac Sonographer (RDCS) with Pediatric Echocardiography (PE) Specialty - American Registry for Diagnostic Medical Sonography (ARDMS)"
    }
  ]
}