{
  "meta": [
    {
      "job_title": "School Education Manager",
      "job_category": "Education",
      "job_class": "Manager",
      "sector": "Education",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the introduction, execution, and oversight of all child care center curriculum offerings."
    },
    {
      "duty": "Develop, train, and coach staff members and ensure the effective delivery of all educational programs along the Kindergarten Readiness Pathway."
    },
    {
      "duty": "Serve as an ambassador for the school to prospective families."
    },
    {
      "duty": "Ensure the school is operating in accordance with company and state licensing standards."
    },
    {
      "duty": "Spark imagination, build self-esteem, and help children discover new things each day."
    },
    {
      "duty": "Promote the positive image of the company and play a major role in making the company a provider of choice for the communities we serve."
    },
    {
      "duty": "Recruit, select, and retain quality staff."
    },
    {
      "duty": "Help achieve profitability for the company."
    },
    {
      "duty": "Observe and evaluate program delivery and curriculum implementation at the School and ensure regular child assessments occur along the School Readiness Pathway."
    },
    {
      "duty": "Conduct observations and provide ongoing feedback and coaching on curriculum implementation, classroom management, and lesson planning."
    },
    {
      "duty": "Work in tandem with the School Director to prepare for and maintain accreditation status by ensuring the effective delivery of educational programming."
    },
    {
      "duty": "Stay current on company program offerings and ensure the school operates with the most up-to-date curriculum/program expectations."
    }
  ],
  "skills": [
    {
      "skill": "Early Childhood Education",
      "experience": 5
    },
    {
      "skill": "Curriculum Development",
      "experience": 5
    },
    {
      "skill": "Training and Coaching",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Program Evaluation",
      "experience": 5
    },
    {
      "skill": "Accreditation Maintenance",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Associate’s Degree in Early Childhood Education, Early Elementary, or related field (Bachelor's preferred)"
    }
  ]
}