{
  "meta": [
    {
      "job_title": "RN Infusion PT",
      "job_category": "Nursing",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Infusion Experience",
      "experience": 5
    },
    {
      "skill": "Nursing Care",
      "experience": 5
    },
    {
      "skill": "Treatment Planning",
      "experience": 5
    },
    {
      "skill": "Patient Education",
      "experience": 5
    },
    {
      "skill": "Medical Record Documentation",
      "experience": 5
    },
    {
      "skill": "Intravenous Access Maintenance",
      "experience": 5
    },
    {
      "skill": "Crisis Intervention",
      "experience": 5
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 5
    },
    {
      "skill": "Patient Triage",
      "experience": 5
    },
    {
      "skill": "Quality Control Standards",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide professional nursing care for patients including assessment, treatment, care planning, and medical care and evaluation."
    },
    {
      "duty": "Assist physicians and staff in coordinating patient care and function as a primary liaison between patients, staff, and physicians."
    },
    {
      "duty": "Obtain patient consent for care, ensure patient confidentiality, and assess disease condition."
    },
    {
      "duty": "Administer prescribed treatments, medications, and monitor treatment progress and patient response."
    },
    {
      "duty": "Educate patients and families about health status, health maintenance, and management of acute and chronic conditions."
    },
    {
      "duty": "Maintain accurate inventory of all medications and respond to incoming patient treatment-related phone calls."
    },
    {
      "duty": "Administer all medications: PO, IV, SC, IM as prescribed and coordinate treatment plans for patients."
    },
    {
      "duty": "Schedule follow-up appointments and collaborate with the research department as required."
    },
    {
      "duty": "Maintain patient confidentiality and perform other clinical duties as deemed appropriate by nursing management/supervisor."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "RN degree. Completion of nursing training from an accredited school of nursing. BSN preferred. Minimum of 3 years professional nursing experience. Minimum of 1 year infusion experience in acute, outpatient, home and/or physician office setting. Gastroenterology experience preferred. Current state registered nurse license. Current CPR certificate. CRNI certification preferred."
    }
  ]
}