{
  "meta": [
    {
      "job_title": "CRM Engineer II",
      "job_category": "Information Technology",
      "job_class": "Engineer",
      "sector": "Information Technology",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Salesforce CRM",
      "experience": 5
    },
    {
      "skill": "Data Management",
      "experience": 5
    },
    {
      "skill": "Customization and Development",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "User Training and Support",
      "experience": 5
    },
    {
      "skill": "Maintenance and Upgrades",
      "experience": 5
    },
    {
      "skill": "Continuous Improvement",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in the configuration, customization, and maintenance of the CRM platform."
    },
    {
      "duty": "Troubleshoot and resolve technical issues related to the CRM system."
    },
    {
      "duty": "Assist in data cleansing, migration, and integration efforts to ensure data accuracy and consistency within the CRM system."
    },
    {
      "duty": "Work with senior engineers to implement customizations, workflows, and automation within the CRM system."
    },
    {
      "duty": "Collaborate with business stakeholders to gather requirements and understand their needs for CRM system improvements."
    },
    {
      "duty": "Document technical processes, configurations, and customizations within the CRM system."
    },
    {
      "duty": "Provide training and support to end-users on CRM system usage, best practices, and troubleshooting."
    },
    {
      "duty": "Participate in regular system maintenance, updates, and upgrades to ensure the CRM system's reliability and security."
    },
    {
      "duty": "Stay up to date with industry trends and best practices related to CRM systems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "A bachelor's degree and at least 3 years experience as a CRM Engineer or similar role (additional experience may be substituted in lieu of a degree)"
    }
  ]
}