{
  "meta": [
    {
      "job_title": "Customer Success Renewal Quoting Manager",
      "job_category": "Customer Success",
      "job_class": "Manager",
      "sector": "Customer Success",
      "salary": 115000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of analysts to execute on key performance indicators and projects that support customer renewal activities."
    },
    {
      "duty": "Manage quoting analysts responsible for quote creation and revision, and ensure compliance with company policies for quoting of renewal orders."
    },
    {
      "duty": "Establish and maintain relationships with team leads of adjacent functions to develop and streamline processes."
    },
    {
      "duty": "Drive effectiveness by identifying improvements to the quoting processes and tools, and ensuring achievement of on-time, accurate, and actionable renewal quote creation."
    },
    {
      "duty": "Ensure renewal pricing follows current policies, rules, and procedures based on configuration of the offering and instance."
    },
    {
      "duty": "Support and provide guidance to renewal quoting analyst team, and establish a regular cadence to ensure development and progress toward agreed upon career goals and objectives."
    },
    {
      "duty": "Assist with special projects related to the renewal quoting process and function."
    },
    {
      "duty": "Establish relationships with customer renewal data to ensure the product data is properly captured for creation of customer renewal quotes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree, or 5+ years' experience in an Operations, Product, or Specialists role within a B2B organization."
    },
    {
      "credential": "Experience in Customer Success Operations, Contract Creation or Review, or similar role."
    },
    {
      "credential": "Prior experience using Salesforce (or similar CRM) required, familiarity with Gainsight, NetSuite, and Walk-Me desirable."
    },
    {
      "credential": "Exceptional ability to communicate clearly, both verbal and written."
    },
    {
      "credential": "Familiarity with CX (industry and technology) is a bonus."
    }
  ]
}