{
  "meta": [
    {
      "job_title": "Clinical Nurse",
      "job_category": "Nursing",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 61,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 3
    },
    {
      "skill": "Critical Thinking",
      "experience": 4
    },
    {
      "skill": "Evidence-Based Practice",
      "experience": 4
    },
    {
      "skill": "Therapeutic Relationship",
      "experience": 4
    },
    {
      "skill": "Process Improvement",
      "experience": 4
    },
    {
      "skill": "Clinical Skills",
      "experience": 4
    },
    {
      "skill": "Nursing Documentation",
      "experience": 4
    },
    {
      "skill": "Quality Improvement",
      "experience": 4
    },
    {
      "skill": "Safe Patient Care",
      "experience": 4
    },
    {
      "skill": "Team Collaboration",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver patient care based on nursing theory, evidence-based practice, and organizational standards."
    },
    {
      "duty": "Assess and evaluate patient care needs, apply critical thinking skills in care management, and integrate relevant assessment and intervention skills."
    },
    {
      "duty": "Collaborate with the healthcare team to develop, implement, and evaluate the plan of care."
    },
    {
      "duty": "Prioritize patient care aspects including teaching, rounding, coaching, and planning after hospital care."
    },
    {
      "duty": "Educate patients and caregivers about their plan of care, transition of care, and promotion of health."
    },
    {
      "duty": "Communicate effectively with patients, family, and interdisciplinary team, manage assignments within the Care Delivery Model, and demonstrate allocation of material resources effectively."
    },
    {
      "duty": "Role model Relationship Centered Care through various actions including Admission Welcome, Bedside shift Report, HELP, AM/PM Care, 5 Minute Sit Down, Purposeful Hourly Rounding, Medication Review, Discharge Wrap Up, and MD/RN Unit Collaboration."
    },
    {
      "duty": "Practice safe and efficient patient-centered care, identifying and escalating barriers and opportunities for improvement, and implementing process improvement strategies."
    },
    {
      "duty": "Engage in formal and informal peer and institutional review processes, and collaborate to create and implement quality improvement projects and evidence-based practice activities."
    },
    {
      "duty": "Conduct Purposeful Hourly Rounding (PHR) on assigned patients addressing the 4 Ps, and perform charge nurse duties as assigned."
    },
    {
      "duty": "Coordinate with the Clinical Coordinator/Clinical Nurse Manager to ensure supplies are appropriately utilized and inventory is sufficient for patient care, and escalate material or staffing resource deficits."
    },
    {
      "duty": "Document in compliance with hospital, regulatory, and legal requirements, facilitate patient throughput on a shift basis, and support clinical colleagues, patients, and their families."
    },
    {
      "duty": "Advance clinical competence in nursing practice, contribute to the environment of care, and serve as a professional role model and preceptor for new staff and students."
    },
    {
      "duty": "Contribute to the profession of nursing through participation in professional organizations and shared decision making, and acquire knowledge and skills relative to the role, patient population, clinical specialty, and local and/or global health community needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science with a major in nursing preferred. Associate degree in nursing is considered only with relevant experience and/or active matriculation in a BSN Program if approved by Chief Nursing Officer or designee."
    },
    {
      "credential": "Relevant clinical competence in area of nursing practice assigned; new graduates must possess current knowledge of the nursing process and its application."
    },
    {
      "credential": "Licensed as a registered nurse with current registration in New York State."
    },
    {
      "credential": "BCLS, NRP, ACLS, and PALS certifications."
    },
    {
      "credential": "Collective bargaining unit: NYSNA-MSH"
    }
  ]
}