{
  "meta": [
    {
      "job_title": "Maintenance Supervisor",
      "job_category": "Maintenance",
      "job_class": "Supervisor",
      "sector": "Facilities Maintenance",
      "salary": 48000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HVAC Repair",
      "experience": 5
    },
    {
      "skill": "Carpentry",
      "experience": 5
    },
    {
      "skill": "Plumbing",
      "experience": 5
    },
    {
      "skill": "Electrical Work",
      "experience": 5
    },
    {
      "skill": "Maintenance Planning",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Computer Literacy",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise maintenance staff and closely monitor general maintenance of building(s) including carpentry, electrical work, HVAC, plumbing, mechanic, painting, flooring, patching, general hardware, and minor building repairs."
    },
    {
      "duty": "Maintain a safe and secure environment throughout the building(s) and supervise, train, and direct maintenance staff through work orders."
    },
    {
      "duty": "Assess repair needs, estimate the time needed for repair, and monitor the functions of service contractors and building repair and maintenance contractors."
    },
    {
      "duty": "Plan, monitor and appraise job results, coach, counsel and discipline employees, and administer preventive/reactive maintenance schedule."
    },
    {
      "duty": "Complete reports/work orders of repairs (work needed), oversee or participate in construction, installation, and preventative maintenance of equipment, and request materials, tools, and supplies needed for a job."
    },
    {
      "duty": "Maintain disaster preparedness by identifying potential problems, developing response plans, and managing crises, perform maintenance replacement and repair in various areas."
    },
    {
      "duty": "On call availability for emergencies and projects as assigned by property manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalency preferred. Must possess strong maintenance and repair skills in HVAC, cooling towers, chillers, painting, carpentry, plumbing and electricity. 3-5 years general experience in building trades, repair and replacement maintenance or handy work. Computer literacy: Proficiency and working knowledge of Microsoft offices applications. Word, Excel spreadsheets, and e-mail."
    }
  ]
}