{
  "meta": [
    {
      "job_title": "Community Association Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Property Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Property Operations",
      "experience": 3
    },
    {
      "skill": "Team Management",
      "experience": 3
    },
    {
      "skill": "Critical Thinking",
      "experience": 3
    },
    {
      "skill": "Decision Making",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Hospitality",
      "experience": 3
    },
    {
      "skill": "Construction",
      "experience": 3
    },
    {
      "skill": "Florida Statutes",
      "experience": 3
    },
    {
      "skill": "Community Management",
      "experience": 3
    },
    {
      "skill": "Financial Management",
      "experience": 3
    },
    {
      "skill": "Physical Safety",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide management and leadership to assigned property and book of business."
    },
    {
      "duty": "Manage the functions of a team within a property while maintaining standards of excellence for processes, methods, and personnel."
    },
    {
      "duty": "Act as liaison to ensure quality service is delivered, that Board expectations are met and to assist in prompt response and resolution to questions/problems."
    },
    {
      "duty": "Maintain knowledge and understanding of the contract between the association and FirstService Residential. Ensure all contractual obligations are being met."
    },
    {
      "duty": "Conduct site inspections regularly, identify deficiencies and provide recommendations and action plans to improve the property."
    },
    {
      "duty": "Oversee all construction projects and ensure property maintenance/improvement and other related projects are completed on time and within budget."
    },
    {
      "duty": "Create, maintain, and upload a wide variety of information in our portal including but not limited to work orders, signed meeting minutes and Monthly Management Report."
    },
    {
      "duty": "Interview, select, recommend, hire, train and schedule assigned staff. Ensure proper coverage and staffing levels. Provide directions to staff and assist in the investigation and resolution of problems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business or related field Must be Certified and Licensed by the State of Florida for Community Association Management (CAM)"
    }
  ]
}