{
  "meta": [
    {
      "job_title": "Senior Compliance Analyst/Consultant",
      "job_category": "Compliance",
      "job_class": "Analyst",
      "sector": "Compliance",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Track newly created applications and drive ARA completion within 30 days."
    },
    {
      "duty": "Track existing applications that have not completed ARA’s within the past year. This includes reviewing ARA responses for quality & accuracy."
    },
    {
      "duty": "Sent out privacy alert emails to IS&T App Owner and business DRI when a new application completes an ARA has outstanding privacy action item to complete (e.g., define retention limits, PIA, Pribacy Portal onboarding)."
    },
    {
      "duty": "Provide Project Management and Guidance for the following Privacy initiatives that pop up due to requests from Privacy Legal."
    },
    {
      "duty": "Examples: PCF correctionsInput on setting up privacy alertsIdentify business owners and DRIs"
    },
    {
      "duty": "Wanted: Onboarding teams to privacy portalProviding data retention periodsQuality Assurance in ARAs"
    },
    {
      "duty": "Follow up on 3PC cloud account requests that indicate they have compliance impact. If an account is accurately tagged as in-scope in SAFE refer the team to Sayali to complete the CCRO."
    },
    {
      "duty": "Various Compliance initiatives that pop up due to requests from the compliance team."
    },
    {
      "duty": "Examples: Identify BNPL applications approach to encrypting PII data elements and ensure they complete an ARA accurately Compliance Review – Setting up application baselines in PlatoCloud controls – ensuring teams are meeting their cloud obligationsManaging Plato Administration (e.g., resetting passwords, adding new users, triggering annual review)"
    },
    {
      "duty": "Create and track tickets to validate the existing asset inventory for compliance applications (e.g., PCI, SOX, BNPL) for the annual scoping exercise for compliance applications"
    },
    {
      "duty": "Create and track Baseline assessment for in-scope tools in order to ensure administrative access is reviewed"
    },
    {
      "duty": "Create and track baseline assessments for in-scope applications (e.g., PCI, SOX, BNPL) in order to ensure administrative access is reviewed"
    },
    {
      "duty": "Security Compliance and Framework"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ]
}