{
  "meta": [
    {
      "job_title": "Global Program Manager, Commercial Operations",
      "job_category": "Global Program Management",
      "job_class": "Manager",
      "sector": "Operations",
      "salary": 140000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage program launches for the Johnson Controls Commercial Operations and drive lead generation for the EMEALA region."
    },
    {
      "duty": "Ensure each function manages their deliverables to meet the program schedule and budget."
    },
    {
      "duty": "Work with stakeholders across EMEALA to understand programs and identify opportunities for lead generation."
    },
    {
      "duty": "Collaborate with leaders across Global Products, EMEALA, Commercial Operations, Data and Analytics, and the Region Sales Teams to manage Commercial Programs."
    },
    {
      "duty": "Lead programs that drive EMEALA growth and operational effectiveness."
    },
    {
      "duty": "Lead team meetings, track progress, identify issues, and develop action plans."
    },
    {
      "duty": "Adhere to internal solution development process, hold team members accountable for deliverables, and manage issues, risks, and opportunities."
    },
    {
      "duty": "Document critical path, track schedule, and report on program status at regular reviews."
    },
    {
      "duty": "Participate in Phase Exits and obtain approval to exit the phase prior to starting work on the subsequent phase."
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Operations Management",
      "experience": 8
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 8
    },
    {
      "skill": "Financial Analysis",
      "experience": 8
    },
    {
      "skill": "Risk Management",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Engineering, Business, or a related field (Master's preferred)"
    }
  ]
}