{
  "meta": [
    {
      "job_title": "Commissioning & Qualification Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide engineering support for media preparation, harvest capture, and clarification, buffer preparation, clean-in-place systems, and manufacturing support equipment."
    },
    {
      "duty": "Participate in Factory Acceptance Testing (FAT) and Commissioning and Qualification (C&Q) throughout the project lifecycle."
    },
    {
      "duty": "Perform systems and P&ID Walkdowns, commission equipment, and provide Equipment Turnover Packages (ETOPs)."
    },
    {
      "duty": "Conduct spray coverage testing, cleaning verification swabbing, and sample submission practices."
    },
    {
      "duty": "Offer process engineering support for clean water systems, CIP, SIP, and pharmaceutical process equipment."
    },
    {
      "duty": "Write and execute Factory Acceptance Tests (FATs), Commissioning, Installation Qualification (IQ), Operational Qualification (OQ), Performance Qualification (PQ), and cycle development protocols."
    },
    {
      "duty": "Assist the project lead in project delivery and project management processes to ensure completion within timeline and budget."
    },
    {
      "duty": "Promote cGMP and regulatory compliance into assigned projects."
    },
    {
      "duty": "Review and modify standard operating procedures (SOPs) for various equipment."
    },
    {
      "duty": "Document, monitor, and report on project deliverables."
    },
    {
      "duty": "Manage project documentation such as protocols, reports, calibration certificates, and process trends."
    }
  ],
  "skills": [
    {
      "skill": "Media Preparation",
      "experience": 5
    },
    {
      "skill": "Commissioning and Qualification",
      "experience": 5
    },
    {
      "skill": "Process Engineering",
      "experience": 5
    },
    {
      "skill": "Factory Acceptance Testing (FAT)",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "cGMP and Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Standard Operating Procedures (SOPs)",
      "experience": 5
    },
    {
      "skill": "Documentation Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree or higher in chemical engineering or a related engineering or scientific discipline, or significant related experience."
    }
  ]
}