{
  "meta": [
    {
      "job_title": "Assistant Coordinating Manager",
      "job_category": "Administration",
      "job_class": "Manager",
      "sector": "Administration",
      "salary": 62000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assembles, maintains and secures all information in a confidential manner."
    },
    {
      "duty": "Ensures deadlines are met in regards to projects/reports."
    },
    {
      "duty": "Demonstrates the ability to recognize knowledge barriers and utilize appropriate resources."
    },
    {
      "duty": "Verifies accuracy of information/mail processing and distribution."
    },
    {
      "duty": "Demonstrates the ability to communicate instructions and requests to staff in a courteous respectful manner."
    },
    {
      "duty": "Type minutes/agendas/memos for committee meetings."
    },
    {
      "duty": "Performs clerical duties such as copying and filing."
    },
    {
      "duty": "Responsible for making out four-part requisitions for ordering supplies."
    },
    {
      "duty": "Assists Director with reports and special projects."
    },
    {
      "duty": "Direct calls to proper areas."
    },
    {
      "duty": "Proficient in Microsoft Word, Excel, and PowerPoint."
    },
    {
      "duty": "Demonstrates the ability to maintain databases and create graphs."
    },
    {
      "duty": "Ability to maintain Director’s appointment schedule."
    },
    {
      "duty": "Demonstrates flexibility and is ready, willing and able to advance skills."
    },
    {
      "duty": "Demonstrates professional demeanor at all times."
    },
    {
      "duty": "Works well with others and exemplifies team spirit."
    },
    {
      "duty": "Maintain unit time sheets."
    },
    {
      "duty": "Data entry."
    },
    {
      "duty": "Maintains Departmental Budget expenditure Records and spreadsheets."
    },
    {
      "duty": "Maintain time keeping records."
    },
    {
      "duty": "All other duties as assigned."
    }
  ],
  "education_certification": [
    {
      "credential": "A Baccalaureate Degree from an accredited college or university in Business Administration, Community Health, Psychology or related discipline with one year of full-time experience in a supervisory or administrative capacity in business management systems, general administration, health care and medical/patient systems administration; or, A satisfactory combination of education, training and experience."
    }
  ]
}