{
  "meta": [
    {
      "job_title": "Production Supervisor",
      "job_category": "Manufacturing",
      "job_class": "Supervisor",
      "sector": "Manufacturing",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Lean Manufacturing Principles",
      "experience": 5
    },
    {
      "skill": "Recruiting and Training Experience",
      "experience": 5
    },
    {
      "skill": "ERP Software",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervising daily operations of the production floor to ensure safety, quality, and production goals are met."
    },
    {
      "duty": "Analyzing the production schedule and adjusting team member assignments to meet production targets."
    },
    {
      "duty": "Coaching and developing team members, making employment decisions, and resolving issues through conflict resolution."
    },
    {
      "duty": "Inspecting raw materials prior to changeovers and performing quality checks after changeovers to prevent non-conforming product."
    },
    {
      "duty": "Collaborating with the Maintenance Department to resolve downtime occurrences on the production lines."
    },
    {
      "duty": "Completing shift reports for production numbers, downtime, attendance, and quality checks for submission to the Production Manager."
    },
    {
      "duty": "Adhering to safety programs, guidelines, rules, regulations, Good Manufacturing Practices, and Food Safety Standards."
    },
    {
      "duty": "Developing, recommending, and implementing measures to improve production methods, equipment performance, and product quality."
    },
    {
      "duty": "Monitoring and reviewing assigned team members' time and attendance for accuracy."
    },
    {
      "duty": "Working 12-hour shifts, day or night, on a rotating 2-2-3 schedule or as dictated by production demand."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED, Associate's Degree preferred"
    }
  ]
}