{
  "meta": [
    {
      "job_title": "Technical Program Manager",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Program and Product Management",
      "experience": 10
    },
    {
      "skill": "Product Development",
      "experience": 10
    },
    {
      "skill": "Strategic Leadership",
      "experience": 10
    },
    {
      "skill": "Process Management",
      "experience": 10
    },
    {
      "skill": "Relationship Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide strategic leadership to deliver against critical business goals tied to products and programs."
    },
    {
      "duty": "Build a world-class team of program and product managers to drive business engagement and expand core product management capabilities."
    },
    {
      "duty": "Manage product releases and prioritize delivery of mission-critical programs."
    },
    {
      "duty": "Develop product cost models and analytics to benchmark services vs market."
    },
    {
      "duty": "Provide governance, process, and program management for work intake into service pillars."
    },
    {
      "duty": "Identify and mitigate technical risks throughout the delivery life cycle."
    },
    {
      "duty": "Lead business discussions and strategy alignment for global workload service direction."
    },
    {
      "duty": "Develop and maintain relationships with external vendors and service providers."
    },
    {
      "duty": "Ensure products meet all security requirements and comply with external regulations."
    },
    {
      "duty": "Participate in the development and review of IT budgets."
    },
    {
      "duty": "Provide leadership, supervision, coaching, and guidance across team in achievement of internal priorities and goals."
    },
    {
      "duty": "Partner with IT leadership, business unit leaders, and service providers to provide strategic solutions and operational efficiencies."
    },
    {
      "duty": "Work with product owners across the businesses to understand market needs & vision and quickly translate that vision into capabilities."
    },
    {
      "duty": "Drive increased efficiency across the teams, eliminating duplication, and leveraging product and technology reuse."
    },
    {
      "duty": "Establish vision, identifies and champions best practices, tools, and ideas to improve execution and quality."
    },
    {
      "duty": "Drive an organization of efficiency, accountability, and ownership."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 140,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Computer Science, STEM Majors, or related (Master’s preferred)"
    }
  ]
}