{
  "meta": [
    {
      "job_title": "Ambulatory Care Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Nursing Practice",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Clinical Compliance",
      "experience": 5
    },
    {
      "skill": "Health Education",
      "experience": 5
    },
    {
      "skill": "Coordination",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Emergency Care",
      "experience": 5
    },
    {
      "skill": "Medical Regimens",
      "experience": 5
    },
    {
      "skill": "Record Keeping",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the coordination, integration, communication, implementation and evaluation of nursing practice and clinical policies and procedures."
    },
    {
      "duty": "Participate in site and organizational quality and performance improvement activities."
    },
    {
      "duty": "Collect patient healthcare data systematically using appropriate assessment techniques and instruments."
    },
    {
      "duty": "Develop patient-centered plans of care that prescribe interventions to attain expected outcomes."
    },
    {
      "duty": "Provide comprehensive care including administration of treatments and medication, disease prevention guidance, and rehabilitation care."
    },
    {
      "duty": "Assess and monitor patient responses to various treatments, procedures, and anesthesia."
    },
    {
      "duty": "Perform physical examinations, diagnostic tests, and onsite testing (e.g., POC lab testing, EKG, specimen collection)."
    },
    {
      "duty": "Record patient health history and information in electronic health record."
    },
    {
      "duty": "Administer medications, provide comprehensive wound care, and perform phone and in-person patient triage for clinical concerns."
    },
    {
      "duty": "Support patient care in a healing, humane, and caring environment."
    },
    {
      "duty": "Coordinate and facilitate patient care with other health care providers."
    },
    {
      "duty": "Implement interventions identified in the plan of care and educate patients and families for healthy adjustment to new or changed health patterns."
    },
    {
      "duty": "Measure and report on the performance of patient care, using data-driven insights to continuously improve care practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Baccalaureate degree in Nursing is highly preferred; a Diploma or Associates Degree in Nursing requires a minimum of one year experience in conjunction with plans to earn a baccalaureate degree required. Current Registered Professional Nurse in New York licensure is required. BCLS is also required."
    }
  ]
}