{
  "meta": [
    {
      "job_title": "Technical Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Science and Engineering",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Leadership",
      "experience": 10
    },
    {
      "skill": "Risk Mitigation",
      "experience": 10
    },
    {
      "skill": "Compliance",
      "experience": 10
    },
    {
      "skill": "Process Development",
      "experience": 10
    },
    {
      "skill": "Pharmaceutical Industry Knowledge",
      "experience": 10
    },
    {
      "skill": "Communication Liaison",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Validation",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the development of improved product transfer processes and ensure effective commercialization of products."
    },
    {
      "duty": "Act as the primary interface between Manufacturing and the sending organization to drive effective communication and expedient execution at all stages of the project."
    },
    {
      "duty": "Work closely with all stakeholders in strategic planning to ensure that project activities are progressing according to established timeline."
    },
    {
      "duty": "Minimize potential for issues or impact of issues during the manufacturing process transfer."
    },
    {
      "duty": "Provide suggestions and guidance to ensure commercial viability, efficiency, and quality are considered in process design."
    },
    {
      "duty": "Collaborate with Validation group to transfer knowledge from Technical Transfer batches and ensure a successful validation campaign."
    },
    {
      "duty": "Write campaign summary reports and develop commercial records in collaboration with process scientists."
    },
    {
      "duty": "Analyze data from Technical Transfer batches and make recommendations for establishing a commercial process."
    },
    {
      "duty": "Provide leadership for technical transfer procedure, ensure projects adhere to the tech transfer procedure, and make process improvements as needed."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of Bachelor’s degree in science or engineering with at least 10 years of experience. Master’s degree in science or engineering with at least 5 years of experience. Doctorate degree in science or engineering with at least 2 years of experience."
    }
  ]
}