{
  "meta": [
    {
      "job_title": "Server",
      "job_category": "Hospitality",
      "job_class": "Entry-Level",
      "sector": "Hospitality",
      "salary": 25000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Food and Beverage Knowledge",
      "experience": 2
    },
    {
      "skill": "Cashiering",
      "experience": 2
    },
    {
      "skill": "Health and Safety Compliance",
      "experience": 2
    },
    {
      "skill": "POS System Operation",
      "experience": 2
    },
    {
      "skill": "Table Setting and Clearing",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Stress Management",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Take customer's food and drink orders, serve food and beverages, prepare itemized checks, and sometimes accept payments."
    },
    {
      "duty": "Escort guests to tables, serve customers seated at counters, set up and clear tables, or operate a cash register."
    },
    {
      "duty": "Check the identification of patrons to ensure they meet the minimum age requirement for the purchase of alcohol."
    },
    {
      "duty": "Comply with Aimbridge Hospitality standards and regulations to encourage safe and efficient hotel operations."
    },
    {
      "duty": "Be familiar with the organization of the restaurant and lounge and know the function of each job position."
    },
    {
      "duty": "Service guests with all food and beverage requirements in a warm, friendly, courteous, and professional manner."
    },
    {
      "duty": "Clear, clean, and reset tables as needed."
    },
    {
      "duty": "Be familiar with the operation of the P.O.S. system."
    },
    {
      "duty": "Carry out cashiering functions in closing checks and end of shift paperwork."
    },
    {
      "duty": "Perform opening and closing procedures and side work duties according to station rotation assignment."
    },
    {
      "duty": "Ensure that tables and side stands are kept stocked, tidy, and clean."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent. Alcohol Awareness Certification and Food Handlers certification required."
    }
  ]
}