{
  "meta": [
    {
      "job_title": "Registered Nurse, Peds CCVCU, Night Shift",
      "job_category": "Healthcare",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Assessment",
      "experience": 10
    },
    {
      "skill": "Care Planning",
      "experience": 10
    },
    {
      "skill": "Patient Care",
      "experience": 10
    },
    {
      "skill": "Interdisciplinary Collaboration",
      "experience": 10
    },
    {
      "skill": "Quality Improvement",
      "experience": 10
    },
    {
      "skill": "Documentation",
      "experience": 10
    },
    {
      "skill": "Patient Education",
      "experience": 10
    },
    {
      "skill": "Progress Evaluation",
      "experience": 10
    },
    {
      "skill": "Safe Patient Care",
      "experience": 10
    },
    {
      "skill": "Nursing Standards",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Carry out patient care responsibilities using the nursing process, including assessment, diagnosis, planning, implementation, and evaluation."
    },
    {
      "duty": "Formulate initial plan of care with the physician/nurse practitioner and collaborate to implement a comprehensive patient-centered plan of care."
    },
    {
      "duty": "Analyze unit level quality data and participate in improvement efforts to achieve organizational goals within the quality and safety performance improvement plan."
    },
    {
      "duty": "Direct patient/family and interdisciplinary team to identify a plan of care and outcomes that are realistic and measurable."
    },
    {
      "duty": "Educate the patient/family regarding health status and established plan of care."
    },
    {
      "duty": "Evaluate patient's progress towards expected outcomes and modify interventions as needed."
    },
    {
      "duty": "Coordinate and direct unit activities to provide patient care in a healing, humane, and caring environment."
    },
    {
      "duty": "Organize staff assignments to ensure appropriate delegation of activities."
    },
    {
      "duty": "Serve as a support, resource, and preceptor for nursing staff and students."
    },
    {
      "duty": "Adhere to patient care and nursing standards, and use clinical practice guidelines."
    },
    {
      "duty": "Participate in standard development and practice evaluation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Current Registered Professional Nurse in New York, Bachelors degree in Nursing required, Basic Life Support Certification through the American Heart Association, Fluent written and spoken English language skills."
    }
  ]
}