{
  "meta": [
    {
      "job_title": "Area Leader",
      "job_category": "Management",
      "job_class": "Leader",
      "sector": "Retail",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Sales and Profit Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Coaching and Development",
      "experience": 5
    },
    {
      "skill": "Merchandising",
      "experience": 5
    },
    {
      "skill": "Marketing Campaigns",
      "experience": 5
    },
    {
      "skill": "Recruiting and Hiring",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "Retail Operations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Directly drive sales and profits for a multi-unit area of store locations."
    },
    {
      "duty": "Oversee and ensure that the overall condition of all stores comply with company standards."
    },
    {
      "duty": "Foster a coaching environment where team members want to excel and are recognized for their achievements."
    },
    {
      "duty": "Conduct regular store visits to ensure compliance with all company policies and procedures."
    },
    {
      "duty": "Engage with merchandising team to suggest ways to increase sales, expand markets, and promote business."
    },
    {
      "duty": "Plan and implement marketing campaigns and sales promotions."
    },
    {
      "duty": "Monitor all store activities to ensure exceptional customer service and operational excellence."
    },
    {
      "duty": "Build strong, sales-focused teams through recruiting, hiring, training, and coaching."
    },
    {
      "duty": "Coaches and supervises team members in all store responsibilities."
    },
    {
      "duty": "Ensures all human resources policies and procedures are timely and accurately administered."
    },
    {
      "duty": "Encourages and champions multi-unit store locations in providing friendly customer service."
    },
    {
      "duty": "Ensures store operations are current on product offerings and promotions."
    },
    {
      "duty": "Follows company dress code standards as applicable to Area Leaders."
    },
    {
      "duty": "Performs any other duties as needed for effective and efficient operations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED required, bachelor’s degree preferred"
    }
  ]
}