{
  "meta": [
    {
      "job_title": "Registered Nurse (RN) ICU (Critical Care) The Jewish Hospital",
      "job_category": "Healthcare",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Nursing",
      "experience": 5
    },
    {
      "skill": "Patient Assessment",
      "experience": 5
    },
    {
      "skill": "Treatment Implementation",
      "experience": 5
    },
    {
      "skill": "Clinical Judgement",
      "experience": 5
    },
    {
      "skill": "Medication Administration",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "ACLS",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Utilizing strong organizational and leadership skills to assess patient status and determine the priority of the patient’s problems and needs."
    },
    {
      "duty": "Implementing clinical nursing interventions to acute, critical patients that require intensive medical care."
    },
    {
      "duty": "Developing and performing patient care plans to enhance and improve outcomes."
    },
    {
      "duty": "Ensuring a safe and therapeutic environment."
    },
    {
      "duty": "Conducts and analyzes initial and ongoing patient assessment, creates a plan of care, implements treatment, and evaluates treatment effectiveness."
    },
    {
      "duty": "Synthesizes and prioritizes information in order to take immediate and decisive evidence-based, patient-focused action using clinical judgement and clinical inquiry."
    },
    {
      "duty": "Anticipates and responds with confidence and adapts to rapidly changing patient conditions."
    },
    {
      "duty": "Administer medications in a safe manner consistent with the State of Practice and the organization’s policies and procedures."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science Nursing (preferred, not required)"
    },
    {
      "credential": "Current state licensure as a Registered Nurse (RN)"
    },
    {
      "credential": "Basic Life Support (BLS) – American Heart Association (preferred, not required)"
    },
    {
      "credential": "ACLS Advanced Cardiac Life Support (required within 6 months of hire)"
    }
  ]
}