{
  "meta": [
    {
      "job_title": "RN - Operating Room",
      "job_category": "Healthcare",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Professional Nursing",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Operating Room Circulating",
      "experience": 5
    },
    {
      "skill": "Scrub Experience",
      "experience": 5
    },
    {
      "skill": "Care Delegation",
      "experience": 5
    },
    {
      "skill": "Specialty Certification",
      "experience": 5
    },
    {
      "skill": "BLS Certification",
      "experience": 5
    },
    {
      "skill": "ACLS Certification",
      "experience": 5
    },
    {
      "skill": "Interpersonal Relationship",
      "experience": 5
    },
    {
      "skill": "Computer Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide professional nursing direct patient care in compliance with professional practice and unit standards."
    },
    {
      "duty": "Assess, plan, implement and evaluate patient care needs and document patient care in the healthcare record according to established standards."
    },
    {
      "duty": "Direct and delegate care to other team members in accordance with their education, credentials, and demonstrated competence."
    },
    {
      "duty": "Ensure own professional effectiveness through education and professional development."
    },
    {
      "duty": "Participate in the development of and maintain established hospital policies, procedures and objectives, quality improvement, safety, environmental and infection prevention program."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an approved school of nursing required. BSN preferred. Specialty certification preferred."
    },
    {
      "credential": "Minimum of 2 years experience operating room circulating experience in an acute care setting required or successful completion of a Period 101 course within 6 months. Scrub experience preferred."
    },
    {
      "credential": "Current Registered Nurse licensure in the state in which nurse will be practicing at date of hire. Current BLS (Basic Life Support) certification required at date of hire. ACLS certification may be required."
    },
    {
      "credential": "Demonstrated ability to promote positive interpersonal relationships and patient/family centered work environment. Able to support and interpret medical center philosophy, policy and procedures. Basic computer skills."
    }
  ]
}