{
  "meta": [
    {
      "job_title": "Technical Program Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technical Program Management",
      "experience": 10
    },
    {
      "skill": "Product Management",
      "experience": 10
    },
    {
      "skill": "Business Engagement",
      "experience": 10
    },
    {
      "skill": "Product Cost Modeling",
      "experience": 10
    },
    {
      "skill": "Analytics",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Vendor Management",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "IT Leadership",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Digital Transformation",
      "experience": 10
    },
    {
      "skill": "Security and Compliance",
      "experience": 10
    },
    {
      "skill": "Stakeholder Management",
      "experience": 10
    },
    {
      "skill": "Process Improvement",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide strategic leadership to deliver against critical business goals tied to the products and programs in the cloud, data center, server, and storage services."
    },
    {
      "duty": "Build a world-class team of program and product managers to drive business engagement, expand core product management capabilities, and prioritize delivery of mission-critical programs."
    },
    {
      "duty": "Manage product releases and prioritization based on business strategy."
    },
    {
      "duty": "Develop product cost models and analytics to be able to benchmark services vs market."
    },
    {
      "duty": "Provide governance, process, and program management for work intake into service pillars."
    },
    {
      "duty": "Proactively identify and mitigate technical risks throughout the delivery life cycle."
    },
    {
      "duty": "Lead business discussion and strategy alignment for global workload service direction."
    },
    {
      "duty": "Develop and maintain relationships with external vendors and service providers."
    },
    {
      "duty": "Partner with security and compliance functions to ensure products meet all security requirements."
    },
    {
      "duty": "Participate in the development and review of IT budgets."
    },
    {
      "duty": "Provide leadership, supervision, coaching, and guidance across the team in achievement of internal priorities and goals."
    },
    {
      "duty": "Partner with IT leadership, business unit leaders, and service providers to provide strategic solutions and operational efficiencies."
    },
    {
      "duty": "Work with product owners across the businesses to understand market needs & vision; quickly translate that vision into capabilities."
    },
    {
      "duty": "Drive increased efficiency across the teams, eliminating duplication, leveraging product and technology reuse."
    },
    {
      "duty": "Establish vision, identifies and champions internal/external best practices, tools, and ideas to improve execution and quality."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in computer science or in STEM Majors (Science, Technology, Engineering, and Math) or related."
    },
    {
      "credential": "Minimum 10+ years of experience in the software/technology domain or a master’s degree with 6 years of experience."
    },
    {
      "credential": "Minimum 5 years of experience in a product leadership / management role."
    },
    {
      "credential": "GE Leadership Program Graduates will get credit towards relevant work experience, commensurate to the program they have completed."
    }
  ]
}