{
  "meta": [
    {
      "job_title": "Patient Access Associate",
      "job_category": "Healthcare",
      "job_class": "Support Staff",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Interview patients to obtain necessary identification information and prepare required forms for treatment, billing, or record release authorization."
    },
    {
      "duty": "Apply ID bands to patients, have contact with insurance companies, and educate patients about Advance Directives and Charity Care when necessary."
    },
    {
      "duty": "Enter arriving patients into the computer system for processing and throughput, and represent various ancillary areas as a liaison between patients and staff."
    },
    {
      "duty": "Assist departments with projects and various duties deemed by Management staff."
    },
    {
      "duty": "Obtain correct identification information, demographic, guarantor, and insurance coverage. Enter necessary information for payment and scan documents into the Electronic Document Imaging."
    },
    {
      "duty": "Interpret Payor Website, E-paces, HDX, and enter responses into the registration system. Obtain authorizations, referrals, and per-certs for payments."
    },
    {
      "duty": "Ensure appropriate explanations, consents, and authorizations are signed, documented, and distributed to relevant locations."
    },
    {
      "duty": "Attach I.D. bands to patients according to medical center policy, offer a copy of the Patient Bill Of Rights, review Advance Directives, and advise patients of valuable policies and services."
    },
    {
      "duty": "Accurately enter physician orders into the computer system, collect payments, issue receipts, and balance daily receipts and transactions."
    },
    {
      "duty": "Utilize RAS reports to facilitate patient movement, check and compare patient data for accuracy, and communicate movements with relevant staff."
    },
    {
      "duty": "Attend and participate in departmental staff meetings, demonstrate knowledge of departmental projects, and show a teamwork ethic."
    },
    {
      "duty": "Assist patients with applying or securing insurance coverage, demonstrate knowledge of Patient Access Emergency Management process, OAS/Invasion, and system downtime procedures."
    },
    {
      "duty": "Demonstrate excellent customer service skills, knowledge of systems, and uphold departmental dress policy."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 20,
      "student_teacher": 80,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalency. Understanding of Medical Terminology."
    }
  ]
}