{
  "meta": [
    {
      "job_title": "Health Insurance Supervisor",
      "job_category": "Insurance",
      "job_class": "Supervisor",
      "sector": "Insurance",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Health Insurance Experience",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Regulatory Knowledge",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise, coach, develop, train, and evaluate staff in the Bureau’s Life and Health Forms section."
    },
    {
      "duty": "Review accident and sickness form submissions and provide support to staff with their assigned form reviews."
    },
    {
      "duty": "Coordinate and monitor workload, training staff, auditing staff form reviews, conducting performance evaluations, and preparing reports."
    },
    {
      "duty": "Provide comments and advice on policy implications and technical health insurance issues, and support related projects."
    },
    {
      "duty": "Communicate with regulators, industry personnel, and the public in response to information requests and reviews of staff decisions."
    },
    {
      "duty": "Maintain effective working relationships with SCC staff, industry personnel, and other state agencies."
    },
    {
      "duty": "Ensure compliance with Virginia Insurance and Administrative Codes and determine applicability to submitted form and rate filings."
    },
    {
      "duty": "Attend job-related training and obtain related certifications and designations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Considerable professional experience with health insurance forms and products. A college degree is desirable, but not required."
    }
  ]
}