{
  "meta": [
    {
      "job_title": "Java Applications Developer",
      "job_category": "Software Development",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, develop, and test software solutions supporting insurance placement and policy management process using Java Spring framework technology."
    },
    {
      "duty": "Develop software focusing on code quality using test automation and following the organization’s standard development and testing practices."
    },
    {
      "duty": "Build application deployment artifacts, test (unit, functional, security vulnerability, and performance) and deploy using automated pipelines providing continuous integration and continuous delivery."
    },
    {
      "duty": "Collaborate closely with Agile development team members, Product Owners, and business users to deliver business value."
    },
    {
      "duty": "Proactively contribute to system architecture and technical stack design, software development toolset, Agile, and DevOps practices."
    },
    {
      "duty": "Responsible for creating the low-level detail design, coding it, and testing the product for functionality and errors, while ensuring that user needs, performance requirements, and security standards are met."
    },
    {
      "duty": "Code, test and debug software programs and meet project plan goals under limited guidance from senior software developers."
    },
    {
      "duty": "Work independently to design and develop small technical modules."
    },
    {
      "duty": "Assist with repairing coding problems."
    },
    {
      "duty": "Provide technical support to clients on existing problems escalated as appropriate."
    },
    {
      "duty": "Provide support through a help desk; monitor trends and result from technical support calls to advise senior team members on performance of existing systems."
    },
    {
      "duty": "Act as a technical resource for other analysts on the team."
    },
    {
      "duty": "Work with team to develop project plans and communicate software development plans."
    }
  ],
  "skills": [
    {
      "skill": "Java",
      "experience": 2
    },
    {
      "skill": "Springboot",
      "experience": 2
    },
    {
      "skill": "REST API",
      "experience": 2
    },
    {
      "skill": "JSON",
      "experience": 2
    },
    {
      "skill": "Oracle",
      "experience": 2
    },
    {
      "skill": "MongoDB",
      "experience": 2
    },
    {
      "skill": "JavaScript",
      "experience": 2
    },
    {
      "skill": "Hibernate",
      "experience": 2
    },
    {
      "skill": "Maven",
      "experience": 2
    },
    {
      "skill": "Gradle",
      "experience": 2
    },
    {
      "skill": "Agile Scrum",
      "experience": 2
    },
    {
      "skill": "Unit Testing (Junit, Mockito)",
      "experience": 2
    },
    {
      "skill": "Sonar",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or foreign equivalent in Computer Science, Information Technology, or a related field plus two (2) years of experience in the position offered or as a Software Developer, System Analyst, Programmer, or a related position."
    },
    {
      "credential": "Certification in Agile Scrum methodology is preferred."
    }
  ]
}