{
  "meta": [
    {
      "job_title": "Product Design and Development Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Manufacturing",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Product Design",
      "experience": 5
    },
    {
      "skill": "SolidWorks or 3D Design",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Mathematics and Design Principles",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and collaborate with Sales, Manufacturing, and Engineering teams in creating new designs and improving existing designs for high-quality and cost-effective product manufacturing."
    },
    {
      "duty": "Analyze market research and develop design concepts and proposals for various projects."
    },
    {
      "duty": "Conduct design reviews and manage multiple product development projects concurrently for timely delivery to the market."
    },
    {
      "duty": "Maintain professional and technical knowledge by attending workshops, reviewing publications, and participating in professional societies."
    },
    {
      "duty": "Frequently interface with customers to determine their needs and expectations, and fabricate samples of working models for demonstration."
    },
    {
      "duty": "Champion the use of Lean Manufacturing and Six Sigma principles for continuous improvement and prepare status updates on product development and design concepts."
    },
    {
      "duty": "Maintain and coordinate activities to ensure vital operational metrics and prepare product training sessions for new employees."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Engineering or a related field required, preferably a Bachelor of Science in Mechanical Engineering (MSME). Must have a passion for continuous learning and professional development. In lieu of a degree, significant experience in a related industry or equivalent education may be considered."
    }
  ]
}