{
  "meta": [
    {
      "job_title": "Materials Coordinator",
      "job_category": "Logistics",
      "job_class": "Coordinator",
      "sector": "Manufacturing",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Forklift Operation",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 4
    },
    {
      "skill": "Quality Assurance",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitor and maintain freight and logistics operations, ensuring adherence to safety and quality policies."
    },
    {
      "duty": "Coordinate loading, unloading, and documentation of freight, providing materials for manufacturing while maintaining inventory levels."
    },
    {
      "duty": "Lead and assist with the training of team members, enforcing safety and quality standards."
    },
    {
      "duty": "Control man-hours, plan and execute daily work, and coordinate activities with other departments for efficient logistics operations."
    },
    {
      "duty": "Seek and develop new processes to improve productivity and customer satisfaction, while ensuring compliance with safety policies."
    },
    {
      "duty": "Provide leadership in creating and maintaining a safe work environment, enforcing safe work practices and achieving safety goals."
    },
    {
      "duty": "Set objectives and standards for team members, providing tools, training, and support, and promoting effective communication and teamwork within the department."
    },
    {
      "duty": "Maintain continual effective communication with associates, perform performance coaching and counseling, and adhere to legal and company policies and procedures."
    },
    {
      "duty": "Perform physical tasks such as lifting, standing for extended periods, bending, reaching, and climbing ladders as required in a manufacturing environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent GED preferred."
    },
    {
      "credential": "Forklift certification training required."
    },
    {
      "credential": "Prior supervisory experience preferred but not required."
    }
  ]
}