{
  "meta": [
    {
      "job_title": "Associate Manager, Regulatory Compliance",
      "job_category": "Regulatory Compliance",
      "job_class": "Manager",
      "sector": "Compliance",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Legal Research",
      "experience": 5
    },
    {
      "skill": "Health Insurance Regulations",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and manage the Regulatory Compliance Team to ensure compliance matters are addressed within specified timelines and regulations."
    },
    {
      "duty": "Maintain required business licenses in a constantly changing regulatory environment and escalate concerns and potential risks to supervisor while presenting solutions."
    },
    {
      "duty": "Communicate externally with regulatory authorities to understand and negotiate enforcement expectations, as well as educate external contacts regarding unique aspects of the company's business practices."
    },
    {
      "duty": "Inform department leadership of all compliance issues, including legislative developments, and supervise the functions of the Compliance Coordinator(s) while ensuring compliance with department standards, company policy, accreditation standards, and state and Federal law."
    },
    {
      "duty": "Monitor legislative and regulatory activity impacting company operations, complete detailed legislative and regulatory reports, and provide information and direction to various departments and the regulatory compliance team."
    },
    {
      "duty": "Demonstrate subject matter expertise on regulatory enforcement expectations in a constantly evolving regulatory environment, and ensure the maintenance, review, and development of policy, procedures, and forms related to department processes."
    },
    {
      "duty": "Administer the Regulatory Report Workgroup, support the Compliance Coordinator, and represent the department at Key Process Team, Workgroup, and Corporate Compliance Committee meetings."
    },
    {
      "duty": "Assist with training of new employees, training for other department staff, and development of department procedures and protocols, as well as updating and completing compliance status reports and risk assessments for company operations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in English or equivalent; Paralegal Degree and/or Certificate or law degree, helpful."
    },
    {
      "credential": "Minimum of 3 years’ experience with maintaining managed care related licenses and monitoring related regulatory compliance in a health insurance environment."
    },
    {
      "credential": "Understanding of Department of Insurance, Department of Health Insurance Law, and/or Health Care Law preferred."
    },
    {
      "credential": "Excellent research skills and strong analytical and writing skills."
    },
    {
      "credential": "Demonstrated ability to manage and lead a small team."
    }
  ]
}