{
  "meta": [
    {
      "job_title": "Packaging Specialist",
      "job_category": "Manufacturing",
      "job_class": "Specialist",
      "sector": "Manufacturing",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Packaging Support",
      "experience": 5
    },
    {
      "skill": "Materials Management",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "Labeling Compliance",
      "experience": 5
    },
    {
      "skill": "Safety Protocols",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Environmental Responsibility",
      "experience": 5
    },
    {
      "skill": "Training",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate and execute support for packaging equipment to ensure reliable operation, accurate weights, operator training, and provide technical support for packaging materials and suppliers."
    },
    {
      "duty": "Manage inventory levels and ordering of packaging materials, ensuring adequate stock levels to support production demands. Coordinate finished goods shipping with end customer."
    },
    {
      "duty": "Perform visual inspections and quality checks on packaging materials and finished products to ensure they meet company standards and regulatory requirements, and minimize shipping damage."
    },
    {
      "duty": "Maintain accurate and detailed records of packaging processes, including batch numbers, lot codes, labels, finished goods inventory, truck load plans, and any deviations from standard operating procedures."
    },
    {
      "duty": "Ensure accurate and compliant labeling of products including hazard communication and transportation requirements."
    },
    {
      "duty": "Follow and enforce safety procedures, including the use of personal protective equipment (PPE), proper handling of finished goods, and safe operation of packaging equipment."
    },
    {
      "duty": "Collaborate with cross-functional teams to identify and implement process improvements that enhance efficiency, quality, and safety within the packaging operations."
    },
    {
      "duty": "Dispose of packaging waste and hazardous materials in accordance with environmental regulations, promoting sustainable practices within the facility. Develop and maintain spill response procedures and equipment."
    },
    {
      "duty": "Train and mentor packaging team members on proper packaging techniques, inventory tracking requirements, finished goods storage, vehicle loading process, safety protocols, and equipment operation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Packaging, Materials Management, or a related field (Master's preferred)"
    }
  ]
}