{
  "meta": [
    {
      "job_title": "HVAC Control Systems Technician",
      "job_category": "Skilled Trades",
      "job_class": "Technician",
      "sector": "Facility Operations",
      "salary": 46000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HVAC System Installation",
      "experience": 4
    },
    {
      "skill": "HVAC System Repair",
      "experience": 4
    },
    {
      "skill": "Control Systems Maintenance",
      "experience": 3
    },
    {
      "skill": "Equipment Operation",
      "experience": 3
    },
    {
      "skill": "Blueprint Reading",
      "experience": 3
    },
    {
      "skill": "Electrical Code Knowledge",
      "experience": 3
    },
    {
      "skill": "Preventative Maintenance",
      "experience": 3
    },
    {
      "skill": "Troubleshooting",
      "experience": 3
    },
    {
      "skill": "Material Ordering",
      "experience": 3
    },
    {
      "skill": "Record Maintenance",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Install, repair, and replace electric, electronic, and DDC heating, ventilation, and air conditioning (HVAC) control systems according to design drawings and/or specifications."
    },
    {
      "duty": "Perform preventative maintenance procedures on HVAC electric, electronic, and DDC control systems; diagnose control problems and overhaul, either individually or as part."
    },
    {
      "duty": "Locate and obtain components required for building electric, electronic, and DDC control systems."
    },
    {
      "duty": "Clean, maintain, safely operate, and properly store all tools and equipment."
    },
    {
      "duty": "Observe and enforce all safety requirements related to equipment operation."
    },
    {
      "duty": "May perform or assist in the preparation of cost estimates, material orders, reports, and maintenance of records."
    },
    {
      "duty": "Work toward successfully completing all Skills Category training and tests for Building Control Systems Technician II."
    },
    {
      "duty": "May be required to respond to after-hours callouts for emergencies and/or to work during emergency closures or overtime."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High school diploma or an equivalent combination of education and experience from which comparable knowledge and abilities can be acquired is necessary."
    },
    {
      "credential": "Four years actual work experience and training, including the equivalent of apprenticeship or vocational training, in the HVAC controls trade OR 18 months' experience with completion of vocational education training in the desired field."
    },
    {
      "credential": "Ability to read blueprints, plans, drawings, wiring diagrams, and electrical codes."
    },
    {
      "credential": "Skill in maintenance and use of tools, equipment, and materials of applicable trade."
    },
    {
      "credential": "Ability on a daily basis to: Grasp, lift, carry and set down objects of moderate weight (50 lbs.) on a regular basis; Climb and work from ladders, scaffolding and staging on an occasional basis; Ability to get into and work in hot, moist, confined spaces on an occasional basis."
    },
    {
      "credential": "A valid State of Missouri Driver's License must be held and maintained by incumbents in the position."
    }
  ]
}