{
  "meta": [
    {
      "job_title": "Registered Nurse II - Stem Cell",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cellular Therapy",
      "experience": 5
    },
    {
      "skill": "Oncology Care",
      "experience": 5
    },
    {
      "skill": "Critical Care",
      "experience": 5
    },
    {
      "skill": "Patient Education",
      "experience": 5
    },
    {
      "skill": "Chemotherapy Administration",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assess, plan, and implement care for patients across the continuum of malignant hematology and stem cell transplantation."
    },
    {
      "duty": "Direct and oversee the care delivered by Patient Care Technicians and other healthcare team members."
    },
    {
      "duty": "Adhere to hospital and department infection control policies and effectively communicate with peers to resolve conflict."
    },
    {
      "duty": "Protect the patient's dignity, rights, and privacy."
    },
    {
      "duty": "Collaborate with physicians and other health care providers to provide direct and indirect care to patients."
    },
    {
      "duty": "Conduct and reinforce patient education, including treatment plan/regimen, symptom management, and available resources at home or at the facility."
    },
    {
      "duty": "Administer medications and care for patients with IV lines, central lines, and ports."
    },
    {
      "duty": "Read, interpret, and operate cardiac and other invasive and noninvasive monitors, recognize normal/abnormal rhythms/trends, and institute appropriate interventions within 6 months of hire."
    },
    {
      "duty": "Effectively communicate to manage complex patient and family needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associate Degree in Nursing or equivalent; Bachelor of Science in Nursing (BSN) preferred"
    },
    {
      "credential": "Basic Life Support (BLS) Certification, American Heart Association (AHA) training site, American Safety & Health Institute, or Red Cross BLS certification required upon hire."
    },
    {
      "credential": "Advanced Cardiovascular Life Support (ACLS) Certification, American Heart Association (AHA) ACLS certification required 30 days from the date of hire and renewed every two years."
    },
    {
      "credential": "Oncology Nursing Society (ONS) Fundamentals of Chemotherapy Immunotherapy/Biotherapy Provider Certificate preferred upon hire, required before completion of nursing orientation, with renewal every two years."
    },
    {
      "credential": "Oncology Nursing Society (ONS) Hematopoietic Stem Cell Transplantation course within 30 days of hire. Exempt with proof of previous ONS equivalent course or Blood & Marrow Transplant Certified Nurse (BMTCN) certification."
    }
  ]
}