{
  "meta": [
    {
      "job_title": "Front Desk Coordinator I",
      "job_category": "Admin",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs various clerical duties for office manager, or providers including: answering telephones, taking messages, scheduling appointments, copying, and creating/scanning charts."
    },
    {
      "duty": "Answer and screens high volume telephone calls in a courteous manner, and record messages for providers and other personnel."
    },
    {
      "duty": "Schedule patient appointments and procedures according to established policies and procedures."
    },
    {
      "duty": "Check-in patients upon arrival at the office as well as check-out upon departure."
    },
    {
      "duty": "Obtain accurate information from patients and ensure all registration forms are complete."
    },
    {
      "duty": "Collect patient and insurance payments and reconcile charges on a daily basis."
    },
    {
      "duty": "Verify account balances and refunds for accuracy. Provide information to patients regarding unpaid balances."
    },
    {
      "duty": "File records in appropriate sections of patient charts in EMR."
    },
    {
      "duty": "Prepare patient charts in advance and scan documents into charts in EMR. Transcribe letters and create forms as needed."
    },
    {
      "duty": "Maintain files and records in a confidential manner."
    },
    {
      "duty": "Maintain organization and efficiency of front office, including office supply inventory."
    },
    {
      "duty": "Maintain patient confidentiality."
    },
    {
      "duty": "Perform other related duties as directed or assigned."
    }
  ],
  "skills": [
    {
      "skill": "Answering Telephones",
      "experience": 2
    },
    {
      "skill": "Scheduling Appointments",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Patient Accounts",
      "experience": 2
    },
    {
      "skill": "Medical Office Experience",
      "experience": 2
    },
    {
      "skill": "EMR Systems",
      "experience": 2
    },
    {
      "skill": "Office Supply Inventory",
      "experience": 2
    },
    {
      "skill": "Confidentiality",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 100,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED"
    }
  ]
}