{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Nursing Process",
      "experience": 5
    },
    {
      "skill": "Healthcare Data Collection",
      "experience": 5
    },
    {
      "skill": "Patient Education",
      "experience": 5
    },
    {
      "skill": "Quality and Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Interdisciplinary Collaboration",
      "experience": 5
    },
    {
      "skill": "Progress Evaluation",
      "experience": 5
    },
    {
      "skill": "Language Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Carrying out patient care responsibilities with emphasis on decision-making related to the steps in the nursing process to include assessment, diagnosis, identification of expected outcomes, planning, implementation and evaluation."
    },
    {
      "duty": "Collecting, assessing and documenting patient healthcare data."
    },
    {
      "duty": "Involving patient/family and Interdisciplinary team to identify a plan of care and outcomes that are realistic and measurable."
    },
    {
      "duty": "Prioritizing care based upon data collected."
    },
    {
      "duty": "Documenting assessment and reassessment in medical records."
    },
    {
      "duty": "Implementing interventions in the coordination of patient care in a safe, timely and appropriate manner and applies escalation process."
    },
    {
      "duty": "Considering needs and behaviors of specific patient age groups and cultural groups in all patient care activities."
    },
    {
      "duty": "Educating the patient/family regarding health status and established plan of care."
    },
    {
      "duty": "Determining learning needs of the patient/family."
    },
    {
      "duty": "Evaluating the patient's progress towards expected outcomes."
    },
    {
      "duty": "Participating in and contributing to in unit activities to provide patient care in a healing, humane and caring environment."
    },
    {
      "duty": "Adhering to patient care and nursing standards in care delivery, and uses clinical practice guidelines (CPG)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Current Registered Professional Nurse in New York, Bachelors degree in Nursing preferred, Basic Life Support Certification through the American Heart Association, Fluent written and spoken English language skills."
    }
  ]
}