{
  "meta": [
    {
      "job_title": "Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Marketing",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 4
    },
    {
      "skill": "Budgeting",
      "experience": 4
    },
    {
      "skill": "Negotiation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive sales volume by motivating the Design Consultants through goal setting, promotions, sales meetings, coaching and participating in joint sales calls."
    },
    {
      "duty": "Monitor progress and success for each individual as well as the team. Create development plans for underperforming sales staff."
    },
    {
      "duty": "Review status of leads, appointments, and signings on a daily basis. Meet with the DC’s to review progress against their individual budgets once per month."
    },
    {
      "duty": "Work with the Lead Managers to ensure successful conversion of leads to appointments."
    },
    {
      "duty": "Ensure that the company sales platforms are being used by the sales team in the selling process; Sales Vision 20/20, company sanctioned proposals, etc."
    },
    {
      "duty": "Hire, train, and retain Design Consultants. Educate new hires in pool industry specifics as well as sales techniques, and other necessary administrative duties."
    },
    {
      "duty": "Assist in the development of annual sales and marketing budgets including sales goals and personnel and administrative requirements."
    },
    {
      "duty": "Prepare management reports for daily/weekly/monthly assessment of Leads, Appointments, Sales and Design Consultant performance."
    },
    {
      "duty": "Understand the competitive marketplace and equip the sales team to effectively sell against the competition."
    },
    {
      "duty": "Review permit data, if available, to project opportunities to sales team. Assist in the planning and implementation of advertising activities including print, electronic and direct mail."
    },
    {
      "duty": "Build and develop relationships with Builders, Real-estate agents, and community to drive sales."
    },
    {
      "duty": "Continually monitor daily sales to ensure division is meeting MI goal and adjusting pricing accordingly."
    },
    {
      "duty": "Directly supervises employees. Carries out supervisory responsibilities in accordance with the organization's policies and applicable laws."
    },
    {
      "duty": "Other projects and duties as required/assigned."
    },
    {
      "duty": "Follows company's policies and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required.5+ years of experience in sales, preferably in-home B to C.3+ years in sales management role supervising a commissioned-based sales team.2-4 years of Marketing experience."
    }
  ]
}