{
  "meta": [
    {
      "job_title": "Patient Access Associate",
      "job_category": "Healthcare",
      "job_class": "Associate",
      "sector": "Healthcare",
      "salary": 38000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Medical Terminology",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Insurance Knowledge",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Teamwork",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Interview patients to obtain necessary identification information and prepare required forms for treatment, billing, or record release authorization."
    },
    {
      "duty": "Contact insurance companies for information and educate patients about Advance Directives and Charity Care when necessary."
    },
    {
      "duty": "Assist various departments with projects and duties deemed by the Management staff."
    },
    {
      "duty": "Complete Medicare Secondary Payer Questionnaire when necessary and enter necessary data for payment."
    },
    {
      "duty": "Attach ID bands to patients following the two identifier rule and offer a copy of the Patient Bill Of Rights and the Addendum of the Patient Rights."
    },
    {
      "duty": "Document and distribute registration forms to various locations and enter physician orders into the computer system."
    },
    {
      "duty": "Collect and enter payments into the system, balance daily receipts, and work with departments to facilitate patient movement."
    },
    {
      "duty": "Assist patients with applying for insurance coverage through the New York State Market Place and provide Charity Care Education to eligible patients."
    },
    {
      "duty": "Demonstrate knowledge of Patient Access Emergency Management process and utilize downtime procedure in Patient Access areas."
    },
    {
      "duty": "Maintain professional and confidential telephone communication, attend departmental staff meetings, and demonstrate knowledge of yearly Performance Improvement projects."
    },
    {
      "duty": "Demonstrate team work ethic, assist coworkers, and maintain neat attire and positive attitude."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalency."
    }
  ]
}