{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Retail Sales Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Merchandising",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for every aspect of the store operation, including selecting, coaching, and developing store teammates, as well as merchandising, advertising, and promotion of products and services."
    },
    {
      "duty": "Manages overall store operations, oversees customer satisfaction, resolves complaints, and develops customer retention strategies."
    },
    {
      "duty": "Manages financial aspects of the business, including evaluating and taking corrective actions, and protecting store and company assets."
    },
    {
      "duty": "Leads the recruitment, coaching, and development of store teammate staff, manages scheduling and staffing, and establishes teammate performance standards."
    },
    {
      "duty": "Greets and handles customers, opens and/or closes the store as required, and attends all area and special meetings as required."
    },
    {
      "duty": "Grows profit through service or tire recommendations, coaches, motivates, and leads store teammates, and develops and manages teammate retention programs."
    },
    {
      "duty": "Handles customer complaints, tire adjustments, and develops customer loyalty and retention through relationship selling."
    },
    {
      "duty": "Assists with physical duties such as unloading merchandise shipments, changing and balancing tires, and constructing store displays."
    },
    {
      "duty": "Performs management activities such as daily management of the retail automotive service store, coaching, leading, and motivating teammates, and making calls to outside suppliers for parts and equipment."
    },
    {
      "duty": "Performs store upkeep activities, including setting up and taking down outside tire rack, stacking tires, maintaining store displays, and using cleaning supplies to keep the store clean."
    },
    {
      "duty": "Coordinates store deliveries, including receiving tire deliveries, storing tires, and handling store deliveries of merchandise."
    },
    {
      "duty": "Performs various tasks related to the store floor, including opening and closing doors, performing computer work, and pulling tires for customers."
    },
    {
      "duty": "Manages the work environment by implementing and maintaining safety and health environmental policies and coaching, leading, and motivating teammates."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent (Bachelor's degree preferred)"
    },
    {
      "credential": "Completed all current and required BSRO store education courses & modules required for this position"
    }
  ]
}