{
  "meta": [
    {
      "job_title": "Primary Care Practice Administrator I",
      "job_category": "Healthcare",
      "job_class": "Administrator",
      "sector": "Healthcare",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Practice Management",
      "experience": 5
    },
    {
      "skill": "Healthcare Financial Management",
      "experience": 5
    },
    {
      "skill": "Staff Supervision",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and supervise the day-to-day functions of assigned clinics in accordance with federal, state, and local standards, guidelines, and regulations."
    },
    {
      "duty": "Responsible for carrying out all established policies, working with and building alignment with medical providers, staff, and hospital administration."
    },
    {
      "duty": "Operational oversight for the Primary Care Specialty with 7 practice locations and 14 providers."
    },
    {
      "duty": "Responsible for routine business and clinical functions of the assigned practice and develops, implements, and monitors annual practice budgets."
    },
    {
      "duty": "Monitors purchases for each practice and plans corrective strategies when order levels are excessive in volume or cost."
    },
    {
      "duty": "Selects, hires, and evaluates practice management staff and recommends professional development for staff."
    },
    {
      "duty": "Develops and maintains effective communications between all levels of personnel and ensures regulatory compliance."
    },
    {
      "duty": "Develops and oversees implementation and administration of internal practice policies and procedures in conjunction with Physician Services standard policies and procedures."
    },
    {
      "duty": "Interprets applicable laws, rules and regulations and ensures the practice is in compliance with them."
    },
    {
      "duty": "Coordinates continuity of patient care with external healthcare organizations and facilities and referrals from the primary care provider to a specialty care provider for practices certified as Patient Center Medical Homes."
    },
    {
      "duty": "Participates on a team for data collection, health outcomes reporting, audits, and programmatic evaluation related to Patient Centered Medical Home."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in health or business administration is preferred. Appropriate experience may be substituted for educational requirements."
    }
  ]
}