{
  "meta": [
    {
      "job_title": "Project Leader",
      "job_category": "Engineering",
      "job_class": "Project Management",
      "sector": "Engineering",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as the onsite project leader to plan, execute, and complete control systems projects with assigned customers."
    },
    {
      "duty": "Perform and/or delegate tasks for the hardware design, system programming, installation coordination, system and network commissioning, and project closeout."
    },
    {
      "duty": "Responsible for the overall financial results of assigned projects including costs, project billings, and collections, and maintain an effective balance between customer satisfaction and project financial results."
    },
    {
      "duty": "Actively pursue selling change orders and coordinate communication with the customer during all phases of the project."
    },
    {
      "duty": "Provide work direction to subcontractors, electrical installers, technicians, designers, and administration as necessary."
    },
    {
      "duty": "Ensure work performed is in compliance with legal requirements and operate on the job with the highest of ethics. Ensure proper execution of warranty."
    },
    {
      "duty": "Adhere and ensure staff and subcontractors adhere to all safety protocols."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Customer Satisfaction",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Technical Associate Degree with two years of field experience or four years of equivalent related field experience ideally in the building automation industry programming panel controls - preferably HVAC equipment"
    }
  ]
}