{
  "meta": [
    {
      "job_title": "Billing Specialist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Denial Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Insurance Billing",
      "experience": 5
    },
    {
      "skill": "Claim Resolution",
      "experience": 5
    },
    {
      "skill": "Medical Policies",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work and resolve all back-end high dollar, complex, and aged physician billing denials as assigned."
    },
    {
      "duty": "Review and complete continuous daily work queue volume for related denials."
    },
    {
      "duty": "Respond to all customer service inquiries in regards to physician billing-related patient accounts."
    },
    {
      "duty": "Work on claim rejections due to physician billing-related issues returned by the payor preventing claims submission."
    },
    {
      "duty": "Research systems for active insurance coverages for self-pay balances beyond set thresholds to prevent missed cash collection opportunity."
    },
    {
      "duty": "Assist in the development of reporting mechanisms to identify trends and track so that education can be performed to reduce and/or resolve high dollar/high volume values."
    },
    {
      "duty": "Provide and promote ideas geared toward process improvements within the Central Billing Office."
    },
    {
      "duty": "Independently work on the resolution of complex claims issues, denials, and appeals."
    },
    {
      "duty": "Assist in the mentoring and training of new and existing A/R staff as required following the training program set forth."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Associates degree or equivalent experience. Billing Certification Preferred – Epic Resolute Professional/Hospital Billing Admin (Proficiency, Proficiency with Honors, or Certification)"
    }
  ]
}