{
  "meta": [
    {
      "job_title": "Construction Manager III",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Engineering",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Field Construction Management",
      "experience": 10
    },
    {
      "skill": "Project Planning",
      "experience": 10
    },
    {
      "skill": "Cost Control",
      "experience": 10
    },
    {
      "skill": "Safety Compliance",
      "experience": 10
    },
    {
      "skill": "Quality Assurance",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Contract Management",
      "experience": 10
    },
    {
      "skill": "Constructability Review",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Overseeing and directing all field construction activities for projects typically valued between $150 million and $500 million."
    },
    {
      "duty": "Ensuring conformance with project plans, specifications, schedules, and cost estimates."
    },
    {
      "duty": "Thorough working knowledge and background of assigned work, dealing with complex situations holistically."
    },
    {
      "duty": "Directing other line supervision to meet or exceed all project objectives."
    },
    {
      "duty": "Coordinating and directing construction craftsmen and managing contractors/subcontractors."
    },
    {
      "duty": "Executing field construction activities in conformance with project requirements and safety standards."
    },
    {
      "duty": "Controlling project schedule and cost through efficient use of resources."
    },
    {
      "duty": "Playing an active role in the development of the safety culture on the project."
    },
    {
      "duty": "Providing proposal/project support and other duties as assigned."
    },
    {
      "duty": "Ensuring all work is in compliance with approved scope boundaries and pertinent requirements."
    },
    {
      "duty": "Serving as the single point of accountability to senior management, the client, and the community."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Accredited four (4) year degree or global equivalent in applicable field of study and eighteen (18) years of work-related experience or a combination of education and directly related experience equal to twenty-two (22) years if non-degreed."
    },
    {
      "credential": "Proven ability promoting outstanding customer service and client relations."
    },
    {
      "credential": "Functional proficiency in project controls, human relations, industrial relations, and contract management."
    }
  ]
}