{
  "meta": [
    {
      "job_title": "Senior Account Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Sales Lead Generation",
      "experience": 5
    },
    {
      "skill": "Sales Forecasting",
      "experience": 5
    },
    {
      "skill": "Sales Process Knowledge",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Mentoring",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Sell primary and ancillary communications solutions to small and medium-sized businesses within a specified territory."
    },
    {
      "duty": "Provide subject matter expertise (Product Knowledge, Systems Knowledge, Sales Process Knowledge) within the sales team and mentor other employees on the team."
    },
    {
      "duty": "Achieve sales and revenue goals through successful prospecting for new customers as well as the successful sale of bundled services to new customers."
    },
    {
      "duty": "Generate all sales leads through a variety of prospecting tactics and work every lead from initial contact to sale."
    },
    {
      "duty": "Develop and implement a Territory Plan to expand the customer base within the assigned territory."
    },
    {
      "duty": "Be 100% focused on generating new Internet, voice, and video customers."
    },
    {
      "duty": "Place orders through order management software and ensure all necessary administrative work necessary to support sales activities are accurate and submitted in a timely manner."
    },
    {
      "duty": "Maintain accurate records of all sales and prospecting activities including the use of Salesforce.com to maximize territory potential."
    },
    {
      "duty": "Meet and exceed performance standards as defined by the department and attend and participate in sales meetings as established by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in business, marketing or related field, or equivalent experience"
    }
  ]
}