{
  "meta": [
    {
      "job_title": "Director of Patient Safety",
      "job_category": "Healthcare",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Safety",
      "experience": 5
    },
    {
      "skill": "Healthcare Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Clinical Experience",
      "experience": 5
    },
    {
      "skill": "Legal Compliance",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Advance patient safety programs and promote a culture of safety, while eliminating avoidable harm."
    },
    {
      "duty": "Initiate and oversee proactive evaluation and redesign of systems to improve care processes."
    },
    {
      "duty": "Emphasize both appropriate behaviors and robust systems to support improved outcomes."
    },
    {
      "duty": "Effectively report, investigate, and analyze patient safety incidents, medical errors, and potential risks in the facility."
    },
    {
      "duty": "Facilitate thorough and credible serious event analysis and failure mode effect analysis to identify and mitigate unintended adverse patient outcomes."
    },
    {
      "duty": "Champion the completion of Culture of Safety Survey and partner with facility leadership to establish activities that enable and sustain an open and fair environment promoting learning and safe systems."
    },
    {
      "duty": "Work with legal counsel to coordinate the investigation, processing, and defense of claims against the facility."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree is required; Master's degree preferred. Certified Professional Patient Safety (CPPS) must be obtained within 1 year of employment start date."
    }
  ]
}