{
  "meta": [
    {
      "job_title": "Bilingual Talent Advisor",
      "job_category": "Human Resources",
      "job_class": "Advisor",
      "sector": "HR",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Bilingual Communication (Spanish/English)",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Sales",
      "experience": 1
    },
    {
      "skill": "Recruiting",
      "experience": 1
    },
    {
      "skill": "Administrative Skills",
      "experience": 1
    },
    {
      "skill": "Marketing",
      "experience": 1
    },
    {
      "skill": "Problem-Solving",
      "experience": 1
    },
    {
      "skill": "Leadership",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver superb customer service to clients and temporary associates in both Spanish and English."
    },
    {
      "duty": "Perform resume searches, refer to established candidate pool and other staffing/job board resources to fulfill client orders in a timely manner."
    },
    {
      "duty": "Recruit, conduct interviews and follow-up with candidates and temporary associates."
    },
    {
      "duty": "Successfully and strategically match employee skill sets to customers' hiring needs."
    },
    {
      "duty": "Maximize billable hours to increase market share and branch profits."
    },
    {
      "duty": "Conduct service calls to ensure quality customer service; conduct outside sales calls to obtain new business partnerships and customers."
    },
    {
      "duty": "Nurture strong business partnerships by providing exceptional customer service skills and implementing customer development & retention strategies."
    },
    {
      "duty": "Recruit, train, and retain temporary associates; coach and counsel temporary associates to ensure quality performance and job satisfaction."
    },
    {
      "duty": "Troubleshoot and resolve problems or complaints of temporary associates, as well as customers and other personnel."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma required; or equivalent work experience/education greatly preferred."
    },
    {
      "credential": "Previous experience in a supervisory or leadership role a plus; staffing industry experience strongly preferred."
    },
    {
      "credential": "Proficiency in Microsoft Word, Excel, PowerPoint, Outlook and Internet."
    },
    {
      "credential": "Sales-minded, team-oriented and exceptionally calm under pressure."
    }
  ]
}