{
  "meta": [
    {
      "job_title": "Hospital Laboratory Director",
      "job_category": "Healthcare",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 176738,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Staff Management",
      "experience": 7
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 7
    },
    {
      "skill": "Financial Management",
      "experience": 7
    },
    {
      "skill": "Performance Feedback",
      "experience": 7
    },
    {
      "skill": "Staff Development",
      "experience": 7
    },
    {
      "skill": "Policy Development",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct operations, programs, and activities to meet organizational and regulatory requirements and to drive innovation."
    },
    {
      "duty": "Ensure adequate and qualified staffing for the department through hiring, orientation, training, and performance management."
    },
    {
      "duty": "Develop and recognize staff through coaching and regular feedback. Set and execute department strategies to meet various goals."
    },
    {
      "duty": "Oversee the financial operation for the laboratory by monitoring resource utilization and identifying variances."
    },
    {
      "duty": "Assure compliance with standards set forth by accrediting agencies (CAP, JCAHO, CLIA, FDA, and CMS). Develop and implement policies and procedures."
    },
    {
      "duty": "Manage key vendor relationships and supply contracts. Develop and implement a communication plan to ensure that department personnel are well-informed."
    },
    {
      "duty": "Direct and organize operations through appropriate delegation of responsibilities and authority. Monitor and evaluate the activities of the staff and provide management, coaching, and guidance."
    },
    {
      "duty": "Ensure operational efficiency and adherence to policies and procedures."
    },
    {
      "duty": "Evaluate and incorporate feedback into the department improvement and planning process."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Baccalaureate Degree in Medical Technology, Biomedical Science, Biology, or Chemistry required. Master’s Degree preferred. National Certification as a Medical Technologist required. State license where required (CA, FL, GA, HI, LA, MT, NV, NY, ND, RI, TN, WV)."
    }
  ]
}