{
  "meta": [
    {
      "job_title": "Clinical Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 61530,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Care Coordination",
      "experience": 5
    },
    {
      "skill": "Quality Assessment",
      "experience": 5
    },
    {
      "skill": "Interdisciplinary Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Continuing Education",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Nursing Practice",
      "experience": 5
    },
    {
      "skill": "Professional Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Developing and implementing a plan of care for a specialty patient population, and/or specialty specific standards of care organization wide."
    },
    {
      "duty": "Coordinates clinical care within a designated specialty, in conjunction with Nursing, Social Work, Care Management, and other related disciplines, Medical and Quality leadership, coordinates care across multiple departments and services within the context of the specialty program including the clinical plan of care, quality assessment and improvement processes."
    },
    {
      "duty": "Serves as a resource to leadership and staff in the development and implementation of nursing standards consistent with the established model of care."
    },
    {
      "duty": "Supports academic affiliations for purposes of providing clinically enriching experiences for students of nursing and other related clinical disciplines."
    },
    {
      "duty": "Collaborates with other members of the health care team in the development, implementation, and ongoing review of policies, procedures, and standards of care for designated patient populations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in specific discipline (i.e., Bachelor of Science in Nursing) is required. Masters degree in health related field is preferred."
    }
  ]
}