{
  "meta": [
    {
      "job_title": "Division Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Youth Services",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide leadership, strategic planning, oversight, administration, and management of all aspects of division operations/services for children and families in crisis."
    },
    {
      "duty": "Provide administrative oversight and coordination of division activities including planning, coordinating, development, and implementation of division service delivery."
    },
    {
      "duty": "Develop and review division policies and procedures for proper care and treatment of clients, operational relevance, and compliance with State statutes."
    },
    {
      "duty": "Serve as community liaison by addressing civic groups, organizations and other interested parties, resolving complaints and media issues."
    },
    {
      "duty": "Responsible for various personnel matters including hiring, discipline, training and development, performance appraisals and related activities."
    },
    {
      "duty": "Develop and negotiate contracts with state, federal, and private agencies for funding, rates, and units of service."
    },
    {
      "duty": "Develop division goals consistent with community needs, the department’s Strategic Plan and County policy."
    },
    {
      "duty": "Plan, develop, direct, and monitor division’s budget to include analyzing revenues and authorizing expenditures."
    },
    {
      "duty": "Organize, plan and direct the activities of the assigned programs and the operation of community facilities for the division to ensure that services are provided to eligible residents of the community."
    },
    {
      "duty": "Serve as a liaison to the Children Family Services Board to communicate the division's needs and program status."
    },
    {
      "duty": "Develop and write regular and special reports regarding activities, functions, and services."
    },
    {
      "duty": "Represent the County before local community organizations and boards, ensuring the effective communication of the division’s mission, vision, plans, and objectives."
    },
    {
      "duty": "Represent the division as an engaged member of the department and County leadership teams."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree from an accredited college or university in Human Services, Social Work, Psychology or a closely related field and five years of experience in children and youth services, preferably in a residential setting, or a Bachelor's degree from an accredited college or university in Human Services, Social Work, Psychology or a closely related field and seven years of experience in children and youth services, preferably in a residential setting, to include three years of supervisory experience."
    }
  ]
}