{
  "meta": [
    {
      "job_title": "Pheresis Specialist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for preparing the donor, donor area and equipment for the pheresis process."
    },
    {
      "duty": "Prepares the autopheresis machine for the pheresis process."
    },
    {
      "duty": "Monitors the donor and the pheresis process, responds to specific alarms or signals that may occur during the process."
    },
    {
      "duty": "Disconnects the donor when the process is complete."
    },
    {
      "duty": "Maintains alertness and awareness to any reaction donor may have during or after the pheresis process and notifies appropriate staff."
    },
    {
      "duty": "Uses Personal Digital Assistant (PDA) to record incidents that occur during the pheresis process, such as machine alerts and alarms, volume variances and donor adverse events."
    },
    {
      "duty": "Uses PDA to link equipment and soft goods used in the pheresis process to the appropriate donor."
    },
    {
      "duty": "Alerts Group Leader or Supervisor of donor flow issues."
    },
    {
      "duty": "Ensures the accurate recording of donor data in the electronic donor information management system as outlined in the Standard Operating Procedures (SOPs)."
    },
    {
      "duty": "Understands the policies and procedures associated with hyper immune programs at the center if applicable."
    },
    {
      "duty": "Maintains clean efficient work environment, and ensures sufficient operating supplies and forms are available as needed."
    },
    {
      "duty": "Follows all Health Safety & Environmental (HSE) and Occupational Safety and Health Administration (OSHA) policies and procedures."
    },
    {
      "duty": "Promotes safety in all actions."
    },
    {
      "duty": "Maintains confidentiality of all personnel, donor and center information."
    },
    {
      "duty": "May be cross-trained in other areas to meet the needs of the business."
    },
    {
      "duty": "Bilingual skills may be required, at the discretion of the organization, to meet the needs of the business."
    },
    {
      "duty": "Perform job-related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent required"
    }
  ]
}