{
  "meta": [
    {
      "job_title": "Financial Accounting Manager",
      "job_category": "Accounting",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "GAAP",
      "experience": 5
    },
    {
      "skill": "ERP Systems",
      "experience": 3
    },
    {
      "skill": "CPA License",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "PeopleSoft",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the Financial Reporting function of the department to ensure the financial integrity of the General Ledger, the Financial Statement, and related financial and nonfinancial reports and data."
    },
    {
      "duty": "Prepare monthly management reporting and perform calculations related to technical accounting topics and providing guidance on the proper recording in the general ledger and related financial statement presentation."
    },
    {
      "duty": "Manage the year-end audit process including planning and the preparation of various analyses and documentation."
    },
    {
      "duty": "Provide professional leadership to the Financial Reporting Accounting team and manage and supervise the activities of the Financial Reporting Accounting staff to ensure their work meets goals and performance objectives."
    },
    {
      "duty": "Assist in the preparation of financial statements and ensure that all financial data is recorded accurately and on time within Generally Accepted Accounting Principles (GAAP) and organizational policy."
    },
    {
      "duty": "Oversee and manage the year-end audit process including planning and the preparation of various analyses and documentation; implement new accounting standards as needed and serve as a key resource for technical accounting issues."
    },
    {
      "duty": "Identify business matters and processes that impact the interpretation of the accounting literature through inquiry with the appropriate departmental stakeholders within the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in accounting or a related degree, with a minimum of 30 hours in accounting. Active Certified Public Accountant license. Minimum three (3) years of leading and managing others. Minimum five (5) years of progressive, hands-on experience in preparing financial reports and providing solutions-focused consultation and deliverables for a governmental organization the size and complexity of Harris County, or a large/complex company or organization. Minimum three (3) years of experience with a major ERP system in a large organization."
    }
  ]
}