{
  "meta": [
    {
      "job_title": "Seasonal Associate",
      "job_category": "Retail",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 25000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Cash Handling",
      "experience": 2
    },
    {
      "skill": "Product Knowledge",
      "experience": 2
    },
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Merchandising",
      "experience": 2
    },
    {
      "skill": "Flexibility",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in multiple areas of the store including setting floorsets and/or cleaning, processing, replenishing, cashiering, and selling."
    },
    {
      "duty": "Proactively engage with customers, read cues, and respond effectively."
    },
    {
      "duty": "Deliver a friendly and efficient cash wrap experience, processing customer transactions accurately and efficiently."
    },
    {
      "duty": "Provide customers with the perfect bra fit by asking effective questions."
    },
    {
      "duty": "Process merchandise to be floor ready and maintain back room and under stock to brand standards."
    },
    {
      "duty": "Replenish merchandise to brand standards to ensure product is placed on the sales floor and available for purchase."
    },
    {
      "duty": "Assist with other projects as needed including markdowns, re-tickets, and the mark out of stock process."
    },
    {
      "duty": "Assist with maintenance of back room and under stock, including merchandise and non-merchandise, to brand standards to enable efficient replenishment."
    },
    {
      "duty": "Maintain a focus on bras as the premier product differentiator to build loyalty and support the \"Best at Bras\" culture."
    },
    {
      "duty": "Schedule flexibility that includes peak dates that meet the needs of the customers during peak times of the business including evenings, holidays, and weekends."
    },
    {
      "duty": "Exhibit an authentic desire to exceed the customer’s expectations."
    },
    {
      "duty": "Proven ability to meet or exceed goals while demonstrating urgency."
    },
    {
      "duty": "Has a competitive spirit while maintaining a team focus."
    },
    {
      "duty": "Is resilient and bounces back quickly from setbacks."
    },
    {
      "duty": "Seeks out coaching from leaders and peers to improve productivity; leads own learning."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": []
}