{
  "meta": [
    {
      "job_title": "Material Coordinator",
      "job_category": "Logistics",
      "job_class": "Coordinator",
      "sector": "Logistics",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate and expedite the movement of material, parts, and assemblies within or between departments based on production schedules and department priorities."
    },
    {
      "duty": "Review production schedules and collaborate with department supervisors to determine material requirements and locate overdue materials."
    },
    {
      "duty": "Requisition necessary materials and establish delivery sequences to departments, prioritizing job orders and considering material availability."
    },
    {
      "duty": "Arrange for in-plant transfers of materials to meet production schedules, coordinating with department supervisors for material repair, assembly, and transportation."
    },
    {
      "duty": "Verify delivered material against specifications in production departments."
    },
    {
      "duty": "Monitor and control the movement of materials and parts along conveyor systems using remote-control panels."
    },
    {
      "duty": "Calculate material quantities required for specific job orders, applying knowledge of products and manufacturing processes."
    },
    {
      "duty": "Compile reports detailing the quantity and type of materials on hand."
    },
    {
      "duty": "Move and transport materials using hand or industrial trucks between departments."
    },
    {
      "duty": "Maintain accurate perpetual production records, both manually and in computerized systems, to track materials in various stages of production."
    },
    {
      "duty": "Ensure accurate recording of received materials in inventory records."
    },
    {
      "duty": "Process material issue receipts and ensure materials are available according to delivery and shipping schedules."
    },
    {
      "duty": "Possess expertise in receipt control, staging of interim support items, and evaluating materials for proper configurations to meet program requirements."
    }
  ],
  "skills": [
    {
      "skill": "Logistics Management",
      "experience": 2
    },
    {
      "skill": "Material Coordination",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Supply Chain Operations",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Problem-Solving",
      "experience": 2
    },
    {
      "skill": "Attention to Detail",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Two or more years of experience in a related field."
    },
    {
      "credential": "Strong understanding of material management procedures, including supply transactions, inventory review, and material tracking."
    },
    {
      "credential": "Familiarity with government material management programs."
    },
    {
      "credential": "Ability to operate motor vehicles and Material Handling Equipment (MHE) as described in the solicitation's requirements."
    }
  ]
}