{
  "meta": [
    {
      "job_title": "InContact Contact Center Engineer",
      "job_category": "Engineering",
      "job_class": "Technical Lead",
      "sector": "Software Engineering",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Nice InContact CXone",
      "experience": 5
    },
    {
      "skill": "Nice CXOne Studio",
      "experience": 3
    },
    {
      "skill": "C#",
      "experience": 4
    },
    {
      "skill": "C++",
      "experience": 4
    },
    {
      "skill": "Java",
      "experience": 4
    },
    {
      "skill": "JavaScript",
      "experience": 4
    },
    {
      "skill": "Python",
      "experience": 4
    },
    {
      "skill": "Webservice API",
      "experience": 5
    },
    {
      "skill": "Contact Center Dashboard Creation",
      "experience": 3
    },
    {
      "skill": "Salesforce",
      "experience": 3
    },
    {
      "skill": "Intersystem Networking",
      "experience": 3
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Confident in a client facing role and possess the ability to manage multiple stakeholders."
    },
    {
      "duty": "Coordinate and perform release planning, development, testing, and releases on multiple agencies IVR enhancements."
    },
    {
      "duty": "Build Call flow designs, Chat and integration to backend systems using application program interfaces (API)."
    },
    {
      "duty": "Manage NICE BU and provide Subject Matter Expertise (SME) input into solution design, and optimization for network solutions."
    },
    {
      "duty": "Skills based routing design and implementation for voice, chat, email, and SMS contact center technology."
    },
    {
      "duty": "Works with the Architecture team to design, develop, and deploy APIs, consume APIs."
    },
    {
      "duty": "Understand business requirements with the ability to translate to technical requirements."
    },
    {
      "duty": "Prepare design documents based on business requirements for the application development."
    },
    {
      "duty": "Experience with cloud-based SaaS/PaaS/IaaS providers and working with virtualized systems, including application servers, databases, and networking infrastructure."
    },
    {
      "duty": "Coordinate issue communication and resolution with multiple other tech teams in the event of a problem."
    },
    {
      "duty": "Review support tickets with agency leadership and oversee any support questions from other team members."
    },
    {
      "duty": "Act as a SME accessible by other team members to discuss and work through possible ways to achieve or a design a requested IVR enhancement."
    },
    {
      "duty": "Knowledge of Nice InContact CXone (ACD, IVR, Auto Dialer, OMNIChannel, WFM, Studio, Interaction Analytics, POCs & Auto Attendant) [5+ years of experience preferred]"
    },
    {
      "duty": "NICE CXOne Studio experience [3+ years of experience preferred]"
    },
    {
      "duty": "Ability to program in one or more of the following software languages: C#, C++, Java, JavaScript, Python [4+ years of experience preferred]"
    },
    {
      "duty": "Ability to develop, maintain, and troubleshoot webservice API calls [5+ years of experience preferred]"
    },
    {
      "duty": "Experience in Contact Center Dashboard Creation."
    },
    {
      "duty": "Experience with Salesforce."
    },
    {
      "duty": "Base knowledge of intersystem networking, and data traffic flow between components."
    },
    {
      "duty": "Ability to troubleshoot end to end Call center application including Chrome and Edge issues when interacting with a Web-based application like Salesforce/ Microsoft Dynamics."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Software Engineering, Computer Science or related field (Master's preferred)"
    }
  ]
}