{
  "meta": [
    {
      "job_title": "Heavy Equipment Operator",
      "job_category": "Construction",
      "job_class": "Operator",
      "sector": "Construction",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Must be proficient on a front end loader, mechanically inclined, ability to weld/cut with some light fabrication."
    },
    {
      "duty": "Repair and replace crusher components such as conveyor belts, guarding, rollers etc."
    },
    {
      "duty": "Operate power construction equipment, such as bulldozers, front-end loaders, backhoes, scrapers, motor graders, shovels and derricks."
    },
    {
      "duty": "May also maintain running large pumps or air compressors."
    },
    {
      "duty": "Heavy equipment operators drive heavy construction equipment and control their attachments, such as buckets, swing booms, scrapers and blades."
    },
    {
      "duty": "They also control water and air output of pumps and compressors."
    },
    {
      "duty": "Have a keen sense of basic maintenance and repair of the equipment they operate."
    },
    {
      "duty": "Operating engineers may be encouraged to perform equipment and materials inspections."
    },
    {
      "duty": "They must comprehend specifications and instructions, both verbal and written."
    },
    {
      "duty": "Working with heavy-duty machinery requires knowledge of and strict adherence to safety regulations."
    },
    {
      "duty": "Wear all appropriate personal protective equipment."
    }
  ],
  "skills": [
    {
      "skill": "MSHA Certification",
      "experience": 1
    },
    {
      "skill": "OSHA 10 hr Certification",
      "experience": 1
    },
    {
      "skill": "CPR/First Aid Certification",
      "experience": 0
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED. Minimum of one year of related experience or equivalent combination of education and experience."
    }
  ]
}