{
  "meta": [
    {
      "job_title": "VP of Finance",
      "job_category": "Finance",
      "job_class": "VP",
      "sector": "Management",
      "salary": 170000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage all financial operations of the organization including GAAP Compliance, FP&A, Reporting, A/R & A/P, Internal Controls, Audit and Tax, Payroll, Treasury, Fundraising, and more."
    },
    {
      "duty": "Generate timely, accurate financial statements, models, KPI’s, and operational reports for internal and external use. Analyze and report on trends, risks, opportunities, and communicate variances from plan to facilitate corrective actions."
    },
    {
      "duty": "Ensure compliance with GAAP accounting including ASC 606 Revenue Recognition; personal property, sales, and income tax filings; bank covenants, and all federal, state, and company operational requirements."
    },
    {
      "duty": "Manage international subsidiary in Australia, complying with all regulations and adhering to government contracting requirements."
    },
    {
      "duty": "Lead debt and equity fundraising, liaising with potential investors and financial institutions, as well as content creation and administration of the transaction."
    },
    {
      "duty": "Spearhead the transition from QuickBooks Online to Sage Intacct accounting platform."
    },
    {
      "duty": "Collaborate with external firms to produce required 409(A) valuation, audit, and tax filings."
    },
    {
      "duty": "Conduct ad-hoc analysis for leadership, investors, and the Board. Prepare materials, participate, and take minutes in Board of Directors meetings."
    },
    {
      "duty": "Manage the capitalization table and stock options tracking."
    },
    {
      "duty": "Direct financial strategy, budgeting, planning, and forecasts."
    },
    {
      "duty": "Maintain the company’s financial processes and reporting to include purchase orders, accounts payable, account receivable, and other standard accounting processes."
    },
    {
      "duty": "Have direct responsibility for cash and all treasury management functions."
    },
    {
      "duty": "Collaborate with the VP of Human Resources for efficient onboarding of new employees and maintaining an accurate payroll process."
    },
    {
      "duty": "Continually evaluate the business model and perform pricing analyses."
    },
    {
      "duty": "Instill a culture of accountability and transparency through departmental quarterly financial reviews, fostering a strong relationship with the executive team."
    },
    {
      "duty": "Hire, train, and manage a team in accordance with the growth of the organization."
    }
  ],
  "skills": [
    {
      "skill": "US GAAP",
      "experience": 15
    },
    {
      "skill": "Financial Reporting",
      "experience": 15
    },
    {
      "skill": "FP&A",
      "experience": 15
    },
    {
      "skill": "Payroll Processes",
      "experience": 15
    },
    {
      "skill": "Subscription-based IT/SaaS",
      "experience": 15
    },
    {
      "skill": "International Finance",
      "experience": 15
    },
    {
      "skill": "Debt and Equity Fundraising",
      "experience": 15
    },
    {
      "skill": "Sage Intacct",
      "experience": 10
    },
    {
      "skill": "Financial Analysis",
      "experience": 15
    },
    {
      "skill": "Strategic Financial Planning",
      "experience": 15
    },
    {
      "skill": "GAAP Revenue Recognition (ASC 606)",
      "experience": 15
    },
    {
      "skill": "Team Management",
      "experience": 15
    },
    {
      "skill": "Business Aptitude",
      "experience": 15
    },
    {
      "skill": "Internal Controls",
      "experience": 15
    },
    {
      "skill": "Communication Skills",
      "experience": 15
    },
    {
      "skill": "Conflict Resolution",
      "experience": 15
    },
    {
      "skill": "Financial Strategy",
      "experience": 15
    },
    {
      "skill": "Budgeting and Forecasting",
      "experience": 15
    },
    {
      "skill": "Cash and Treasury Management",
      "experience": 15
    },
    {
      "skill": "Pricing Analysis",
      "experience": 15
    },
    {
      "skill": "HR Collaboration",
      "experience": 15
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BA in Finance, Accounting, or related field of study. An MBA degree a plus. Certified Public Accountant (CPA) designation."
    },
    {
      "credential": "Startup company experience with private equity and venture capital ownership."
    },
    {
      "credential": "Knowledge of financial software systems including Sage Intacct."
    },
    {
      "credential": "Demonstrated ability to work remotely, with ability to be present in the office monthly."
    }
  ]
}