{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides direct nursing care in settings where patients require complex assessments and intervention, in accordance with established policies, procedures and protocols of the healthcare organization."
    },
    {
      "duty": "Obtains comprehensive data pertinent to the patient from the patient, family other healthcare providers to develop a holistic picture of the patient’s needs or condition."
    },
    {
      "duty": "Analyzes and synthesizes data from the assessment in determining diagnosis or conditions relevant to care."
    },
    {
      "duty": "Identifies optimal outcomes for the patient in collaboration with the patient, family and interprofessional team."
    },
    {
      "duty": "Develops a plan that prescribes strategies and alternatives to attain outcomes, using clinical judgement in collaboration with patient, family and interprofessional care team."
    },
    {
      "duty": "Implements the plan, employing strategies to promote and maintain a safe environment, coordinates implementation with patient, family and interprofessional team."
    },
    {
      "duty": "Evaluates processes and progress toward attainment of goals and outcomes."
    },
    {
      "duty": "Contributes to the quality and effectiveness of nursing practice, evaluates their own practice, and maintains current knowledge and competence."
    },
    {
      "duty": "Communicates effectively in all areas of practice, collaborates with patient, family and interprofessional team."
    },
    {
      "duty": "Uses clinical inquiry and integrates best evidence into practice."
    },
    {
      "duty": "Applies the existing body of evidence-based practice and scientific knowledge in health care to critical care nursing practice, ensuring that nursing care is delivered based on patient’s age-specific needs and clinical needs as described in the department's Scope of Service."
    },
    {
      "duty": "Works in a constant state of alertness and safe manner."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Critical Care Nursing",
      "experience": 0
    },
    {
      "skill": "Clinical Judgement",
      "experience": 0
    },
    {
      "skill": "Interprofessional Collaboration",
      "experience": 0
    },
    {
      "skill": "Patient Communication",
      "experience": 0
    },
    {
      "skill": "Evidence-Based Practice",
      "experience": 0
    },
    {
      "skill": "Clinical Inquiry",
      "experience": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of accredited school of nursing or education equivalency for licensing"
    },
    {
      "credential": "Advanced Life Support (ALS) - American Heart Association (AHA)"
    },
    {
      "credential": "Basic Life Support HealthCare Provider (BLS HCP) - American Heart Association (AHA)"
    },
    {
      "credential": "Neonatal Resuscitation Program (NRP) - American Academy Pediatrics (AAP)"
    },
    {
      "credential": "Pediatric Advanced Life Support (PALS) - American Heart Association (AHA)"
    },
    {
      "credential": "Registered Nurse (RN) - Missouri Division of Professional Registration"
    },
    {
      "credential": "Registered Nurse (RN) Nurse Licensure Compact (NLC) Multi-State - Alabama Board of Nursing"
    },
    {
      "credential": "Registered Nurse (RN) Nurse Licensure Compact (NLC) Multi-State - Arizona State Board of Nursing"
    },
    {
      "credential": "Registered Nurse (RN) Nurse Licensure Compact (NLC) Multi-State - Arkansas State Board of Nursing"
    },
    {
      "credential": "Registered Nurse (RN) Nurse Licensure Compact (NLC) Multi-State - Colorado Board of Nursing"
    }
  ]
}