{
  "meta": [
    {
      "job_title": "Analytics Developer II",
      "job_category": "Software Engineering",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 88000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Database Management",
      "experience": 4
    },
    {
      "skill": "Reporting Services",
      "experience": 4
    },
    {
      "skill": "SQL",
      "experience": 4
    },
    {
      "skill": "Tableau",
      "experience": 4
    },
    {
      "skill": "Business Intelligence",
      "experience": 4
    },
    {
      "skill": "Health Insurance Analytics",
      "experience": 3
    },
    {
      "skill": "Medicare Analytics",
      "experience": 3
    },
    {
      "skill": "Claims Analysis",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Gather and document data requirements from customers. Analyze and translate requirements into technical specifications, process and workflows."
    },
    {
      "duty": "Assess, produce and/or develop moderately complex relevant, standard or custom information (reports, dashboards, interactive reporting, charts, graphs and tables) from various data sources by querying data and generating the associated output. Distribute and disseminate reports to applicable agencies, researchers, management and other customers."
    },
    {
      "duty": "Analyzes and validates output and metrics to ensure data quality, reliability and integrity."
    },
    {
      "duty": "Documents project/work assignments to include all needed technical documentation such as source to target mappings, data sources, definitions, methodologies, contact information, output requirements or other information to ensure continuity of process."
    },
    {
      "duty": "Interprets data and associated deliverables (reports, dashboards, interactive reporting, charts, graphs and tables) in plain business language for executive & clinical staff. Effectively summarizes information and creates intuitive/digestible information by selecting visualizations that are fit for purpose."
    },
    {
      "duty": "Develops statistical, economic and financial analysis from data to evaluate performance and drive relevant business and clinical initiatives. Analyzes data for trends, observations, improvements and makes recommendations."
    },
    {
      "duty": "The ideal candidate will have experience at a health insurance, vendor, or consulting organization performing the stated functions of the role. Specific experience in Medical/Pharmacy claim analytics and Utilization Management/Case Management is preferred."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 50,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Statistics, Operations Research, Physics, Computer Science, Economics, Business, Analytics, Clinical or other similar degree or equivalent experience required."
    }
  ]
}