{
  "meta": [
    {
      "job_title": "Product Marketing Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Product Marketing",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Sales Enablement",
      "experience": 5
    },
    {
      "skill": "Competitive Analysis",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote products in the marketplace."
    },
    {
      "duty": "Lead cross-functional teams in planning and executing product launches, ensuring alignment across Product, Marketing, Sales, and Customer Success."
    },
    {
      "duty": "Analyze market intelligence to drive positioning, packaging, and promotion, and gain insight to improve differentiation."
    },
    {
      "duty": "Drive sales success by developing compelling messaging and assets that drive purchase decisions, including sales playbooks, value assessment tools, and presentations."
    },
    {
      "duty": "Craft competitive positioning for sales enablement and advise on the best approaches for integrated demand programs."
    },
    {
      "duty": "Be the expert on our competition, their positioning, and customers' key buying criteria."
    },
    {
      "duty": "Maintain a strong understanding of the product set, customer solutions, and the market ecosystem to support pipeline growth through direct/indirect sales channels."
    },
    {
      "duty": "Conduct research on buyers, how and why they buy, and translate product capabilities into clear, value-based messaging and sales artifacts."
    },
    {
      "duty": "Train and support sales channels to ensure they are up to speed on the latest product capabilities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}