{
  "meta": [
    {
      "job_title": "Technical Program Manager",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Leadership",
      "experience": 10
    },
    {
      "skill": "Technical Program Delivery",
      "experience": 10
    },
    {
      "skill": "Product Management",
      "experience": 10
    },
    {
      "skill": "Product Cost Modeling",
      "experience": 10
    },
    {
      "skill": "Analytics",
      "experience": 10
    },
    {
      "skill": "Governance",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Relationship Management",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "Coaching",
      "experience": 10
    },
    {
      "skill": "IT Solutions",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Efficiency Improvement",
      "experience": 10
    },
    {
      "skill": "Process Optimization",
      "experience": 10
    },
    {
      "skill": "Decision-making",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide strategic leadership to deliver against critical business goals tied to products and programs."
    },
    {
      "duty": "Manage product releases and prioritize based on business strategy."
    },
    {
      "duty": "Develop product cost models and analytics to benchmark services vs the market."
    },
    {
      "duty": "Provide governance, process, and program management for work intake into service pillars."
    },
    {
      "duty": "Proactively identify and mitigate technical risks throughout the delivery life cycle."
    },
    {
      "duty": "Drive well-educated decisions across product, engineering, design, and data science representatives."
    },
    {
      "duty": "Lead business discussion and strategy alignment for global workload service direction."
    },
    {
      "duty": "Develop and maintain relationships with external vendors and service providers."
    },
    {
      "duty": "Partner with security and compliance functions to ensure products meet all security requirements."
    },
    {
      "duty": "Participate in the development and review of IT budgets."
    },
    {
      "duty": "Provide leadership, supervision, coaching, and guidance across the team in achievement of internal priorities and goals."
    },
    {
      "duty": "Partner with IT leadership, business unit leaders, and service providers to provide strategic solutions and operational efficiencies."
    },
    {
      "duty": "Work with product owners across the businesses to understand market needs and vision; quickly translate that vision into capabilities."
    },
    {
      "duty": "Drive increased efficiency across the teams, eliminating duplication, leveraging product and technology reuse."
    },
    {
      "duty": "Establish vision, identifies and champions internal/external best practices, tools, and ideas to improve execution and quality. Drives an organization of efficiency, accountability, and ownership."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in computer science or related field (Master's preferred)"
    }
  ]
}