{
  "meta": [
    {
      "job_title": "Principal System Reliability Manager",
      "job_category": "Information Technology",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 205000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Release Management",
      "experience": 5
    },
    {
      "skill": "Large commercial application delivery",
      "experience": 5
    },
    {
      "skill": "Docker and related virtualization technologies",
      "experience": 5
    },
    {
      "skill": "Cloud Services - AWS",
      "experience": 5
    },
    {
      "skill": "Programming languages - Java, JavaScript, C#, Groovy, Python, Bash (Shell Scripting)",
      "experience": 5
    },
    {
      "skill": "Managing infrastructure as code using Docker, Puppet, GitHub, Bitbucket, Nexus, Cloudbees",
      "experience": 5
    },
    {
      "skill": "Splunk and Google Analytics",
      "experience": 5
    },
    {
      "skill": "Agile / Scrum development and continuous integration",
      "experience": 5
    },
    {
      "skill": "SharePoint, Rally, Confluence, Trello",
      "experience": 5
    },
    {
      "skill": "Linux, Unix, and Windows operating systems",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build and lead teams to ensure effective performance and collaboration in achieving system reliability goals."
    },
    {
      "duty": "Learn and implement new technologies and processes to improve system reliability and performance."
    },
    {
      "duty": "Take a proactive and hands-on approach to identify and resolve potential issues, ensuring delivery of polished finished products."
    },
    {
      "duty": "Collaborate with other associates to share ideas, learn from others, and keep up with ever-changing technologies."
    },
    {
      "duty": "Handle a variety of work, including international team coordination, leadership meetings, and ad hoc requests."
    },
    {
      "duty": "Present to senior leaders, product owners, and peers, demonstrating executive presence and leading change."
    },
    {
      "duty": "Troubleshoot and resolve failures to production code promotions, supporting continuous improvement of the release management process."
    },
    {
      "duty": "Develop and maintain application build and deployment pipelines, support cloud instance and integration with AWS, and maintain resilient, scalable, elastic runtime environments."
    },
    {
      "duty": "Play a critical role in securing the organization's success by optimizing development operations to meet client needs."
    },
    {
      "duty": "Develop, improve, and maintain application build and deployment pipelines, support cloud instance and integration with AWS, and maintain resilient, scalable, elastic runtime environments."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 210,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Computer Engineering, Information Systems or related field of study plus five (5) years of related experience required. Master's degree plus two (2) years of related experience accepted."
    }
  ]
}