{
  "meta": [
    {
      "job_title": "Physician",
      "job_category": "Healthcare",
      "job_class": "Physician",
      "sector": "Healthcare",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Primary Care Assessment",
      "experience": 5
    },
    {
      "skill": "Comprehensive Care",
      "experience": 5
    },
    {
      "skill": "Customer/Patient Care Excellence",
      "experience": 5
    },
    {
      "skill": "Medical Record Documentation",
      "experience": 5
    },
    {
      "skill": "Medical Expertise",
      "experience": 5
    },
    {
      "skill": "Quality of Care Review",
      "experience": 5
    },
    {
      "skill": "Patient Care Compliance",
      "experience": 5
    },
    {
      "skill": "Community Relationship Building",
      "experience": 5
    },
    {
      "skill": "Integrated Team-Based Care",
      "experience": 5
    },
    {
      "skill": "Value-Based Care Setting",
      "experience": 5
    },
    {
      "skill": "Bilingual Mandarin",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Basic Computer Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assess healthcare needs and effectiveness of care outcomes."
    },
    {
      "duty": "Deliver commitment of excellence to patients and participate in continuous improvement and innovative population health activities."
    },
    {
      "duty": "Follow level of medical care and quality for patients and monitor care using available data and chart reviews."
    },
    {
      "duty": "Assist in the coordination of patient services, including specialty referrals, hospital and SNF coordination, durable medical equipment, and home health care."
    },
    {
      "duty": "Act as a key source of medical expertise with the care team through daily huddles."
    },
    {
      "duty": "Collaborate with leadership to review outcome data, population health information, and general operational issues."
    },
    {
      "duty": "Participate in potential growth opportunities for new or existing services."
    },
    {
      "duty": "Assure personal compliance with licensing, certification, and accrediting bodies."
    },
    {
      "duty": "Spend 100% of time clinically focused on direct patient care, inclusive of patient facing time and general administrative time (charting, meetings, etc.) as it relates to direct patient care."
    },
    {
      "duty": "Be an ambassador in the local community, building relationships with other healthcare providers, social/community organizations, and marketing partners."
    },
    {
      "duty": "Perform all other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Current and unrestricted medical license or willing to obtain a medical license in state of practice; eligible and willing to obtain licenses in other states in the region of assignment, as required Graduate of accredited MD or DO program of accredited university Excellent verbal and written communication skills Demonstrate a high level of skill with interpersonal relationships and communications with colleagues/patients Fully engaged in the concept of \\"
    }
  ]
}