{
  "meta": [
    {
      "job_title": "Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 52000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Assessment",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "Prioritization",
      "experience": 5
    },
    {
      "skill": "Educational Planning",
      "experience": 5
    },
    {
      "skill": "Patient Education",
      "experience": 5
    },
    {
      "skill": "Evaluating Progress",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Carry out patient care responsibilities and decision-making related to the nursing process."
    },
    {
      "duty": "Collect, assess, and document patient healthcare data."
    },
    {
      "duty": "Involve patient/family and Interdisciplinary team to identify a plan of care and outcomes."
    },
    {
      "duty": "Prioritize care based upon data collected and document assessment and reassessment in medical records."
    },
    {
      "duty": "Implement and document interventions in the coordination of patient care in a safe, timely, and appropriate manner."
    },
    {
      "duty": "Educate the patient/family regarding health status and established plan of care."
    },
    {
      "duty": "Determine learning needs of the patient/family and revise education plan accordingly."
    },
    {
      "duty": "Evaluate the patient's progress towards expected outcomes and involve the patient/family and interdisciplinary team in the evaluation process."
    },
    {
      "duty": "Participate in unit activities and contribute to unit throughput efficiencies and metrics."
    },
    {
      "duty": "Comply with unit based and organizations professional standards, New York State Nurse Practice Act, and regulations of relevant outside agencies."
    },
    {
      "duty": "Exhibit appropriate judgement in delegated activities and differentiate those activities which are in scope of professional nursing practice."
    },
    {
      "duty": "Comply with annual education and mandatory/regulatory requirements and serve as a support and resource for nursing staff and students."
    },
    {
      "duty": "Engage in self-assessment and peer review, attend unit practice councils, and utilize the practice council structure to critically appraise and influence practice."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Current Registered Professional Nurse in New York, Bachelors degree in Nursing preferred, Basic Life Support Certification through the American Heart Association, Fluent written and spoken English language skills."
    }
  ]
}