{
  "meta": [
    {
      "job_title": "Client Manager",
      "job_category": "Client Management",
      "job_class": "Manager",
      "sector": "Insurance",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide and maintain service to clients and support Personal Risk Management Producers in processing all lines of personal insurance."
    },
    {
      "duty": "Develop and maintain excellent relationships with partners, carriers, and vendors."
    },
    {
      "duty": "Manage incoming email, mail, and calls from clients, lenders, and insurance company personnel."
    },
    {
      "duty": "Process changes and follow up with clients via email."
    },
    {
      "duty": "Process policies as new business, renewals, or rewrites and maintain client profiles and policies in the client management system."
    },
    {
      "duty": "Process agency bill renewals - obtain a quote from the company and present to the client. Follow up to make sure renewal is ordered or insured is advised that the policy has lapsed."
    },
    {
      "duty": "Accept payments from insureds and forward to the company and/or process payments online."
    },
    {
      "duty": "Counsel clients on coverage and limits."
    },
    {
      "duty": "Assess when accounts need to be taken to market, quoted, and proposed."
    },
    {
      "duty": "Provide proactive risk management support in identifying, analyzing, and responding to a client’s needs."
    },
    {
      "duty": "Maintain and be responsible for expiration reports."
    },
    {
      "duty": "Provide renewal summaries of insurance on VIP accounts."
    },
    {
      "duty": "Check new policies for accuracy and, if applicable, mail policies to insured with an invoice if agency bill."
    },
    {
      "duty": "Follow up on late payments and send a letter to the client to confirm cancellation, if necessary."
    },
    {
      "duty": "Review monthly statements from accounting and contact clients if late for agency bill policies."
    },
    {
      "duty": "Visit the client at home or office on larger accounts, when necessary with a producer or manager."
    },
    {
      "duty": "Cover the desk of those on vacation or out sick for time-sensitive work."
    },
    {
      "duty": "Volunteer assistance to others in the department if caught up on day-to-day responsibilities."
    },
    {
      "duty": "Work efficiently and effectively in a team environment. Ensure behavior consistently reflects the best interests of the team and the client."
    },
    {
      "duty": "Project a positive attitude toward company goals and team objectives."
    },
    {
      "duty": "Apply problem-solving techniques to various issues that may arise from time to time with carriers and clients."
    },
    {
      "duty": "Utilize intuitive behaviors to work with various personalities and styles."
    },
    {
      "duty": "Pursue a program for professional development consistent with your position."
    },
    {
      "duty": "Other duties may be assigned."
    }
  ],
  "skills": [
    {
      "skill": "Client Management",
      "experience": 3
    },
    {
      "skill": "Insurance Processing",
      "experience": 3
    },
    {
      "skill": "Relationship Management",
      "experience": 3
    },
    {
      "skill": "Risk Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Team Work",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Property & Casualty Insurance License required"
    },
    {
      "credential": "CISR designation or other advanced designation preferred"
    }
  ]
}