{
  "meta": [
    {
      "job_title": "Clinical Coordinator Surgical Technology Program-Manhattan",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Surgical Technology",
      "experience": 3
    },
    {
      "skill": "Teaching",
      "experience": 3
    },
    {
      "skill": "Educational Research",
      "experience": 3
    },
    {
      "skill": "Clinical Supervision",
      "experience": 3
    },
    {
      "skill": "Staff Management",
      "experience": 3
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify learning needs of Surgical Technology students and plan, develop, implement, evaluate, and document outcome of educational offerings."
    },
    {
      "duty": "Supervise and evaluate students in practice and clinical settings."
    },
    {
      "duty": "Serve as a resource regarding educational theory, methods, and skills to all members of the Operating room team and other departments."
    },
    {
      "duty": "Conduct formal and informal classes; supervise, evaluate, and provide counseling and clinical critiques to students during their clinical experience."
    },
    {
      "duty": "Plan, develop, and implement educational offerings to provide necessary knowledge, skills, and attitudes to Surgical Technology students."
    },
    {
      "duty": "Provide aseptic technique classes for the In-service Education Department Operating Room Services and other departments who request it."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Certification by NBSTA (National Board of Surgical Technology and Surgical Assisting). Minimum of three years or more of clinical experience as a Surgical Technologist in a tertiary operating room setting or Surgical experience as an MD. In depth and current knowledge of operating room procedures and equipment."
    }
  ]
}