{
  "meta": [
    {
      "job_title": "Maintenance Supervisor",
      "job_category": "Maintenance",
      "job_class": "Supervisor",
      "sector": "Maintenance",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Supervision",
      "experience": 5
    },
    {
      "skill": "Equipment Repair",
      "experience": 5
    },
    {
      "skill": "Preventative Maintenance",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Shop Facility Maintenance",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise and coordinate the activities of the employees engaged in servicing and repairing equipment and vehicles."
    },
    {
      "duty": "Provide hands-on maintenance to assist the shop employees with the completion of their daily tasks."
    },
    {
      "duty": "Directly supervise all employees in the maintenance department through planning and directing work."
    },
    {
      "duty": "Establish and enforce a preventative maintenance program to ensure equipment is in safe and operable condition."
    },
    {
      "duty": "Maintain all vehicle inspection, maintenance and safety records required by federal, state/provincial or local agencies and Company policies."
    },
    {
      "duty": "Ensure that all work and the shop facility is compliant to safety standards."
    },
    {
      "duty": "Confer with Operations Supervisor/Management to arrange for equipment to be released from service for inspections, service and repair."
    },
    {
      "duty": "Schedule and conduct safety meetings and ensure employees follow safety guidelines."
    },
    {
      "duty": "Maintain cost-effective inventory of all supplies and parts and authorize and arrange for purchase of supplies, tools, parts, etc."
    },
    {
      "duty": "Oversee the maintenance and appearance of the shop facility and grounds."
    },
    {
      "duty": "Recruit, interview, hire and train all shop personnel."
    },
    {
      "duty": "Evaluate shop personnel and discipline when necessary."
    },
    {
      "duty": "Ensure compliance with applicable federal, state and local laws, regulations, ordinances, and company policies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED required. Completion of DOT certification for air brake inspection and adjustment. Possess Class B Certified Driver's License (CDL) within 6 months of hire. Prior supervisory experience in a shop or maintenance setting desired. Full set of hand tools required. Knowledge of welding, compactor repair, air brake inspection, vehicle inspections."
    }
  ]
}