{
  "meta": [
    {
      "job_title": "Salesforce Platform Manager",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Technology",
      "salary": 118808,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Salesforce Administration",
      "experience": 6
    },
    {
      "skill": "Business Process Documentation",
      "experience": 6
    },
    {
      "skill": "Force.com Platform Development",
      "experience": 6
    },
    {
      "skill": "Data Model Architecture",
      "experience": 6
    },
    {
      "skill": "Workflow Design",
      "experience": 6
    },
    {
      "skill": "Salesforce Data Loader",
      "experience": 6
    },
    {
      "skill": "Report Generation",
      "experience": 6
    },
    {
      "skill": "Change Management",
      "experience": 6
    },
    {
      "skill": "AppExchange App Support",
      "experience": 6
    },
    {
      "skill": "Lightning Web Components",
      "experience": 6
    },
    {
      "skill": "Salesforce Debugging",
      "experience": 6
    },
    {
      "skill": "Customer-Facing Application Development",
      "experience": 6
    },
    {
      "skill": "Technical Guidance",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop deep expertise in assigned Salesforce modules, including learning existing architecture, integrations, and automation to be able to support, maintain, and enhance the system."
    },
    {
      "duty": "Become an expert in business processes to develop and improve Salesforce-powered solutions."
    },
    {
      "duty": "Build and maintain custom applications on the SFDC platform, including data models, business logic, user interface, and workflows."
    },
    {
      "duty": "Perform administrator functions such as user management, profiles, roles, permissions, validation rules, assignment rules, queues, licenses, capacity, and storage management."
    },
    {
      "duty": "Provide production support, troubleshooting, and testing of new functionality and SFDC seasonal releases."
    },
    {
      "duty": "Prepare data files and upload the data to Salesforce.com using data loader and other 3rd party tools. Create reports in SFDC to meet operational requirements."
    },
    {
      "duty": "Execute Change Management process, including maintaining updated documentation and data dictionary. Complete regular system audits and preparations for upgrades."
    },
    {
      "duty": "Stay current with new features and functionality to provide technical guidance and feasibility for system enhancements."
    },
    {
      "duty": "Work on customer and employee facing applications as we build the next wave of technologies that will drive our resident experience to the next level."
    },
    {
      "duty": "Perform testing of new functionality and SFDC seasonal releases. Create reports in SFDC to meet operational requirements including maintaining a standard set of queries/reports to satisfy requirements; validate queries/reports created by others in the organization and assist in the interpretation of data."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "At least 6+ years’ experience administering and configuring SFDC environment with deep knowledge of the declarative (point and click) capabilities or comparable experience as a “Super User” or “Product Owner” of similar Salesforce functionality. Salesforce Certified Administrator Salesforce Certified Advanced Administrator Platform App Builder Certification"
    }
  ]
}