{
  "meta": [
    {
      "job_title": "Client Service Associate",
      "job_category": "Administrative",
      "job_class": "Associate",
      "sector": "Financial Services",
      "salary": 50000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Services a high volume of daily interactions, including basic inquiries and scheduling of meetings, with prospective and existing clients on the phone, in-person, virtually and through mailings."
    },
    {
      "duty": "Works both independently and within a dynamic team environment to provide crucial support to the financial advisors and branch office."
    },
    {
      "duty": "Processes client financial transactions and financial advisor and branch office expenses and expense reports with a high level of organization and accuracy."
    },
    {
      "duty": "Opens new client accounts and researches client and security information using internal databases and other technologies."
    },
    {
      "duty": "Ensures client paperwork and documentation is accurate and correct prior to submission and processing to meet firm and industry requirements. Follows up to ensure accurate completion."
    },
    {
      "duty": "Prepares letters, forms, and reports to assist with servicing existing clients and prospecting for new clients."
    },
    {
      "duty": "Assists Financial Advisors with marketing efforts including seminars and other client-facing events."
    },
    {
      "duty": "Performs other duties and responsibilities as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Client Relationship Management (CRM) software",
      "experience": 3
    },
    {
      "skill": "Excel",
      "experience": 4
    },
    {
      "skill": "Effective communication across multiple client interactive platforms (in-person, virtual, phone and mail)",
      "experience": 4
    },
    {
      "skill": "General office practices, procedures, and methods",
      "experience": 3
    },
    {
      "skill": "Financial markets, products and industry regulations",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent and one (1) or more years securities industry or related work experience preferred. OR ~ An equivalent combination of experience, education, and/or training as approved by Human Resources."
    }
  ]
}