{
  "meta": [
    {
      "job_title": "FP&A Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "remote": false,
      "salary": 85000
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Become a subject matter expert for Hyperion Planning.\n"
    },
    {
      "duty": "Support the monthly closing, consolidation and reconciliation processes in the Management Reporting application.\n"
    },
    {
      "duty": "Outline and test changes to our Management Reporting application (Hyperion Planning), provide end users documentation on all financial system updates.\n"
    },
    {
      "duty": "Work closely with the Hyperion consultants to maintain system integrity and recommend enhancements to Hyperion Planning.\n"
    },
    {
      "duty": "Provide training on Hyperion applications and reporting practices to new end users.\n"
    },
    {
      "duty": "Support all system requirements for on-going reporting, forecasting/budgeting.\n"
    },
    {
      "duty": "Become subject matter expert for Corporate FP&A for Data Warehouse related reporting requirements. Gain expert knowledge of table structures and content to facilitate development of more efficient data mining and ad hoc reporting. Work with IT and offshore resources to create and test enhancements as well as resolve any Data Warehouse issues.\n"
    },
    {
      "duty": "Support the development/implementation of any finance-related software packages.\n"
    },
    {
      "duty": "Assist all Finance end users to develop reporting and improve data as needed including ad hoc problem solving.\n"
    },
    {
      "duty": "Provide ad hoc reporting and data mining to support Corporate functions and Divisional teams as called upon.\n"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in IT/Finance with 1-2 years of experience. Must be a hands-on problem solver capable of working on tight deadlines and minimal direct supervision."
    }
  ],
  "skills": [
    {
      "skill": "Hyperion Planning",
      "experience": 2
    },
    {
      "skill": "Management Reporting",
      "experience": 3
    },
    {
      "skill": "Data Warehousing",
      "experience": 2
    },
    {
      "skill": "Financial Analysis",
      "experience": 2
    },
    {
      "skill": "Microsoft Excel",
      "experience": 3
    },
    {
      "skill": "Oracle SmartView",
      "experience": 1
    },
    {
      "skill": "Microsoft Access",
      "experience": 1
    },
    {
      "skill": "SQL Server",
      "experience": 1
    }
  ],
  "sector": "Finance"
}