{
  "meta": [
    {
      "job_title": "Implementation Global Design Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Provide overall direction, prioritize critical issues, and support the team to ensure that work is completed accurately and with quality according to scheduled deadlines, priorities, and overall goals."
    },
    {
      "duty": "Motivate associates through coaching, mentoring, and evaluation."
    },
    {
      "duty": "Improve GSD processes in collaboration with Methodology & Knowledge Mgt, etc. based on understanding of product direction/changes and lessons learned."
    },
    {
      "duty": "Drive innovation, best practices, and achievement of strategic objectives."
    },
    {
      "duty": "Responsible for associate hiring, performance management, and professional development activities, training, and associate engagement."
    },
    {
      "duty": "Participate in the definition of the GIC implementation strategy."
    },
    {
      "duty": "Responsible for client relationship/expectation management and the Project team's ability to deliver client requirements within project deadlines and budget."
    },
    {
      "duty": "Support communications on methodology and business process improvements within the Global Integration Center and to partner teams."
    },
    {
      "duty": "Thrive in a structured environment where you set priorities, organize your day, multi-task, change direction, and provide prompt follow-up."
    },
    {
      "duty": "Executes on continuous improvement initiatives across the GSD Team. Acts as a change leader."
    },
    {
      "duty": "Responsible for staffing and optimizing resources in the team for efficiency and maximum productivity and utilization."
    },
    {
      "duty": "Work collaboratively with other departments to ensure alignment, drive quality and client satisfaction."
    },
    {
      "duty": "Be a leader! Motivate associates while providing continuous feedback on performance and coaching. Develop team members' careers and coordinate additional training as needed with leadership support."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 80,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree -> Required. Graduate Degree -> Preferred. Global Payroll Certification -> Preferred. Workday, Oracle, or SAP Integration Certification -> Preferred"
    }
  ]
}