{
  "meta": [
    {
      "job_title": "Senior Client Relationship Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 245000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Client Relationship Management",
      "experience": 10
    },
    {
      "skill": "Strategic Account Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Financial Analysis",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Business Acumen",
      "experience": 10
    },
    {
      "skill": "Client Feedback Management",
      "experience": 10
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "Salesforce CRM",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Coaching and Mentoring",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement client-centric, action-oriented Relationship Development and Service Plan"
    },
    {
      "duty": "Lead and track multiple, complex sets of client relationship activities including RFPs, new business opportunities, client events, and marketing efforts"
    },
    {
      "duty": "Review, analyze, understand, and report key client account data including financial, diversity, and other metrics"
    },
    {
      "duty": "Plan and lead recurring internal team meetings, managing agenda preparation and tracking follow-up items"
    },
    {
      "duty": "Facilitate process and discussions on rate negotiations and financial analyses"
    },
    {
      "duty": "Develop and provide regular client relationship reporting focused on key metrics, strategic actions, impact, client satisfaction, etc."
    },
    {
      "duty": "Activate, organize, and oversee the coordination of supporting business services teams including Legal Project Management"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent required. Master’s degree (MBA, MA, MS JD, or other relevant graduate degree) preferred. Minimum of 10 years experience in strategic account management, complex program management, and/or direct client service experience in a professional services environment, or similarly relevant business experience is preferred."
    }
  ]
}