{
  "meta": [
    {
      "job_title": "Regional Human Resources Business Partner",
      "job_category": "Human Resources",
      "job_class": "Business Partner",
      "sector": "Management",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead Human Resources initiatives within a designated territory and support all aspects of human resources management, including labor planning, employee retention, employee relations, benefits administration, performance management, compliance, and training and development."
    },
    {
      "duty": "Develop and implement HR strategies that align with the company's goals and objectives and work closely with company leadership and the executive team."
    },
    {
      "duty": "Oversee the West Region and report to VP of Human Resources."
    },
    {
      "duty": "Partner with managers to develop and execute long-term and short-term people strategies that directly support and enable business objectives."
    },
    {
      "duty": "Manage employee relations issues, including resolving conflicts and addressing complaints."
    },
    {
      "duty": "Implement performance management programs that align with the organization's goals and objectives."
    },
    {
      "duty": "Ensure compliance with all relevant labor laws and regulations."
    },
    {
      "duty": "Develop and implement training and development programs to enhance employee skills and knowledge."
    },
    {
      "duty": "Develop and maintain HR policies and procedures that are compliant with all relevant laws and regulations."
    },
    {
      "duty": "Provide guidance and support to managers and employees on HR-related matters."
    },
    {
      "duty": "Partner with managers to develop and embed an organizational culture that creates both an unmatched employee and customer experience."
    },
    {
      "duty": "Leverage change acceleration techniques to assist in driving broad change."
    },
    {
      "duty": "Partner with leaders and employees within the region to create a positive and serving work environment."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree in Human Resources or related discipline"
    }
  ]
}