{
  "meta": [
    {
      "job_title": "Benefits Analysis Manager",
      "job_category": "Analysis",
      "job_class": "Manager",
      "sector": "Operations",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "BI Tools (SAS, Power BI, etc.)",
      "experience": 5
    },
    {
      "skill": "Statistical Modeling",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "Data Warehousing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee operations of the Benefits Analysis Department, leveraging data to drive strategic decision-making and optimize business operations."
    },
    {
      "duty": "Collaborate with cross-functional teams in collecting, analyzing, and visualizing data to uncover valuable insights for Executives and Trustees."
    },
    {
      "duty": "Maintain a thorough understanding of the benefits and business processes of the Basic and Supplemental Pension Plans and the Health Plan."
    },
    {
      "duty": "Develop statistical models and perform model updates as needed."
    },
    {
      "duty": "Identify cost-effective benefit initiatives and programs based on current environment and best practices."
    },
    {
      "duty": "Ensure timely and accurate business-related analytics to support annual reporting and compliance with legislative and regulatory mandates."
    },
    {
      "duty": "Oversee claims auditor and review audit reports for accuracy in conjunction with the Claims Department Manager and Controller."
    },
    {
      "duty": "Audit pension and health benefits payments through analysis of data to ensure accuracy and initiate recommendations for process improvements."
    },
    {
      "duty": "Perform any other functions as required to meet the business analysis needs of the Plans."
    },
    {
      "duty": "Maintain regular, predictable, and reliable attendance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business or related field with 5+ years’ experience in data analysis and use of analytical tools (i.e., SAS, Microsoft Power BI or Tableau). Certified Employee Benefits Specialist degree or comparative coursework related to multi-employer trust funds administration is preferred."
    }
  ]
}