{
  "meta": [
    {
      "job_title": "AR Collections Specialist",
      "job_category": "Accounting",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Negotiation",
      "experience": 3
    },
    {
      "skill": "Billing Procedures",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Accounting Software",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Construction Industry Knowledge",
      "experience": 3
    },
    {
      "skill": "Legal Processes",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitor and manage a portfolio of accounts to ensure timely payment and minimize delinquency rates."
    },
    {
      "duty": "Follow up with customers through phone calls, emails, and other communication channels to secure payment for outstanding invoices."
    },
    {
      "duty": "Review and analyze customer payment histories and account records to identify delinquent accounts and prioritize collection efforts."
    },
    {
      "duty": "Resolve billing discrepancies, disputes, and issues related to outstanding balances in a timely and professional manner."
    },
    {
      "duty": "Collaborate with project managers, estimators, and other relevant stakeholders to resolve customer billing concerns and ensure accurate invoicing."
    },
    {
      "duty": "Develop and implement effective collection strategies and payment plans to minimize outstanding balances and improve cash flow."
    },
    {
      "duty": "Monitor and maintain accurate records of collection activities, including customer contact details, payment arrangements, and collection notes."
    },
    {
      "duty": "Provide regular updates to management on collection activities, including delinquency rates, payment trends, and any escalated accounts."
    },
    {
      "duty": "Work closely with the accounting team to reconcile customer accounts and resolve any outstanding payment issues."
    },
    {
      "duty": "Assist in the preparation of legal documents and collaborate with legal counsel when necessary for collections or disputes."
    },
    {
      "duty": "Contribute to process improvements and recommend strategies to streamline the collections process."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Proven work experience as a Collections Specialist within the construction industry."
    },
    {
      "credential": "Solid understanding of construction billing and payment procedures."
    },
    {
      "credential": "Knowledge of construction contracts, lien laws, and related legal processes is highly desirable."
    },
    {
      "credential": "Proficiency in using accounting software, CRM systems, and Microsoft Office Suite."
    },
    {
      "credential": "High level of integrity and ethical behavior in handling sensitive financial information."
    },
    {
      "credential": "All applicants applying for U.S. job openings must be legally authorized to work in the United States. Candidates applying for this role are required to have US residency at the time of application."
    }
  ]
}