{
  "meta": [
    {
      "job_title": "Industrial Hygiene Supervisor",
      "job_category": "Health and Safety",
      "job_class": "Supervisor",
      "sector": "Health and Safety",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assess and minimize risks associated with potentially hazardous agents and ensure compliance with federal, state, and local laboratory and chemical safety regulations."
    },
    {
      "duty": "Develop, supervise, and implement industrial hygiene programs in a clinical and biomedical research environment, including chemical monitoring, hazard communications, respiratory protection, air quality, and hearing conservation."
    },
    {
      "duty": "Provide supervision and administrative support to assist the Industrial Hygiene Officer (IHO) in maintaining an effective and safe occupational and environmental hygiene program."
    },
    {
      "duty": "Supervise and coordinate the occupational and environmental hygiene program. Provide training to the industrial hygiene technicians regarding exposure assessments and air sampling."
    },
    {
      "duty": "Develop and deliver chemical safety training courses. Participate in risk assessment surveys of research laboratories and other work areas as part of the hazard surveillance system to ensure compliance with safety policies and regulatory standards."
    },
    {
      "duty": "Conduct occupational exposure assessments for hazardous chemicals, noise, and physical hazards. Maintain a database of exposure assessment records. Report results of exposure assessments to affected employees."
    },
    {
      "duty": "Manage the biological safety cabinet and fume hood certification program. Coordinate certifications (and repairs if necessary) of biological safety cabinets, fume hoods, and other containment equipment items."
    },
    {
      "duty": "Manage the air handling unit HEPA filter certification program. Serve as the industrial hygiene representative for Physical Environment rounds conducted in clinical areas subject to accreditation."
    },
    {
      "duty": "Serve as the Respiratory Protection Program Manager. Coordinate and schedule fit testing for employees required to wear respirators. Conduct respirator fit testing of employees using tight-fitting respirators. Maintain the respirator fit testing database."
    },
    {
      "duty": "Investigate chemical exposure incidents, as assigned by the EHS Senior Manager. Perform root cause analyses for select events."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Industrial Hygiene, Environmental Health, Science, or related field required. (Master's degree preferred)"
    }
  ]
}