{
  "meta": [
    {
      "job_title": "Director of Sales",
      "job_category": "Sales",
      "job_class": "Director",
      "sector": "Sales",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Business Development",
      "experience": 10
    },
    {
      "skill": "Marketing Strategy",
      "experience": 7
    },
    {
      "skill": "Market Analysis",
      "experience": 7
    },
    {
      "skill": "Negotiation",
      "experience": 10
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 10
    },
    {
      "skill": "Sales Forecasting",
      "experience": 10
    },
    {
      "skill": "Budget Planning",
      "experience": 10
    },
    {
      "skill": "Team Development",
      "experience": 10
    },
    {
      "skill": "CRM Software",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a strategic plan and a go-to-market strategy to achieve Sales targets and expand our customer base."
    },
    {
      "duty": "Align Sales departmental objectives with business strategy through active participation in corporate strategic planning, Sales strategy development, forecasting, and Sales resource planning and budgeting."
    },
    {
      "duty": "Work with other departments and upper management to align efforts, avoid conflict of interests, and guarantee the success of targeted Sales strategies."
    },
    {
      "duty": "Staying up to date on competitive landscape and market trends; using this information to shift tactical budgets and the strategic direction of accounts."
    },
    {
      "duty": "Forecast and develop annual Sales quotas, revenue goals, expected Sales volume and profit, and ensure annual Sales targets are met or exceeded."
    },
    {
      "duty": "Maintain Sales volume, product mix, and selling price by keeping current with supply and demand, changing trends, economic indicators, and competitors."
    },
    {
      "duty": "Determine and monitor departmental key performance indicators (KPIs)."
    },
    {
      "duty": "Develop and establish a consultative and advisory sales and relationship approach model with customers to enhance long-term sales and value."
    },
    {
      "duty": "Lead complex negotiations with customers to maximize revenue and win the maximum number of deals."
    },
    {
      "duty": "Support increased brand awareness and ongoing marketing efforts."
    },
    {
      "duty": "Develop and monitor the accuracy and efficiency of Sales reports/analytics to ensure operation of a high-performing sales team."
    },
    {
      "duty": "Oversee staff operations, business planning, budget development, and expenditures toward achievement of objectives."
    },
    {
      "duty": "Lead Sales team by assigning employees to accounts, planning, monitoring, and appraising job results."
    },
    {
      "duty": "Motivate and support by coaching and mentoring employees."
    },
    {
      "duty": "Maintain Sales staff by recruiting, selecting, conducting orientation, and training employees."
    },
    {
      "duty": "Coordinate the training of Sales management and Sales support personnel by providing them with the necessary tools to ensure optimal performance of the Sales force."
    },
    {
      "duty": "Assist Sales department with complex Sales negotiations, attend Sales presentations, and help close deals."
    },
    {
      "duty": "Build and maintain strong customer relationships, partnering with them to understand their business needs and objectives."
    },
    {
      "duty": "Attend key events and conferences to generate leads and sustain relationships."
    },
    {
      "duty": "Assist team with generating RFP submissions and related Sales documents."
    },
    {
      "duty": "Maintain records of current Accounts and Opportunities and seek out opportunities to further Sales initiatives."
    },
    {
      "duty": "Work with other internal teams, on behalf of clients, to ensure the highest level of customer service."
    },
    {
      "duty": "Interface with Technical Support, internally, to resolve issues that directly impact customers."
    },
    {
      "duty": "Foster a culture of success, ongoing business and goal achievement, and continuous process improvement."
    },
    {
      "duty": "Help enhance company culture and employee experience."
    },
    {
      "duty": "Travel as necessary."
    },
    {
      "duty": "Other duties as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Business Administration, Marketing, or related field required. Master’s Degree, MBA, or PhD in related field preferred."
    }
  ]
}