{
  "meta": [
    {
      "job_title": "Senior Cyber Modeler",
      "job_category": "Cybersecurity",
      "job_class": "Senior",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Machine Learning Models",
      "experience": 3
    },
    {
      "skill": "Python",
      "experience": 3
    },
    {
      "skill": "SQL",
      "experience": 3
    },
    {
      "skill": "Catastrophe Modelling",
      "experience": 1
    },
    {
      "skill": "Cyber Risk Analysis",
      "experience": 1
    },
    {
      "skill": "Enterprise Architecture",
      "experience": 1
    },
    {
      "skill": "Security Framework",
      "experience": 1
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work with the company’s Cyber Analytics Center of Excellence to deliver best in class cyber analytics to company’s internal and external clients."
    },
    {
      "duty": "Interact with stakeholders across the organization to understand the cyber analytics needs from individual risk modelling to aggregation modelling and develop solutions that span this spectrum."
    },
    {
      "duty": "Collaborate with other members of the Analytics team and help recruit new team members."
    },
    {
      "duty": "Understand the different cyber analytics needs of corporations, insurance companies, and reinsurance companies, and develop analytic solutions for each."
    },
    {
      "duty": "Build cyber risk loss estimation models, tools and reports using proprietary internal data and data licensed from third parties."
    },
    {
      "duty": "Analyze and evaluate third-party cyber risk loss estimation models."
    },
    {
      "duty": "Write articles, papers, blogs, and other thought leadership pieces."
    },
    {
      "duty": "Collaborate with colleagues within the Cyber Analytics Center, other analytics groups across the company, and third-party vendors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in Business Intelligence and Analytics, Information Systems and Technology, Computer Engineering, or a related field (foreign equivalent accepted)"
    }
  ]
}