{
  "meta": [
    {
      "job_title": "Compensation Consulting Engagement Leader",
      "job_category": "Consulting",
      "job_class": "Leader",
      "sector": "Consulting",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 7
    },
    {
      "skill": "Compensation Practices",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Problem-Solving",
      "experience": 7
    },
    {
      "skill": "Market Analysis",
      "experience": 7
    },
    {
      "skill": "RFP Development",
      "experience": 7
    },
    {
      "skill": "Team Management",
      "experience": 7
    },
    {
      "skill": "Billing Management",
      "experience": 7
    },
    {
      "skill": "Bachelor's Degree",
      "experience": 7
    },
    {
      "skill": "MarketPCC Certification",
      "experience": 0
    },
    {
      "skill": "Masters or MBA Degree",
      "experience": 0
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify and attract prospects through public speaking engagements, writing articles, and networking."
    },
    {
      "duty": "Listen to prospective client’s issues, understand their situation, identify potential needs, and produce a solution while costing proposal fees."
    },
    {
      "duty": "Liaise with the client and lead teams working on assigned projects to ensure completion with a high level of technical and professional accuracy."
    },
    {
      "duty": "Oversee the development of project deliverables such as market pricings, pay structure design, and cost impact models."
    },
    {
      "duty": "Partner with team members related to researching on difficult questions or escalated issues and ensure project deliverables are understood and accepted."
    },
    {
      "duty": "Ensure team members meet very high standards for customer service, technical, and communication skills."
    },
    {
      "duty": "Generate revenue through the development of new client relationships while building and maintaining strong client relationships."
    },
    {
      "duty": "Design short-term and long-term incentive programs that reinforce the clients' strategic objectives."
    },
    {
      "duty": "Develop RFP (Request for Proposal) for new clients and existing cross-selling opportunities."
    },
    {
      "duty": "Provide oversight of project deliverables like market pricings, pay structure design, cost impact models, and help with project billing."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience"
    }
  ]
}