{
  "meta": [
    {
      "job_title": "Porter/Gatekeeper",
      "job_category": "Property Maintenance",
      "job_class": "Porter",
      "sector": "Property Management",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Property Maintenance",
      "experience": 1
    },
    {
      "skill": "General Maintenance",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Physical Labor",
      "experience": 2
    },
    {
      "skill": "Professional Communication",
      "experience": 2
    },
    {
      "skill": "Landscaping",
      "experience": 1
    },
    {
      "skill": "Pool Maintenance",
      "experience": 1
    },
    {
      "skill": "Safety Protocols",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain the physical condition of the property according to The Scion Group’s Standard Operating Procedures, OSHA and Industry standards."
    },
    {
      "duty": "Perform physically demanding work to maintain the asset, and other property features to minimize liability concerns."
    },
    {
      "duty": "Remove trash and other debris from the common areas on a continuous basis."
    },
    {
      "duty": "Sweep and remove debris from the curbs, parking areas, walkways and stairways as scheduled."
    },
    {
      "duty": "Maintain and repair loose stairwell treads."
    },
    {
      "duty": "Maintain and repair exterior lighting by replacing burned out bulbs and reporting inventory to supervisor."
    },
    {
      "duty": "Mow all lawn areas, remove clippings as scheduled, trim all planting beds, rake and remove leaves and other debris from landscaped areas."
    },
    {
      "duty": "Apply weed and feed to lawn areas as scheduled; top seed and water areas as needed."
    },
    {
      "duty": "Install seasonal plantings, replacement shrubs and trees, decorative rock and water features."
    },
    {
      "duty": "Trim and prune trees and shrubs as directed."
    },
    {
      "duty": "Maintain, adjust and repair irrigation system and fountains as needed."
    },
    {
      "duty": "Clean pool and spa in accordance with manufacturer specifications and code compliance."
    },
    {
      "duty": "Perform routine maintenance and repairs to pool equipment, as directed."
    },
    {
      "duty": "Know the emergency procedures for the property, including the location and how to engage water and gas shutoff valves and access to sewer cleanouts and fuse panels."
    },
    {
      "duty": "Promote safety awareness to limit property loss and damage or injury to residents and visitors to the property."
    },
    {
      "duty": "Keep drainage grills on grounds clear of leaves."
    },
    {
      "duty": "Pressure-wash sidewalks, buildings, pool decks, etc."
    },
    {
      "duty": "Assist in snow removal at property, as required."
    },
    {
      "duty": "Undertake training related to job duties as deemed necessary."
    },
    {
      "duty": "Maintain required property uniform and present a professional appearance and attitude."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school/GED or trade school diploma and one year of full-time experience in some aspect of lawn/grounds maintenance, or an equivalent combination of education and experience"
    }
  ]
}