{
  "meta": [
    {
      "job_title": "Information Systems Architect",
      "job_category": "Information Technology",
      "job_class": "Architect",
      "sector": "Leisure and Travel",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "AWS Cloud Engineer",
      "experience": 5
    },
    {
      "skill": "AWS Application Systems Design",
      "experience": 5
    },
    {
      "skill": "AWS IT Infrastructure Management",
      "experience": 5
    },
    {
      "skill": "Windows Server",
      "experience": 5
    },
    {
      "skill": "Terraform",
      "experience": 5
    },
    {
      "skill": "CI/CD",
      "experience": 5
    },
    {
      "skill": "Scrum",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide an architectural framework for information system development, maintenance, and enhancement efforts."
    },
    {
      "duty": "Understand user and process requirements and ensure those requirements can be achieved through high-quality deliverables."
    },
    {
      "duty": "Work closely with developers and engineers to develop road maps for Corporate System's AWS applications, align development plans, and to ensure effective integration among information systems and the AWS IT infrastructure."
    },
    {
      "duty": "Monitor technological advancements to ensure that solutions are continuously improved, supported, and aligned with industry and company standards as well as emerging business requirements."
    },
    {
      "duty": "Understand the interactions between systems, applications, and services within the environment, and evaluate the impact of changes or additions."
    },
    {
      "duty": "Analyze systems and perform usability testing to ensure performance and reliability, enhance scalability, and meet security requirements."
    },
    {
      "duty": "Conduct routine tasks as directed. Closely supervised with little latitude for independent judgment."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or a related field (Master's preferred)"
    }
  ]
}