{
  "meta": [
    {
      "job_title": "Construction Project Executive",
      "job_category": "Construction",
      "job_class": "Executive",
      "sector": "Construction",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 20
    },
    {
      "skill": "Project Management",
      "experience": 20
    },
    {
      "skill": "Contract Management",
      "experience": 15
    },
    {
      "skill": "Risk Management",
      "experience": 15
    },
    {
      "skill": "Program Management",
      "experience": 15
    },
    {
      "skill": "Subcontracting",
      "experience": 15
    },
    {
      "skill": "Asset Management",
      "experience": 15
    },
    {
      "skill": "Communication Skills",
      "experience": 20
    },
    {
      "skill": "Team Leadership",
      "experience": 20
    },
    {
      "skill": "Presentation Skills",
      "experience": 20
    },
    {
      "skill": "Project Accounting",
      "experience": 20
    },
    {
      "skill": "Microsoft Office",
      "experience": 20
    },
    {
      "skill": "Primavera P6",
      "experience": 20
    },
    {
      "skill": "MS Project",
      "experience": 20
    },
    {
      "skill": "Adobe Writer",
      "experience": 15
    },
    {
      "skill": "Visio",
      "experience": 15
    },
    {
      "skill": "Windows Environment",
      "experience": 20
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and drive larger, more complex construction projects under general direction."
    },
    {
      "duty": "Manage overall program development effort, management plan, and progress monitoring."
    },
    {
      "duty": "Identify actions required in the event of deviation from the plan and adhere to standardized procedures and processes."
    },
    {
      "duty": "Represent company interests to exceed customer satisfaction and ensure overall safety program compliance."
    },
    {
      "duty": "Provide primary leadership for the program and associated Project Delivery Teams."
    },
    {
      "duty": "Collaborate with various teams to identify and deliver program objectives and establish project recovery plans."
    },
    {
      "duty": "Mentor project team and assess training needs for future project leaders."
    },
    {
      "duty": "Ensure accurate and timely reporting of assigned projects via operational and financial systems reporting."
    },
    {
      "duty": "Make presentations to Executive Management on current and forecasted performance and review overall subcontracting strategies."
    },
    {
      "duty": "Maintain relationships with major subcontractors and oversee monthly performance evaluations of strategic programs."
    },
    {
      "duty": "Responsible for overall scope management, coordination with installation managers, and program asset management."
    },
    {
      "duty": "Ensure project document controls are in compliance with contract requirements and seek opportunities to increase customer satisfaction and deepen client relationships."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Construction, Civil, Mechanical, Electrical Engineering, Construction Management or Architecture. Master’s degree preferred. Certification as a PMI Project Management Professional (PMP) is highly preferred."
    }
  ]
}