{
  "meta": [
    {
      "job_title": "Business Development Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 125000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Target and penetrate Public Companies, Middle Market Businesses, and larger enterprises in industries such as Energy, Construction, Higher Education, Manufacturing, Government & Nonprofit, Aerospace, and Financial Services."
    },
    {
      "duty": "Skillfully contact CFOs, CROs, CAEs, CCOs, CISOs CTOs, Internal Audit Directors/Managers and other key financial leaders to understand their needs, future plans, and desire for change."
    },
    {
      "duty": "Continually identify and qualify new sales opportunities by building trusted relationships and maximizing enterprise sales programs, campaigns, and content-driven digital programming."
    },
    {
      "duty": "Partner with Client Service Teams to develop and execute sales campaigns specific to the targeted industries and markets."
    },
    {
      "duty": "Meet the challenge of generating leads and winning new business in dynamic and sophisticated organizations that require a full range of advisory solutions and advice."
    },
    {
      "duty": "Support prospecting and referral activity through a goal of conducting a minimum of 20 sales appointments per month, utilizing various communication channels, including in-person meetings, video conferences, and phone calls."
    },
    {
      "duty": "Work closely with Client Service colleagues to lead a team sales approach that listens and responds to prospect needs, highlights the CBIZ value proposition, and demonstrates a compelling win strategy."
    },
    {
      "duty": "Responsible for crafting an annual sales plan and achieving annual sales goals agreed upon with the National Director of Business Development."
    },
    {
      "duty": "Plan and report on sales activity using Salesforce CRM enterprise application."
    },
    {
      "duty": "Play a role in delivering business development skills training to client service colleagues and other emerging professionals."
    },
    {
      "duty": "Report to the National Director of Business Development while maintaining strong relationships with internal stakeholders, including Senior Managing Directors, Managing Directors, Practice Leaders, and Marketing and Operations Professionals."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree and a fundamental understanding of business administration, finance, and/or accounting. Proven sales ability represented by a minimum of 5 years of direct sales experience."
    }
  ]
}