{
  "meta": [
    {
      "job_title": "Senior Technology Manager",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Technology",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technology Evaluation",
      "experience": 5
    },
    {
      "skill": "Licensing Strategy",
      "experience": 5
    },
    {
      "skill": "IP Strategy",
      "experience": 5
    },
    {
      "skill": "Early-Stage Technology Commercialization",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluate and manage invention disclosures, develop innovation and licensing strategies, and conduct outreach to successfully commercialize University-owned intellectual property."
    },
    {
      "duty": "Maintain a close working relationship with other OTM and campus staff to fulfill the obligations of federal compliance, IP protection, and related needs."
    },
    {
      "duty": "Develop and manage strong relationships with faculty inventors and prospective inventors, providing specialized advice and counsel on technology commercialization."
    },
    {
      "duty": "Perform licensing and marketing responsibilities, including evaluating and screening disclosures, identifying and qualifying licensees, drafting business terms for license agreements, and independent development of marketing strategies."
    },
    {
      "duty": "Train, supervise, and mentor colleague and support staff as needed, and oversee programs to further advance and promote innovation at UIC."
    },
    {
      "duty": "Provide assistance to the Director, OTM, on matters as needed, and lead or work with OTM staff to improve and maintain procedures for administrative efficiency."
    },
    {
      "duty": "Strengthen relationships within the innovation ecosystem, interface with senior executives and decision-makers in various industries, and provide strategic vision, planning, and execution of university-wide programs to expedite innovation and catalyze commercialization."
    },
    {
      "duty": "Work as an integral part of a team contributing to the on-going evolution of UIC OTM in its mission of commercializing University intellectual property and enhancing economic development."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in related field (Master's preferred) with technical background in a research area aligned with the technology portfolio."
    }
  ]
}