{
  "meta": [
    {
      "job_title": "Market Sales Leader",
      "job_category": "Sales",
      "job_class": "Leader",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Outside/outbound Sales",
      "experience": 2
    },
    {
      "skill": "B2B Sales",
      "experience": 2
    },
    {
      "skill": "Relationship Building",
      "experience": 2
    },
    {
      "skill": "Prospecting",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Microsoft Products",
      "experience": 2
    },
    {
      "skill": "Event Planning",
      "experience": 2
    },
    {
      "skill": "Verbal Communication",
      "experience": 2
    },
    {
      "skill": "Written Communication",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prospect, qualify, and sell B2B catering and gifting to new and lapsed corporate customers within an assigned geographical market."
    },
    {
      "duty": "Build relationships with new B2B customers and encourage frequent repeat business."
    },
    {
      "duty": "Sell products and gift cards to corporate customers by articulating the gifting value proposition and benefit of products."
    },
    {
      "duty": "Achieve assigned sales targets on a monthly and trimester basis."
    },
    {
      "duty": "Complete assigned number of sales driving activities on a daily basis such as number of calls, visits, and emails."
    },
    {
      "duty": "Record work completed daily in designated reporting system."
    },
    {
      "duty": "Accept orders, enter orders into the point of sale system, and submit orders on a timely basis for fulfillment."
    },
    {
      "duty": "Create and maintain prospecting lists, provide customer service assistance to corporate clients, and generate and submit telemarketing activity reports on a regular basis."
    },
    {
      "duty": "Schedule and conduct Lunch and Learn seminars with businesses."
    },
    {
      "duty": "Place follow-up calls to customers prior to order receipt and after order receipt to ensure customer satisfaction with the process and purchase."
    },
    {
      "duty": "Report customer issues and major changes to the General Manager for resolution."
    },
    {
      "duty": "Build relationships with General Managers in the market to gain a better understanding of the market and the strengths of the stores."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree or equivalent work experience preferred."
    }
  ]
}