{
  "meta": [
    {
      "job_title": "Front-End Driver",
      "job_category": "Transportation",
      "job_class": "Driver",
      "sector": "Waste Management",
      "salary": 52000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Driving",
      "experience": 5
    },
    {
      "skill": "Vehicle Inspection",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Safety Procedures",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Operate front-end trucks to collect and transport waste and recyclables from residential and commercial routes."
    },
    {
      "duty": "Perform daily pre- and post-trip inspections of the vehicle and submit vehicle condition reports."
    },
    {
      "duty": "Interact courteously with customers and the general public along the route, answering questions and responding to requests."
    },
    {
      "duty": "Maintain clean customer sites and safety along roads and highways by cleaning loose trash."
    },
    {
      "duty": "Submit logbook, daily route/productivity sheet, and vehicle condition report as required by law or company policy."
    },
    {
      "duty": "Follow safe operating practices and safety standards, including lockout/tagout procedures."
    },
    {
      "duty": "Monitor operations to detect loose debris and conduct visual scans of customer sites before and after dumping."
    },
    {
      "duty": "Conduct employment screening, hiring, training, evaluating, and developing personnel to meet service commitments."
    },
    {
      "duty": "Adhere to wage and hour laws, compensate personnel for services rendered, and practice progressive discipline with employee performance issues."
    },
    {
      "duty": "Ensure safe working conditions, plan and operate landfill operations, and establish and review productivity standards."
    },
    {
      "duty": "Promote an effective safety program, investigate accidents, and ensure proper supply and usage of safety equipment."
    },
    {
      "duty": "Conform with applicable laws, regulations, ordinances, company policies, procedures, and directives from supervisors."
    },
    {
      "duty": "Perform other duties and responsibilities as required or requested by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree from a four-year college or university, or equivalent combination of required education and experience."
    }
  ]
}