{
  "meta": [
    {
      "job_title": "EH&S Officer",
      "job_category": "Environmental Health and Safety",
      "job_class": "Officer",
      "sector": "EHS",
      "salary": 125000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Federal Laws and Regulations Compliance",
      "experience": 5
    },
    {
      "skill": "Biomedical Laboratory Safety",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Emergency Response Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, coordinate, and implement environmental health and safety programs in compliance with federal, state, and local laws, regulations, and guidelines."
    },
    {
      "duty": "Review and approve complex research projects, ensuring compliance with regulations such as NIH, CDC, and EH&S policies."
    },
    {
      "duty": "Integrate safety into Institute operations and promote safe work practices based on regulatory requirements and best management practices."
    },
    {
      "duty": "Assess risk of biological agent protocols, process applications for registration with the Institutional Biosafety Committee, and prepare policies and procedures for biological and chemical hazards."
    },
    {
      "duty": "Manage laboratory inspections and compliance reviews, providing recommendations to Principal Investigators (PIs)/labs based on regulatory compliance."
    },
    {
      "duty": "Conduct training on biological safety, bloodborne pathogens, chemical safety, and hazardous materials shipping, as well as assist in the response to laboratory-related accidents or exposures."
    },
    {
      "duty": "Develop written plans, training modules, fact sheets, and other communications, while collaborating with EH&S staff, PIs, and researchers to promote a culture of safety."
    },
    {
      "duty": "Provide 24-hour emergency response for Institute biological/blood spills, chemical/oil/waste releases, personal injuries, fire, etc., and contribute to the development of an inclusive working and learning environment."
    },
    {
      "duty": "Chair Institutional Biosafety Committee, be a member of the Institutional Animal Care and Use Committee, lead the Emergency Response Team, and be involved in Radiation Safety and Occupational & Laboratory Safety Committees."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 110,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BS in Science and MS or MPH in OEHS with 5+ years related work experience, or BS in Science with 10+ years related work experience."
    },
    {
      "credential": "Ideal certifications such as CBSP, CIH, and CSP, or eligibility for professional certification."
    },
    {
      "credential": "Maintain medical clearance to work in biohazard high containment laboratories."
    },
    {
      "credential": "Working knowledge of CITI training and Cayuse platforms."
    }
  ]
}