{
  "meta": [
    {
      "job_title": "Medical Technologist",
      "job_category": "Healthcare",
      "job_class": "Laboratory",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": false
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Medical Technology, or a science discipline is required, consistent with Clinical Laboratory Improvement Amendment (CLIA) requirements."
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure the integrity and acceptability of specimens for testing and/or blood or blood components, perform laboratory tests, and report test results."
    },
    {
      "duty": "Communicate critical values, differentiate, and resolve technical, instrument, and physiologic causes of problems or unexpected test results."
    },
    {
      "duty": "Complete equipment maintenance and quality control functions, also promote a Lean work culture by performing team member duties to ensure consistent use of Lean principles and processes."
    },
    {
      "duty": "Operate and perform daily preventive maintenance of equipment according to written procedures, report equipment malfunctions, and request service as necessary."
    },
    {
      "duty": "Actively participate in inventory control and supply chain operations through the application of Lean principles, and look for, initiate, and/or participate in quality improvement opportunities."
    },
    {
      "duty": "Promote teamwork and cooperation through helpful, courteous, and positive interactions with colleagues, also take ownership of performance and PEAC process by understanding lab goals and objectives and aligning individual activities and performance with hospital and lab goals and objectives."
    },
    {
      "duty": "Maintain inspection readiness and demonstrate knowledge and ownership of current inspection requirements for all applicable regulatory and accrediting agencies relating to the area of responsibility."
    },
    {
      "duty": "Attend and participate in shift stand up meetings, staff meetings, and Laboratory Town Hall meetings, share knowledge, and provide instructions to new employees, students, other technologists, technicians, and other staff."
    },
    {
      "duty": "Pursue continuing education and perform other duties and special projects as requested. Read and adhere to all laboratory policies and procedures pertaining to the section and document understanding of such."
    }
  ],
  "skills": [
    {
      "skill": "Quality Control",
      "experience": 2
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Teamwork",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ]
}