{
  "meta": [
    {
      "job_title": "Operations Coordinator - Administration",
      "job_category": "Administration",
      "job_class": "Coordinator",
      "sector": "Management",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Operational Support",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Change Management",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Technology Implementation",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    },
    {
      "skill": "Strategic Planning",
      "experience": 3
    },
    {
      "skill": "Event Management",
      "experience": 3
    },
    {
      "skill": "Interdisciplinary Liaison",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide operational and logistical support to the Market President and Director of Human Resources, facilitating key strategic and operational meetings."
    },
    {
      "duty": "Research and accumulate relevant data for strategic initiatives and best practices, and support managers, supervisors, and directors across both hospitals."
    },
    {
      "duty": "Assist in administrative, financial, and operational duties for respective departments, and educate on technology, process improvement, and project management."
    },
    {
      "duty": "Prepare and present key operational reports, initiate reminders and attend meetings to take minutes of the session."
    },
    {
      "duty": "Conduct ongoing research in workforce, innovation, business, and regulatory trends to provide intelligence and data support for operational and logistical tactics."
    },
    {
      "duty": "Plan, lead, and execute projects, evaluate and execute performance improvement initiatives, and provide data analysis of key operational and strategic initiatives."
    },
    {
      "duty": "Collaborate with talent acquisition team and physicians, and provide timely follow-up with all requests."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 90,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in healthcare administration, business, or related discipline required. Master’s degree preferred."
    }
  ]
}