{
  "meta": [
    {
      "job_title": "Visiting Technology Manager",
      "job_category": "Academic Professional",
      "job_class": "Manager",
      "sector": "Technology Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technology Evaluation",
      "experience": 5
    },
    {
      "skill": "Licensing Strategies",
      "experience": 5
    },
    {
      "skill": "IP Strategy",
      "experience": 5
    },
    {
      "skill": "Marketing",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Intellectual Property Law",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluate and manage invention disclosures, and develop licensing strategies."
    },
    {
      "duty": "Conduct outreach to industry and individuals for commercializing University-owned intellectual property."
    },
    {
      "duty": "Maintain a close working relationship with OTM and campus staff to fulfill federal compliance and IP protection obligations."
    },
    {
      "duty": "Develop and manage strong relationships with faculty inventors and prospective inventors."
    },
    {
      "duty": "Provide specialized advice and counsel on technology commercialization including disclosing inventions, screening and evaluation, and licensing."
    },
    {
      "duty": "Perform marketing responsibilities, including building and managing strong industry relationships."
    },
    {
      "duty": "Develop and deliver an annual Action Plan to enhance the disclosure pipeline and marketing of technologies."
    },
    {
      "duty": "Develop an annual Professional Development & Improvement Plan."
    },
    {
      "duty": "Train and mentor Associate Technology Managers and other support staff when needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "PhD, Doctor of Medicine, Dentistry, Pharm D, JD with science background, MBA with Doctorate in relevant science. Foreign professional degrees are acceptable. Minimum (one) 1 year of relevant professional experience in business, academia, or government, including the licensing of technologies"
    }
  ]
}