{
  "meta": [
    {
      "job_title": "Operations Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Operations",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Food Production Management",
      "experience": 5
    },
    {
      "skill": "Cost Control",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Team Training",
      "experience": 5
    },
    {
      "skill": "Performance Evaluation",
      "experience": 5
    },
    {
      "skill": "Labor Relations",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensures quality production standards are followed and maintained."
    },
    {
      "duty": "Controls food cost and other controllable costs."
    },
    {
      "duty": "Maintains all financial goals related to productivity, overtime, labor goals and meals per hour."
    },
    {
      "duty": "Works with management staff to improve performance of the unit."
    },
    {
      "duty": "Conducts inventory of products to ensure proper usage and minimization of waste."
    },
    {
      "duty": "Supervises employees on daily operations, conducts performance evaluations, and provides specific and detailed feedback on their management and leadership skills."
    },
    {
      "duty": "Completes required requisitions for the Storeroom to ensure adequate supply is maintained."
    },
    {
      "duty": "Responsible for coaching, counseling, and preparing corrective actions for employees in compliance with the applicable union/collective bargaining agreement(s)."
    },
    {
      "duty": "Reviews and ensures employees in chain of command are in correct cost centers and correct job titles."
    },
    {
      "duty": "Must complete all company required training including but not limited to ServSafe."
    },
    {
      "duty": "Regularly stands, bends, lifts, and moves intermittently during shifts of 10+ hours. In a normal production kitchen facility, there may be physical discomfort due to temperature and noise."
    },
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote freight and logistics services."
    },
    {
      "duty": "Lead a team of marketing specialists, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's online presence, optimizing the website and social media channels for maximum engagement and conversions."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED required. Associates degree or degree from a 4-year university or college preferred."
    }
  ]
}