{
  "meta": [
    {
      "job_title": "Construction Project Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for on-site project management of assigned projects. Manages schedule milestones and monitors workforce levels to ensure conformance with the construction plan."
    },
    {
      "duty": "Controls change/scope creep, ensuring that all scope changes are quickly and properly documented and that change orders are approved prior to the performance of work."
    },
    {
      "duty": "Implements the site safety and security procedures and project work rules and plays an active role in the development of the safety program."
    },
    {
      "duty": "Develops and maintains Customer and Subcontractor relationships."
    },
    {
      "duty": "Acts as the primary on-site leader for execution teams on assigned projects."
    },
    {
      "duty": "Plans, develops project schedules, controls project activities, and executes according to plan for assigned projects."
    },
    {
      "duty": "Oversees project construction for compliance with specifications, local codes and construction techniques."
    },
    {
      "duty": "Reviews design scope and approach with regard to constructability and submits recommendations for change."
    },
    {
      "duty": "Actively pursues additional work through change orders."
    },
    {
      "duty": "Reviews and interprets contract Terms and Conditions."
    },
    {
      "duty": "Monitors productivity and cost and recommends changes in order to mitigate problems and maintain maximum labor, productivity and cost effectiveness."
    },
    {
      "duty": "Reports project status to ensure profitability goals and management of cash/cost/billing."
    },
    {
      "duty": "Ensures subcontractors understand expectations of the project."
    },
    {
      "duty": "Oversees site safety and security."
    },
    {
      "duty": "Safe execution of field construction activities in conformance with the engineering package and project budget & schedule."
    },
    {
      "duty": "Ensures project document controls are in compliance with contract requirements and JCI standards."
    },
    {
      "duty": "Assists in the evaluation of contractual scope of work and the impact of client issued bulletins, field directives and/or scheduling changes."
    },
    {
      "duty": "Coordinates customer-training requirements."
    },
    {
      "duty": "Assists Area Operations Leader and/or sales in project development efforts."
    },
    {
      "duty": "Responsible for the audit timeline and project execution."
    },
    {
      "duty": "Assists to develop cost estimates and sub-contractor scope documents and solicitations for bids."
    },
    {
      "duty": "Able to travel based on assigned projects, as projects may exist outside of assigned geography."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Project/Construction Management. PMP Design Build Institute of America (DBIA), LEED certification, preferred."
    }
  ]
}