{
  "meta": [
    {
      "job_title": "Process Improvement Specialist",
      "job_category": "Process Improvement",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Lean Six Sigma",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Business Analysis",
      "experience": 4
    },
    {
      "skill": "Change Management",
      "experience": 4
    },
    {
      "skill": "Value Stream Mapping",
      "experience": 4
    },
    {
      "skill": "Performance Metrics",
      "experience": 4
    },
    {
      "skill": "Operational Excellence",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Data Interpretation",
      "experience": 5
    },
    {
      "skill": "Innovation",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead cross-functional, company-wide, and business unit specific process improvement initiatives using Lean Six Sigma, Project Management, Business Analysis, and change management disciplines."
    },
    {
      "duty": "Conduct organizational and business process analysis, prepare value stream mapping, and drive project planning activities for continuous improvement efforts."
    },
    {
      "duty": "Equip the organization with operational excellence tools and practices by applying Lean and Six Sigma methodology on a regular basis, facilitating knowledge transfer within the business units."
    },
    {
      "duty": "Lead high-impact process improvement projects by partnering with senior leaders to increase operational efficiency and reduce waste through Lean and Six Sigma tools."
    },
    {
      "duty": "Validate and scope improvement projects, link client requirements with business process improvements, and organize effective teams to deliver results."
    },
    {
      "duty": "Solve complex problems, integrate and interpret data from diverse sources, and monitor changes made to improve processes for long-term adoption."
    },
    {
      "duty": "Partner with business leaders to increase efficiencies and reduce waste within the organization, ensuring efforts produce expected financial results."
    },
    {
      "duty": "Bring innovation and insight by working closely with Business partners and being a trusted administrator to drive process improvement independently."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 40,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree - Preferred, 4 years of experience in Lean implementation, 1 year of experience in Six Sigma, LSS- Greenbelt - Required, LSS-Blackbelt - Preferred"
    }
  ]
}