{
  "meta": [
    {
      "job_title": "Systems Engineering Director",
      "job_category": "Engineering",
      "job_class": "Director",
      "sector": "Software Engineering",
      "salary": 310000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of Systems Engineering Managers and provide support to Systems Engineers in driving growth within Major Accounts."
    },
    {
      "duty": "Partner with the Regional Vice President of Sales to drive enterprise-wide sales-related initiatives within Major Accounts."
    },
    {
      "duty": "Oversee technical pre-sales operations and achieve revenue generation, individual, team, and organizational quotas."
    },
    {
      "duty": "Interact at a senior level with customers and partners, providing valuable insight into industry trends, customer challenges, technical evolutions, and business changes."
    },
    {
      "duty": "Develop and own outcome-oriented Systems Engineering initiatives that drive pipeline and sales with cross-functional teams."
    },
    {
      "duty": "Maintain strong relationships with partners and lead portfolio expansion initiatives, upselling subscriptions, and strategic solutions."
    },
    {
      "duty": "Ensure effective account planning is executed across the teams to deliver compelling business-focused solutions."
    },
    {
      "duty": "Operate effectively in a matrix manner with extended teams, such as Support, Finance, HR, Product Management, and other relevant organizations."
    },
    {
      "duty": "Act as an escalation point for pre-sales and post-sales technical issues that arise in the territory."
    },
    {
      "duty": "Develop, mentor, manage, and support reporting sales engineers with technical and organizational leadership."
    }
  ],
  "skills": [
    {
      "skill": "Systems Engineering Management",
      "experience": 8
    },
    {
      "skill": "Sales Support",
      "experience": 8
    },
    {
      "skill": "Technical Insights",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Business Development",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Account Planning",
      "experience": 8
    },
    {
      "skill": "Relationship Management",
      "experience": 8
    },
    {
      "skill": "Problem Resolution",
      "experience": 8
    },
    {
      "skill": "Management",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "A minimum combination of 8 years of first and/or second line, Systems Engineering management experience preferred."
    }
  ]
}