{
  "meta": [
    {
      "job_title": "Executive Director, Sales",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 180000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 8
    },
    {
      "skill": "Account Management",
      "experience": 8
    },
    {
      "skill": "Business Development",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Market Penetration",
      "experience": 8
    },
    {
      "skill": "Presentation Skills",
      "experience": 8
    },
    {
      "skill": "Client Relationship Management",
      "experience": 8
    },
    {
      "skill": "Retail Industry Knowledge",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Achieve company revenue objectives and business plan for the defined region, associated staff, and work streams via multiple channels."
    },
    {
      "duty": "Manage a group of sales directors, managers, personnel, and business partners representing various products, orders, and shipments."
    },
    {
      "duty": "Oversee overall sales activities for the defined region, and report to the SVP, Global Sales."
    },
    {
      "duty": "Develop, control, and execute the TGCS Sales business for North America via multiple channels."
    },
    {
      "duty": "Develop initiatives and execute the cultivation and implementation of software and services engagement."
    },
    {
      "duty": "Collaborate with Sales Directors to develop market penetration plans and execute client contact strategies."
    },
    {
      "duty": "Maintain positive and effective contact with key customers, prospects, business partners, and others to enhance sales opportunities."
    },
    {
      "duty": "Travel as necessary to maintain a presence with customers, staff, and enhance relationship opportunities."
    },
    {
      "duty": "Identify opportunities for improvement processes in general working practices and team efficiency."
    },
    {
      "duty": "Work closely with other members of the Sales Group and various Direct and Channel Sales Organization Personnel."
    },
    {
      "duty": "Build and lead a high-performance team to cultivate and establish new client relationships to exceed revenue and margin growth targets."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or Work Experience equivalent to 12 years. Must possess effective written and verbal communications skills. Should be able to demonstrate PC proficiency in MS Word, Excel, PowerPoint as well as learn any corporate or industry administrative software used by the position. Should have a demonstrated history displaying an in-depth knowledge of sales, account management, and business partner programs and techniques. Has 8+ years of Sales Management experience in a similar industry and has directed a group of Individuals in the achievement of revenue goals and quota for a direct sales organization. Has operated under a sales quota system and achieved on-target revenue achievement in multiple years. Working retail industry knowledge or actual experience working within the industry. Strong presentation skills with the capability of interacting with senior management levels such as CEO, COO, CFO, CTO/CIO, Owner, and other managers. Works well in a team selling environment and maintains good working relationships with other functional company departments such as Services, Product Management, Marketing, Engineering, etc., to ensure both partner & company requirements are met or exceeded. Give guidance and mentorship to staff to “lead by example” and provide support to various needs of personnel. Provide strong mentorship to staff with having a “whatever it takes” attitude to succeed."
    }
  ]
}