{
  "meta": [
    {
      "job_title": "Visual Art Lead",
      "job_category": "Art",
      "job_class": "Lead",
      "sector": "Gaming",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Adobe Suite",
      "experience": 10
    },
    {
      "skill": "3D Concept Art",
      "experience": 10
    },
    {
      "skill": "2D Concept Art",
      "experience": 10
    },
    {
      "skill": "3D Pipeline Validation",
      "experience": 10
    },
    {
      "skill": "Unity",
      "experience": 10
    },
    {
      "skill": "Unreal Engine",
      "experience": 10
    },
    {
      "skill": "Adobe Suite",
      "experience": 10
    },
    {
      "skill": "Animation",
      "experience": 8
    },
    {
      "skill": "UI/UX",
      "experience": 8
    },
    {
      "skill": "VFX",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evolve and contribute to driving Treasure’s overall brand and visual direction across its IP, the game project, and other technology products (gaming platform, marketplace, etc)."
    },
    {
      "duty": "Define and support visual direction for the game project in collaboration with studio leadership Narrative Designer, and Game Director, and own the visual style so it hits the storytelling and brand needs but also blows people’s minds creatively."
    },
    {
      "duty": "Create, curate, and update the project art bible outlining the visual tone and style."
    },
    {
      "duty": "Own art backlog, roadmaps, and production pipelines."
    },
    {
      "duty": "Hands-on ownership of the entire creation process - sketches to color concepts to 2D and 3D game assets. Manage and oversee a team of artists, brand designers, product designers, and other internal and external/outsourced creatives."
    },
    {
      "duty": "Source and coordinate with external studios and contractors should the need arise (or, potentially over time, build and manage an in-house team)."
    },
    {
      "duty": "Contribute to sprint planning and work closely with the rest of an expanding team."
    },
    {
      "duty": "Import, implement, and test game assets in Unity or Unreal Engine."
    },
    {
      "duty": "Evaluate and select tools used for art creation to ensure optimal and quality creation of game assets."
    },
    {
      "duty": "Be willing to learn and explore this new, exciting frontier to bring to life an original fun world."
    },
    {
      "duty": "Foster a creative culture empowering and mentoring future creative leaders, including both designers and artists."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Art, Graphic Design, or related field (Master's preferred)"
    }
  ]
}