{
  "meta": [
    {
      "job_title": "Systems Engineering Director",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 320000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 8
    },
    {
      "skill": "Business Savvy",
      "experience": 8
    },
    {
      "skill": "Technical Expertise",
      "experience": 8
    },
    {
      "skill": "Team Management",
      "experience": 8
    },
    {
      "skill": "Industry Knowledge",
      "experience": 8
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Mentoring",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of Systems Engineering Managers and support the Systems Engineers in driving growth within Commercial Accounts."
    },
    {
      "duty": "Oversee technical pre-sales operations and achieve revenue generation, individual, team, and organizational quotas."
    },
    {
      "duty": "Interact at a senior level with customers and partners, providing valuable insight into industry trends, challenges, and technical solutions."
    },
    {
      "duty": "Ensure effective account planning and deliver business-focused solutions that address customers' security needs."
    },
    {
      "duty": "Develop and maintain strong relationships with partners to improve sales productivity and lead portfolio expansion initiatives."
    },
    {
      "duty": "Report and make visible the successes and deficiencies of initiatives within the area."
    },
    {
      "duty": "Provide account support through SE assignments, load balancing, continuity, strategic planning, and problem resolution."
    },
    {
      "duty": "Operate effectively in a matrix manner with extended teams, such as Support, Finance, HR, and other relevant organizations."
    },
    {
      "duty": "Act as an escalation point for technical issues within the territory and manage successful evaluations."
    },
    {
      "duty": "Develop, mentor, manage, and support reporting sales engineers with technical and organizational leadership."
    },
    {
      "duty": "Ensure metric-based results are evident across all areas of focus and achieve personnel management and development targets."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "A minimum combination of 8 years of first and/or second-line Systems Engineering management experience."
    },
    {
      "credential": "Industry knowledge of security product market trends and directional awareness of Palo Alto Network’s roadmap and technology development efforts."
    },
    {
      "credential": "Bachelor’s degree in a related field (Master's preferred)"
    }
  ]
}