{
  "meta": [
    {
      "job_title": "Healthcare Operations Specialist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Operations",
      "experience": 5
    },
    {
      "skill": "Clinical Practice",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Healthcare Technology",
      "experience": 5
    },
    {
      "skill": "Nursing Administration",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Business Intelligence",
      "experience": 5
    },
    {
      "skill": "Lean Six Sigma",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide operational leadership and support within the department of Patient Care Services."
    },
    {
      "duty": "Synthesize data from operational, clinical, and technology databases and transform it into actionable insights and recommendations for operational improvements."
    },
    {
      "duty": "Lead and execute complex projects related to operational efficiency, nursing workforce optimization, and technology solutions in healthcare."
    },
    {
      "duty": "Serve as a healthcare operations 'consultant', translating operational information between nursing and systems engineers, analysts, or designers."
    },
    {
      "duty": "Identify, collect, analyze, and summarize data to transform it into actionable insights and make solution recommendations."
    },
    {
      "duty": "Keep abreast of relevant legislation, rules, regulations, tools, procedures, and technical specifications in the field of Healthcare Operations."
    },
    {
      "duty": "Represent the department on various committees or teams related to Healthcare Operations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Nursing required. Current license as a Professional Registered Nurse. Five (5) years of clinical nursing experience, preferably in an academic health care setting. Five (5) years of Healthcare Administration or Nursing Administration, with strong Data Analytics skills."
    }
  ]
}