{
  "meta": [
    {
      "job_title": "Food & Beverage Director",
      "job_category": "Hospitality",
      "job_class": "Director",
      "sector": "Hospitality",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for all facets of the food and beverage operation (restaurant, bar, culinary, banquets) including but not limited to the guest experience, managing the team for success, overall cleanliness and upkeep, inventory and ordering, quality of menu, scheduling, and payroll."
    },
    {
      "duty": "Ensuring the team has the capabilities to exceed expectations and coordinating the timely implementation of new menus including costing."
    },
    {
      "duty": "Approving and implementing all policies and procedures for the operation of the food and beverage areas to include brand standards and assisting in the annual budgeting process."
    },
    {
      "duty": "Assisting with capital expenses, revenues, direct expenses, costs, and profitability, as well as food and beverage purchases, inventories, product utilization, and proper procedures to ensure monthly budgeted cost of sales."
    },
    {
      "duty": "Assisting employees in understanding guests’ ever-changing needs and expectations, and exceeding them."
    },
    {
      "duty": "Taking proactive approaches when dealing with employee concerns and always extending professionalism and courtesy to employees."
    },
    {
      "duty": "Communicating/updates all goals and results with employees and providing excellent customer service by being readily available/approachable for all guests."
    },
    {
      "duty": "Ensuring all team members meet or exceed all hospitality requirements and meal periods exceed guest expectations."
    },
    {
      "duty": "Assisting in performing and exceeding brand Quality Audit and health inspections, and understanding financial statements, sales and activity reports, and other performance data."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": []
}