{
  "meta": [
    {
      "job_title": "Application Developer",
      "job_category": "Engineering",
      "job_class": "Developer",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Software Development Life Cycle (SDLC)",
      "experience": 3
    },
    {
      "skill": "Structured Query Language (SQL)",
      "experience": 3
    },
    {
      "skill": "Episys and PowerOn development",
      "experience": 3
    },
    {
      "skill": "Financial Institution Technologies",
      "experience": 3
    },
    {
      "skill": "Object Oriented Programming",
      "experience": 3
    },
    {
      "skill": "Networking",
      "experience": 3
    },
    {
      "skill": "JavaScript",
      "experience": 3
    },
    {
      "skill": "Unix Operating System",
      "experience": 3
    },
    {
      "skill": "Unix Shell Scripting",
      "experience": 3
    },
    {
      "skill": "PowerShell",
      "experience": 3
    },
    {
      "skill": "ITIL Certification",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Utilize sound software development life cycle (SDLC) practices and accurately follow established procedures for delivering application solutions that support critical business strategies."
    },
    {
      "duty": "Work closely with suppliers to ensure successful software or hardware implementation, maintenance, and support. Commit application configuration updates to stage / test environment and plans for rollbacks."
    },
    {
      "duty": "Troubleshoot issues and resolve incidents in support of existing production applications."
    },
    {
      "duty": "Prepare documentation and provide user training on new system applications."
    },
    {
      "duty": "Facilitate architecture review and ensure that all architectural products are updated and maintained."
    },
    {
      "duty": "Maintain understanding of the full architecture stack with an ability to communicate effectively on a variety of information technology (IT) topics."
    },
    {
      "duty": "Identify and solve technical, process, or interpersonal problems to ensure projects are delivered within required timelines and expectations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent related work experience. Three (3) years of experience in application development which includes supporting business applications for diverse operating systems and platforms and/or structured query language (SQL) development for relational databases. Adequate knowledge of Object Oriented programming and networking."
    }
  ]
}