{
  "meta": [
    {
      "job_title": "Plant Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Manufacturing",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the work of all production employees, oversee production and shipping schedules based on availability of raw and finished goods."
    },
    {
      "duty": "Provide hands-on leadership as a working manager, responsible for mentoring and coaching all employees and managing employee relations issues."
    },
    {
      "duty": "Support plant administration to ensure compliance to established policies."
    },
    {
      "duty": "Directly responsible for all employment decisions at the facility."
    },
    {
      "duty": "Responsible in consult with General Manager for the cost and yield performance of the Plant in partnership with the overall P&L of the Plant."
    },
    {
      "duty": "Support and implement cost control initiatives and process control within the Plant."
    },
    {
      "duty": "Continually review operations activities, including local transportation activities to maintain compliance with all Federal, State and local laws (OSHA, DOL, DOJ, EPA, FD)."
    },
    {
      "duty": "Drive Safety improvements (Zero Harm) across the Plant."
    },
    {
      "duty": "Ensure the consistent execution of all SOPs throughout the Plant and in accordance with the PMS Commercial Organization, Global Supply Chain."
    },
    {
      "duty": "Deliver best operational practices and cost efficiencies across the Plant while maintaining critical quality and raw material utilization standards that are necessary to maintain customer satisfaction and Plant profitability."
    },
    {
      "duty": "Ensure compliance through teamwork for all Standard Operating Procedures within the Plant."
    },
    {
      "duty": "Implement and manage Lean opportunities to effectively eliminate waste."
    },
    {
      "duty": "In partnership with Plant Manager, provide leadership to Plant staff to effectively recruit, train, develop, evaluate, motivate, delegate and monitor their activities."
    },
    {
      "duty": "Drive efficiencies in asset utilization through proper transportation scheduling, dispatch, & driver management while meeting customer expectations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors in Operations/Supply Chain or related field (Master's preferred)"
    },
    {
      "credential": "Six Sigma/Lean certification preferred"
    }
  ]
}