{
  "meta": [
    {
      "job_title": "Education Manager",
      "job_category": "Education",
      "job_class": "Manager",
      "sector": "Education",
      "salary": 54000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Program Development",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Community Engagement",
      "experience": 5
    },
    {
      "skill": "Data Collection",
      "experience": 5
    },
    {
      "skill": "Supervision",
      "experience": 5
    },
    {
      "skill": "Public Health Knowledge",
      "experience": 5
    },
    {
      "skill": "Bilingual Communication",
      "experience": 5
    },
    {
      "skill": "Youth Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure successful oversight and implementation of PPGNY’s educational programs, including creating work plans, engaging in evaluation activities, creating and monitoring budgets, tracking goals and deliverables, and reporting on the work to funders."
    },
    {
      "duty": "Hire, train, coach, support, observe, and develop Health Educators and Youth Advisors educators to ensure all educators are well equipped to deliver high-quality programming."
    },
    {
      "duty": "Serve as the region CAPP point person and maintain strong and effective relationships with the technical assistance provider agency."
    },
    {
      "duty": "Provide support to two peer education/youth development programs, including planning and implementation of youth programming."
    },
    {
      "duty": "Build new community partnerships, manage all Memorandums of Understanding with key community partners, and complete monitoring data accurately and on time."
    },
    {
      "duty": "Deliver in-person and virtual educational programs to youth and adults in a variety of settings and conduct community engagement activities such as community events, pop-ups, tabling, fairs, and school events."
    },
    {
      "duty": "Maintain strong community relationships by representing PPGNY to community partners with professionalism and providing assistance and/or referrals for youth to obtain comprehensive family planning services, health services, or other essential support services."
    },
    {
      "duty": "Act as a liaison between PPGNY and community networking committees and coalitions related to sexuality and sexual health, sexual violence and assault, youth development, community service, LGBTQ topics, and diversity."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equal experience from an accredited University in Communication, Social Work, Public Health, or related field. 5+ years experience in education including experience working with adolescents and sexuality education or training and 3 years supervision experience."
    },
    {
      "credential": "Experience in working with diverse communities and knowledge of sexual and reproductive health. Experience with communities impacted by adverse health outcomes and knowledge of systemic barriers to sexual reproductive health and wellbeing faced by marginalized communities especially women, LGBTQ, poor/working class and communities of color. Analysis of how systemic oppression and racism impacts communities of color. Flexible schedule and own transportation is required, with a valid NYS driver’s license, inspection, registration, and adequate insurance."
    },
    {
      "credential": "Preferred Experience: Bilingual English and Spanish"
    }
  ]
}