{
  "meta": [
    {
      "job_title": "Manager for Customer Success Renewal Quoting Team",
      "job_category": "Customer Success",
      "job_class": "Manager",
      "sector": "Customer Success",
      "salary": 115000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Quoting Analysis",
      "experience": 5
    },
    {
      "skill": "Sales Operations",
      "experience": 5
    },
    {
      "skill": "Customer Success",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Salesforce CRM",
      "experience": 5
    },
    {
      "skill": "Business Communication",
      "experience": 5
    },
    {
      "skill": "CX Familiarity",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage a team responsible for quote creation and revision to execute on key performance indicators, and implementation of projects supporting customer renewal activities."
    },
    {
      "duty": "Provide support, training, and evaluate improvement opportunities for Renewal Quoting Analysts, and maintain required documentation."
    },
    {
      "duty": "Establish relationships with team leads of adjacent functions, defining roles, responsibilities, and accountability to develop and streamline processes."
    },
    {
      "duty": "Assist with special projects related to the renewal quoting process and function."
    },
    {
      "duty": "Drive effectiveness to reduce overall time spent on renewal quote creation/revision by identifying improvements to the quoting processes and tools."
    },
    {
      "duty": "Ensure achievement of on-time, accurate, and actionable renewal quote creation, revisions, and other key metrics."
    },
    {
      "duty": "Ensure renewal pricing follows current policies, rules, and procedures based on configuration of the offering and instance."
    },
    {
      "duty": "Track renewal quoting activities and evaluate process effectiveness."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree, or 5+ years' experience in an Operations, Product, or Specialists role within a B2B organization."
    },
    {
      "credential": "Experience in Customer Success Operations, Contract Creation or Review, or similar role."
    },
    {
      "credential": "Experience in working with a team to identify process gaps and improvements, and continuously improve business processes."
    },
    {
      "credential": "Prior experience using Salesforce (or similar CRM) required, familiarity with Gainsight, NetSuite, and Walk-Me desirable."
    },
    {
      "credential": "Ability to use basic business tools effectively: e-mail, spreadsheets, business collaboration tools, and file sharing."
    },
    {
      "credential": "Familiarity with CX (industry and technology) is a bonus."
    },
    {
      "credential": "Bachelor’s degree in Marketing, Business, or a related field (Master's preferred)."
    }
  ]
}