{
  "meta": [
    {
      "job_title": "Equipment Sales Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales & Marketing",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Market Forecasting",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Logistics Management",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Bilingual Communication (Korean & English)",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a comprehensive sales and marketing plan to significantly increase business in pre-owned semiconductor equipment, spare parts, and Thin Film Wafers."
    },
    {
      "duty": "Work closely with product managers to exceed sales goals and develop sustainable new businesses."
    },
    {
      "duty": "Provide knowledge and insight to internal systems for data integrity and real-time sharing with global teams."
    },
    {
      "duty": "Participate in global weekly meetings to share deal opportunities/progress and market trends."
    },
    {
      "duty": "Ensure accurate forecasting of buys and sells on a monthly and quarterly basis."
    },
    {
      "duty": "Identify and acquire new customers while strengthening partnerships with End users, OEMs, and 3rd parties."
    },
    {
      "duty": "Conduct onsite/virtual inspection, valuation, negotiation, purchasing, and logistics processes."
    },
    {
      "duty": "Support and launch tool refurbishment and installation at customers’ field aligned with HQ."
    },
    {
      "duty": "Plan and coordinate product demos, customer visits, and customer meetings involving division personnel."
    },
    {
      "duty": "Foster relationships at all levels internally and externally and prepare for industry exhibitions."
    },
    {
      "duty": "Build relationships with internal stakeholder teams and understand differentiated strategies and roadmap."
    },
    {
      "duty": "Develop and build relationships with customers’ teams to understand their technology needs and application requirements."
    },
    {
      "duty": "Deeply involve in demand and supply management, and logistics."
    },
    {
      "duty": "Travel more than 30% of the time."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Management, Engineering, or a related field"
    }
  ]
}