{
  "meta": [
    {
      "job_title": "Client Service Support",
      "job_category": "Customer Service",
      "job_class": "Associate",
      "sector": "Financial Services",
      "salary": 19000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Client Relationship Management",
      "experience": 3
    },
    {
      "skill": "Financial Transactions",
      "experience": 3
    },
    {
      "skill": "Appointment Scheduling",
      "experience": 3
    },
    {
      "skill": "Client Communication",
      "experience": 3
    },
    {
      "skill": "Compliance Management",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Financial Services",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as a liaison between the registered representatives and their clients."
    },
    {
      "duty": "Answer phones, schedule appointments, and prepare materials for client meetings."
    },
    {
      "duty": "Aid registered representatives in preparing client illustrations, graphs, charts, reports, etc. for registered representative presentations and appointment with clients."
    },
    {
      "duty": "Prepare and complete client paperwork and follow up tasks to support registered representative."
    },
    {
      "duty": "Spend time with clients on the phone, via virtual visits and in person to ensure client service level needs are met."
    },
    {
      "duty": "Organize client events and follow up tasks."
    },
    {
      "duty": "Maintain client records and retention management within corporate requirements."
    },
    {
      "duty": "Conduct proactive outreach to clients and registered representatives on time sensitive activities (e.g., RMDs, Client’s Quarterly/Annual Reviews)."
    },
    {
      "duty": "Assume ownership of inquiries and requests; communicate with internal Cetera departments to ensure clients’ expectations for timely service delivery are met."
    },
    {
      "duty": "Educate clients on account services, capabilities, and new technology."
    },
    {
      "duty": "Complete required corporate training on new technologies and follow implementation guidelines."
    },
    {
      "duty": "Maintain compliance guidelines, client communication notes in AdviceWorks/SmartWorks and Redtail while following Cetera standards in a timely manner."
    },
    {
      "duty": "Work with Advisor(s) through weekly meetings to help maintain Advisors Business Plan process, tasks, marketing, and client communication expectations and follow up processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "High School Degree or GED"
    }
  ]
}