{
  "meta": [
    {
      "job_title": "Director, CMC Program Management",
      "job_category": "Program Management",
      "job_class": "Director",
      "sector": "Pharmaceuticals",
      "salary": 200000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Operational Leadership",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Stakeholder Management",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Cross-functional Collaboration",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Time Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide operational leadership and support to CMC-PM team members, ensuring achievement of key business and program deliverables against global development plan milestones."
    },
    {
      "duty": "Act as a key senior level liaison in the interactions between Regeneron and corporate partners, preparing and providing input for major presentations for collaboration meetings."
    },
    {
      "duty": "Facilitate and drive decision making in support of the joint strategic objectives of the program, representing Regeneron’s interests."
    },
    {
      "duty": "Keep the Senior Director, Strategic Alliances and CMC Program Management and IOPS Senior Management informed of all major alliance activities and issues."
    },
    {
      "duty": "Develop and facilitate achievement of strategic team operational project milestones, and support through active and consistent leadership, alignment with department operational objectives."
    },
    {
      "duty": "Monitor ongoing progress of key results against global development plan achievements, including the identification of potential risks and contingency plans."
    },
    {
      "duty": "Act as a key resource for direct reports and business on matters related to CMC PM, ensuring effective, accurate, and timely communication across functional areas within Regeneron."
    },
    {
      "duty": "Interact with Senior Management on cross-functional team matters/issues, influencing the overall objectives and long-range milestones of the CMC Program."
    },
    {
      "duty": "Adept at leading multiple projects/tasks simultaneously, switching between tasks quickly, and juggling competing priorities and projects."
    },
    {
      "duty": "Understand resources, portfolio requirements, and align accordingly. Develop tools and mechanisms for monitoring progress and problem solving with CMC project and functional area managers."
    },
    {
      "duty": "Define and document working/standard processes that can be used across other CMC projects with all relevant departments to ensure efficient product supply to patients and the business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS/BA required and 14+ years industry experience. PMP certification or MBA a plus."
    }
  ]
}