{
  "meta": [
    {
      "job_title": "Credit Analyst",
      "job_category": "Banking and Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Work directly with the team in the underwriting of new transaction requests and assist in managing a portfolio."
    },
    {
      "duty": "Participate in the achievement of the team’s goals through day-to-day relationship management of healthcare clients and participating in the retention, amendment, and renewal process of existing accounts."
    },
    {
      "duty": "Support the Portfolio Manager on all new credit requests and renewals, provide initial risk rating and recommend appropriate credit structure."
    },
    {
      "duty": "Accumulate relevant financial, industry, borrower, and collateral information to framework the underwriting of new clients."
    },
    {
      "duty": "Assist in the preparation of presentation materials for credit committee on new and existing deals as needed."
    },
    {
      "duty": "Meet with clients and prospects regularly, attend bank meetings, and conduct site visits."
    },
    {
      "duty": "Partner with the Portfolio Manager to manage the ongoing credit risk for a portfolio of healthcare clients and participate in portfolio meetings with senior management."
    },
    {
      "duty": "Work with Loan Operations and Treasury Management to set up accounts in accordance with credit and division policy."
    },
    {
      "duty": "Ensure ongoing client satisfaction through managing both the loan structure and customer interface with the Healthcare Division, bank partners, and support functions of the bank."
    },
    {
      "duty": "Monitor timeliness of reporting, tickler information and ensure bank has current and accurate information to make decisions and remain expert on the credit and legal files."
    },
    {
      "duty": "Maintain up-to-date trend cards, credit files, and legal files through the bank’s resources."
    },
    {
      "duty": "Review financial statement spreads for accuracy and raise issues / questions to management on a timely basis."
    },
    {
      "duty": "Develop and maintain internal relationships following established processes and procedures."
    },
    {
      "duty": "Continue education of the healthcare industry including regulatory, reimbursement, and transactional changes and trends. Attend industry conferences and client meetings."
    },
    {
      "duty": "Understand all Bank policies and procedures, and federal and state laws and regulations pertinent to this position; stay informed and share updates on changes with management. Required to successfully complete all required Compliance training."
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 4
    },
    {
      "skill": "Relationship Management",
      "experience": 3
    },
    {
      "skill": "Credit Risk Assessment",
      "experience": 4
    },
    {
      "skill": "Loan Management",
      "experience": 3
    },
    {
      "skill": "Portfolio Management",
      "experience": 3
    },
    {
      "skill": "Financial Modeling",
      "experience": 4
    },
    {
      "skill": "Credit Policy",
      "experience": 4
    },
    {
      "skill": "Market Research",
      "experience": 3
    },
    {
      "skill": "Client Engagement",
      "experience": 3
    },
    {
      "skill": "Compliance",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, or a related field"
    }
  ]
}