{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Retail Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and direct activities related to truck unload, freight flow, backroom organization, ticketing merchandise, stocking shelves, and reconciliation of inventory transactions according to operational and merchandising standards."
    },
    {
      "duty": "Establish plans to accomplish merchandising initiatives and achieve defined goals."
    },
    {
      "duty": "Utilize company tools, reports, and feedback to effectively analyze trends and refine plans."
    },
    {
      "duty": "Participate in the interviewing, selection, hiring, and training of associates in collaboration with store leadership."
    },
    {
      "duty": "Administer appropriate disciplinary action to associates, including recommendations for termination, in partnership with the store leadership and in accordance with company guidelines."
    },
    {
      "duty": "Assist with store scheduling and payroll processes on a daily and weekly basis."
    },
    {
      "duty": "Serve in the Manager on Duty role as needed including opening and closing the store."
    },
    {
      "duty": "Drive the customer experience and ensure resolution of customer issues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, GED, or equivalent work experience required."
    },
    {
      "credential": "Minimum three years retail management experience preferred."
    },
    {
      "credential": "Demonstrated visual merchandising skills required."
    },
    {
      "credential": "Basic English literacy, math, and PC skills required."
    }
  ]
}