{
  "meta": [
    {
      "job_title": "Supervisory Operations Coordinator",
      "job_category": "Operations",
      "job_class": "Supervisor",
      "sector": "Operations",
      "salary": 140000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee, coordinate and integrates the work of a cross-functional staff performing a variety of work related to the operation, maintenance, renovation and repair of government buildings as well as administration, and fiscal management of leased properties."
    },
    {
      "duty": "Oversee, direct and coordinate the delivery of various products and/or services in support of Federal agencies occupying government owned and/or leased buildings."
    },
    {
      "duty": "Conduct complex building operations studies."
    },
    {
      "duty": "Serve as Division representative and coordinator with Portfolio Management and building managers for the development of asset building plans for government owned and leased buildings and other asset related issues."
    },
    {
      "duty": "Assists building managers and the Deputy Director with complex politically sensitive projects."
    },
    {
      "duty": "Works closely with building managers, asset managers and program analysts to monitor operating costs for government owned and leased buildings."
    },
    {
      "duty": "Serve as a representative to national and local industry groups related to building operations and maintenance activities."
    },
    {
      "duty": "Act as a liaison between agency headquarters, other agency components, and non-Federal parties to coordinate various activities, identify problems, and develop solutions related to the region's building operations policy and associated program areas."
    },
    {
      "duty": "Review and/or prepare highly technical reports and/or papers on important and extremely complex matters."
    },
    {
      "duty": "Serve as the division coordinator for customer surveys and analyses."
    },
    {
      "duty": "Serve as an advisor to other Federal client agencies who have building operations programs that are both local and national in scope."
    },
    {
      "duty": "Responsible for supervising, providing managerial direction, providing administrative direction and guidance to approximately 20 employees (Buildings Managers, Buildings Management Specialists, Planner Estimators, Quality Assurance, administrative and clerical office automation)."
    },
    {
      "duty": "Develop a human resources strategy and executes the full range of human resource and administrative management activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Operations Management or related field (Master's preferred)"
    }
  ]
}