{
  "meta": [
    {
      "job_title": "Mammography Technologist PRN",
      "job_category": "Healthcare",
      "job_class": "Technologist",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mammography",
      "experience": 4
    },
    {
      "skill": "Radiology Imaging",
      "experience": 4
    },
    {
      "skill": "Diagnostic Imaging",
      "experience": 4
    },
    {
      "skill": "Patient Care",
      "experience": 4
    },
    {
      "skill": "Medical Equipment Operation",
      "experience": 4
    },
    {
      "skill": "Medical Charting",
      "experience": 4
    },
    {
      "skill": "Healthcare Communication",
      "experience": 4
    },
    {
      "skill": "Patient Transportation",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform Mammo exams as per protocol on a variety of different body parts in an efficient manner."
    },
    {
      "duty": "Complete pre-exam screening, greet patients, and assist in appropriate gowns."
    },
    {
      "duty": "Complete history forms, complete technologist exam sheet, stock rooms with required supplies, and check labs when necessary."
    },
    {
      "duty": "Verify and follow doctor’s orders in patient’s chart, initial patient chart when exam is complete, start/remove IVs when necessary, and safely administer contrast media with power injector."
    },
    {
      "duty": "Transport patients to and from ER and other Imaging areas when assistant is unavailable, move patients on and off the exam table."
    },
    {
      "duty": "Organize and prioritize patient exams for best work flow, and communicate effectively with customers - physicians, co-workers, patients, and their families."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an AMA approved Radiography program is required."
    },
    {
      "credential": "ARRT registered with advanced registration in Mammography."
    },
    {
      "credential": "BLS with AHA or Red Cross."
    },
    {
      "credential": "Minimum of 2 years of experience is highly preferred."
    },
    {
      "credential": "Role requires full vaccination for COVID-19 based on local, state, and/or federal law or regulations (unless a medical or religious exemption is approved)"
    }
  ]
}