{
  "meta": [
    {
      "job_title": "Sales Team Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Sales Support",
      "experience": 5
    },
    {
      "skill": "Inside Sales",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "CRM/Salesforce",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement sales strategies, identify potential customers, handle vendor relationships, and monitor industry trends."
    },
    {
      "duty": "Supervise 13 to 15 Sales Support Reps to ensure high-quality customer service standards, meeting sales goals, and helping to resolve customer concerns."
    },
    {
      "duty": "Serve as day-to-day team leader leading all aspects of customer service and inside sales team."
    },
    {
      "duty": "Mentor, train, motivate, and develop team members to be successful, monitor calls and offer guidance to improve call effectiveness, and share the best techniques for successful sales calls."
    },
    {
      "duty": "Set expectations and goals, by driving associate/team performance, ensuring customer satisfaction and retention, assuring sales satisfaction, and building strong associate relationships."
    },
    {
      "duty": "Evaluate associate key performance indicators and identify training needs and development opportunities, participate in the work of associates to understand and distribute workload, drive productivity, and ensure effective work/life balance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "1 to 3 years’ experience in management/leadership, successful experience in Sales Center leadership, and experience of using process and metrics/data to lead such a team."
    }
  ]
}