{
  "meta": [
    {
      "job_title": "Executive Administrative Assistant",
      "job_category": "Administrative",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform administrative duties including; scheduling and coordinating meetings, events and travel, arranging various services, preparing agendas, gathering and organizing information, record and summarize minutes and materials for distribution."
    },
    {
      "duty": "Perform office operations including; filing, organizing, answering phones, maintaining calendars, and distribution of communications and materials."
    },
    {
      "duty": "Compose diverse business correspondence, memos, letters, reports and materials."
    },
    {
      "duty": "Respond to internal and external customer inquiries and requests for information regarding department or corporate policy and procedure."
    },
    {
      "duty": "Research, gather and conduct preliminary analysis of data for department and corporate reporting."
    },
    {
      "duty": "Maintain office supplies, equipment, purchases and budgets."
    },
    {
      "duty": "Ensure confidentiality and control access to sensitive information."
    },
    {
      "duty": "The position requires a full-time work schedule. Full-time is defined as working at least 40 hours per week, plus any additional hours as requested or as needed to meet business requirements."
    },
    {
      "duty": "Perform all other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Office Operations",
      "experience": 3
    },
    {
      "skill": "Administrative Support",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Organization",
      "experience": 3
    },
    {
      "skill": "Calendar Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High-School Diploma or GED in general field of study (Associate's Degree preferred)"
    }
  ]
}