{
  "meta": [
    {
      "job_title": "Project Leader",
      "job_category": "Management",
      "job_class": "Leadership",
      "sector": "Management",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Team Coordination",
      "experience": 5
    },
    {
      "skill": "System Design",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Safety Standards Adherence",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as the on-site project leader to plan, execute, and complete projects with assigned customers in a safe and cost-effective manner."
    },
    {
      "duty": "Delegate tasks as required to execute and fully complete assigned projects, including hardware design, system programming, installation coordination, system and network commissioning, and project closeout."
    },
    {
      "duty": "Coordinate communication with the customer during all phases of the project and ensure proper execution of warranty."
    },
    {
      "duty": "Provide work direction to subcontractors, electrical installers, technicians, designers, and administration as necessary."
    },
    {
      "duty": "Manage and complete the loading, device verification, and commissioning of all system controllers as required."
    },
    {
      "duty": "Develop project plans and coordinate the required resources to ensure timely and cost-effective installation and completion of assigned projects."
    },
    {
      "duty": "Provide training for owner/operators on the total system in full or with assistance, and ensure proper documentation and manuals for system operation are provided."
    },
    {
      "duty": "Maintain viable long-term relationships with contractors, clients, consultants, and subcontractors."
    },
    {
      "duty": "Attend job progress meetings as required and follow all safety standards with the highest regard for employee and subcontractor safety."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of a technical Associates Degree with four years of field experience or six years of equivalent related field experience in the industry."
    }
  ]
}