{
  "meta": [
    {
      "job_title": "IT Portfolio Manager",
      "job_category": "Information Technology",
      "job_class": "Manager",
      "sector": "IT",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "IT Governance",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "IT Financial Management",
      "experience": 3
    },
    {
      "skill": "SDLC Management",
      "experience": 5
    },
    {
      "skill": "Business Consulting",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Technology Trends",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure adherence to appropriate IT governance functions and systems development lifecycle."
    },
    {
      "duty": "Facilitate and coordinate the efforts of senior leadership and project managers in the establishment of project portfolio definition and processes."
    },
    {
      "duty": "Support the creation of strategy and multi-year roadmaps for a specific business area and prioritize projects based on business objectives."
    },
    {
      "duty": "Gather, provide, and evaluate data for portfolio selection, prioritization, and execution, and track project results."
    },
    {
      "duty": "Collaborate with IT and business leaders to identify opportunities and facilitate selection and processing of technology solutions."
    },
    {
      "duty": "Direct the development and maintenance of project portfolio communications, reporting, and documentation."
    },
    {
      "duty": "Manage project managers, provide coaching and mentoring, and conduct project portfolio reviews."
    },
    {
      "duty": "Lead large-scale projects following PMO and SDLC processes."
    },
    {
      "duty": "Advise senior leaders on portfolio balancing and manage resources and funding against plan."
    },
    {
      "duty": "Lead reviews of significant initiatives, provide recommendations, and lead change and reprioritization as necessary."
    },
    {
      "duty": "Oversee and manage execution of projects, develop and communicate portfolio objectives, and maintain alignment with business strategy."
    },
    {
      "duty": "Manage at both a broad and tactical level, and analyze and monitor portfolio performance."
    },
    {
      "duty": "Understand current and emerging technologies and attract, retain, and develop high caliber talent."
    },
    {
      "duty": "Periodic travel may be required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in technical field or related field of study required. Master’s Degree preferred. PMP certification preferred."
    }
  ]
}