{
  "meta": [
    {
      "job_title": "Customer Service and Social Media Engagement Specialist",
      "job_category": "Customer Service",
      "job_class": "Specialist",
      "sector": "Wellness Transformation",
      "salary": 38000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Social Media Management",
      "experience": 3
    },
    {
      "skill": "Health Coaching",
      "experience": 2
    },
    {
      "skill": "Nutrition",
      "experience": 2
    },
    {
      "skill": "Fitness",
      "experience": 2
    },
    {
      "skill": "Holistic Healing",
      "experience": 2
    },
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Verbal Communication",
      "experience": 4
    },
    {
      "skill": "Written Communication",
      "experience": 4
    },
    {
      "skill": "Microsoft Suite",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    },
    {
      "skill": "Adaptability",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Rapidly respond to customer inquiries, concerns, and requests through diverse channels such as email, live chat, our website Q&A section, Private FB Group, and FB/IG Direct messages and comments."
    },
    {
      "duty": "Provide accurate recommendations about our holistic wellness products, services, and practices, ensuring customers receive guidance tailored to their needs, in addition to other holistic modalities to support in the herbal healing experience."
    },
    {
      "duty": "Address challenges and resolve customer issues promptly, escalating complex matters to specialized teams as required."
    },
    {
      "duty": "Process orders, returns, and refunds swiftly, adhering to our holistic wellness company's policies and values."
    },
    {
      "duty": "Maintain meticulous records of customer interactions and transactions, ensuring our CRM system is up-to-date and accurate."
    },
    {
      "duty": "Embrace the fast-paced nature of social media, managing and monitoring our presence across platforms like Instagram, Facebook, and TikTok."
    },
    {
      "duty": "Initiate authentic and meaningful engagement with our community, and other page’s communities by responding to comments, questions, and feedback in a genuine and positive manner."
    },
    {
      "duty": "Collaborate with our marketing team to devise marketing campaigns that ignite engagement and excitement."
    },
    {
      "duty": "Immerse yourself in our holistic wellness philosophy, becoming a true brand advocate and embody our values in every customer interaction."
    },
    {
      "duty": "Embrace our fast-paced work environment, working efficiently both autonomously and collaboratively to exceed customer expectations."
    },
    {
      "duty": "Liaise with cross-functional teams including marketing, warehouse operations, and sales to convey customer insights and contribute to ongoing improvements."
    },
    {
      "duty": "Stay abreast of product launches, policy changes, and industry trends through regular team meetings and training sessions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent; qualified certification or training in health coaching, nutrition, fitness, and/or herbal/holistic healing preferred."
    }
  ]
}