{
  "meta": [
    {
      "job_title": "Data Collection Technician",
      "job_category": "Data Collection",
      "job_class": "Technician",
      "sector": "Data Collection",
      "salary": 50000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Capture visual and spatial data of various environments such as offices, external spaces, and homes using various collection devices including glasses, sensors on a helmet, hand-held devices, and backpacks or a combination of the above."
    },
    {
      "duty": "Troubleshoot any basic technical problems involving the equipment used."
    },
    {
      "duty": "Perform light data entry."
    },
    {
      "duty": "Support the program's dogfooding population: Manning the swag store where participants redeem prizes for participating in the program."
    },
    {
      "duty": "Perform demos and tutorials that spotlight how the device works and what it can do."
    },
    {
      "duty": "Receives and inspects all incoming materials and reconciles with purchase orders; processes and distributes documentation with purchase orders; reports, documents, and tracks damages and discrepancies on orders received."
    },
    {
      "duty": "Fills supply requisitions; assists buyer in ordering adequate merchandise and supplies; delivers orders to employees."
    },
    {
      "duty": "Ships canceled and damaged items back to vendors."
    },
    {
      "duty": "Maintains the warehouse, records area, and stores area in a neat and orderly manner."
    },
    {
      "duty": "Answers questions regarding procedures and resolves discrepancies regarding receipts, deliveries, and repairs."
    },
    {
      "duty": "Ensures that all goods are properly priced and labeled according to company standards."
    },
    {
      "duty": "Processes sales transactions using computerized cash register systems."
    },
    {
      "duty": "Performs physical inventory counts to ensure that all goods are accounted for at the end of each accounting period."
    },
    {
      "duty": "Stocks shelves with merchandise, including putting price tags on items and arranging displays."
    }
  ],
  "skills": [
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Hardware Troubleshooting",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Testing/QA",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 40,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Data Collection, Computer Science, or a related field (Master's preferred)"
    }
  ]
}