{
  "meta": [
    {
      "job_title": "Sr. Salesforce Technical Architect",
      "job_category": "Software Engineering",
      "job_class": "Technical Architect",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design key technical components of the solution and direct technical resources to develop and deliver project deliverables."
    },
    {
      "duty": "Reduce project technical risk by uncovering design issues early in the project life cycle and share implementation best practices."
    },
    {
      "duty": "Conduct design/code reviews during major project milestones."
    },
    {
      "duty": "Fulfill commitments consistently on-time and proactively escalate commitments that are in jeopardy."
    },
    {
      "duty": "Judge the tradeoffs with technology and feasibility and make choices that fit the constraints of the project."
    },
    {
      "duty": "Design and implement business technology solutions focused on cloud-based business applications, specifically Salesforce, and other custom solutions."
    },
    {
      "duty": "Provide mentoring and guidance to other team members, including offshore team members."
    },
    {
      "duty": "Serve as a subject matter expert and guide customers towards appropriate solutions for their needs."
    },
    {
      "duty": "Participate actively in Discussions, build a reputation as a go-to resource for the toughest problems, and contribute to the Asset Libraries."
    },
    {
      "duty": "Provide pre-sales support as requested and oversee technical decisions and activities of project teams."
    },
    {
      "duty": "Understand platform limitations and design alternatives to work around limitations and monitor technical deliverables for consistent quality as well as compliance with company standards."
    },
    {
      "duty": "Partner with project managers to monitor project status and risk areas and demonstrate knowledge to design and build high-performance technical solutions on the Salesforce platform."
    }
  ],
  "skills": [
    {
      "skill": "Salesforce Development",
      "experience": 8
    },
    {
      "skill": "Technical Leadership",
      "experience": 8
    },
    {
      "skill": "Business Technology Solutions",
      "experience": 8
    },
    {
      "skill": "Cloud-Based Applications",
      "experience": 8
    },
    {
      "skill": "Salesforce Best Practices",
      "experience": 8
    },
    {
      "skill": "Apex and LWC Components",
      "experience": 8
    },
    {
      "skill": "Salesforce Integration Patterns",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Computer Science, Software Engineering, Management Information Systems, or a related field plus 5 years of experience with Salesforce development. Service Cloud Certification and one or more current Salesforce certifications are highly preferred."
    }
  ]
}