{
  "meta": [
    {
      "job_title": "Dispatcher",
      "job_category": "Transportation",
      "job_class": "Dispatcher",
      "sector": "Logistics",
      "remote": false,
      "salary": 45000
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Communicate with drivers to assist with problem resolution while on route."
    },
    {
      "duty": "Handle incoming service orders, direct drivers, and resolve service issues."
    },
    {
      "duty": "Schedule service and satisfy customer needs for service changes."
    },
    {
      "duty": "Dispatch calls to routes based upon designated route and driver location."
    },
    {
      "duty": "Perform driver check-ins at day’s end to ensure complete and accurate paperwork completion."
    },
    {
      "duty": "Distribute, collect and review route sheets for proper days end data entry."
    },
    {
      "duty": "Ensure coordination with other departments, clarifying roles and responsibilities for resolving service issues."
    },
    {
      "duty": "Interact with customers, customer service department, sales, and Operations staff."
    },
    {
      "duty": "Work with routing specialists to optimize routes."
    },
    {
      "duty": "Field incoming calls/emails from customers."
    },
    {
      "duty": "Troubleshoot and resolve potential delivery and pickup problems before they result in service issues."
    },
    {
      "duty": "Assist in determining daily level of driver staffing to provide the best mix of responsiveness and productivity."
    },
    {
      "duty": "Record and document information from drivers and distribute to appropriate departments."
    },
    {
      "duty": "Communicate with maintenance shop personnel."
    },
    {
      "duty": "Must be able to communicate effectively and professionally via email, telephone, and two-way devices."
    },
    {
      "duty": "Perform some additional responsibilities as assigned by the Operations Manager."
    }
  ],
  "skills": [
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Logistics",
      "experience": 2
    },
    {
      "skill": "MS Office",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 3
    },
    {
      "skill": "Coordination",
      "experience": 3
    },
    {
      "skill": "Service Order Management",
      "experience": 3
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma"
    },
    {
      "credential": "Post-secondary courses or diploma in transportation, logistics, or related field"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 140
    }
  ]
}