{
  "meta": [
    {
      "job_title": "Phlebotomist",
      "job_category": "Healthcare",
      "job_class": "Phlebotomist",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assure accurate identification of all patients and specimens."
    },
    {
      "duty": "Collect blood specimens by venipuncture or capillary puncture using age-specific criteria guidelines while following correct policy and procedures requirements."
    },
    {
      "duty": "Transport specimens using correct requirements (i.e. refrigerate, room temp, frozen, protect from light, etc.)."
    },
    {
      "duty": "Process and prepare specimens and deliver to correct laboratory departments for testing in a timely manner."
    },
    {
      "duty": "Prepare specimens for transport to appropriate reference laboratories."
    },
    {
      "duty": "Competent operation of Laboratory Information System to include: admission of patients, ordering tests, printing labels, collection time and received time entry, uncollected logs, send out logs, etc."
    },
    {
      "duty": "Maintain and apply knowledge of Ethics and Compliance Standards."
    },
    {
      "duty": "Adhere to the laboratory’s quality control policies, properly documenting quality control activities or any discrepancies, recording and reporting corrective actions."
    },
    {
      "duty": "Demonstrate competency in the operation of equipment and document daily maintenance on required equipment."
    },
    {
      "duty": "Set priorities appropriately, complete tasks with thoroughness, within the allotted time frame and with appropriate follow-through to achieve maximum productivity."
    },
    {
      "duty": "Consistently use good judgment and problem-solving skills to assess the situation, consider alternatives, and choose the appropriate course of action."
    },
    {
      "duty": "Identify and investigate processes that can be improved and use FOCUS-PDCA to work toward improving these processes."
    },
    {
      "duty": "Maintain confidentiality of all patients."
    },
    {
      "duty": "Assume responsibility for continuing education and professional development to maintain certification and/or license appropriate for assigned duties."
    },
    {
      "duty": "Act as a reference/information source for areas outside the lab regarding specimen collection procedures."
    },
    {
      "duty": "Perform miscellaneous job-related duties as assigned."
    },
    {
      "duty": "May perform registrations and sample collections in outpatient clinic settings. This involves demographics, insurances, medical necessity, and other related items in addition to phlebotomy duties."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Certificate, High School Graduate / GED, Basic Cardiac Life Support, or CPR for Healthcare Providers, or Heart Saver CPR must be obtained within 30 days of employment start date"
    }
  ]
}