{
  "meta": [
    {
      "job_title": "General Counsel",
      "job_category": "Legal",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Law",
      "experience": 10
    },
    {
      "skill": "Franchise Law",
      "experience": 10
    },
    {
      "skill": "Privacy Law",
      "experience": 10
    },
    {
      "skill": "Legal Compliance",
      "experience": 10
    },
    {
      "skill": "Contract Negotiation",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Change Management",
      "experience": 10
    },
    {
      "skill": "Communication",
      "experience": 10
    },
    {
      "skill": "Analytical Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide general legal support on a wide variety of key projects, including negotiating and drafting commercial agreements."
    },
    {
      "duty": "Oversee the company's intellectual property matters, including negotiating licensing rights and managing the company's trademark and other intellectual property assets."
    },
    {
      "duty": "Advise executive team, senior management, and Board on various matters, including the implementation of sound corporate governance practices."
    },
    {
      "duty": "Research and advise the company on state and federal regulatory matters."
    },
    {
      "duty": "Support and develop company’s privacy program to enable consistent, effective data privacy practices and minimize privacy risk."
    },
    {
      "duty": "Educate franchisees through targeted counseling, training and awareness programs."
    },
    {
      "duty": "Provide legal counsel and support for incident management and incident response."
    },
    {
      "duty": "Lead other key projects as needed to support the legal department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Juris degree from an ABA-accredited law school with at least 7 years of legal experience at a law firm or in-house legal department in the healthcare industry, and a minimum of 7 years in a supervisory/leadership role."
    },
    {
      "credential": "Knowledge of major privacy laws such as CCPA/CPRA, GDPR, HIPAA."
    },
    {
      "credential": "Experience with national franchise systems and/or multi-unit healthcare companies."
    },
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)."
    }
  ]
}