{
  "meta": [
    {
      "job_title": "Field Technician 2",
      "job_category": "Field Technician",
      "job_class": "Mid-Level",
      "sector": "Engineering",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technical Support",
      "experience": 3
    },
    {
      "skill": "Maintenance",
      "experience": 3
    },
    {
      "skill": "Troubleshooting",
      "experience": 3
    },
    {
      "skill": "Equipment Installation",
      "experience": 3
    },
    {
      "skill": "Customer Support",
      "experience": 3
    },
    {
      "skill": "Training",
      "experience": 3
    },
    {
      "skill": "Electrical Engineering",
      "experience": 3
    },
    {
      "skill": "Mechanical Engineering",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide testing per specific test procedures using measuring instruments and computer test programs for vehicle systems or products."
    },
    {
      "duty": "Support customer support and training for new and existing customers in-house and in the field."
    },
    {
      "duty": "Support production and manufacturing functions as well as the production and assembly of test boards."
    },
    {
      "duty": "Maintain vehicle repairs, upgrades, and execution of test procedures in new and existing vehicles."
    },
    {
      "duty": "Perform pre-mission tasks such as vehicle mission programming, vehicle checkout, and recognize when something is out of specification."
    },
    {
      "duty": "Perform post-mission data download and analysis, and level one troubleshooting including visual inspection, use of DVM, and basic schematic reading."
    },
    {
      "duty": "Lead normal vehicle systems field operations for testing and design missions to perform needed tasks."
    },
    {
      "duty": "Document test results with appropriate information in a complete manner and communicate to all required."
    },
    {
      "duty": "Perform all job responsibilities in support of Product Quality Standards and communicate all design problems and bugs to the correct areas within the organization."
    },
    {
      "duty": "Local sea/boat testing at 25-40%, customer-site training as required at 1-2 weeks per trip, and possibility of some extensive travel; must be able to work in the field unsupervised."
    },
    {
      "duty": "Install, operate, maintain, repair, and modify equipment; perform a variety of maintenance and technical support on products such as equipment, integrated systems and subsystems, and software at customer and/or field locations."
    },
    {
      "duty": "Analyze and evaluate products and related performance; troubleshoot and diagnose malfunctions to eliminate problems in minimum time; install, upgrade, and remove products ensuring coordinative engineering field change; maintain effective customer communications, relations, and provide onsite training."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Associates Degree or other 2-year technical degree in a related discipline and 1 year of related experience, or High School Diploma or equivalent and 3 years related experience. Must have the ability to obtain and maintain a government clearance."
    }
  ]
}