{
  "meta": [
    {
      "job_title": "Internal Sales Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "salary": 70000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Establish and maintain relationships with Financial Advisors and Registered Investment Advisors."
    },
    {
      "duty": "Partner with a Regional Vice President in the field to create, develop and implement programs that drive opportunities in their territory."
    },
    {
      "duty": "Leverage Investment Tools (RPAG, FI360, John Hancock Investment Comparison Tool) and provide insight for registered representatives helping them improve portfolio construction."
    },
    {
      "duty": "Educate advisors on the retirement industry. Discuss the differences and advantages of products to help determine solutions that best suits their client’s needs."
    },
    {
      "duty": "Become well versed in JH’s product offers as well as other providers to assist advisors in determining product that best meets their client’s need."
    },
    {
      "duty": "Assist advisors and TPAs with sold case paperwork and the onboarding of plans."
    },
    {
      "duty": "Recommend and strategize with TPA Partners to develop unique and optimal Plan Design for each Plan Sponsor/401k Plan."
    },
    {
      "duty": "Support the advisor’s business growth by helping them understand John Hancock’s story and services to gain competitive advantage, as well as, providing industry insights."
    },
    {
      "duty": "Establish and complete a business strategy and annual territory plan with the team to achieve revenue and growth targets by: Segmentation of advisors, partners (DCIO/TPA) to find additional opportunities, and identifying innovative approaches to help current advisors grow their book of business."
    },
    {
      "duty": "Provide service and support by contacting advisor audience by soliciting/prioritizing opportunities and analyzing needs (pricing, service issues, features) when existing plans go out for RFP."
    },
    {
      "duty": "Review investment line-up from current 401(k) provider, analyze and compare to the JH platform to ensure the plan sponsor has appropriate and diverse fund line-up offering providing full style box coverage."
    },
    {
      "duty": "Lead projects for department initiatives to fully implement new processes, strategies, and more."
    },
    {
      "duty": "Qualify new advisor prospects by gaining insight on their business model and composition of current clients."
    },
    {
      "duty": "Participate in training and coaching development programs to enhance skills and provide opportunities for advancement within the ISC role and other firm wide sales, marketing, and management related functions."
    },
    {
      "duty": "Implement the highest levels of integrity and professional conduct."
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Financial Services",
      "experience": 3
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Negotiation Skills",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree or equivalent work experience"
    },
    {
      "credential": "A minimum of 2-3 years dynamic work experience, preferably in phone and/or sales type roles."
    },
    {
      "credential": "A commitment to attain the Securities Industry Essentials, Series 6, 63 plus state insurance and variable licenses within 4 months of hire"
    }
  ]
}