{
  "meta": [
    {
      "job_title": "Key Holder",
      "job_category": "Retail",
      "job_class": "Supervisor",
      "sector": "Sales",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with the management team to supervise store operations and create an engaging environment for customers and the team."
    },
    {
      "duty": "Drive sales, build awareness of key metrics, and contribute to the development of team members."
    },
    {
      "duty": "Act as a brand ambassador, creating selling initiatives, and delivering a seamless omni-channel shopping experience."
    },
    {
      "duty": "Exercise decision-making and multitasking capabilities, prioritize service over tasks, and actively participate in managing the store environment and customer experience."
    },
    {
      "duty": "Support the store management team in executing daily office procedures, operations, and store maintenance."
    },
    {
      "duty": "Engage employees at all levels, promote open dialogue, reinforce follow-through, and ensure that the store team is heard and supported."
    },
    {
      "duty": "Stay current and collaborate with the leadership team, respond to communication, and actively participate in daily meetings and chat ins."
    },
    {
      "duty": "Guide and develop the Stylist team, take responsibility for own development and professional growth, and consider role replacement for career progression."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Sales",
      "experience": 3
    },
    {
      "skill": "Team Management",
      "experience": 3
    },
    {
      "skill": "Visual Merchandising",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Retail Operations",
      "experience": 3
    },
    {
      "skill": "Brand Ambassadorship",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent (Bachelor's degree preferred)"
    }
  ]
}