{
  "meta": [
    {
      "job_title": "Marketing Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    },
    {
      "skill": "Market Analysis",
      "experience": 8
    },
    {
      "skill": "Online Presence Management",
      "experience": 8
    },
    {
      "skill": "Event Planning",
      "experience": 8
    },
    {
      "skill": "Data Analysis",
      "experience": 8
    },
    {
      "skill": "Digital Marketing",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Organizational Skills",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create brand awareness for Genesys Customer Success via regional events, a strong digital presence on Genesys.com, and social media campaigns."
    },
    {
      "duty": "Drive pipeline generation activities to support the adopt, expand, and renewal motions."
    },
    {
      "duty": "Develop content and marketing assets for core messaging."
    },
    {
      "duty": "Develop scalable processes in partnership with Global Marketing."
    },
    {
      "duty": "Cross functional marketing lead within CSS - work cross-functionally with SMEs, regional leaders, and Global Marketing to create and execute digital awareness and demand generation campaigns and track campaign performance (analytics)."
    },
    {
      "duty": "Work with Global Marketing to create a robust Customer Success presence on the corporate website, with relevant and dynamic CTAs."
    },
    {
      "duty": "Develop creative strategies for marketing Customer Success to internal organizations, customers, and partners to raise awareness of CS offerings."
    },
    {
      "duty": "Run Social Media campaigns. (LinkedIn, Instagram, etc)"
    },
    {
      "duty": "Partner with Operations team to measure effectivity and ROI of marketing initiatives."
    },
    {
      "duty": "Create content to support all marketing initiatives. Write copy."
    },
    {
      "duty": "Develop sales enablement content and work with commercial leaders on enabling the service sales teams."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Marketing, Business, or a related field"
    }
  ]
}