{
  "meta": [
    {
      "job_title": "Process Improvement Specialist",
      "job_category": "Business",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Lean Six Sigma",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Business Analysis",
      "experience": 4
    },
    {
      "skill": "Change Management",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Process Improvement",
      "experience": 4
    },
    {
      "skill": "Operational Excellence",
      "experience": 4
    },
    {
      "skill": "Budget Management",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Data Interpretation",
      "experience": 5
    },
    {
      "skill": "Innovation",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead cross functional, company-wide, and business unit specific process improvement initiatives using Lean Six Sigma, Project Management, Business Analysis, and change management disciplines."
    },
    {
      "duty": "Conduct organizational and business process analysis in partnership with business unit owners and process owners."
    },
    {
      "duty": "Prepare value stream mapping for enterprise-wide and business segment specific objectives by managing the project planning activities for enterprise-wide continuous improvement efforts."
    },
    {
      "duty": "Design and drive project plans with Sr. leaders to attain improvements as identified."
    },
    {
      "duty": "Create and compile performance tracking metrics and data tracking for business units and associated services with emphasis on the critical success factors."
    },
    {
      "duty": "Equip the organization with operational excellence tools and practices by applying Lean and Six Sigma methodology through the ‘learning by doing’ process."
    },
    {
      "duty": "Lead high-impact process improvement projects by partnering with senior leaders to identify and act on opportunities to increase operational efficiency and reduce waste through application of Lean and Six Sigma tools."
    },
    {
      "duty": "Validate and scope improvement projects, link client requirements and business process improvements."
    },
    {
      "duty": "Organize and drive effective teams to deliver results and complete projects successfully deploying pilot, launch and control in order to ensure the achievement of expected results."
    },
    {
      "duty": "Enable the delivery of budgeted benefits at the program level by partnering with business leaders to increasing efficiencies and reducing waste within the organization."
    },
    {
      "duty": "Solve complex problems, integrate and interpret data from diverse sources to find solutions for very complex problems."
    },
    {
      "duty": "Monitor and control the changes that were made to improve processes to ensure long-term adoption. Work closely with Business partners and is a trusted administrator to help bring innovation and insight."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree - Preferred4 years of experience in Hands-on experience driving Lean implementation.1 year of experience in Six Sigma, or the equivalent combination of education and experience.LSS- Greenbelt - RequiredLSS-Blackbelt - Preferred"
    }
  ]
}