{
  "meta": [
    {
      "job_title": "Executive Assistant",
      "job_category": "Administrative",
      "job_class": "Assistant",
      "sector": "Management",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Organization",
      "experience": 5
    },
    {
      "skill": "Confidentiality",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide high-level administrative support to the CEO and Executive Leadership."
    },
    {
      "duty": "Manage sensitive matters with a high level of confidentiality and discretion."
    },
    {
      "duty": "Sustain a daily calendar of meetings and events."
    },
    {
      "duty": "Culture coordination - manage event planning for company meetings and outings."
    },
    {
      "duty": "Prepare Word, Excel, PowerPoint presentations, agendas, reports, special projects, and other documents in support of objectives for the organization."
    },
    {
      "duty": "Arrange travel and accommodations for executives. Prepare expense reports."
    },
    {
      "duty": "Screen incoming telephone calls; take and deliver accurate messages; respond to requests by gathering and providing information and referring non-routine calls to the appropriate staff."
    },
    {
      "duty": "Prepare documents/decks for Board meetings, Investor meeting and committee meetings."
    },
    {
      "duty": "Manage the Executive's contacts and organize complex calendars and schedules, resolving any scheduling issues."
    },
    {
      "duty": "Be responsive to emails/texts/phone calls, with contact outside normal business hours."
    },
    {
      "duty": "Welcome the Executive’s guests by greeting them, in person or on the phone, answering or directing inquiries. Use discretion, confidentiality, and good judgment to handle C-Level matters."
    },
    {
      "duty": "Conserve the Executive's time by reading, researching, collecting, and analyzing information as needed, in advance. Provide direction to contract administrative personnel."
    },
    {
      "duty": "Perform duties and responsibilities of an office manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred. 3+ years of related experience required in working in an executive assistant role supporting C-Level executives. Advanced proficiency in Microsoft Office (Outlook, Word, Excel, and PowerPoint)"
    }
  ]
}