{
  "meta": [
    {
      "job_title": "Client Relationship Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Consultative Selling",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    },
    {
      "skill": "Financial Services",
      "experience": 5
    },
    {
      "skill": "Plan Management",
      "experience": 5
    },
    {
      "skill": "ERISA Compliance",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct annual plan reviews, investment reviews, and service meetings with clients and brokers."
    },
    {
      "duty": "Act as the escalation point for resolution of non-routine issues related to service, including identifying root causes and designing strategies for resolution."
    },
    {
      "duty": "Consult with clients and brokers on qualified plan design issues and interpret plan provisions to accomplish client goals."
    },
    {
      "duty": "Adhere to process and documentation standards to minimize operational risk and loss."
    },
    {
      "duty": "Drive cross-sell opportunities and consult with clients to enhance profitability."
    },
    {
      "duty": "Assist the Sales team with final presentations, acting as a subject matter expert on company service model, installation process, and plan design."
    },
    {
      "duty": "Contribute to projects designed to enhance service, improve internal training, and improve client satisfaction and retention."
    },
    {
      "duty": "Engage in extensive travel (40%-60%) to meet with clients and brokers."
    },
    {
      "duty": "Train clients on company processes, procedures, and resources, including all systems/technology for participants and plan sponsors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in a business-related field or equivalent education/experience."
    },
    {
      "credential": "FINRA Series 6 and 63 licenses, or obtain within six months."
    },
    {
      "credential": "Thorough understanding of ERISA and retirement industry trends."
    },
    {
      "credential": "Advanced knowledge of retirement programs and subject matter expertise in plan management, including technical, compliance, administration, investment, and participant solutions."
    },
    {
      "credential": "Proficiency using MS Office (Word, Excel, PowerPoint)"
    }
  ]
}