{
  "meta": [
    {
      "job_title": "Director, Data Center Construction",
      "job_category": "Construction",
      "job_class": "Director",
      "sector": "Management",
      "salary": 160000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Lead construction teams and ensure proper construction and completion of data center projects both on time and on budget."
    },
    {
      "duty": "Develop state-of-the-art data center concepts for our portfolio of data centers; orchestrate concepts such as standardization, speed to market, operator life safety, sustainability and energy efficiency."
    },
    {
      "duty": "Collaborate with architects, engineers and consultants to ensure design concepts and product selection align with our client's strategic goals for developing and operating cost effective and reliable data centers; collectively identify and pursue opportunities for innovation."
    },
    {
      "duty": "Collaborate with senior management to develop data center strategies relative to new markets, new technologies, and new design features."
    },
    {
      "duty": "As requested, assist in analyzing new markets for potential data center expansion; provide technical evaluation, and perform due diligence of potential acquisitions."
    },
    {
      "duty": "Work with local jurisdictions to ensure all designs meet federal, state and municipal requirements and building codes."
    },
    {
      "duty": "Work with our client's development teams to ensure construction deliverables meet project schedules."
    },
    {
      "duty": "Provide quality control over construction and commissioning documentation, including but not limited to construction drawings, submittals, and commissioning test scripts."
    },
    {
      "duty": "Participate in factory witness testing of new equipment."
    },
    {
      "duty": "Work with engineers and commissioning agents to properly test and validate installation, operation, and performance of electrical, mechanical and building systems."
    },
    {
      "duty": "Represent Company at industry events by attending or speaking on current data center trends/topics."
    },
    {
      "duty": "Reasonable accommodation may be made to enable individuals with disabilities to perform the essential functions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "10+ years of mission-critical facility engineering and construction."
    },
    {
      "credential": "Bachelor's degree in Engineering, Construction Management or a related field (Master's preferred)"
    }
  ]
}