{
  "meta": [
    {
      "job_title": "Physician Assistant",
      "job_category": "Healthcare",
      "job_class": "Physician Assistant",
      "sector": "Healthcare",
      "salary": 167000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medical Care",
      "experience": 4
    },
    {
      "skill": "Patient Education",
      "experience": 4
    },
    {
      "skill": "Clinical Duties",
      "experience": 4
    },
    {
      "skill": "Prescription Management",
      "experience": 4
    },
    {
      "skill": "Therapeutic Plan Implementation",
      "experience": 4
    },
    {
      "skill": "Clinical Research Coordination",
      "experience": 4
    },
    {
      "skill": "Patient Outcome Monitoring",
      "experience": 4
    },
    {
      "skill": "Interdisciplinary Collaboration",
      "experience": 4
    },
    {
      "skill": "Healthcare Education",
      "experience": 4
    },
    {
      "skill": "Core Values Integration",
      "experience": 4
    },
    {
      "skill": "Hospital Care Facilitation",
      "experience": 4
    },
    {
      "skill": "Continuity of Care Coordination",
      "experience": 4
    },
    {
      "skill": "Therapeutic Regimen Consultation",
      "experience": 4
    },
    {
      "skill": "Communication with Family Members",
      "experience": 4
    },
    {
      "skill": "Patient Care Planning",
      "experience": 4
    },
    {
      "skill": "Resource Utilization",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provision, coordination, and assurance of comprehensive medical care using sound medical knowledge and pertinent standards of care."
    },
    {
      "duty": "Educate patients and families to facilitate healthy adjustment to new or changed health patterns."
    },
    {
      "duty": "Evaluate treatment and health care plans for effectiveness and modify per clinical standards and practice protocols."
    },
    {
      "duty": "Prescribe medical equipment, devices, physical and occupational therapy, and home health services per practice protocol."
    },
    {
      "duty": "Coordinate implementation of clinical research studies or clinical trials, including patient screening, enrollment, and data collection."
    },
    {
      "duty": "Monitor and trend the cost-effectiveness of the position, particularly as it relates to the efficiency and performance indicators established for the service."
    },
    {
      "duty": "Facilitate patient throughput and efficient process during patient admission and discharge."
    },
    {
      "duty": "Maintain PA board certification and annual CME requirement for re-appointment and privileging."
    },
    {
      "duty": "Promote own professional growth and development in clinical role."
    },
    {
      "duty": "Participate in designated activities related to professional physician assistant practice standards."
    },
    {
      "duty": "Demonstrate knowledge of the organization's Core Values and incorporate them into the performance of responsibilities."
    },
    {
      "duty": "Assist in the preparation, implementation, and evaluation of research protocols when applicable."
    },
    {
      "duty": "Provide consultation about the therapeutic regimen to the nursing staff responsible for the patient's care in the hospital setting."
    },
    {
      "duty": "Plan and organize care to meet individual patient needs and to ensure appropriate clinical resource utilization."
    },
    {
      "duty": "Participate in the development and revision of interdisciplinary and hospital standards, patient, and family education materials relevant to the area of practice and expertise."
    },
    {
      "duty": "Work collaboratively with the interdisciplinary team, including the attending physician, to develop and implement the therapeutic plan of care for a group of patients and ensure communication with family members."
    },
    {
      "duty": "Facilitate the continuity of care across the continuum of services, e.g., home care, other facilities, appointments with MDs, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 110,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Physician Assistant Bachelor's Degree (BA-PA)"
    },
    {
      "credential": "Current New York State Physician Assistant License"
    },
    {
      "credential": "NCCPA Board Certification"
    },
    {
      "credential": "ACLS, PALS, NRP Provider (Neonatal Resuscitation Program) NALS per delineation of privileges."
    },
    {
      "credential": "Membership in pertinent professional organizations preferred."
    }
  ]
}