{
  "meta": [
    {
      "job_title": "VP, Market Risk Methodologies Quant",
      "job_category": "Risk Management",
      "job_class": "VP",
      "sector": "Finance",
      "salary": 160000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with cross-functional teams, including risk managers, traders, and IT professionals, to design, implement, and maintain cutting-edge quantitative models for measuring market risk."
    },
    {
      "duty": "Develop and enhance risk methodologies, stress testing frameworks, and scenario analysis tools to accurately capture market risk exposures across a variety of financial products and trading strategies."
    },
    {
      "duty": "Conduct rigorous quantitative analysis and research to identify potential vulnerabilities in existing risk models and methodologies, proposing and implementing innovative solutions to address identified shortcomings."
    },
    {
      "duty": "Evaluate and calibrate risk models to ensure accuracy and robustness, keeping them aligned with market dynamics, regulatory changes, and best practices in the industry."
    },
    {
      "duty": "Stay abreast of industry trends, market developments, and regulatory requirements related to market risk, incorporating this knowledge into the enhancement of risk methodologies and models."
    },
    {
      "duty": "Collaborate with the validation team to perform comprehensive testing and validation of quantitative models, ensuring they meet internal and external validation standards."
    },
    {
      "duty": "Contribute to the documentation of model development, validation reports, and technical specifications to ensure transparency and compliance with internal policies and regulatory guidelines."
    }
  ],
  "skills": [
    {
      "skill": "Quantitative Analysis",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Financial Modeling",
      "experience": 5
    },
    {
      "skill": "Stress Testing",
      "experience": 5
    },
    {
      "skill": "Quantitative Research",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Finance, Economics, or a related quantitative field"
    }
  ]
}