{
  "meta": [
    {
      "job_title": "Lending Manager",
      "job_category": "Banking",
      "job_class": "Manager",
      "sector": "Banking",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Business Growth",
      "experience": 5
    },
    {
      "skill": "Home Lending",
      "experience": 5
    },
    {
      "skill": "Client Solutions",
      "experience": 5
    },
    {
      "skill": "Partnership Building",
      "experience": 5
    },
    {
      "skill": "Banking Career Development",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Business Partnership",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Accelerate the penetration of bank mortgage services in the designated territory to grow the business."
    },
    {
      "duty": "Source and build relationships with new referral partners within the local community for Home Lending business."
    },
    {
      "duty": "Support clients' home lending and other financial needs through a customer-centric approach and strong business development."
    },
    {
      "duty": "Provide high-level customer service and keep all stakeholders informed throughout the process to drive customer satisfaction and advocacy."
    },
    {
      "duty": "Foster a coaching culture to support referral partners and a branch network."
    },
    {
      "duty": "Engage with prospects and customers, establish trust, and develop long-term relationships to support an exceptional customer journey."
    },
    {
      "duty": "Work with all internal functions to build the business partnership required to support an exceptional customer journey."
    },
    {
      "duty": "Create growth, lead progressively and empathetically, and drive positive change with a high level of integrity in a high-performing team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Banking, Finance, or a related field (Master's preferred)"
    }
  ]
}