{
  "meta": [
    {
      "job_title": "Cashier",
      "job_category": "Customer Service",
      "job_class": "Entry-level",
      "sector": "Hospitality",
      "salary": 32000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Cash Handling",
      "experience": 1
    },
    {
      "skill": "Restaurant Operations",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Team Player",
      "experience": 1
    },
    {
      "skill": "Cash Register Operation",
      "experience": 1
    },
    {
      "skill": "Food Service",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Greeting and assisting customers, filling drink orders, and working the drive-thru."
    },
    {
      "duty": "Advancing career by taking on more responsibilities in other roles, such as Certified Trainer."
    },
    {
      "duty": "Guiding the customer experience and interacting with each customer that visits the Restaurant."
    },
    {
      "duty": "Working in a fast-paced food service environment, working all shifts from opening to closing."
    },
    {
      "duty": "Providing paid training for new Restaurant Cashier team members."
    },
    {
      "duty": "Earning pay increases through additional training, certifications, and performance evaluations."
    },
    {
      "duty": "Being a team player, excellent communicator, and responsible and dependable."
    },
    {
      "duty": "Maintaining casual work attire and flexible scheduling."
    },
    {
      "duty": "Lifting, carrying, pushing or pulling heavy objects up to 50 pounds and cleaning tables, floors, and other areas of the Restaurant."
    },
    {
      "duty": "Taking orders from customers and processing payments efficiently, while following proper safety procedures when handling and/or preparing food."
    },
    {
      "duty": "Showing up to scheduled shifts on time and working under pressure and at a fast pace."
    },
    {
      "duty": "Complying with company policies and providing all customers with quick and friendly service."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": []
}