{
  "meta": [
    {
      "job_title": "Process Improvement Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads cross functional, company-wide, and business unit specific process improvement initiatives."
    },
    {
      "duty": "Conducts organizational and business process analysis in partnership with business unit owners and process owners."
    },
    {
      "duty": "Designs and drives project plans with senior leaders to attain improvements as identified."
    },
    {
      "duty": "Creates and compiles performance tracking metrics and data tracking for business units and associated services."
    },
    {
      "duty": "Equips the organization with operational excellence tools and practices."
    },
    {
      "duty": "Leads high impact process improvement projects by partnering with senior leaders."
    },
    {
      "duty": "Validates and scopes improvement projects, links client requirements and business process improvements."
    },
    {
      "duty": "Enables the delivery of budgeted benefits at the program level."
    },
    {
      "duty": "Integrates and interprets data from diverse sources to find solutions for very complex problems."
    },
    {
      "duty": "Monitors and controls the changes made to improve processes to ensure long term adoption."
    },
    {
      "duty": "Works closely with Business partners and is trusted administrator to help bring innovation and insight."
    }
  ],
  "skills": [
    {
      "skill": "Lean Six Sigma",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Business Analysis",
      "experience": 4
    },
    {
      "skill": "Change Management",
      "experience": 4
    },
    {
      "skill": "Operational Excellence",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Leadership",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree - Preferred4 years of experience in Hands-on experience driving Lean implementation.1 year of experience in Six Sigma, or the equivalent combination of education and experience. LSS- Greenbelt - Required LSS-Blackbelt - Preferred"
    }
  ]
}