{
  "meta": [
    {
      "job_title": "Sr. Advanced R&D Engineer/Scientist",
      "job_category": "Engineering",
      "job_class": "Advanced R&D",
      "sector": "Engineering",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Electromagnetic Design and Measurement",
      "experience": 7
    },
    {
      "skill": "Cryogenic Systems Operation",
      "experience": 5
    },
    {
      "skill": "Finite Element Software",
      "experience": 5
    },
    {
      "skill": "Python",
      "experience": 5
    },
    {
      "skill": "MATLAB",
      "experience": 5
    },
    {
      "skill": "Teamwork",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "RF and Millimeter Wave Design",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with physicists, engineers and technicians on various project phases including initial concept, engineering analysis, detailed design, integration, fabrication procurement assembly, testing, installation, and commissioning of superconducting magnets."
    },
    {
      "duty": "Partner with subject matter experts to design and/or operate cryogenic systems and conduct electromagnetic, structural, and thermal analyses on existing or new superconducting magnets."
    },
    {
      "duty": "Create magnet designs based on high temperatures and/or low-temperature superconductors for prescribed requirements of field strength, uniformity, and other operating conditions."
    },
    {
      "duty": "Model components or systems utilizing commercial finite element software (ANSYS, COMSOL) and document engineering designs through written reports and presentation materials."
    },
    {
      "duty": "Provide a deep understanding in electromagnetic theory and real-world design & specification of magnetic components, coupled electromagnetic environments in in the radio frequency and millimeter wave bands."
    },
    {
      "duty": "Operate under a culture of teamwork to overcome challenging design tasks while maintaining awareness of individual strengths and weaknesses."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from an accredited institution in a technical discipline such as the sciences, technology, engineering, or mathematics (Master's preferred)"
    }
  ]
}