{
  "meta": [
    {
      "job_title": "Marketing Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute marketing strategies that maximize return on investment and deliver competitive advantage within the US business."
    },
    {
      "duty": "Contribute to the development of category and product strategies; work with the Global Marketing teams to ensure brands fit the needs of the US market."
    },
    {
      "duty": "Develop and execute marketing initiatives and oversee program management including in-store collateral, blow-ins, co-op advertising, and digital assets."
    },
    {
      "duty": "Proof and approve all artwork relating to new promotional opportunities."
    },
    {
      "duty": "Conduct business analysis and reporting for assigned brand(s) with emphasis on utilizing data to drive action."
    },
    {
      "duty": "Uncover category, competitive, and consumer insights and apply insights to recommend an appropriate course of action."
    },
    {
      "duty": "Maintain and monitor project timelines and follow up with cross-functional team members on an ongoing basis."
    },
    {
      "duty": "Work with Retail Experience team to ensure category-specific products are represented appropriately in-store."
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}