{
  "meta": [
    {
      "job_title": "Administrative Assistant",
      "job_category": "Administration",
      "job_class": "Assistant",
      "sector": "Administration",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Carries out basic office administrative duties including, but not limited to, filing, copying, scanning, ordering supplies, generating reports, setting up for meetings, sorting mail, conducting research, and making telephone calls with various tax jurisdictions and other third parties to request information."
    },
    {
      "duty": "Screens phone calls and routes callers to the appropriate party. Greets and assists visitors."
    },
    {
      "duty": "Processes invoices for both vendors and general contractors in a timely manner. Serves as a point of contact for vendor and general contractor questions relating to payments."
    },
    {
      "duty": "Provides real-time scheduling support by booking appointments and preventing conflicts. Uses technology to assist in generating reports and collating requested data across tax functions."
    },
    {
      "duty": "Anticipates the needs of others to ensure their seamless and positive experience. Performs various ad hoc requests for department personnel as needed."
    },
    {
      "duty": "Proven organizational skills and attention to details."
    }
  ],
  "skills": [
    {
      "skill": "Office Administration",
      "experience": 3
    },
    {
      "skill": "Scheduling",
      "experience": 3
    },
    {
      "skill": "Invoicing",
      "experience": 3
    },
    {
      "skill": "Vendor Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree from an accredited college or university preferred. Some tax assistant experience preferred. 1+ years experience in an administrative role preferred. Knowledge of Microsoft Office Suite preferred. Ability to manage multiple large-scale administrative projects concurrently (e.g., high-volume mail merges and mail-outs (knowledge of USPS certified mail and bulk book mailing procedures preferred), document/notice intake, large-batch scanning, and tracking). Experience improving and creating reference documents for day-to-day and project-specific processes. Has obtained (or willing to obtain) notary license."
    }
  ]
}