{
  "meta": [
    {
      "job_title": "Sales Consultant",
      "job_category": "Sales",
      "job_class": "Consultant",
      "sector": "Sales",
      "salary": 55000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales and Service",
      "experience": 5
    },
    {
      "skill": "Product Demonstration",
      "experience": 5
    },
    {
      "skill": "Customer Onboarding",
      "experience": 5
    },
    {
      "skill": "Operational Tasks",
      "experience": 5
    },
    {
      "skill": "Customer Care",
      "experience": 5
    },
    {
      "skill": "Retail Operations",
      "experience": 5
    },
    {
      "skill": "Sales Excellence",
      "experience": 5
    },
    {
      "skill": "Administration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Passionately represents products and services, delivers product demonstrations, and provides comprehensive customer onboarding."
    },
    {
      "duty": "Achieves sales and customer experience goals, partners with customer care, and consistently demonstrates sales excellence."
    },
    {
      "duty": "Performs operational and administrative tasks, complies with operational policies, and completes training requirements."
    },
    {
      "duty": "Works a flexible schedule and may be asked to work in alternate stores. Carries and lifts up to 25 pound boxes, stands and moves about the store constantly."
    },
    {
      "duty": "Understands operating principles, owns the customer experience, knows and understands sales compensation plan, and demonstrates integrity and a warm and friendly demeanor."
    },
    {
      "duty": "Contributes to the Net Promoter System, drives results and growth, respects and promotes inclusion & diversity, and does what's right for customers and communities."
    },
    {
      "duty": "Understands operating principles, owns the customer experience, knows and understands sales compensation plan, and actively engage in team huddles and learning."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma / GED"
    }
  ]
}