{
  "meta": [
    {
      "job_title": "Quality Inspection Specialist",
      "job_category": "Manufacturing",
      "job_class": "Specialist",
      "sector": "Engineering",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform inspection activities, to assess conformance of products to the design as defined by the engineering drawings and/or models."
    },
    {
      "duty": "Inspect products, components, subassemblies, and/or systems to ensure conformance to requirements."
    },
    {
      "duty": "Add organizational value by implementing innovative solutions and best practices involved in all processes of the product realization value stream."
    },
    {
      "duty": "Support Quality Engineers with identifying non-conforming conditions that present existing or impending defective conditions at the system or subsystem level of assembly."
    },
    {
      "duty": "Oversee the preparation of inspection plans and checklists for inspections."
    },
    {
      "duty": "Aid with data collection and root cause analysis investigations."
    },
    {
      "duty": "Generate discrepancy notices and initiate Material Review Board actions."
    },
    {
      "duty": "Perform material movement transactions after completing inspection process."
    },
    {
      "duty": "Specialize in receiving inspection, in-process inspection, process verification/auditing, final inspection, etc."
    },
    {
      "duty": "Support, communicate, reinforce and defend the mission, values and culture of the organization."
    }
  ],
  "skills": [
    {
      "skill": "Inspection Activities",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 5
    },
    {
      "skill": "Measurement Devices",
      "experience": 5
    },
    {
      "skill": "Product Inspection",
      "experience": 5
    },
    {
      "skill": "Technical Discipline",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED with 5+ years of experience in a technical discipline or equivalent experience in a field or in a related area."
    }
  ]
}