{
  "meta": [
    {
      "job_title": "Line Cook",
      "job_category": "Culinary",
      "job_class": "Cook",
      "sector": "Hospitality",
      "salary": 32000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Chinese Wok Cooking",
      "experience": 5
    },
    {
      "skill": "Scratch Kitchen Cooking",
      "experience": 5
    },
    {
      "skill": "Knowledge of Asian Cuisines",
      "experience": 5
    },
    {
      "skill": "Food Preparation",
      "experience": 5
    },
    {
      "skill": "Cooking Techniques",
      "experience": 5
    },
    {
      "skill": "Kitchen Equipment Operation",
      "experience": 5
    },
    {
      "skill": "Food Safety and Sanitation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Properly prepare all food items listed on the menu, including grilling, frying, broiling, baking, boiling, and braising."
    },
    {
      "duty": "Cook on the Wok station with at least 5 years of high-volume scratch kitchen experience."
    },
    {
      "duty": "Prepare Chinese Wok Dishes and preferably have knowledge of Vietnamese, Thai, and other Asian cuisines."
    },
    {
      "duty": "Create an inviting atmosphere for guests and actively build and retain guest relations."
    },
    {
      "duty": "Mentor team members to provide superior guest service."
    },
    {
      "duty": "Ensure the aesthetical appeal and proper cooking of all plates or pans served."
    },
    {
      "duty": "Recognize and properly place a variety of sauces on entrees featured on daily menus."
    },
    {
      "duty": "Maintain a neat and clean workstation."
    },
    {
      "duty": "Assist co-workers for efficient kitchen operation and special events/parties."
    },
    {
      "duty": "Ensure cleanliness of the working area and report any equipment safety failures or hazardous areas."
    },
    {
      "duty": "Properly store foods and ensure full stock of items and good working condition of equipment."
    },
    {
      "duty": "Close down workstations and assist with other duties at special events or parties."
    },
    {
      "duty": "Attend and participate in meetings, completing follow-up as assigned."
    },
    {
      "duty": "Season food according to recipes or company needs and assist other cooks during the food assembly process."
    },
    {
      "duty": "Clean food preparation areas according to company policy and perform work regularly and predictably."
    },
    {
      "duty": "Clean and sanitize work and public spaces as required, as well as other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 90,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or Equivalent, with preference for culinary apprenticeship, Associate's Degree in culinary institution, or equivalent with industry experience."
    },
    {
      "credential": "Valid licenses/certifications per Federal, State, and Gaming regulations."
    },
    {
      "credential": "Must successfully pass background check and drug screening."
    },
    {
      "credential": "Must be at least eighteen (18) years of age."
    }
  ]
}