{
  "meta": [
    {
      "job_title": "Cardiac Intervention Specialist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Invasive Cardiac Procedures",
      "experience": 5
    },
    {
      "skill": "Noninvasive Cardiac Procedures",
      "experience": 5
    },
    {
      "skill": "Electrophysiology Procedures",
      "experience": 5
    },
    {
      "skill": "Vascular Procedures",
      "experience": 5
    },
    {
      "skill": "Pediatric Cardiac Procedures",
      "experience": 5
    },
    {
      "skill": "Medical Equipment Calibration",
      "experience": 5
    },
    {
      "skill": "Digital Medical Equipment Operation",
      "experience": 5
    },
    {
      "skill": "Fluoroscopic Equipment Operation",
      "experience": 5
    },
    {
      "skill": "Patient Monitoring",
      "experience": 5
    },
    {
      "skill": "EKG Interpretation",
      "experience": 5
    },
    {
      "skill": "Hemodynamic Waveform Interpretation",
      "experience": 5
    },
    {
      "skill": "Medical Documentation",
      "experience": 5
    },
    {
      "skill": "Aseptic Techniques",
      "experience": 5
    },
    {
      "skill": "Supply Inventory Management",
      "experience": 5
    },
    {
      "skill": "Electronically Health Record (EHR) Management",
      "experience": 5
    },
    {
      "skill": "Charge Capture",
      "experience": 5
    },
    {
      "skill": "Quality Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist physicians in performing invasive and noninvasive cardiac, electrophysiology, structural heart interventions, and vascular procedures in the Electrophysiology Lab (EP)."
    },
    {
      "duty": "Prepare patients and procedural sites using aseptic techniques."
    },
    {
      "duty": "Assist physicians by calibrating equipment, preparing supplies, devices and instruments for the procedure."
    },
    {
      "duty": "Operate and monitor digital medical and fluoroscopic equipment for accurate image acquisition."
    },
    {
      "duty": "Utilize multiple computer applications and medical devices for proper procedure documentation within the electronic health record (EHR)."
    },
    {
      "duty": "Responsible for monitoring, interpreting and calculating hemodynamic waveforms and EKGs."
    },
    {
      "duty": "Assist with the coordination, implementation, and evaluation of patient care under the supervision of the physician in the EP/CCL."
    },
    {
      "duty": "Maintain an electronically and radiologic safe environment in the EP/CCL."
    },
    {
      "duty": "Maintain integrity of EP/CCL supply inventory."
    },
    {
      "duty": "Ensure accurate charge capture."
    },
    {
      "duty": "Prepares patients for procedures using proper positioning and surgical prep of procedural site(s)."
    },
    {
      "duty": "Maintains sterile technique while assisting physicians during cardiac adult and pediatric / EP/ vascular procedures."
    },
    {
      "duty": "Operates digital medical and fluoroscopic equipment during procedures. Continuous monitoring of patients condition through interpretation of EKG and hemodynamic waveforms."
    },
    {
      "duty": "Documentation of procedural events and ensures accuracy of recorded waveforms and calculation. Finalizes procedural reports and transfers all images and information."
    },
    {
      "duty": "Loads automatic injector with contrast media and injects via catheter at a rate of volume selected by physician."
    },
    {
      "duty": "Uses provided computer applications to ensure accurate charge capture on procedural and supply charges."
    },
    {
      "duty": "Stocking and inventory of equipment and supply readiness utilizing hospital inventory system."
    },
    {
      "duty": "Participate in unit performance improvement / quality management measures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "RCIS credential through Cardiovascular Credentialing International and/or RT through ARRT with special procedures experience and/or cardiac catheterization experience."
    },
    {
      "credential": "BLS / ACLS certification."
    },
    {
      "credential": "Basic dysrhythmia course."
    },
    {
      "credential": "6-12 months on-the-job training in electrocardiograph interpretation, aseptic techniques, and cardiac diagnostic and interventional procedures."
    },
    {
      "credential": "Knowledge of heart anatomy, physiology and radiographic procedures generally acquired through two years education in an allied health science such as radiographic technology, nursing, or cardiopulmonary technology."
    },
    {
      "credential": "Desirable to have registry as an invasive Cardiovascular Specialist through the Cardiovascular Credentialing International."
    }
  ]
}