{
  "meta": [
    {
      "job_title": "Operational Performance Analyst",
      "job_category": "Operations",
      "job_class": "Analyst",
      "sector": "Operations",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for analyzing and evaluating operational performance metrics and resources."
    },
    {
      "duty": "Create and facilitate reporting and analysis to evaluate operational initiatives and drive operational efficiencies."
    },
    {
      "duty": "Provide analytical support of actual results against budget and feasibility of proposed business strategies."
    },
    {
      "duty": "Conduct regular audits to ensure data integrity and provide analysis of master and transactional data."
    },
    {
      "duty": "Consolidate data reports and deliver to help drive data-based strategic decision making."
    },
    {
      "duty": "Create and maintain compliance reports that identify discrepancies within the Company's billing systems."
    },
    {
      "duty": "Provide user feedback to management and help influence future systems enhancements."
    },
    {
      "duty": "Ensure accuracy of data through partnerships with team members."
    },
    {
      "duty": "Prepare reports to be used by other departments to correct billing issues."
    },
    {
      "duty": "Other duties and responsibilities as assigned."
    },
    {
      "duty": "Consistent exercise of independent judgment and discretion in matters of significance."
    },
    {
      "duty": "Regular, consistent and punctual attendance. Must be able to work nights and weekends, variable schedule(s) and overtime as necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Operations, Business, or a related field (Master's preferred)"
    }
  ]
}