{
  "meta": [
    {
      "job_title": "Patient Coordinator",
      "job_category": "Customer Service",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Greets and assists patients, customers and visitors in person and over the phone."
    },
    {
      "duty": "Performs patient registration in various systems."
    },
    {
      "duty": "Answers all phone calls in a professional and courteous manner."
    },
    {
      "duty": "May collect monies for time-of-service patient responsibility."
    },
    {
      "duty": "May be responsible for verifying insurance coverage and obtain prior authorization."
    },
    {
      "duty": "Performs preliminary screening of patients prior to procedures, including medical history."
    },
    {
      "duty": "Assists in patient transfer on/off the exam table."
    },
    {
      "duty": "Maintains a clean and organized work area and orders supplies."
    },
    {
      "duty": "Ensures accuracy of patient records and schedules patient appointments."
    },
    {
      "duty": "Prepares medical records for physicians, patients, and customers."
    },
    {
      "duty": "Ensures accurate documentation of patient visits and assists with documentation and image delivery."
    },
    {
      "duty": "Performs duties within HIPAA regulations."
    },
    {
      "duty": "May be exposed to outside weather conditions during transport of patients if working on a mobile unit."
    },
    {
      "duty": "May be exposed to a strong magnetic field or radioactive material."
    },
    {
      "duty": "May be exposed to blood/body fluids and infectious disease and environmental hazards."
    },
    {
      "duty": "Sit, stand, walk, repetitive movement of hands, arms and legs, see, speak and hear to communicate with patients."
    },
    {
      "duty": "Stoop, kneel or crawl, climb and balance, carry and lift (ability to move non-ambulatory patients from a sitting or lying position for transfer or to exam)."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Patient Care",
      "experience": 1
    },
    {
      "skill": "Medical Records Management",
      "experience": 1
    },
    {
      "skill": "Insurance Verification",
      "experience": 1
    },
    {
      "skill": "Appointment Scheduling",
      "experience": 1
    },
    {
      "skill": "HIPAA Compliance",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent experience required. CPR Certification required for Mobile Radiology and Oncology, optional for Fixed Radiology. Valid state driver's license required. Basic knowledge of computer applications and programs."
    },
    {
      "credential": "Preferred: Six months customer service or related experience and/or training. Knowledge of medical terminology. Bilingual in Spanish is a plus."
    }
  ]
}