{
  "meta": [
    {
      "job_title": "Pharmaceutical Sales Specialist",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Proficiency",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop superior product and disease state knowledge and effectively educate and engage healthcare professionals in dialogue about clinical evidence, approved indications, and product efficacy/safety profiles to support on-label prescribing for appropriate patients."
    },
    {
      "duty": "Function independently with sales proficiency to drive sales performance and ensure sales forecasts and assigned budgets meet or exceed therapeutic and territory expectations."
    },
    {
      "duty": "Successfully complete training requirements, including product examinations."
    },
    {
      "duty": "Develop and maintain in-depth knowledge of market, demographic, and managed care information relative to your assigned sales territory."
    },
    {
      "duty": "Partner with your District Sales Manager and Regional Sales Director to develop a local strategy and business plan to generate recognizable increases of sales in your territory."
    },
    {
      "duty": "Capitalize on formulary approvals and other opportunities through effective implementation of the Strategic Targeting Plans by using a wide variety of promotional, personnel resources and analytical tools to enhance effectiveness in your assigned sales territory, based on local assessment of customer needs."
    },
    {
      "duty": "Provide special education to healthcare providers through appropriate programs that fall within AstraZeneca’s ethical guidelines."
    },
    {
      "duty": "Work with Pharmaceutical Sales Specialists around common objectives to coordinate selling efforts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree"
    }
  ]
}