{
  "meta": [
    {
      "job_title": "Traffic Operations Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Transportation",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Crisis Planning",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Communication Network Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Emergency Management",
      "experience": 5
    },
    {
      "skill": "Incident Management",
      "experience": 5
    },
    {
      "skill": "Transportation Engineering",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and lead activities of the region’s TOC, evaluating and revising standard operating procedures for improved operational efficiency."
    },
    {
      "duty": "Lead TOC operations during severe weather and emergency operations, developing and leading exercises to assess TOC readiness."
    },
    {
      "duty": "Compile and oversee the compilation of performance metrics reporting related to TOC activities, and develop TOC budget for regional TOC activities."
    },
    {
      "duty": "Engage in management level interaction and coordination with public safety, law enforcement, transportation and emergency management representatives to ensure incident and emergency goals are achieved."
    },
    {
      "duty": "Manage contracts through which services of TOC and Safety Service Patrol (SSP) personnel are obtained, review and approve invoices, and resolve discrepancies."
    },
    {
      "duty": "Assist and serve as back-up for the TOC Incident Management Coordinator (IMC) in administering the Safety Service Patrol, Incident Management program during emergencies and special events for the region."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Transportation Management, Engineering, Public Works, Emergency Management or related field (Master's preferred)"
    }
  ]
}