{
  "meta": [
    {
      "job_title": "Diesel Technician",
      "job_category": "Field Service",
      "job_class": "Technician",
      "sector": "Engineering",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Skills",
      "experience": 5
    },
    {
      "skill": "Trade Specific Tooling",
      "experience": 5
    },
    {
      "skill": "Maintenance",
      "experience": 5
    },
    {
      "skill": "Computer Skills",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Excellent Communication",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform in-field machinery diagnostics and repairs as required."
    },
    {
      "duty": "Serve as an in-field representative for the dealership to provide service solutions and enhance customer satisfaction."
    },
    {
      "duty": "Diagnose, inspect, recondition, repair, assemble, and service equipment as assigned by the supervisor."
    },
    {
      "duty": "Document machine information and repairs completed on work order, including parts and fluids used."
    },
    {
      "duty": "Maintain a clean work area, as well as care for all shop tools, machines, and equipment."
    },
    {
      "duty": "Identify and communicate solutions for customer service opportunities in the dealership’s area of responsibility."
    },
    {
      "duty": "Maintain technical and product knowledge on all equipment sold within the dealership's area of responsibility."
    },
    {
      "duty": "Follow all safety rules and regulations while performing work assignments and adhere to all policies and procedures as specified in company manuals and as directed in the employee handbook."
    },
    {
      "duty": "Conduct self in the presence of customers and community so as to present a professional image of the company."
    },
    {
      "duty": "Proactively seek and participate in available company-sponsored training, in an effort to develop and advance knowledge base and skill set."
    },
    {
      "duty": "Maintain a positive and professional working relationship with peers, management, and support resources, with a constant commitment to teamwork and exemplary customer service."
    },
    {
      "duty": "Perform all other duties as assigned by management in a professional and efficient manner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Graduation from related diesel technology program (preferred)"
    },
    {
      "credential": "Current and valid driver's license as outlined in company policy manual"
    }
  ]
}