{
  "meta": [
    {
      "job_title": "Registered Nurse Medical Surgical/Telemetry",
      "job_category": "Nursing",
      "job_class": "Registered Nurse",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Health Assessment",
      "experience": 5
    },
    {
      "skill": "Nursing Care Planning",
      "experience": 5
    },
    {
      "skill": "Patient Safety Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Clinical Expertise",
      "experience": 5
    },
    {
      "skill": "Care Plan Documentation",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Interdisciplinary Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collects patient health data, performs initial assessment, and records relevant data on the nursing component of the Interdisciplinary Admission Assessment."
    },
    {
      "duty": "Plans and implements the treatment plan, observes and evaluates the patient's progress, and documents pertinent observations."
    },
    {
      "duty": "Incorporates discharge planning into the admission process, analyzes assessment data to determine problem identification, and identifies expected outcomes individualized to the patient."
    },
    {
      "duty": "Recognizes hazards to patient safety, provides education to the patient and family, and communicates the plan of care to promote continuity of care."
    },
    {
      "duty": "Implements the plan of care for each patient, adapts nursing procedures to meet the needs of the individual patient, and evaluates the patient's progress toward attainment of outcomes."
    },
    {
      "duty": "Provides care that demonstrates ethical beliefs and respect for patient's rights, maintains knowledge and proficiency in the clinical area and age group served, and complies with staff meeting attendance requirement."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Professional knowledge of nursing theory and practice acquired through completion of a two-year training at an accredited School of Nursing, Current New York State license or Permit as a Registered Professional Nurse"
    }
  ]
}