{
  "meta": [
    {
      "job_title": "Senior Wild Animal Keeper",
      "job_category": "Wildlife Conservation",
      "job_class": "Keeper",
      "sector": "Wildlife Conservation",
      "salary": 45247,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Animal Management",
      "experience": 5
    },
    {
      "skill": "Zoo Operations",
      "experience": 5
    },
    {
      "skill": "Animal Care",
      "experience": 5
    },
    {
      "skill": "Animal Health",
      "experience": 5
    },
    {
      "skill": "Biology",
      "experience": 5
    },
    {
      "skill": "Data Reporting",
      "experience": 5
    },
    {
      "skill": "Public Interaction",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Animal Nutrition",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform safe, proper and humane care of assigned animals according to established protocols or under the direction of the appropriate senior wild animal keeper and /or the supervisory/curatorial staff."
    },
    {
      "duty": "Prepare animal diets according to established protocols or under the direction of the appropriate senior wild animal keeper and/or the supervisory/curatorial staff."
    },
    {
      "duty": "Assist in developing safe, proper and humane protocols for the management and maintenance of the animal collection, exhibits, and holding facilities."
    },
    {
      "duty": "Inspect animal exhibits, holding facilities, and associated service areas to ensure they are clean, well lit, properly ventilated, and report any deficiencies or required maintenance."
    },
    {
      "duty": "Submit daily reports summarizing events/changes in the animal collection and staff activities, identifying required maintenance, and listing needed supplies and equipment."
    },
    {
      "duty": "Aid the general public and provide information concerning the zoo, visitor services, exhibits, and the animal collection."
    },
    {
      "duty": "Enforce the zoo's visitor rules and regulations."
    },
    {
      "duty": "Perform other related tasks and duties at the instruction of senior animal keepers and/or the supervisory/curatorial staff."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree with major in Biology or a related field with three years recent, full-time paid experience in handling, feeding, and care of animals in a zoo or on a stock farm with experience supervising animal care staff OR an equivalent combination of education or experience."
    }
  ]
}