{
  "meta": [
    {
      "job_title": "Actuarial Director",
      "job_category": "Actuarial",
      "job_class": "Director",
      "sector": "Financial Services",
      "salary": 125000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Actuarial Modeling",
      "experience": 8
    },
    {
      "skill": "Risk Management",
      "experience": 8
    },
    {
      "skill": "Valuation",
      "experience": 8
    },
    {
      "skill": "Insurance Product Design",
      "experience": 8
    },
    {
      "skill": "Actuarial Reporting",
      "experience": 8
    },
    {
      "skill": "Leadership",
      "experience": 8
    },
    {
      "skill": "Analytical Skills",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 8
    },
    {
      "skill": "Management",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and lead the design, pricing, and implementation of insurance products within the actuarial department."
    },
    {
      "duty": "Supervise a small team within actuarial modeling, risk management, valuation, or other actuarial department."
    },
    {
      "duty": "Provide reports and analyses on sales, persistency and mortality experience, reserve adequacy, risk management information, and actuarial aspects of product development."
    },
    {
      "duty": "Manage studies that underlie actuarial assumptions and provide assumptions and data to others."
    },
    {
      "duty": "Monitor and analyze developments in actuarial techniques, laws, regulations, and competitive developments in the marketplace."
    },
    {
      "duty": "Represent the company on industry and professional committees, with regulators, and possibly supervise a small team of employees."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Actuarial Science, Mathematics, Statistics, Economics or related field and 6 years of relevant experience. In lieu of Bachelor's, will accept Master's in a listed discipline and 4 years of relevant experience."
    },
    {
      "credential": "FSA or equivalent professional designation along with Bachelor's Degree and 6 years of relevant experience. In lieu of FSA will accept ASA or equivalent professional designation and 10 years of relevant experience."
    }
  ]
}