{
  "meta": [
    {
      "job_title": "Medical Assistant",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform assigned patient care and related administrative duties under the direct supervision of the physician(s)."
    },
    {
      "duty": "Perform a variety of office/clerical duties as assigned by the office manager."
    },
    {
      "duty": "Prepare patients for examination and treatment. Obtain and record patients' chief complaints, current medications, vital signs, pain screening and allergies."
    },
    {
      "duty": "Assist physician with examinations, tests, procedures, and office-based surgery. Apply splints, casts, dressings and remove sutures with competency. Report and assist during emergencies."
    },
    {
      "duty": "Prepare and administer medications and immunizations as ordered by the physician, including p.o., vaginal and rectal suppositories, intradermal injection and intramuscular injection, after demonstrating competency and passing medication administration test."
    },
    {
      "duty": "Receive and return clinically-related telephone calls after communicating with physician or registered nurse regarding medical concerns of the patient."
    },
    {
      "duty": "Teach patient and provide printed information, on physician request, about diagnosis, self-care within the scope of assigned duties, health promotion, disease prevention and community healthcare resources."
    },
    {
      "duty": "Document data and care in the patient medical record. Maintain as confidential."
    },
    {
      "duty": "Complete medical insurance and other related forms for physician review. Communicate as needed with the patient, referral source and payor between visits. Complete patient registration, scheduling and billing tasks, pre-authorization and other general office/clerical duties as assigned. Schedule tests and treatments, as ordered by the physician."
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of an accredited medical assistant program is preferred."
    },
    {
      "credential": "Job Related Certification From One Of The Following - CMA (AAMA); RMA (AMT); CCMA(NHA); NCMA (NCCT); RMA (ARMA); NRCMA (NAHP); or RMA (AAMP)"
    }
  ]
}