{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 2
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 3
    },
    {
      "skill": "Organization",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide excellent customer service and professionalism to all customers via in person, telephone, email, or via the web."
    },
    {
      "duty": "Communicate clearly and concisely with on-the-road employees to give instructions and assistance."
    },
    {
      "duty": "Answer incoming and make outgoing customer telephone calls."
    },
    {
      "duty": "Receive and resolve, within established guidelines, customer questions and concerns."
    },
    {
      "duty": "Monitor, resolve, document, and report all customer complaints, driver route sheets and call-in sheet and all customer problems relating to operations and coordinate with sales."
    },
    {
      "duty": "Track customer information and concerns and enter data into database."
    },
    {
      "duty": "Research and complete customer refunds and submit for approval before being submitted to Accounts Receivable for payment."
    },
    {
      "duty": "Maintain new account files."
    },
    {
      "duty": "Work with supervisors to ensure that all missed stops and special pick ups are completed daily."
    },
    {
      "duty": "Provide timely and accurate information regarding missed stops or other customer concerns."
    },
    {
      "duty": "Generate call-in work orders for drivers Download, distribute and answer all customer inquiries received via email."
    },
    {
      "duty": "Take web request and process payments by phone."
    },
    {
      "duty": "Process customer payments via internet and take cash payment’s as needed."
    },
    {
      "duty": "Enter new subscription residential accounts into system."
    },
    {
      "duty": "Run credit checks on new customers."
    },
    {
      "duty": "Complete verification form, service agreement and pricing matrix on all commercial accounts for changes, new and cancelled."
    },
    {
      "duty": "Key all new/cancelled accounts into Tower system and verify in system."
    },
    {
      "duty": "Scan all contracts into system and maintain records of them."
    },
    {
      "duty": "Assist in completing the Affirmative Action log for all applicants."
    },
    {
      "duty": "Maintain a positive attitude, and promote the GFL Environmental image by focusing on cooperation, employee partnership and positive telephone and email manners."
    },
    {
      "duty": "Ensure the customer service area is neat and orderly and ensure proper greeting of all visitors."
    },
    {
      "duty": "Conform in all respects with applicable federal, state/provincial and local laws, regulations, ordinances and other orders and to all company policies, procedures and directives from supervisors."
    },
    {
      "duty": "May provide back up assistance for Office Coordinator."
    },
    {
      "duty": "Perform other duties and responsibilities as required or requested by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED"
    }
  ]
}