{
  "meta": [
    {
      "job_title": "Wireless Architect",
      "job_category": "Engineering",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 145000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "802.11 Wireless Technologies",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Wireless Site Design",
      "experience": 5
    },
    {
      "skill": "Networking Technologies",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Technical Leadership",
      "experience": 5
    },
    {
      "skill": "802.11 Technology",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the design, evolution, and maintenance of the wireless network at a prestigious research university."
    },
    {
      "duty": "Engage and manage vendors, possess expert knowledge in wireless subject matter and design, provide leadership and mentorship to team members."
    },
    {
      "duty": "Coordinate with University Construction Coordinators on multimillion-dollar building projects, provide guidance and plans for wireless life cycle and improvement."
    },
    {
      "duty": "Engage with customers to find solutions for their demands, aid in the maintenance, support, and design of the entire university network."
    },
    {
      "duty": "Possess a comprehensive understanding of networking technologies and the ability to provide guidance on how changes to network topology and equipment can affect the wireless design."
    },
    {
      "duty": "Have a deep understanding of 802.11 technology and the highest level of experience in designing interior wireless in a variety of spaces."
    },
    {
      "duty": "Effectively mentor and task personnel to accomplish wireless projects across the university, engage with other higher education institutions as a technical leader through participation in leadership activities within EDUCAUSE."
    },
    {
      "duty": "Work closely with the ITS Infrastructure & Operations (I&O) unit to support and maintain the infrastructure for network, data communications transport services, and campus desktop computers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Masters’ and 2-4 years’ experience; or Bachelors and 3-5 years’ experience; or a combination of related education and experience in substitution."
    }
  ]
}