{
  "meta": [
    {
      "job_title": "Entry Level Structural Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Structural Engineering",
      "experience": 2
    },
    {
      "skill": "CAD & Revit",
      "experience": 2
    },
    {
      "skill": "Engineering Analysis",
      "experience": 2
    },
    {
      "skill": "Technical Drawing",
      "experience": 2
    },
    {
      "skill": "Team Coordination",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support in the design of buildings."
    },
    {
      "duty": "Determine cause of structural failures, damages, and defects through site investigations."
    },
    {
      "duty": "Develop specifications for use during construction and ensures all projects comply with applicable codes and regulations."
    },
    {
      "duty": "Engineering support in the form of standalone analysis modeling and documentation tasks within a larger project on project teams under direction of Senior/Project Engineer or Department Head Engineer."
    },
    {
      "duty": "Active and direct role in document production."
    },
    {
      "duty": "Interface and coordinate with other disciplines."
    },
    {
      "duty": "Mentor team members junior to them."
    },
    {
      "duty": "Develop knowledge of project types through active engagement with project teams and leadership."
    },
    {
      "duty": "Travel as project requirements dictate for surveys and field/site visits during construction."
    },
    {
      "duty": "Foundational interpersonal skills and coordination efforts."
    },
    {
      "duty": "Foundational analytical and engineering skills under mentorship of project engineers."
    },
    {
      "duty": "Ability to take direction within a larger team."
    },
    {
      "duty": "Develops design or technical solutions under supervision of the Project Engineer and/or Department Heads."
    },
    {
      "duty": "Active role in drawing production, including but not limited to picking up redlines, quality assessment of individual work, coordination with other disciplines and coordination reviews and participation in team coordination meetings from SD through CA phases."
    },
    {
      "duty": "Thorough understanding of discipline's drawing and graphic standards, adherence to standards for quality and consistency in product."
    },
    {
      "duty": "Strong interpersonal skills, specifically communication, dependability, responsibility, and teamwork."
    },
    {
      "duty": "Coordination skills, specifically communication, organization, time management, and adaptability."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS, BEng, or BAE degree in engineering relevant field of practice or equivalent as determined by the firm. Post Graduate degree preferred. 0-4 years' experience"
    }
  ]
}