{
  "meta": [
    {
      "job_title": "Guest Services Assistant",
      "job_category": "Customer Service",
      "job_class": "Assistant",
      "sector": "Hospitality",
      "salary": 17.79,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "The Guest Services Assistant (GSA), Information desk, Greeter and Health Screener is the front door Ambassador to all patients, families, visitors, physicians, affiliates, students, clergy and employees. The GSA position ensures each customer receives exceptional assistance as related to: information, health screening, visitor management, directions, wayfinding, concierge services, transportation, and guest lodging."
    },
    {
      "duty": "This position may have a primary focus to either the Guest Services Desk or the Information/Greeter/Health Screening desk but expected to provide support to either area to maintain operational needs."
    },
    {
      "duty": "The GSA coordinates scheduling of all contracted interpreters, is responsible for cash reconciliation and cash handling, external transportation billing and cash posting, and maintains Lost & Found items."
    },
    {
      "duty": "The Information/Greeter/ Health Screener desk will initiate positive customer service relations by demonstrating a welcoming personality for patients, family, visitors, and team members. Conducts wellness screening according to organizational and CDC guidelines to ensure our patients, families, visitors, and team members entering our facilities meet the established criteria. Aids in keeping a safe environment in the hospital areas where screening stations are located. Supports the management of patients and visitors entering into the lobby for hospital and hospital-based clinics."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "MS Office Suite",
      "experience": 2
    },
    {
      "skill": "Cash Handling",
      "experience": 2
    },
    {
      "skill": "Hospitality Services",
      "experience": 0
    },
    {
      "skill": "Wellness Screening",
      "experience": 0
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 2
    },
    {
      "skill": "Confidentiality",
      "experience": 2
    },
    {
      "skill": "Organizational Skills",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 80,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED"
    }
  ]
}