{
  "meta": [
    {
      "job_title": "Actuarial Director",
      "job_category": "Actuarial",
      "job_class": "Director",
      "sector": "Insurance",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Actuarial Modeling",
      "experience": 6
    },
    {
      "skill": "Risk Management",
      "experience": 6
    },
    {
      "skill": "Valuation",
      "experience": 6
    },
    {
      "skill": "Insurance Product Design",
      "experience": 6
    },
    {
      "skill": "Financial Data Analysis",
      "experience": 6
    },
    {
      "skill": "Leadership",
      "experience": 6
    },
    {
      "skill": "Communication",
      "experience": 6
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct and provide leadership in the design, pricing, and implementation of insurance products."
    },
    {
      "duty": "Oversee a small team within actuarial modeling, risk management, valuation or other actuarial department."
    },
    {
      "duty": "Provide reports and analyses to management on sales, persistency and mortality or morbidity experience for various product lines, reserve adequacy, risk management information, or various other similar items."
    },
    {
      "duty": "Manage studies that underlie actuarial assumptions and provides assumptions and data to others."
    },
    {
      "duty": "Support creation of systems specifications, contracts, commission structures, and other actuarial aspects of product development."
    },
    {
      "duty": "Monitor and analyze developments in actuarial techniques, laws and regulations applicable to company operations, and competitive developments in the marketplace."
    },
    {
      "duty": "Represent the company on industry and professional committees and/or with regulators."
    },
    {
      "duty": "Supervise a small team of employees."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Fellow of Society of Actuaries (FSA) or equivalent professional designation along with Bachelor's Degree in Actuarial Science, Mathematics, Statistics, Economics or related field and 6 years of relevant experience. In lieu of Bachelor's, will accept Master's in a listed discipline and 4 years of relevant experience. In lieu of FSA will accept Associate of Society of Actuaries (ASA) or equivalent professional designation and 10 years of relevant experience."
    }
  ]
}