{
  "meta": [
    {
      "job_title": "Technical Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 135000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Budget Management",
      "experience": 7
    },
    {
      "skill": "Microsoft Project",
      "experience": 7
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "CAD Software",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Form and lead project teams, develop technical project plans, and manage project budgets."
    },
    {
      "duty": "Report project status to Leadership Team, communicate, document, and manage project activities according to good project management practices."
    },
    {
      "duty": "Provide technical project management support for new product introductions, site to site technology transfers, and continuous improvement projects."
    },
    {
      "duty": "Deliver the portfolio of new products to the business by leading the co-development and launch teams."
    },
    {
      "duty": "Provide project leadership for technology transfers between manufacturing sites."
    },
    {
      "duty": "Coordinate the site team to develop project plans in support of the business strategy and prioritize projects appropriately within the platform."
    },
    {
      "duty": "Plan and budget project resources required to execute projects and maintain project management best practices globally."
    },
    {
      "duty": "Train and support others in project management tools and best practices and report out frequently on the progress of projects to senior management."
    },
    {
      "duty": "Work with other team leaders on sharing of technical knowledge across the businesses supported by the team."
    },
    {
      "duty": "Responsible for working with Regulatory groups to develop and execute strategies for filing, defending, and launching new products."
    },
    {
      "duty": "Serve as a technical liaison to both internal and external sites as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "PMP certification required. Bachelor's degree in a related field (Master's preferred)."
    },
    {
      "credential": "Proficient with Microsoft Project software and CAD software. Injection molding knowledge is a plus. Working knowledge of key regulatory authorities (USDA, EMA, VMD, and FDA)."
    }
  ]
}