{
  "meta": [
    {
      "job_title": "Supervisory Operations Coordinator",
      "job_category": "Operations",
      "job_class": "Coordinator",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support Federal agencies occupying Federally owned and/or leased buildings by providing leadership, oversight, expert advice, and coordination of the operations and maintenance services provided by the Service Centers."
    },
    {
      "duty": "Oversee, coordinate and integrates the work of a cross-functional staff performing a variety of work related to the operation, maintenance, renovation and repair of government buildings as well as administration, and fiscal management of leased properties."
    },
    {
      "duty": "Conduct complex building operations studies and monitor complex and high visibility projects in the Division business line involving building operations functions requiring the combined efforts of two or more of the branches."
    },
    {
      "duty": "Serve as Division representative and coordinator with Portfolio Management and building managers for the development of asset building plans for government owned and leased buildings and other asset related issues."
    },
    {
      "duty": "Assist building managers and the Deputy Director with complex politically sensitive projects and monitor operating costs for government owned and leased buildings."
    },
    {
      "duty": "Serve as a representative to national and local industry groups related to building operations and maintenance activities."
    },
    {
      "duty": "Act as a liaison between agency headquarters, other agency components, and non-Federal parties to coordinate various activities, identify problems, and develop solutions related to the region's building operations policy and associated program areas."
    },
    {
      "duty": "Review and/or prepare highly technical reports and/or papers on important and extremely complex matters and serve as the division coordinator for customer surveys and analyses."
    },
    {
      "duty": "Serve as an advisor to other Federal client agencies who have building operations programs that are both local and national in scope. Responsible for supervising, providing managerial direction, providing administrative direction and guidance to approximately 20 employees."
    },
    {
      "duty": "Develop a human resources strategy and executes the full range of human resource and administrative management activities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Management, Engineering, or related field (Master's preferred)"
    }
  ]
}