{
  "meta": [
    {
      "job_title": "Steamfitter Helper",
      "job_category": "Skilled Trade",
      "job_class": "Maintenance",
      "sector": "Construction",
      "salary": 32.4,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Boiler Installation and Repair",
      "experience": 2
    },
    {
      "skill": "Piping System Maintenance",
      "experience": 2
    },
    {
      "skill": "Equipment Operation",
      "experience": 2
    },
    {
      "skill": "Hazardous Materials Handling",
      "experience": 2
    },
    {
      "skill": "Mechanical Aptitude",
      "experience": 3
    },
    {
      "skill": "Welding",
      "experience": 3
    },
    {
      "skill": "Pipefitting",
      "experience": 3
    },
    {
      "skill": "Carpentry",
      "experience": 3
    },
    {
      "skill": "Masonry",
      "experience": 3
    },
    {
      "skill": "Blueprint Reading",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist steamfitter mechanic in the installation and repair of boilers, boiler trim, pressure vessels, heat exchangers, piping systems, and related equipment."
    },
    {
      "duty": "Assist with the fabrication, installation, and maintenance of piping systems and boiler maintenance, refractory work, building and grounds maintenance, carpentry, masonry, sandblasting, rigging, cutting, welding, and fitting pipe."
    },
    {
      "duty": "Operate various equipment such as cranes, skid steers, forklifts, vacuum trucks, loaders, and backhoes."
    },
    {
      "duty": "Perform tasks related to the use and handling of hazardous materials and keeping the work area clean."
    },
    {
      "duty": "Responsible for the proper care and maintenance of tools and economical use of supplies."
    },
    {
      "duty": "Support power plant outages and callouts to repair equipment needed to keep the power plants running, which may require working night shifts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent. Completion of an industrial education program (trade school), completed a craft apprenticeship program, or equivalent training with a desire to be in an applicable field such as welding or mechanical. Certification in stainless steel and/or carbon steel welding. Class A or B CDL."
    }
  ]
}