{
  "meta": [
    {
      "job_title": "Journeyman Chiller Mechanic TTL",
      "job_category": "Mechanical",
      "job_class": "Journeyman",
      "sector": "Commercial, Industrial, Institutional",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Refrigeration Maintenance",
      "experience": 5
    },
    {
      "skill": "Trouble Shooting",
      "experience": 5
    },
    {
      "skill": "HVAC Systems",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Technical Support",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performing maintenance, trouble shooting, and installation of chiller equipment for commercial, industrial, and institutional markets."
    },
    {
      "duty": "Coaching and mentoring branch technicians to ensure customer satisfaction and operational compliance."
    },
    {
      "duty": "Executing contract maintenance visits, inspections, and site assessments for customer equipment."
    },
    {
      "duty": "Establishing and maintaining positive relationships with customers, vendors, and co-workers through effective oral and written communication."
    },
    {
      "duty": "Providing quote estimates for labor and material repairs, and coaching and mentoring other HVAC Mechanics in quoting."
    },
    {
      "duty": "Serving as the direct customer contact for servicing products and equipment, ensuring customer satisfaction by identifying, analyzing, diagnosing, and repairing equipment and systems at customer locations."
    },
    {
      "duty": "Enforcing safety standards and maintaining security and accountability of company issued and procured assets."
    },
    {
      "duty": "Working as part of a team dedicated to delivering the highest standard of service to all customers, including flexibility to work overtime and weekends as required."
    },
    {
      "duty": "Participating in on-call rotation since the company operates 24/7."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Universal Refrigeration and Air Conditioning Systems CFC Certification."
    },
    {
      "credential": "Experience/factory training on various Water and Air cooled Chillers with emphasis on York, Carrier, Trane, and Daikin."
    },
    {
      "credential": "Operating knowledge of Microsoft office software and working proficiency with hand-held computer (i.e., Smartphone, iPad)"
    },
    {
      "credential": "Valid driver's license."
    },
    {
      "credential": "Good verbal and written communication skills and ability to lead a team of 6-12 Mechanics."
    },
    {
      "credential": "Ability to be on call nights and weekends on a Four-to-six-week cycle rotating basis."
    },
    {
      "credential": "More than 5 years of commercial, industrial, and/or institutional experience with all types of HVAC systems, various compressor technologies, HVAC control systems, and speed drives as well as leadership experience in managing small technical teams."
    },
    {
      "credential": "Bargaining Unit Position."
    },
    {
      "credential": "Equal Opportunity Employer."
    },
    {
      "credential": "Equal employment opportunity and affirmative action employer."
    }
  ]
}