{
  "meta": [
    {
      "job_title": "Software Implementation Specialist",
      "job_category": "Software Engineering",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Software Development",
      "experience": 5
    },
    {
      "skill": "Process Optimization",
      "experience": 5
    },
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Technical Requirements Gathering",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Requirements Analysis",
      "experience": 5
    },
    {
      "skill": "Market and Platform Requirements",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Definition of working methods and their implementation in software applications to optimize the processes in development."
    },
    {
      "duty": "Preparation and moderation of workshops to define market and platform requirements for economy & business class seats – program management (customer requirements/claims/problems), platform engineering, testing, customer service – problems with the product and consider that into the requirements."
    },
    {
      "duty": "Gathering, definition and coordination of technical requirements for seats and seat components together with all relevant interfaces."
    },
    {
      "duty": "Gathering of internal lessons learned and their transfer into requirements – claims and complaints from customer service are taken and converted to requirements by the RE; RAU: lessons learned database."
    },
    {
      "duty": "Ensure that internal specifications produced include all relevant requirements from OEM, top level, customer and internal specifications; -- TMS/OEM spec/compliance matrix created as TMS – Bid management and sales engineering."
    },
    {
      "duty": "Create, review and update internal specifications and standards."
    },
    {
      "duty": "Analyze and support requirements change requests as part of change management – based on customer requests for changes to features on the seat or design."
    },
    {
      "duty": "Inform organization about new, changed, withdrawn specifications and requirements."
    },
    {
      "duty": "Management of compliance matrices."
    },
    {
      "duty": "Other duties as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Software Engineering, Computer Science, or a related field (Master's preferred)"
    }
  ]
}