{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Engineering",
      "salary": 100000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for coordination of all technical activities on assigned projects."
    },
    {
      "duty": "Plans, schedules, conducts, and coordinates assigned engineering work; monitors work for compliance to applicable FAA/EASA regulations, customer requirements, accepted engineering practices, as well as RECARO standards."
    },
    {
      "duty": "Ensures effective communication and coordination on assigned projects between all disciplines and all other project participants."
    },
    {
      "duty": "Coordinates all aspects of the design and certification of aircraft seats. This includes the coordination of designers, design engineers, electrical engineers, certification engineers and product support personnel."
    },
    {
      "duty": "Summarizes technical customer requirements, communicates this to the team and ensures customer expectations are being met."
    },
    {
      "duty": "Supports Purchasing and Production by providing bills of materials and documentation to support sourcing of components."
    },
    {
      "duty": "Experience in the use of CFR, EASA CS, (E)TSO regulations, as well as the use of parts lists with high variant diversity is desired."
    },
    {
      "duty": "Knowledge of PLM based database systems such as Teamcenter, Agile or Enovia is desired."
    },
    {
      "duty": "Completes root cause analysis on MRB (Material Review Board) actions, and presents resolutions to the Engineering, Quality and Operations Departments."
    },
    {
      "duty": "Interfaces with outside suppliers during the design process."
    },
    {
      "duty": "Effectively participates and contributes in telecoms and meetings with the overseas based engineers and program management by applying engineering knowledge, discussing manufacturing issues, and suggesting potential seat development topics and innovations."
    },
    {
      "duty": "Verifies use of appropriate materials according to their usage on the seat using advanced knowledge."
    },
    {
      "duty": "Monitor capacity planning and tracking for all engineering tasks on assigned projects."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Technical Coordination",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Aerospace Design",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Product Lifecycle Management",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering or a related field (Master's preferred)"
    }
  ]
}