{
  "meta": [
    {
      "job_title": "Biologist",
      "job_category": "Science",
      "job_class": "Staff",
      "sector": "Environmental",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Biological Survey",
      "experience": 1
    },
    {
      "skill": "Field Data Collection",
      "experience": 1
    },
    {
      "skill": "Environmental Sampling",
      "experience": 1
    },
    {
      "skill": "Quality Control",
      "experience": 1
    },
    {
      "skill": "Documentation",
      "experience": 1
    },
    {
      "skill": "Safety Guidelines",
      "experience": 1
    },
    {
      "skill": "GIS Mapping",
      "experience": 1
    },
    {
      "skill": "Business Writing",
      "experience": 1
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct biological natural resource field surveys collecting observational and spatial data concerning a variety of vegetation, wetland, wildlife, marine, terrestrials, botanical, and/or avian species."
    },
    {
      "duty": "Collect and compile biological/environmental data from samples of air, soil, water, sludge, and other matrices for analysis."
    },
    {
      "duty": "Maintain quality control standards and procedures for accurate and precise measurement and documentation."
    },
    {
      "duty": "Assist with performing basic professional biology work relating to ecological systems, air, and water resources, assisting with verifying the characteristics of a site and providing entry-level technical assistance on various environmental issues."
    },
    {
      "duty": "Generate complete, accurate, and concise documentation using electronic systems and field/work site notebook."
    },
    {
      "duty": "Comply with safety guidelines and site-specific procedures which include but are not limited to, the maintenance of sample collection, location data, laboratory or statistical documentation, and logbooks."
    },
    {
      "duty": "Utilize the latest technologies and techniques in performing studies and analysis of habitats."
    },
    {
      "duty": "Complete training on assigned tasks."
    },
    {
      "duty": "Exercise responsible and ethical decision-making regarding company funds, resources and conduct, and adhere to WSP’s Code of Conduct and related policies and procedures."
    },
    {
      "duty": "Perform additional responsibilities as required by business needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Biology, Ecology, Environmental Science, Natural Resource Management, or a related life sciences field. A member of and/or actively participate in local professional practice organizations."
    }
  ]
}