{
  "meta": [
    {
      "job_title": "Industrial Electrician",
      "job_category": "Skilled Trades",
      "job_class": "Electrician",
      "sector": "Manufacturing",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Industrial Electrical Maintenance",
      "experience": 5
    },
    {
      "skill": "PLC Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Electrical Equipment Repair",
      "experience": 5
    },
    {
      "skill": "Electrical Testing",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Troubleshooting Skills",
      "experience": 5
    },
    {
      "skill": "Construction Knowledge",
      "experience": 5
    },
    {
      "skill": "Lumber Manufacturing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the safe maintenance, repair, installation, and modification of all sawmill-related equipment to maximize uptime, quality and production."
    },
    {
      "duty": "Act as lead person on projects, installations, or other assignments, and follow all safety guidelines, policies, and procedures."
    },
    {
      "duty": "Troubleshoot, repair, and install electrical equipment to help meet production goals, including three (3) phase electrical systems and PLC systems."
    },
    {
      "duty": "Diagnose the cause of electrical or mechanical malfunction or failure of operational equipment and perform preventive and corrective maintenance."
    },
    {
      "duty": "Set up and perform calibrations on equipment, troubleshoot low voltage systems, and assemble and test experimental motor control devices, switch panels, transformers, generator windings, solenoids, and other electrical equipment and components."
    },
    {
      "duty": "Plan, direct, and record periodic electrical testing, and recommend or initiate modification or replacement of equipment failing to meet acceptable operating standards."
    },
    {
      "duty": "Required to have a strong background in heavy industry and construction, with knowledge of the lumber manufacturing process as an asset."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "3-5 years of Industrial Electrician or Maintenance Technician experience with a strong background in PLCs. Industrial Electrical or Maintenance Technician diploma/degree considered an asset."
    },
    {
      "credential": "Strong analytical and troubleshooting skills, strong interpersonal and communication skills, ability to work in a safe and efficient manner, and the ability to work independently and in a team environment."
    },
    {
      "credential": "Solid background in heavy industry and construction, with knowledge of the lumber manufacturing process considered an asset."
    }
  ]
}