{
  "meta": [
    {
      "job_title": "Spanish-speaking Attorney",
      "job_category": "Legal",
      "job_class": "Attorney",
      "sector": "Legal",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Legal Research",
      "experience": 5
    },
    {
      "skill": "Immigration Law",
      "experience": 5
    },
    {
      "skill": "Legal Writing",
      "experience": 5
    },
    {
      "skill": "Client Interviewing",
      "experience": 5
    },
    {
      "skill": "Multicultural Sensitivity",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Strong Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide legal services, legal orientation, and direct representation before USCIS and EOIR with a focus on immigration matters in detained settings."
    },
    {
      "duty": "Ensure contract compliance, including submitting monthly reports and accurate data entry."
    },
    {
      "duty": "Work closely with stakeholders such as DHS, ORR, EOIR, and detention center staff to maintain positive working relationships and meet clients' needs."
    },
    {
      "duty": "Participate in trainings, calls, and meetings to stay up-to-date with legal and programmatic developments."
    },
    {
      "duty": "Manage a heavy caseload with complex immigration issues and coordinate client services with case managers, supervising attorney, and legal interns."
    },
    {
      "duty": "Organize and maintain client files and data for reporting purposes, and participate in regular peer and supervisor review meetings and legal trainings."
    },
    {
      "duty": "Collaborate with other agencies, stakeholders, and service providers to procure client services and network with like-minded organizations."
    },
    {
      "duty": "Provide mentorship and trainings to recruit and train pro bono attorneys, and perform all other duties as needed and/or as directed by supervisor."
    },
    {
      "duty": "Report suspicious and inappropriate behaviors and policy violations, and follow mandated abuse and incident reporting requirements."
    },
    {
      "duty": "Meet timelines and deadlines related to supporting systems and employee compliance, including but not limited to Kronos Workforce Ready for review and approval of time sheets."
    },
    {
      "duty": "Provide holistic, person-centered representation to unaccompanied children, asylum seekers, and/or detained adults, including timely assistance in the preparation of relief applications."
    },
    {
      "duty": "Maintain an active caseload of approximately 40 clients per year and meet monthly case goals for intake and filing of applications as set by direct supervisor."
    },
    {
      "duty": "Willingness to commute to detention facilities and shelters (45 minutes to 1.5 hours away) and obtain federal government clearance for the position."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 150,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Current bar membership in good standing, Texas licensure preferred. Fluent in Spanish and English; additional language proficiencies."
    }
  ]
}