{
  "meta": [
    {
      "job_title": "Design Engineer II",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Completes more advanced activities of design engineering, including designing aircraft seats and components in compliance with FAA regulations, and customer and OEM requirements."
    },
    {
      "duty": "Utilizing knowledge of CAD 2D/3D systems (CATIA v5), design aircraft seats and components that meet customer expectations and are in conformance to applicable regulations."
    },
    {
      "duty": "Generate 2D drawings based on created 3D models, using standard aerospace drafting practices"
    },
    {
      "duty": "Responds to concerns of customers by making design changes in seat design and components in a manner that meets customer expectations and are in conformance with applicable regulations."
    },
    {
      "duty": "Participates in design meetings with project engineers to discuss engineering issues, including design changes and requests from customers."
    },
    {
      "duty": "Supports Purchasing and Production by providing the necessary documentation to support sourcing of parts."
    },
    {
      "duty": "Interfaces with outside suppliers in the design process."
    },
    {
      "duty": "Effectively participates and contributes in telecoms with overseas engineers and program management by applying manufacturing engineering knowledge, discussing manufacturing issues, and also suggesting potential seat development topics and innovations."
    },
    {
      "duty": "Assists in creating bills of material for aircraft seat components and assemblies."
    },
    {
      "duty": "Verifies use of appropriate materials according to their usage on the seat (Primary Load Path/Secondary Load Path)"
    },
    {
      "duty": "Assists in creating design change notification documents."
    },
    {
      "duty": "Creates presentations outlining design direction and/or design issues"
    },
    {
      "duty": "Familiar in the use of CFR, EASA CS, (E)TSO regulations, as well as the use of parts lists with high variant diversity is a plus."
    },
    {
      "duty": "Must have advanced knowledge and understanding of engineering concepts and aircraft seat manufacturing processes, in order to assure that the appropriate manufacturing procedures are utilized to meet the requirements of individualized client specifications."
    },
    {
      "duty": "Knowledge of PLM based database systems such as Teamcenter, Agile or Enovia is required."
    }
  ],
  "education_certification": [
    {
      "credential": "Advanced degree in Engineering or related field (Master's preferred)"
    }
  ],
  "skills": [
    {
      "skill": "CAD 2D/3D systems (CATIA v5)",
      "experience": 5
    },
    {
      "skill": "Aerospace Design",
      "experience": 5
    },
    {
      "skill": "Engineering Knowledge",
      "experience": 5
    },
    {
      "skill": "Customer Interaction",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    }
  ]
}