{
  "meta": [
    {
      "job_title": "Program Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 83000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 3
    },
    {
      "skill": "Client Engagement",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Risk Management",
      "experience": 4
    },
    {
      "skill": "Supply Chain Management",
      "experience": 4
    },
    {
      "skill": "Client Communication",
      "experience": 4
    },
    {
      "skill": "Cost Reduction",
      "experience": 4
    },
    {
      "skill": "Product Lifecycle Management",
      "experience": 4
    },
    {
      "skill": "Business Development",
      "experience": 4
    },
    {
      "skill": "Design for Excellence",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Follow a rigorous and detailed process to ensure the team is aware of client agreements, risk mitigation plans, sales orders, schedules, budgets, production and stocking requirements, supply chain considerations, and that product specifications are understood and executed."
    },
    {
      "duty": "Manage schedule and monitor financial performance for on-time on-budget completion of projects. Ensure task owners understand their tasks, have adequate resources to accomplish the task, and complete the task on time."
    },
    {
      "duty": "Assess the risk of potential obstacles by reviewing process, program and product bottlenecks, and develop action plans to mitigate risk for each program. Partner with the client to resolve unexpected issues efficiently to maintain client product flow and effectively to prevent future occurrence."
    },
    {
      "duty": "Act as an agent of de-escalation when unforeseen issues arise. Focus energy on getting facts that will be used to develop effective solutions. Communicate solutions to customers."
    },
    {
      "duty": "Guide programs through the product life cycle; Initiate and facilitate major program milestones (ie: Design reviews, New Product Introduction (NPI) kickoff, 1st article reviews, release to production); Manage and secure approval, funding and recovery of costs for changes. Recover excess or obsolete inventory; Manage client owned property and return when no longer needed; Initiate product obsolescence when appropriate."
    },
    {
      "duty": "Provide proactive and regular updates to client on open order status, project progress, open actions items, risks, warranty/service status, inventory liability, and recovery plans on a dependable cadence."
    },
    {
      "duty": "Lead and facilitate cost reduction efforts for the client's portfolio."
    },
    {
      "duty": "Schedule, prepare, and conduct periodic business reviews with assigned clients. For established clients, work closely with Business Development to identify new business opportunities."
    },
    {
      "duty": "Facilitate Design for Excellence early involvement of interested parties (client, supply chain, production) in design processes to ensure a smooth and trouble free transition into production."
    },
    {
      "duty": "Facilitate design transfer of products into volume production."
    },
    {
      "duty": "Working with other Program Managers, identify and lead improvement in client experience touch points and program management business processes (ie: Sales order entry, order acknowledgement, contract review, risk mitigation, business reviews, project management). Acts as champion of the brand promise; Implement the value proposition in standardized processes to ensure repeatable results from the client perspective, execute robust client communication on cadence, and assist colleagues who communicate with clients to embrace the brand and value proposition in their touch points."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 100,
      "introvert_extrovert": 130
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Program Management, Business, or a related field (Master's preferred)"
    }
  ]
}