{
  "meta": [
    {
      "job_title": "Systems Architect",
      "job_category": "Engineering",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Systems Architecture",
      "experience": 7
    },
    {
      "skill": "Pre-Sales",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 6
    },
    {
      "skill": "IT Solutions Development",
      "experience": 7
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 6
    },
    {
      "skill": "Technical Presentation",
      "experience": 6
    },
    {
      "skill": "Complex Account Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Partner with Account Managers in a pre-sales technical role, showcasing Cisco product solutions, setting up demonstrations, and explaining features and benefits to customers."
    },
    {
      "duty": "Design and configure products to meet specific customer needs, using a broad palette of Cisco technologies and applications across various vertical markets."
    },
    {
      "duty": "Provide technical and sales support for accounts in assigned territory, performing technical presentations for customers, partners, and prospects."
    },
    {
      "duty": "Assist with the development of formal sales plans and proposals for assigned opportunities, and keep up-to-date on relevant competitive solutions, products, and services."
    },
    {
      "duty": "Identify an area of specialization and maintain in-depth knowledge in at least one area of concentration, such as Data Center, Collaboration, Security, Route/Switch/Wireless, or Software Development."
    },
    {
      "duty": "Keep current with technological aptitude and adopt an interpersonal, presentation, and troubleshooting skills."
    },
    {
      "duty": "Direct account and partner responsibilities for selected accounts in the assigned territory."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "BS/BA (EE/CS) or equivalent. CCNA or CCNP preferred. Will require frequent travel throughout the continental United States."
    }
  ]
}