{
  "meta": [
    {
      "job_title": "Senior Project Manager",
      "job_category": "Project Management",
      "job_class": "Management",
      "sector": "Management",
      "salary": 190000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Consulting",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Quality Management",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Problem-Solving",
      "experience": 7
    },
    {
      "skill": "Organization",
      "experience": 7
    },
    {
      "skill": "Sales",
      "experience": 7
    },
    {
      "skill": "Strategic Proposal Development",
      "experience": 7
    },
    {
      "skill": "Client Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drives projects and business organizations toward achieving intended business results within a contracted time and budget."
    },
    {
      "duty": "Manages large, complex projects or a program of related projects across all phases of the project life cycle."
    },
    {
      "duty": "Participates in project reviews, validating estimates, schedules, and associated work products."
    },
    {
      "duty": "Oversees assigned personnel for project. Assigns work and provides direction with regard to timeliness and completion of project objectives. Addresses performance issues within prescribed guidelines."
    },
    {
      "duty": "Encourages and assists others in using Catalyst phases, activities, and tasks as a basis for developing estimates and team plans."
    },
    {
      "duty": "Reviews case for action, principles, constraints, and assumptions for completeness and obtains buy-in from executive sponsors for the mission, vision and strategy and case for action."
    },
    {
      "duty": "Understands components of the integration test cycle and participates in the development of the test strategy."
    },
    {
      "duty": "Manages client expectations and balances the needs of the company and clients to ensure satisfaction for both."
    },
    {
      "duty": "Influences decisions and project direction at the executive level."
    },
    {
      "duty": "Identifies sales leads through established networks."
    },
    {
      "duty": "Develops compelling proposal strategies and win themes; participates in sales calls."
    },
    {
      "duty": "Provides leadership and work guidance to less experienced personnel."
    },
    {
      "duty": "Presents to large-size groups of key decision-makers at the executive level; develops and communicates vision and purpose, encourages contribution and support from others. Contributes to proposal orals and division and company-wide events."
    },
    {
      "duty": "Analyzes market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manages the company's online presence, optimizing the website and social media channels for maximum engagement and conversions."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measures and reports on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in related field (Master's preferred)"
    }
  ]
}