{
  "meta": [
    {
      "job_title": "Design Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Initiate and manage the permit process with various jurisdictions with emphasis on obtaining permits quickly and building a communal and cooperative relationship with permitting authorities."
    },
    {
      "duty": "Redline third party design consultant drawings with an emphasis on quality, completeness and clarity in order to achieve the intended results that allow projects to be constructed as economically and efficiently as possible."
    },
    {
      "duty": "Ensure construction documents are created in an accelerated manner and in compliance with project and owner requirements."
    },
    {
      "duty": "Ensure any errors and/or discrepancies are resolved during the design process and produce clear documents that can be constructed without questions and/or change orders for the scope of work intended by the design documents."
    },
    {
      "duty": "Assist the estimating team with preliminary designs in order to obtain early pricing and pursue hard bid and cost-plus design/build projects."
    },
    {
      "duty": "Consistently inform the client and internal project team of the design, permitting, etc. status and communicate any actions needed by others."
    },
    {
      "duty": "Develop designs to utilize materials that are currently available and efficiently procure materials that are long lead to arrive within the time constraints of the project."
    },
    {
      "duty": "Identify and mitigate risks for both the company and the client in terms of safety, regulatory compliance, constructability, schedule, and cost."
    },
    {
      "duty": "Actively participate in the preconstruction and estimating processes to ensure the company estimating team accounts for the requirements and nuances of each project."
    },
    {
      "duty": "Serve as company’s liaison to the client during the design and permitting processes to ensure we deliver intended results with minimal effort from the client while showing an extreme dedication to customer service and integrity."
    },
    {
      "duty": "Assist in developing project schedules, scope, and budgets and verify compliance is maintained through the entirety of the design process."
    },
    {
      "duty": "Ensure requirements of additional project stakeholders (owners, IT/security, equipment contractors, etc.) are obtained and clearly incorporated into design documents."
    },
    {
      "duty": "Develop due-diligence reports early in the project lifecycle to determine project feasibility, challenges, and projected schedules and costs."
    },
    {
      "duty": "Assist and serve as a resource during any phase of the design/construction process as required."
    },
    {
      "duty": "Adapt the project design to meet the owners’ intended results while working with existing building site conditions to reduce the required scope of work."
    },
    {
      "duty": "Establish and maintain positive, productive and professional relationships with clients, consultants, subcontractors, and all other project stakeholders."
    },
    {
      "duty": "Research, prequalify, procure, and manage professional services such as geotechnical engineers, design/build subcontractors, architects, and consulting engineers."
    },
    {
      "duty": "Schedule preliminary meetings with permitting authorities to verify concerns and/or additional required scopes of work are included in design documents as well as determine an early understanding of the project scope of work in order to confirm a precise projected scope of work, comprehensive design, and efficient permitting and construction."
    },
    {
      "duty": "Obtain existing conditions-surveys, as built, and/or construction documents from proper personnel, and field measure and document existing conditions thoroughly if not available."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's Degree in Construction Management, Engineering or Architecture Required"
    }
  ]
}