{
  "meta": [
    {
      "job_title": "Anti-Fraud Product Manager",
      "job_category": "Product Management",
      "job_class": "Manager",
      "sector": "Technology",
      "salary": 200000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "People Management",
      "experience": 4
    },
    {
      "skill": "Antifraud",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Ecommerce",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "Python",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Law Enforcement",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Own and drive the Fraud & Loss operations team strategy and OKR."
    },
    {
      "duty": "Lead, build, and retain a team of high-performing specialists in a fast-paced environment."
    },
    {
      "duty": "Direct day-to-day operations of the fraud detection and mitigation areas."
    },
    {
      "duty": "Identify vulnerabilities in current systems, policies, and products and take actions to mitigate emerging frauds."
    },
    {
      "duty": "Drive continuous improvement in antifraud processes to improve efficiency and achieve early detection of fraud."
    },
    {
      "duty": "Develop up-to-date subject matter expertise in fraud detection and prevention within your team."
    },
    {
      "duty": "Engage with various business, product, technology, and security/risk stakeholders to solve risk problems at scale."
    },
    {
      "duty": "Regularly produce high-quality fraud reports to summarize new trends and business impacts and present them to senior management teams."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "At least 4 years of experience in a people management role."
    },
    {
      "credential": "At least 5+ years of related experience in one of the following areas: Antifraud, Risk Management, Trust & Safety, ecommerce or Tech industry in general; Ecommerce experience is a plus."
    },
    {
      "credential": "Detail-oriented, highly analytical, and strong project management skills."
    },
    {
      "credential": "Strong ability to gather information from various online sources and community groups."
    },
    {
      "credential": "Capability to draw actionable insights from datasets; knowledge of SQL, Python, or equivalent is a plus."
    },
    {
      "credential": "Strong interpersonal skills with the ability to build relationships and effectively liaise with people at all levels."
    },
    {
      "credential": "Prior law enforcement and/or prosecution experience a plus."
    }
  ]
}