{
  "meta": [
    {
      "job_title": "Director of Quality Assurance",
      "job_category": "Quality Assurance",
      "job_class": "Director",
      "sector": "Pharmaceuticals",
      "salary": 150000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, develop, execute, and administer/maintain a GxP Quality Management System meeting applicable compliance requirements and Regulatory Agencies with respect to Good Laboratory Practices (GLP) and Good Manufacturing Practices (GMP)."
    },
    {
      "duty": "Maintain the Quality Assurance audit database, manage the CAPA/deviation documentation and tracking system, audit/review internal and external documents, maintain the company’s training records, and provide overall Quality oversight to the manufacturing process."
    },
    {
      "duty": "Assist business functional areas in developing and implementing processes, procedures, and systems to perform critical activities in an efficient and effective manner to ensure compliance with applicable regulations and company standards."
    },
    {
      "duty": "Develop, execute, and maintain the document control system to ensure appropriate level of Quality oversight to GxP documentation."
    },
    {
      "duty": "Conduct and/or manage internal and external audits to ensure compliance to all relevant policies and procedures as required. This includes the issuance of audit reports and facilitation of timely closure of corrective actions by the respective departments."
    },
    {
      "duty": "Lead the participation, coordination, and responses to audits and inspections."
    },
    {
      "duty": "Administer, develop, and maintain the employee training program including assessments of its’ effectiveness, in collaboration with business functions."
    },
    {
      "duty": "Ensure compliance of manufacture and testing of product for clinical studies. Lead in resolution of quality non-compliance issues in production and testing at labs or at vendors. Identify areas of improvement."
    },
    {
      "duty": "Establish and maintain appropriate development phase GMP compliance for product manufacture, testing, and stability; review and assess production and testing methods, specifications, validations, reference materials and test results."
    },
    {
      "duty": "Review applicable documentation from internal and external sources as well as applicable sections of regulatory submissions for compliance with documentation, established standards, and regulations."
    },
    {
      "duty": "Approve clinical investigation medicinal product label text and proofs for release to production, ensuring proper quality and compliance standards are met, as required."
    }
  ],
  "skills": [
    {
      "skill": "Quality Assurance",
      "experience": 10
    },
    {
      "skill": "GMP Pharmaceutical Development",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Auditing",
      "experience": 10
    },
    {
      "skill": "Document Control",
      "experience": 10
    },
    {
      "skill": "Training Program Management",
      "experience": 10
    },
    {
      "skill": "Clinical Investigation Compliance",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in chemistry, QA, engineering, pharmacy, science, biology, pharmaceutical sciences, or related fields. (Master's degree preferred)"
    }
  ]
}