{
  "meta": [
    {
      "job_title": "Spa Director",
      "job_category": "Spa & Wellness",
      "job_class": "Director",
      "sector": "Hospitality",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Spa Management",
      "experience": 5
    },
    {
      "skill": "Hospitality Management",
      "experience": 5
    },
    {
      "skill": "Team Building",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Sales Management",
      "experience": 4
    },
    {
      "skill": "Event Planning",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the daily operations, management, and profitability of the spa, ensuring the highest level of customer service and quality work environment."
    },
    {
      "duty": "Increase gross margins of the business through growing revenue and reducing costs through optimal scheduling, staffing plans, and capacity utilization."
    },
    {
      "duty": "Hit sales targets by tracking, directing, and coordinating all sales activity."
    },
    {
      "duty": "Achieve growth by successfully managing the sales team around provided sales goals."
    },
    {
      "duty": "Oversee the management of all positions including front desk, housekeeping, spa technicians, and retail."
    },
    {
      "duty": "Responsible for recruiting, coaching, and performance monitoring of the staff."
    },
    {
      "duty": "Maintain the spa facility, ensuring cleanliness, music selection, HVAC, and spa treatment quality controls."
    },
    {
      "duty": "Manage the preparation of purchase orders for professional treatment and operational supplies."
    },
    {
      "duty": "Maintain proper inventory levels for all professional and retail products."
    },
    {
      "duty": "Work with staff and local businesses to participate in special projects, events, and promotions."
    },
    {
      "duty": "Adhere to all applicable policies, procedures, guidelines, and core values."
    },
    {
      "duty": "Demonstrate positive attitude and actions through courtesy, service, cooperation, hospitality, sensitivity, and professionalism to internal guests."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree or equivalent work experience."
    },
    {
      "credential": "Minimum of three (3) years' experience in hospitality."
    }
  ]
}