{
  "meta": [
    {
      "job_title": "Director of Corporate Accounting",
      "job_category": "Accounting",
      "job_class": "Director",
      "sector": "Finance",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Reporting",
      "experience": 10
    },
    {
      "skill": "Accounting Standards",
      "experience": 10
    },
    {
      "skill": "ERP Software",
      "experience": 8
    },
    {
      "skill": "US GAAP",
      "experience": 10
    },
    {
      "skill": "Internal Controls",
      "experience": 10
    },
    {
      "skill": "Process Improvement",
      "experience": 10
    },
    {
      "skill": "CPA",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the company's annual close process, ensuring accurate financial reporting, and maintaining compliance with accounting standards and regulations."
    },
    {
      "duty": "Lead a team of accounting professionals, collaborating with cross-functional departments to support the company's growth and strategic objectives."
    },
    {
      "duty": "Assist with the oversight and management of the month-end, quarter-end, annual close and financial reporting procedures."
    },
    {
      "duty": "Analyze monthly account information and activity related to revenue, equity, and compensation and benefits."
    },
    {
      "duty": "Provide support and training to Corporate Accounting team."
    },
    {
      "duty": "Support preparation of monthly internal management and external reporting packages."
    },
    {
      "duty": "Support process improvements across the accounting/finance department."
    },
    {
      "duty": "Design and implement accounting procedures that maintain strong internal controls and compliance with regulatory requirements."
    },
    {
      "duty": "Support systems implementation."
    },
    {
      "duty": "Support external audits by working with external auditors."
    },
    {
      "duty": "Research and advise on US GAAP Accounting Standards and how to apply to the Company."
    },
    {
      "duty": "Draft position papers related to implementation of US GAAP Accounting Standards."
    },
    {
      "duty": "Perform special projects as needed."
    },
    {
      "duty": "Maintain and develop relationship with internal and external parties of the Company."
    },
    {
      "duty": "Train and supervise senior accountants and staff accountants."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Accounting, or a bachelor’s degree in another field coupled with a Certified Public Accountant (CPA) designation."
    }
  ]
}