{
  "meta": [
    {
      "job_title": "Retail Parts Pro",
      "job_category": "Retail",
      "job_class": "Sales",
      "sector": "Retail",
      "salary": 40000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Growing the sales of automotive parts and related merchandise in accordance with company standards."
    },
    {
      "duty": "Inspiring the team, helping customers succeed, and growing the retail business profitably and with integrity."
    },
    {
      "duty": "Providing legendary customer service, knowing retail metrics, and executing daily, weekly, and period goals to drive profitable retail growth."
    },
    {
      "duty": "Working with General Manager to produce a consistently winning store, effectively planning, delegating, and holding others accountable for their individual and store results."
    },
    {
      "duty": "Maintaining high standards of customer service and creating a superior customer experience for each customer."
    },
    {
      "duty": "Maintaining and developing a comprehensive product knowledge, awareness of promotions and advertisements, executing merchandise moves, stocking and display with high housekeeping standards, and participating in inventories and periodic cycle counts."
    },
    {
      "duty": "Building customer loyalty, aiding customers in locating the right merchandise, using computers accurately and effectively, working well in a diverse, fast-paced and results-oriented retail environment, producing consistently high sales averages, and managing time effectively."
    },
    {
      "duty": "Responsible for working with the General Manager to lead the store team and grow the retail business in conformity with the company’s 4 key strategies and 3 core values."
    },
    {
      "duty": "Maintains rapport with current retail customers, provides professional, courteous, and prompt customer service, and completes all required training materials, attends all scheduled company meetings, and meets or exceeds all assigned sales goals or quotas."
    },
    {
      "duty": "Utilizes a strong knowledge of automotive systems, categories of merchandise, warranties, and Company Policies to make recommendations and suggestions to customers to gain their confidence and business."
    },
    {
      "duty": "Demonstrates an eagerness to be a team player and assist in other functions as assigned by the store management team."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Marketing Strategy",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED equivalent (Bachelor's degree preferred)"
    }
  ]
}