{
  "meta": [
    {
      "job_title": "Strategic Program Resource Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 130000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for strategic program resource management, release management, and project governance."
    },
    {
      "duty": "Provides direction and guidance to managers and oversees the program’s output and product by promoting an atmosphere of cooperation and collaboration."
    },
    {
      "duty": "Drive a critical portfolio of projects & programs in support of Parks Technology and our guest experience by providing overall leadership to project management structure."
    },
    {
      "duty": "Work with Product & Technology teams to develop, track, analyze and publish project and financial reports, scorecards, and program/project performance trends."
    },
    {
      "duty": "Key contributor to annual strategic planning process for assessment of critical resources and financial estimation in support of advancing the organization vision & mission."
    },
    {
      "duty": "Build & lead a high performing team of project managers, program managers, release train engineers scrum masters and others achieving operational excellence to achieve and exceed goals and objectives."
    },
    {
      "duty": "Execute up on and contribute to process improvements and best practices across PMO to support delivery excellence."
    },
    {
      "duty": "Maintain strong relationships with key stakeholders to achieve robust and sustainable governance model."
    },
    {
      "duty": "Oversee the critical area of risk management, dependency management and mitigation; inclusive of issue identification, risk assessment and mitigation development and recommendations."
    },
    {
      "duty": "Contribute to our the agile transformation strategy."
    },
    {
      "duty": "Understand and actively participate in Environmental, Health & Safety responsibilities by following established policy, procedures, training and team member involvement activities."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Strategic Program Resource Management",
      "experience": 9
    },
    {
      "skill": "Release Management",
      "experience": 9
    },
    {
      "skill": "Project Governance",
      "experience": 9
    },
    {
      "skill": "Portfolio Management",
      "experience": 9
    },
    {
      "skill": "Financial Reporting",
      "experience": 9
    },
    {
      "skill": "Stakeholder Management",
      "experience": 9
    },
    {
      "skill": "Risk Management",
      "experience": 9
    },
    {
      "skill": "Agile Transformation",
      "experience": 9
    },
    {
      "skill": "Environmental, Health & Safety Compliance",
      "experience": 9
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, Information Technology, Engineering or related field required."
    },
    {
      "credential": "9+ years in PMO, progressive transformation or technology enablement; or equivalent combination of education and experience."
    }
  ]
}