{
  "meta": [
    {
      "job_title": "Chef/Food Service Director",
      "job_category": "Food Service",
      "job_class": "Director",
      "sector": "Hospitality",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Food Service Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Culinary Arts",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Staff Development",
      "experience": 5
    },
    {
      "skill": "Food Safety Compliance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the main communicator and day-to-day client contact, fostering positive client relationships and ensuring excellence in service and quality of products."
    },
    {
      "duty": "Plan, organize, and direct the work of team members engaged in the procurement, storage, preparation, and serving of food for this multi-operation location."
    },
    {
      "duty": "Provide leadership, support, and guidance to ensure that food quality standards, inventory levels, food safety guidelines, and customer service expectations are met."
    },
    {
      "duty": "Prepare and maintain budgets including purchasing and staffing expenditures."
    },
    {
      "duty": "Approve food orders and ensure a proper level of inventory to meet demand and minimize cost and waste."
    },
    {
      "duty": "Routinely monitor budget compliance and recommend changes as needed to maintain operational quality."
    },
    {
      "duty": "Take part in interviewing, selecting, managing, and developing team members."
    },
    {
      "duty": "Lead, conduct, and participate in meetings/presentations; provide leadership and direction for timely decisions."
    },
    {
      "duty": "Interview, select, manage, and develop hourly team members."
    },
    {
      "duty": "Oversee the food safety to ensure full compliance with federal, state, and other regulatory agencies."
    },
    {
      "duty": "Participate in the development and adherence of policies and procedures for the food service program."
    },
    {
      "duty": "Plan and direct the ordering, receiving, and accounting of all food products, supplies, and equipment for food operation."
    },
    {
      "duty": "Evaluate existing operational methods and procedures of food service program for effectiveness and efficiency, initiating changes as necessary."
    },
    {
      "duty": "Interview, select, manage, and develop hourly team members."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Culinary Arts degree or related field (Bachelor's preferred)"
    }
  ]
}