{
  "meta": [
    {
      "job_title": "Forestry Specialist",
      "job_category": "Forestry",
      "job_class": "Specialist",
      "sector": "Environment and Planning",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Urban Forestry",
      "experience": 5
    },
    {
      "skill": "Horticulture",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Community Engagement",
      "experience": 5
    },
    {
      "skill": "Tree Health Evaluation",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform advanced professional forestry functions in the field and office, including tree pruning, removal, planting, and replacement."
    },
    {
      "duty": "Supervise employees and contractors involved in professional forestry activities and enforce Parks Department standards for tree care."
    },
    {
      "duty": "Consult with engineers, developers, and contractors on ecological and horticulture initiatives."
    },
    {
      "duty": "Conduct inspections and field surveys to assess tree health, structure, pests, diseases, and construction impacts."
    },
    {
      "duty": "Manage forestry contracts, including tree maintenance, removal, planting, sidewalk repair, and natural area restoration."
    },
    {
      "duty": "Review schedules, reports, and correspondence related to forestry activities and contracts."
    },
    {
      "duty": "Review permit applications, assess impacts to trees and landscapes, advise applicants, and issue permits."
    },
    {
      "duty": "Manage forestry databases and produce reports on budgets, productivity, accomplishments, and program status updates."
    },
    {
      "duty": "Respond to citizen inquiries, maintain relationships with community groups, and coordinate community-based greening efforts and tree stewardship workshops."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "A master’s degree from an accredited college or university, with a specialization in forestry or a related subject; or a baccalaureate degree with one year of full-time professional experience in forestry; or an associate degree with three years of full-time professional experience in forestry."
    }
  ]
}