{
  "meta": [
    {
      "job_title": "Data Management Lead",
      "job_category": "Data Management",
      "job_class": "Lead",
      "sector": "Biotechnology",
      "salary": 140000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads oversight of all data management activities including deliverables for the build, collection, review, monitoring of clinical data including CRF data, ePRO, and internal and external laboratory data to ensure that studies are executed within the agreed timelines and according to applicable SOPs, global standards, and working practices."
    },
    {
      "duty": "Coding Specialist perform oversight of outsourced MedDRA and WHODrug dictionary coding activities to ensure quality and productivity are within established standards. Function as dictionary subject matter expert (SME) to provide guidance for all dictionary related issues and strategies Provide support to activities delivering implementation or integration of dictionary or data management systems using industry standard methodologies"
    },
    {
      "duty": "Responsible for the strategy, monitoring, and timeliness of data cleaning process performed by the CRO from start up through data archival including activities related to cleaning, acquisition and standards, clinical data reporting and analytics, centralized monitoring, and medical coding to ensure cohesive support to clinical trial data collection, review, and reporting."
    },
    {
      "duty": "Lead the development of the data management data review strategy, ensures the creation of robust study-specific data review specifications and aggregating data review. Participates in cross-functional data review meetings and activities in support of key reporting events or database lock plan"
    },
    {
      "duty": "Approves and manages the Data Management Plan (and associated documents), edit check, data review and query management, data access and visualization, data cleaning and coding, metrics reporting, drives interim and final cleaned database freeze and release strategy, and regulatory submission related activities.Coordinate with internal Medical, Biostatistics, and Programming team to understand and drive data delivery for business needs and priorities."
    }
  ],
  "skills": [
    {
      "skill": "Medical Coding",
      "experience": 3
    },
    {
      "skill": "Data Management Systems",
      "experience": 5
    },
    {
      "skill": "Clinical Data Reporting",
      "experience": 5
    },
    {
      "skill": "Clinical Data Analytics",
      "experience": 5
    },
    {
      "skill": "Data Visualization Tools",
      "experience": 3
    },
    {
      "skill": "Regulatory Requirements",
      "experience": 5
    },
    {
      "skill": "CDISC Standards",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree minimum requirement and 8+ years of relevant data management experience in biotechnology, pharmaceutical or CRO settings.Have at least 2-3 years’ experience in the medical device, pharmaceutical, or biotech industry with emphasis in coding clinical data with standard dictionaries (e.g., MedDRA, WHO-DD)."
    }
  ]
}