{
  "meta": [
    {
      "job_title": "Manager, Sales and Customer Service",
      "job_category": "Sales and Customer Service",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Customer Experience Management",
      "experience": 5
    },
    {
      "skill": "Training and Coaching",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build a productive, enthusiastic team that's ready and eager to engage with customers and create memorable shopping experiences."
    },
    {
      "duty": "Exceed sales goals by leading Macy's initiatives through coaching and recognition, while optimizing productivity and efficiency."
    },
    {
      "duty": "Review and utilize Sales and Star Rewards data to provide colleague recognition; develop and communicate strategies to improve results."
    },
    {
      "duty": "Support other operational areas such as OMNI, Style, Asset Protection."
    },
    {
      "duty": "Conduct ongoing Talent Analysis of colleagues and establish career progression plans for key players and positions to result in retention of best talent and turnover reduction."
    },
    {
      "duty": "Actively fill open positions prioritizing internal colleagues in Customer Experience, Commission, and Specialized Selling areas."
    },
    {
      "duty": "Interview, hire, train, coach, develop, coordinate, evaluate, and discipline direct and indirect reports; direct and manage team to meet or exceed performance and behavioral expectations; address complaints from and resolve problems with colleagues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Sales, or a related field (Master's preferred)"
    }
  ]
}