{
  "meta": [
    {
      "job_title": "Special Education Teacher",
      "job_category": "Education",
      "job_class": "Teacher",
      "sector": "Education",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Special Education Teaching",
      "experience": 5
    },
    {
      "skill": "Individualized Educational Planning",
      "experience": 5
    },
    {
      "skill": "Collaborative Teaching",
      "experience": 5
    },
    {
      "skill": "Behavioral Assessment",
      "experience": 5
    },
    {
      "skill": "IEP Management",
      "experience": 5
    },
    {
      "skill": "Classroom Management",
      "experience": 5
    },
    {
      "skill": "Parent Collaboration",
      "experience": 5
    },
    {
      "skill": "Disability Accommodations",
      "experience": 5
    },
    {
      "skill": "Data Reporting",
      "experience": 5
    },
    {
      "skill": "Student Progress Monitoring",
      "experience": 5
    },
    {
      "skill": "Instructional Technology",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Feedback Adaptation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan and present lesson plans, create assessments, and ensure the needs of all students in the classroom are being met."
    },
    {
      "duty": "Oversee education and training of students with physical, emotional, mental, and learning disabilities."
    },
    {
      "duty": "Collaborate with school support staff and parents to help students develop and socialize."
    },
    {
      "duty": "Utilize the parallel teaching model as the main model for teaching and learning."
    },
    {
      "duty": "Assess students’ skills and learning requirements and design annual Individualized Educational Plans (I.E.P’s) for students."
    },
    {
      "duty": "Provide research-based specialized instruction to address the instructional goals and objectives contained within each student’s IEP."
    },
    {
      "duty": "Monitor students’ behavioral patterns and arrange appropriate interventions if needed."
    },
    {
      "duty": "Attend and prepare special education evaluation and reevaluation meetings."
    },
    {
      "duty": "Support new initiatives, including the use of blended learning and project-based learning."
    },
    {
      "duty": "Supervise the health, safety, and welfare of students at all times."
    },
    {
      "duty": "Utilize all avenues to incorporate past lessons, the performance standards, and staff development sessions to design and deliver outstanding lessons."
    },
    {
      "duty": "Organize classroom, including materials and visual aids in an educationally appropriate way."
    },
    {
      "duty": "Record each student’s progress through both monitoring forms and marking books."
    },
    {
      "duty": "Prepare progress reports, report cards, and arrange and conduct Parent-Teacher Conferences."
    },
    {
      "duty": "Interact with students in a firm, positive, and constructive way."
    },
    {
      "duty": "Recognize and encourage positive behavior."
    },
    {
      "duty": "Perform additional duties as assigned."
    },
    {
      "duty": "Support positive connections among students and the larger community."
    },
    {
      "duty": "Establish and maintain student control and discipline in the classroom."
    },
    {
      "duty": "Collaborate and consult with educational professionals and community service providers regarding the needs of students."
    },
    {
      "duty": "Provide consultation to classroom teachers regarding classroom adaptations, instructional modifications, and other similar instructional interventions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree required; Master’s Degree preferred. Active New York State Special Education Teaching Certification required."
    }
  ]
}