{
  "meta": [
    {
      "job_title": "Interactive Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Entertainment",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Crisis Management",
      "experience": 4
    },
    {
      "skill": "Budget Management",
      "experience": 4
    },
    {
      "skill": "Theme Park Operations",
      "experience": 4
    },
    {
      "skill": "Guest & Team Member Satisfaction",
      "experience": 4
    },
    {
      "skill": "Union Management",
      "experience": 4
    },
    {
      "skill": "Safety Management",
      "experience": 4
    },
    {
      "skill": "Training Programs",
      "experience": 4
    },
    {
      "skill": "Diversity and Inclusion",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the hiring and training of team members, maintaining strategic and daily operational plans to ensure overall Guest and Team Member satisfaction."
    },
    {
      "duty": "Maintain artistic and thematic integrity of attraction and overall land, ensuring department understands and follows all company policies and procedures."
    },
    {
      "duty": "Supervise all hourly staff and provide work direction, performance reviews, and effective coaching. Investigate and handle incidents, including guest complaints and crisis management."
    },
    {
      "duty": "Plan and implement action plans for the department’s future success, including training programs, workforce planning, and rewards and recognition programs. Support Team Member and Guest Satisfaction initiatives for consistent improvement."
    },
    {
      "duty": "Maintain operational efficiency of attractions during park hours and seasonal/special events. Act as EHS Safety Team representative for the Team Members. Ensure collective bargaining agreements are upheld and promote an environment of diversity, equity, and inclusion."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Operations, or Hospitality is highly preferred (Master's preferred)"
    }
  ]
}