{
  "meta": [
    {
      "job_title": "DEI Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Human Resources",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "DEI Program Implementation",
      "experience": 5
    },
    {
      "skill": "Diversity Data Analysis",
      "experience": 5
    },
    {
      "skill": "Internal and External Collaboration",
      "experience": 5
    },
    {
      "skill": "Event and Program Coordination",
      "experience": 5
    },
    {
      "skill": "Client and Third-Party Engagement",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Statistical Reporting",
      "experience": 5
    },
    {
      "skill": "Intranet and Web Management",
      "experience": 5
    },
    {
      "skill": "DEI Report Creation",
      "experience": 5
    },
    {
      "skill": "Client Services Collaboration",
      "experience": 5
    },
    {
      "skill": "Administrative Support",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate firmwide strategic initiatives to attract, retain, and promote diverse talent, including training programs, professional development events, and client collaborations."
    },
    {
      "duty": "Execute and coordinate mentoring and sponsorship initiatives related to Diversity, Equity, and Inclusion (DEI)."
    },
    {
      "duty": "Fulfill, monitor, and update diversity-related data and requests; research DEI trends and contribute to the development of best practices."
    },
    {
      "duty": "Liaise with various committees and firm leaders to oversee the implementation of DEI initiatives laid out in the firm’s Diversity & Inclusion Plan."
    },
    {
      "duty": "Organize and support diverse employee resource groups in their programming, activities, and initiatives."
    },
    {
      "duty": "Manage client and third-party DEI requests, surveys, and billing responses, and analyze the effectiveness of external DEI programs."
    },
    {
      "duty": "Provide administrative support for special projects, maintain the firm's intranet and external website, and create DEI reports and presentations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent experience required; J.D. or Master’s degree preferred, or work experience comparable to a post-graduate degree preferred. Minimum of two (2) years of post-undergraduate experience, or 4 years of experience in place of an undergraduate degree, supporting and implementing DEI initiatives in a law firm or the private sector required, or at least one year of such experience with a DEI certificate conferred."
    }
  ]
}