{
  "meta": [
    {
      "job_title": "Receiving Colleague",
      "job_category": "Customer Service",
      "job_class": "Entry Level",
      "sector": "Customer Service",
      "salary": 38000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Organizational Skills",
      "experience": 1
    },
    {
      "skill": "Team Collaboration",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Greet customers, answer their questions, and provide assistance in a friendly and professional manner."
    },
    {
      "duty": "Receive and unload merchandise from delivery trucks; unpack merchandise from vendor boxes; and remove merchandise from plastic bags and packaging"
    },
    {
      "duty": "Sort and organize merchandise based on its type, size, or category. Ensure that items are properly labeled, tagged, or marked for easy identification and retrieval. Keep the receiving area clean and organized."
    },
    {
      "duty": "Complete all processing and receiving activities in accordance with productivity standards, timelines, and asset protection inventory control and compliance procedures. Ensure promotional signage is accurate and up-to-date"
    },
    {
      "duty": "Transfer merchandise from the receiving area to the stockroom or sales floor and assist the Merchandise Team in the movement of fixtures and merchandise for new product placement, season changes, and clearance set"
    },
    {
      "duty": "Select merchandise from the selling floor and apply packing policies & techniques to ensure every customer receives his/her package in good condition; process shippable returns and abandoned in store pickup orders"
    },
    {
      "duty": "Retrieve orders from our back-of-house storage and deliver them curbside to the customer; monitor alerts to ensure Ready on Time completion of Buy Online Pickup In-Store (BOPS) orders"
    },
    {
      "duty": "Work with other team members to achieve department goals and maintain a positive work environment. Communicate effectively with colleagues and supervisors, sharing feedback, ideas, and concerns."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": []
}