{
  "meta": [
    {
      "job_title": "Senior Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Industrial and Manufacturing",
      "salary": 135000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support pursuits, client management, project scope development, project planning, organizing, change management, inter-discipline coordination, production coordination, team leadership, financial management, project quality control, and delivery."
    },
    {
      "duty": "Maintain healthy client relationships and possess solid operational insight for driving projects and executing deliverables."
    },
    {
      "duty": "Understand project goals and clearly communicate them to project teams to ensure client expectations are consistently achieved."
    },
    {
      "duty": "Provide leadership and direction for the execution of Industrial and Manufacturing projects."
    },
    {
      "duty": "Lead project staff, prepare work schedules, and assign specific duties. Oversee the production of plans and specifications for design projects for industrial and manufacturing facilities."
    },
    {
      "duty": "Although not a technical producer, be recognized as a credible leader with strong technical experience related to the support of product manufacturing."
    },
    {
      "duty": "Maintain project financial control including monitoring of earned value and estimates to complete with the ability to develop recovery plans if/when needed."
    },
    {
      "duty": "Identification and leadership in controlling scope and managing change."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 15
    },
    {
      "skill": "Client Management",
      "experience": 15
    },
    {
      "skill": "Team Leadership",
      "experience": 15
    },
    {
      "skill": "Financial Management",
      "experience": 15
    },
    {
      "skill": "Change Management",
      "experience": 15
    },
    {
      "skill": "Inter-discipline Coordination",
      "experience": 15
    },
    {
      "skill": "Production Coordination",
      "experience": 15
    },
    {
      "skill": "Industrial and Manufacturing Design",
      "experience": 15
    },
    {
      "skill": "Operational Insight",
      "experience": 15
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150
    },
    {
      "student_teacher": 120
    },
    {
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Architecture or Engineering discipline and 15+ years of job-related experience with a consulting firm for Industrial/Manufacturing/Process projects including but not limited to the following industries: food and beverage, battery manufacturing, energy storage, automotive, metals, etc. Experience with design management and preconstruction experience working as a contractor will also be considered. AIA or P.E. licensure is required. Prefer experience with Deltek Vision. Must be exceptional in written and oral communication, with the ability to lead, develop and deliver highly persuasive presentations that build client confidence and result in securing favorable design contracts."
    }
  ]
}