{
  "meta": [
    {
      "job_title": "Data Analyst",
      "job_category": "Data Analysis",
      "job_class": "Analyst",
      "sector": "Data Analysis",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Collection/Coordination",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 5
    },
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Database Maintenance",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Healthcare Industry Knowledge",
      "experience": 4
    },
    {
      "skill": "English Grammar",
      "experience": 4
    },
    {
      "skill": "Accounting Principles",
      "experience": 4
    },
    {
      "skill": "Office Software Proficiency",
      "experience": 4
    },
    {
      "skill": "Data Analysis Tools",
      "experience": 4
    },
    {
      "skill": "Presentation Skills",
      "experience": 4
    },
    {
      "skill": "Written Communication",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop, implement, and validate utilization and cost models that characterize providers' claims submissions and treatment patterns."
    },
    {
      "duty": "Maintain integrity of databases and repositories. Collect data for ad-hoc request reports and documentation."
    },
    {
      "duty": "Prepare compensation reports and actuarial requests for compensation comparisons and analysis."
    },
    {
      "duty": "Review and prepare reports, compile statistics, and analyze data regarding dentists requesting changes to their compensation."
    },
    {
      "duty": "Coordinate collection of internal data to facilitate investigation of irregularities by dentists, enrollees, or other external entities."
    },
    {
      "duty": "Assist with onsite investigations into cases of suspected fraud or misrepresentation involving providers, brokers, clients, or enrollees."
    },
    {
      "duty": "Keep abreast of network infrastructure and leverage data sets needed to meet business requirements."
    },
    {
      "duty": "Review profiling parameters for statistical validity and recommend adjustments."
    },
    {
      "duty": "Support Client Acceptance Testing of approved business applications and provide input to improve reliability and accuracy of data."
    },
    {
      "duty": "Troubleshoot and suggest improvements to systems and software applications."
    },
    {
      "duty": "Build, develop, and test applicability of new utilization models based on claims data."
    },
    {
      "duty": "Serve as a technical resource to division employees. Coordinate with all other Enterprise areas when applicable."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent education preferred. Minimum 3 years' experience in business, data collection/coordination, and analysis in areas of investigation and/or claims review processing."
    }
  ]
}