{
  "meta": [
    {
      "job_title": "Security Consultant",
      "job_category": "Information Technology",
      "job_class": "Consultant",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Information Security Consulting",
      "experience": 5
    },
    {
      "skill": "Security Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Security Frameworks (NIST, RMF, Common Criteria)",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Cloud Security",
      "experience": 5
    },
    {
      "skill": "Cybersecurity Incident Management",
      "experience": 5
    },
    {
      "skill": "Network/EDGE Security",
      "experience": 5
    },
    {
      "skill": "IoT and AI Security",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assess, analyze, and implement effective security measures in customer environments, leaving no stone unturned when it comes to safeguarding their most sensitive data."
    },
    {
      "duty": "Work closely with clients to understand their unique security requirements and assess their current security posture. Provide expert guidance and recommendations on the best security practices, risk management strategies, and robust security policies that will fortify their defenses."
    },
    {
      "duty": "Design and implement security controls, policies, and procedures. Work alongside cross-functional teams to deploy state-of-the-art technologies, including firewalls, intrusion detection/prevention systems, access controls, and encryption technologies, ensuring a comprehensive security framework."
    },
    {
      "duty": "Conduct thorough security assessments, leaving no stone unturned in identifying potential security breaches. Document findings to serve as the foundation for meticulous security audits and reviews, ensuring adherence to policies and procedures."
    },
    {
      "duty": "Immerse in the latest security threats, technologies, and best practices. Drive enhancements to the organization's security posture, ensuring it remains at the cutting edge of defense."
    },
    {
      "duty": "Lend expertise to the design and review of IT infrastructure, systems, and applications, ensuring they are secure by design from inception. Collaborate with customers and vendors on security assessments, audits, and due diligence activities, shaping secure collaborations and partnerships."
    },
    {
      "duty": "Provide thought leadership and innovative thinking to solve complex transformation puzzles through technology."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Security, Computer Science, or a related field (Master's preferred)"
    }
  ]
}