{
  "meta": [
    {
      "job_title": "Supply Chain Coordinator",
      "job_category": "Logistics",
      "job_class": "Coordinator",
      "sector": "Supply Chain",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Management",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 2
    },
    {
      "skill": "Project Management",
      "experience": 2
    },
    {
      "skill": "Microsoft Office (Access, Excel, Word, Outlook, Power Point)",
      "experience": 2
    },
    {
      "skill": "Detail Orientation",
      "experience": 3
    },
    {
      "skill": "Critical Thinking",
      "experience": 3
    },
    {
      "skill": "Excellent Oral and Written Communication",
      "experience": 3
    },
    {
      "skill": "Collaboration",
      "experience": 3
    },
    {
      "skill": "Self-Sufficiency",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Track supplier performance, lead times, and manage metrics and reporting of said suppliers."
    },
    {
      "duty": "Support overall management of supplier quality and performance to meet tactical business goals."
    },
    {
      "duty": "Support and assist in maintaining and documenting equipment for inventory management, in support of Development initiatives, replacement parts, and new restaurant openings."
    },
    {
      "duty": "Work closely with Kitchen Equipment Supplier (KES) and independent equipment manufacturers on performance and KPIs of deliverables and production timelines."
    },
    {
      "duty": "On-site monitoring of new restaurant openings of KES performance and ensuring new store openings are receiving complete packages to support opening dates."
    },
    {
      "duty": "Compile and retrieve reporting data to provide detailed reporting of the supply chain flow of goods and informational analysis."
    },
    {
      "duty": "Manage all sample requests as required cross-functionally and follows up accordingly."
    },
    {
      "duty": "Collaborate and support R&D Team with new initiatives requiring kitchen equipment and/or smallwares."
    },
    {
      "duty": "Perform other ad hoc tasks and duties as assigned, with or without accommodation, in support of the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in supply chain, business, or equivalent offset experience in related fields."
    }
  ]
}