{
  "meta": [
    {
      "job_title": "Budget Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage daily financial activities in the Department of Gynecology and Obstetrics, including non-sponsored and sponsored accounts."
    },
    {
      "duty": "Assist in the development of the annual Departmental budget and projections."
    },
    {
      "duty": "Responsible for monitoring and reconciling non-sponsored financial reports and exercising control of expenditures."
    },
    {
      "duty": "Process quarterly and annual invoices, including posting sponsored invoices in SAP, quarterly billing incentive bonus supplements, journal entries, and non-payroll cost transfers."
    },
    {
      "duty": "Prepare and process various online check requests, online invoices, travel expense reports, etc."
    },
    {
      "duty": "Assist with processing expense reports and check requests."
    },
    {
      "duty": "Responsible for reconciling departmental accounts on a monthly basis and clearing up any discrepancies."
    },
    {
      "duty": "Manage all iLab requests for the department and add IO #’s as needed."
    },
    {
      "duty": "Work with all departmental staff to provide IT services with updated and accurate budget information."
    },
    {
      "duty": "Responsible for processing large volumes of ISR’s throughout each fiscal year."
    },
    {
      "duty": "Develop efficient electronic and paper recordkeeping systems to track a significantly high volume of electronic and paper payroll transactions."
    },
    {
      "duty": "Responsible for tracking, monitoring, and responding to inquiries from departments."
    },
    {
      "duty": "Draft original correspondence and reports."
    },
    {
      "duty": "Assist in processing all new faculty moving expense payroll supplements and managing the Faculty Compensation Tool."
    },
    {
      "duty": "Assure HR processes new hire paperwork in a timely manner and check payroll record for accuracy."
    },
    {
      "duty": "Oversee all faculty and clinical associates onboarding, process all position requests for ongoing replacement and new positions."
    },
    {
      "duty": "Manage all departmental SuccessFactors myPerformance to notify/train supervisors in using the system."
    },
    {
      "duty": "Assist all departmental employees with E210 timesheet concerns and monitor the E210 submission and approval reports."
    },
    {
      "duty": "Create and terminate accounts when necessary and report changes for budget/billing purposes."
    },
    {
      "duty": "Submit annual Fellowship Survey of Graduate Students and Post-doctorates."
    }
  ],
  "skills": [
    {
      "skill": "Financial Management",
      "experience": 1
    },
    {
      "skill": "Budgeting",
      "experience": 1
    },
    {
      "skill": "Financial Analysis",
      "experience": 1
    },
    {
      "skill": "Payroll Processing",
      "experience": 1
    },
    {
      "skill": "SAP",
      "experience": 1
    },
    {
      "skill": "Account Reconciliation",
      "experience": 1
    },
    {
      "skill": "Expense Management",
      "experience": 1
    },
    {
      "skill": "Recordkeeping",
      "experience": 1
    },
    {
      "skill": "Data Analysis",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Finance, Accounting, Business, or related field (Master's preferred)"
    }
  ]
}