{
  "meta": [
    {
      "job_title": "Actuary",
      "job_category": "Actuarial",
      "job_class": "Expert",
      "sector": "Finance",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Actuarial expertise",
      "experience": 5
    },
    {
      "skill": "Financial reporting and analysis",
      "experience": 5
    },
    {
      "skill": "Asset and liability modeling",
      "experience": 5
    },
    {
      "skill": "Data analytics",
      "experience": 5
    },
    {
      "skill": "Cross-functional collaboration",
      "experience": 5
    },
    {
      "skill": "Leadership and management",
      "experience": 5
    },
    {
      "skill": "Agile mindset",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide actuarial expertise for products, financial reporting and analysis, asset and liability modeling, ALM, and product pricing."
    },
    {
      "duty": "Work closely with the Valuation and Modeling team leads, Product Solutions, the Investment Team, and the broader Finance organization."
    },
    {
      "duty": "Responsible for reporting and modeling of products, reviewing and analyzing results, communicating key insights and findings to senior actuarial staff."
    },
    {
      "duty": "Identify potential action items to improve profitability and/or mitigate risk, and recommend process improvements related to actuarial calculations, monthly reporting, and modeling."
    },
    {
      "duty": "Conduct experience studies, including documentation of process, results, and recommended assumption changes."
    },
    {
      "duty": "Provide direction to and drive development of actuarial staff to ensure compliance with NAIC requirements, actuarial guidelines, and industry best practices."
    },
    {
      "duty": "Actively manage multiple workstreams leveraging project management skillsets and tools, and support the Investment Team and external asset managers to advance asset liability management and investment workstreams."
    },
    {
      "duty": "Manage direct reports including overseeing workflow, providing feedback, fostering a positive work environment, training, hiring, and performance management."
    },
    {
      "duty": "Lead the organization by providing feedback, fostering a culture of betterment, and overseeing day-to-day operations."
    },
    {
      "duty": "Embrace and foster a diverse and inclusive culture that aligns with the company's commitment to THRIVE together. Support and engage in educational opportunities that raise awareness through the Toolkit, Hear by listening and encouraging every voice, and Respect by empowering and appreciating differences."
    },
    {
      "duty": "Perform other related duties as necessary or assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree with at least a minor in Actuarial Science, Mathematics, or Statistics or related field. Combination of education and/or relevant work experience may be accepted in lieu of degree.ASA designation. Preference will be given to candidates with FSA designation."
    }
  ]
}