{
  "meta": [
    {
      "job_title": "Supply Chain Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Supply Chain",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Global Supply Management",
      "experience": 5
    },
    {
      "skill": "Strategic Sourcing",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Product Launch",
      "experience": 5
    },
    {
      "skill": "MRP",
      "experience": 5
    },
    {
      "skill": "ERP Systems",
      "experience": 5
    },
    {
      "skill": "Forecasting and Demand Planning",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Understand cost structure of various components and drive down cost in collaboration with suppliers."
    },
    {
      "duty": "Establish and manage Pomega’s Supply base to ensure the best Suppliers are selected to support all development, prototyping and production activity."
    },
    {
      "duty": "Implements and leverage ERP supply chain functionality and capabilities to drive efficiency within production planning, inventory, and materials management."
    },
    {
      "duty": "Generates, manages and schedules Planned Orders, Purchase Requisitions and Production Orders."
    },
    {
      "duty": "Lead RFP/RFQ activities for your respective area and clearly communicate Pomega’s expectations."
    },
    {
      "duty": "Lead contractual discussions with suppliers (Supply Agreements/NDAs/Terms and conditions/SOWs) with prospective suppliers/partners and Memorandums of Understanding (MOU) with OEMs."
    },
    {
      "duty": "Build relationships across multiple teams (Supply Chain, Finance, Engineering, Manufacturing, Quality) and work across different levels in the organization to ensure program timelines are achieved."
    },
    {
      "duty": "Manages inventory levels to avoid excessive inventory, inventory shortages, and/or inventory inaccuracies within defined guidelines."
    },
    {
      "duty": "Analyze domestic and international shipping forecasts to achieve optimal inventory levels."
    },
    {
      "duty": "Work with and support the project team by; scheduling product delivery, assist permitting process for BESS installations, coordinating commissioning timeline and requirements, reviewing and optimizing proposed designs, and others as needed."
    },
    {
      "duty": "Prepare material variance analyses and review cycle count results to allow for appropriate recommendations for improvements."
    },
    {
      "duty": "Align with production, planning and warehouse to coordinate the forecast and ensure timely delivery."
    },
    {
      "duty": "Drive supply chain initiatives and process improvements to help the team grow in scalability."
    },
    {
      "duty": "Able to work in the office and travel domestically and internationally as needed."
    },
    {
      "duty": "Other duties as assigned."
    },
    {
      "duty": "Reports directly to the Plant Manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. degree in Supply Chain Management, Operations Management or equivalent."
    },
    {
      "credential": "CPSM or APICS or equivalent."
    }
  ]
}