{
  "meta": [
    {
      "job_title": "SAP Configuration Manager",
      "job_category": "Information Technology",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "SAP Configuration Management",
      "experience": 5
    },
    {
      "skill": "Business Process Evaluation",
      "experience": 5
    },
    {
      "skill": "SAP Implementation",
      "experience": 5
    },
    {
      "skill": "ECC and S/4 Hana",
      "experience": 5
    },
    {
      "skill": "Issue Resolution",
      "experience": 5
    },
    {
      "skill": "SAP End-User Training",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "SAP System Troubleshooting",
      "experience": 5
    },
    {
      "skill": "IMG Configuration",
      "experience": 5
    },
    {
      "skill": "SAP OSS Notes",
      "experience": 5
    },
    {
      "skill": "SAP Upgrades",
      "experience": 5
    },
    {
      "skill": "ABAP Programming",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "User Training",
      "experience": 5
    },
    {
      "skill": "Help Desk Support",
      "experience": 5
    },
    {
      "skill": "Process Flow Diagrams",
      "experience": 5
    },
    {
      "skill": "Business System Projects",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain SAP configuration in the IMG and test and implement configuration changes."
    },
    {
      "duty": "Conduct ongoing SAP end-user training for new employees and employees changing roles."
    },
    {
      "duty": "Maintain SAP-related issue/resolution status and troubleshoot SAP system functionality problems."
    },
    {
      "duty": "Identify data inconsistencies, provide reports to users, and work with them to help resolve erroneous data within the system."
    },
    {
      "duty": "Submit OSS Notes to SAP and recommend the application of relevant SAP-provided OSS notes, patches, etc."
    },
    {
      "duty": "Evaluate, test, and implement SAP system software upgrades and write detailed specifications for enhancement requests requiring programming."
    },
    {
      "duty": "Provide analysis and recommendations to management to ensure the business system and associated processes are consistent with the general business direction."
    },
    {
      "duty": "Work with users to examine business process areas for improvement and develop project timelines to ensure target project dates are met."
    },
    {
      "duty": "Provide end-user support, analyze current SAP processes, identify problems, develop and recommend solutions."
    },
    {
      "duty": "Investigate opportunities for implementation of new functionality in SAP to achieve process improvement in the business and train organizational process owners on a train-the-trainer basis."
    },
    {
      "duty": "Prepare and maintain process flow diagrams for educational purposes, monitor and address help desk requests, and take the lead in the knowledge area for larger, long-term business system projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors Degree and SAP FI/CO Certification highly preferred. (5+ Years of experience with at least 3 years of generalbusiness process evaluation. Experience contributing to at least one SAP implementation. Or, experience working with ECC and S/4 Hana. At least one year of experience in setting up IMG (Implementation Guide) configurations in SAP. Additional SAP experience outside of FI/CO is a bonus.)"
    }
  ]
}