{
  "meta": [
    {
      "job_title": "Streets Operator III - Traffic & Signage Technician",
      "job_category": "Traffic & Signage",
      "job_class": "Operator",
      "sector": "Engineering",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Traffic Control",
      "experience": 2
    },
    {
      "skill": "Heavy Construction Equipment Operation",
      "experience": 2
    },
    {
      "skill": "Logistics Support",
      "experience": 3
    },
    {
      "skill": "Emergency Response Coordination",
      "experience": 3
    },
    {
      "skill": "Street Lighting Installation and Maintenance",
      "experience": 3
    },
    {
      "skill": "Contract Management",
      "experience": 3
    },
    {
      "skill": "Data Entry and Verification",
      "experience": 3
    },
    {
      "skill": "Storm Control Activities",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides logistical support for Special Events including, deployment and programming electronic variable message boards, traffic control, and way finding."
    },
    {
      "duty": "Sets up and picks up barricades, lane cones, and warning signs to channel traffic around work crews."
    },
    {
      "duty": "Installs signposts, street signs, checks for maintenance and replaces broken signs as needed."
    },
    {
      "duty": "Coordinates with Park City Police, Transit, and other departments during emergency situations to ensure safety of City personnel and residents."
    },
    {
      "duty": "Responsible for contacting Blue Stakes prior to performing work on streets, curbs, sidewalks, and stormwater system to ensure safety of operation."
    },
    {
      "duty": "Performs street lighting installation and maintenance for City lighting network; assists with the installation, repair and maintenance of street lighting systems."
    },
    {
      "duty": "Utilizes IT equipment to enter, retrieve, review, or modify data; verifies accuracy of entered data and makes corrections; utilizes word processing, work order database, email, and other computer programs."
    },
    {
      "duty": "Monitors and evaluates the work of contract service providers; oversees contract labor and construction projects; provides input in the development of contracts."
    },
    {
      "duty": "Performs skilled functions related to repair and maintenance of all street assets."
    },
    {
      "duty": "Assists in storm control activities such as placing sandbags, barricades and picking up litter or debris."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 60,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "DOT physical card and Class B Commercial Driver’s License with Air Brake"
    },
    {
      "credential": "Utah Flagger Certification"
    },
    {
      "credential": "Traffic Control Supervisor Certification"
    }
  ]
}