{
  "meta": [
    {
      "job_title": "Chauffeur Driver",
      "job_category": "Transportation",
      "job_class": "Driver",
      "sector": "Transportation",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Defensive Driving",
      "experience": 7
    },
    {
      "skill": "Vehicle Maintenance",
      "experience": 7
    },
    {
      "skill": "Customer Service",
      "experience": 7
    },
    {
      "skill": "Route Planning",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct pre-trip and post-trip inspections of assigned vehicle as required."
    },
    {
      "duty": "Route passenger stops efficiently based on customer request."
    },
    {
      "duty": "Drive defensively under varying traffic conditions and inclement weather."
    },
    {
      "duty": "Adhere to all company policies."
    },
    {
      "duty": "Establish favorable working relationships with passengers, co-workers, company customers and company management."
    },
    {
      "duty": "Attain self-improvement by attending training sessions, annual in-service and workshops conducted by company and/or other approved agencies."
    },
    {
      "duty": "Operate non-commercial motor vehicle types and lift equipment, as assigned."
    },
    {
      "duty": "Demonstrate knowledge of geographic service area of the routes traveled."
    },
    {
      "duty": "Demonstrate knowledge of federal and state laws and local ordinances related to transportation."
    },
    {
      "duty": "Keep accurate records and reports as required, submit in a legible condition and submit in a timely manner."
    },
    {
      "duty": "Secure all equipment that is required for each passenger as prescribed in company policy, i.e. passenger luggage."
    },
    {
      "duty": "Act in an appropriate and professional manner at all times."
    },
    {
      "duty": "Keep a presentable appearance in company uniform."
    },
    {
      "duty": "Perform various physical tasks through employment, such as opening and closing vehicle doors, lifting, bending, pushing, and pulling."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Michigan Chauffeur License"
    }
  ]
}