{
  "meta": [
    {
      "job_title": "Construction Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Technical Services",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Oil and Gas Production Operations",
      "experience": 10
    },
    {
      "skill": "Construction Management",
      "experience": 10
    },
    {
      "skill": "HSE Compliance",
      "experience": 10
    },
    {
      "skill": "Facility Commissioning",
      "experience": 10
    },
    {
      "skill": "Procurement",
      "experience": 10
    },
    {
      "skill": "QA/QC Management",
      "experience": 10
    },
    {
      "skill": "Ethical Standards",
      "experience": 10
    },
    {
      "skill": "Verbal Communication",
      "experience": 10
    },
    {
      "skill": "Written Communication",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and coordinate activities of third party inspectors, contractors, suppliers, and field crews engaged on company construction projects."
    },
    {
      "duty": "Monitor productivity, HSE compliance, scope control, construction progress, schedule, and manage project costs."
    },
    {
      "duty": "Schedule and administer progress meetings with all project stakeholders; document and assign responsibilities accordingly."
    },
    {
      "duty": "Report to Operations and Engineering management team on project status, identify potential project problems, e.g., delays, revised scheduling, cost overruns, and recommend solutions."
    },
    {
      "duty": "Prepare, track, and manage AFEs."
    },
    {
      "duty": "Ensure projects are scheduled and conducted in such a way to minimize delays, HSE issues, technical issues, and risks."
    },
    {
      "duty": "Assist Operations personnel with facility commissioning, shutdowns, overhauls, and rebuilds."
    },
    {
      "duty": "Procure project material and maintain related QA/QC records."
    },
    {
      "duty": "Conduct business with the highest ethical standards."
    },
    {
      "duty": "Adhere and promote Company’s safety policies."
    },
    {
      "duty": "Other tasks and projects may be assigned, as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent is required; College degree a plus; Must have a valid driver’s license and a clean driving record. Minimum of 10 years of oil and gas/pipeline project management and construction experience required. Salt water disposal experience preferred. Demonstrated knowledge of safe oil and gas production operations, as well as computer literacy and exceptional project management skills required. Must have the ability and willingness to spend long hours in the field during critical activities."
    }
  ]
}