{
  "meta": [
    {
      "job_title": "Associate Director for Research",
      "job_category": "Research",
      "job_class": "Director",
      "sector": "Labor and Employment Relations",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Quantitative Data Analysis",
      "experience": 5
    },
    {
      "skill": "Econometrics",
      "experience": 5
    },
    {
      "skill": "Research Excellence",
      "experience": 5
    },
    {
      "skill": "Writing and Editing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organization Skills",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Policy Development",
      "experience": 5
    },
    {
      "skill": "Proposal Writing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the institute's research agenda, ensuring that research is rigorous, innovative, and relevant to the institute's mission."
    },
    {
      "duty": "Conduct original applied and academic research focused on the economic and labor market impacts of climate and clean energy transition."
    },
    {
      "duty": "Work collaboratively with stakeholders and partners to design and conduct research studies that advance the institute's policy and programmatic goals."
    },
    {
      "duty": "Lead a team of researchers and research associates to ensure timely and effective delivery of research products."
    },
    {
      "duty": "Develop and maintain relationships with academic, government, and industry partners to advance research partnerships and collaborations."
    },
    {
      "duty": "Participate in collaborations with related Institutes and Centers at the University of Illinois on joint/interdisciplinary research, policy recommendations, academic publications, and external funding proposals related to clean energy initiatives."
    },
    {
      "duty": "Engage in external communications with policymakers, researchers, and the public to communicate research findings and advance the institute's mission."
    },
    {
      "duty": "Report to the institute’s executive director to coordinate planning, strategy, and collaboration the institutes’ research portfolio."
    },
    {
      "duty": "Supervise institute administrative staff and collaborate with institute post-doctoral scholars and researchers."
    },
    {
      "duty": "Perform other duties in order to further the mission and goals of the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Ph.D. in a related field (economics, sociology, public policy, environmental science, labor studies)"
    }
  ]
}