{
  "meta": [
    {
      "job_title": "Property Manager",
      "job_category": "Property Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages the day-to-day operations of an assigned property including managing the team members, daily activities, and resources of the property to achieve established budgeted financial and operational goals."
    },
    {
      "duty": "Provides input into the development of budget(s) for the property by analyzing and evaluating financial statements, reviewing current and projected marketing information, and accessing operational reports that establish historic and predict performance patterns."
    },
    {
      "duty": "Meets targeted revenues by setting rent rates, ensuring rent and fees are collected and posted in a timely manner, making financial bank deposits, and preparing and reviewing monthly financial status reports."
    },
    {
      "duty": "Approves invoices from vendors, contractors, and service providers for payment by reconciling work performed or products purchased, ensuring validity of certificates of insurance, coding charges to appropriate Chart of Account codes, and managing communication between the vendor/contractor, accounting, and the client/owner as needed."
    },
    {
      "duty": "Oversees the lease enforcement process by approving prospective resident applications, discounts and renewal leases, conducts periodic apartment inspections, follows proper notice requirements, evicts residents, and imposes and collects late fees and other charges as allowable and stated in the terms of the lease."
    },
    {
      "duty": "Gathers, analyzes, and interprets current market and economic trends that may impact the property and implements short- and long-range marketing and leasing strategies to achieve the property’s occupancy and revenue goals."
    },
    {
      "duty": "Promotes resident satisfaction and retention by responding to complaints, questions, and requests in a timely manner, and taking appropriate action to resolve and address service issues."
    },
    {
      "duty": "Ensures the property’s maintenance team members comply with the Company’s standards with respect to responding and completing resident service requests."
    },
    {
      "duty": "Supervises property staff by interviewing, hiring, orienting, and training employees, and manages their performance in accordance with Company policies, values, and business practices."
    },
    {
      "duty": "Assists in managing the client/owner relationship by meeting with the owners, conducting property tours, providing updates and information about the property’s performance, and responding to owner requests as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Property Management, Business, or a related field (Master's preferred)"
    }
  ]
}