{
  "meta": [
    {
      "job_title": "Controller",
      "job_category": "Accounting",
      "job_class": "Executive",
      "sector": "Finance",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Partner closely with other senior leaders and teams across the organization to identify and implement operational improvements to streamline the Company’s financial operations."
    },
    {
      "duty": "Focus on increasing visibility, accuracy, speed and efficiency by leveraging technology to drive automation to support scaling for long-term growth."
    },
    {
      "duty": "Lead day-to-day accounting operations and be the chief accounting officer leading the entire accounting staff."
    },
    {
      "duty": "Oversee preparation of monthly consolidated financial statements."
    },
    {
      "duty": "Review and manage closely the accounting close process along with the staff."
    },
    {
      "duty": "Roll up sleeves and step in where needed."
    },
    {
      "duty": "Supervise and manage a growing global accounting team that currently consists of 6 individuals."
    },
    {
      "duty": "Work closely with CFO on the continued development and build out of the finance team with future hires as the company evolves."
    },
    {
      "duty": "Provide strategic financial analysis and recommendations to support business decision-making, such as capital investments, cost optimization, and revenue enhancement opportunities."
    },
    {
      "duty": "Stay abreast of accounting and financial reporting standards, regulations, and industry trends, providing guidance and implementing changes as necessary."
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 15
    },
    {
      "skill": "Strategic Planning",
      "experience": 15
    },
    {
      "skill": "Team Leadership",
      "experience": 15
    },
    {
      "skill": "Financial Reporting",
      "experience": 15
    },
    {
      "skill": "Accounting Software",
      "experience": 15
    },
    {
      "skill": "Budgeting",
      "experience": 15
    },
    {
      "skill": "Financial Management",
      "experience": 15
    },
    {
      "skill": "Process Improvement",
      "experience": 15
    },
    {
      "skill": "Risk Management",
      "experience": 15
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 90,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Accounting, or related field (Master's preferred)"
    }
  ],
  "salary": 180000
}