{
  "meta": [
    {
      "job_title": "Estimator V",
      "job_category": "Estimating",
      "job_class": "V",
      "sector": "Project Management",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Controls Estimating",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "WBS Estimates",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Unit Cost Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide project controls Estimating support per PC-EU-2004 to the director, manager of projects, project managers, contractors, and other key team members."
    },
    {
      "duty": "Utilize independent estimates to challenge contractor proposals"
    },
    {
      "duty": "Identify project/program scope, schedule, and budget issues early and develop resolutions to ensure the successful execution of projects and programs."
    },
    {
      "duty": "Prepare estimates and cash flows in support of authorization presentations"
    },
    {
      "duty": "Provide historical estimate accuracy report of complete projects and programs and update parametric unit rates as needed"
    },
    {
      "duty": "Prepare standard WBS estimates and assumptions with confidence factors ranging from study to the construction phases of the project."
    },
    {
      "duty": "Provide 24/7 on-call estimating services for emergent projects"
    },
    {
      "duty": "Develop unit cost and parametric estimate range for the standard scope of work."
    },
    {
      "duty": "Review the basis of an estimate during Project Estimate Challenge meetings."
    },
    {
      "duty": "Incorporate project actuals into estimating methodology in order to ensure continuous improvement."
    },
    {
      "duty": "Report project actuals against estimate at project completion"
    },
    {
      "duty": "Work with the project managers to ensure that the estimates are properly challenged and reviewed."
    },
    {
      "duty": "Utilize the current financial management system at each utility"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Estimating, Business, or a related field (Master's preferred)"
    }
  ]
}