{
  "meta": [
    {
      "job_title": "Salesforce Solution Architect",
      "job_category": "Sales",
      "job_class": "Solution Architect",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Salesforce Solution Design",
      "experience": 5
    },
    {
      "skill": "Salesforce Architecture Development",
      "experience": 5
    },
    {
      "skill": "Technical Leadership",
      "experience": 5
    },
    {
      "skill": "Salesforce Customization and Development",
      "experience": 5
    },
    {
      "skill": "Integration Management",
      "experience": 5
    },
    {
      "skill": "Quality Assurance and Testing",
      "experience": 5
    },
    {
      "skill": "Collaboration and Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with business stakeholders to gather and understand their requirements and translate them into comprehensive Salesforce solutions."
    },
    {
      "duty": "Define and document the technical architecture, solution design, and data model using best practices and Salesforce standards."
    },
    {
      "duty": "Provide expert guidance to development teams in implementing complex Salesforce solutions, ensuring adherence to best practices and architectural guidelines."
    },
    {
      "duty": "Oversee and contribute to the customization and development of Salesforce functionalities, using Apex, Visualforce, Lightning Components, and other relevant technologies."
    },
    {
      "duty": "Architect and implement integrations between Salesforce and other systems, both on-premises and cloud-based, using APIs, middleware, and integration platforms."
    },
    {
      "duty": "Define and implement testing strategies, including unit testing, integration testing, and user acceptance testing, to ensure the quality and reliability of solutions."
    },
    {
      "duty": "Work closely with cross-functional teams including business analysts, project managers, developers, and administrators to align solution architecture with business goals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "3+ years of end to end salesforce solutions/implementation"
    }
  ]
}