{
  "meta": [
    {
      "job_title": "Paralegal",
      "job_category": "Legal",
      "job_class": "Paralegal",
      "sector": "Legal",
      "salary": 60000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Obtains, reviews, analyzes, and summarizes legal documentation pertaining to cases."
    },
    {
      "duty": "Schedules depositions and other meetings with clients, witnesses, experts, opposing counsel, court reporters and others."
    },
    {
      "duty": "Identifies, locates and evaluates potential experts and sends expert packages to parties for review."
    },
    {
      "duty": "Tracks requests for documents and regularly follows up on progress of receipt."
    },
    {
      "duty": "Regularly reviews files and proactively works to move cases forward."
    },
    {
      "duty": "Documents files and updates client coordinator when necessary regarding status of case."
    },
    {
      "duty": "Participates in all aspects of trial preparation as required by client coordinator."
    },
    {
      "duty": "Prepares draft documents."
    },
    {
      "duty": "Performs research pertaining to legal issues and precedents related to particular cases."
    },
    {
      "duty": "Performs clerical duties such as typing and filing to the extent required to produce non billable work product or assure proper organization of case files."
    },
    {
      "duty": "Ensures all functions are performed in exact accordance with applicable client guidelines available on the firm Intranet."
    }
  ],
  "skills": [
    {
      "skill": "Litigation",
      "experience": 2
    },
    {
      "skill": "Legal Research",
      "experience": 2
    },
    {
      "skill": "Case Management Systems",
      "experience": 2
    },
    {
      "skill": "Discovery Requests",
      "experience": 2
    },
    {
      "skill": "Client Communication",
      "experience": 2
    },
    {
      "skill": "File Organization",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Paralegal Studies or related field (Certification preferred)"
    }
  ]
}