{
  "meta": [
    {
      "job_title": "Advisor, Supplier Relations",
      "job_category": "Business",
      "job_class": "Advisor",
      "sector": "Business",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Global Procurement",
      "experience": 3
    },
    {
      "skill": "Strategic Sourcing",
      "experience": 3
    },
    {
      "skill": "Negotiation",
      "experience": 3
    },
    {
      "skill": "Program Management",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Excel",
      "experience": 3
    },
    {
      "skill": "Database Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for managing key Manufacturer relationships as their commercial liaison, creating strategies and deployment tactics to optimize sales performance for the preferred manufacturer."
    },
    {
      "duty": "Support supplier selection and negotiation processes, along with executing sourcing activities."
    },
    {
      "duty": "Build strong supplier relationships to support categories that you operate in."
    },
    {
      "duty": "Independently develop new product and supplier options to support overall business strategy and growth for Covetrus Proprietary Brands."
    },
    {
      "duty": "Oversee product and supplier proposals and conduct analyses that support business development activities related to the analyses completed."
    },
    {
      "duty": "Negotiate deals with suppliers and/or product categories to drive profitability, while allowing our sales team a complete, competitive portfolio of product categories to sell and be successful."
    },
    {
      "duty": "Understand and monitor key market trends and cost drivers for categories being supported. Understand strategic value of products in applicable categories and implement appropriate category strategies."
    },
    {
      "duty": "Lead cross-functional efforts to resolve operational issues that arise internally or externally regarding our suppliers."
    },
    {
      "duty": "Support increased collaboration with internal Business Partners including commercial, finance, supply chain, legal to increase efficiency commercial execution through new suppliers, branded product introduction & consolidation, and Covetrus Proprietary Brands."
    },
    {
      "duty": "Execute and or support category strategies using standard processes and professional program management practices."
    },
    {
      "duty": "Ensure value contribution to the business, using key performance indicators to track and report progress."
    },
    {
      "duty": "Support the development, direction, and implementation of new and replacement products & new suppliers, current assortment assessment, expansion and rationalization and product research processes."
    },
    {
      "duty": "Support overall category management efforts including category, product, and manufacturer expansion as needed."
    },
    {
      "duty": "Identify projects that can impact business growth and positive EBITDA impact."
    },
    {
      "duty": "Monitor strategy implementation and contract compliance."
    },
    {
      "duty": "Support supplier business reviews as needed."
    },
    {
      "duty": "Provide regular updates on project performance and impact to business."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 30
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent, preferably in engineering, management or business administration"
    }
  ]
}