{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Leads all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Manages and oversees company staff, subcontractors, suppliers, and programs such as Safety, Quality, and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Develops work plans for subcontractors and self-performed work."
    },
    {
      "duty": "Coordinates and manages the care, custody, and control of the project site."
    },
    {
      "duty": "Attends, manages, and participates in appropriate progress and/or project OAC meetings."
    },
    {
      "duty": "Communicates key project information to owners, design team, governing authorities, subcontractors, suppliers, and other departments."
    },
    {
      "duty": "Supports the project closeouts by supervising pre-punch activities and coordinating activities with the owner, architect, and governing authorities."
    },
    {
      "duty": "Participates with field operations leadership and the project team to put together a project pre plan; implements, monitors, and adjusts as needed throughout the project lifecycle."
    },
    {
      "duty": "Understands and applies the terms and conditions of the owner and subcontractor contracts for the project."
    },
    {
      "duty": "Leads, supports, and promotes a culture of diversity and inclusion within the organization."
    },
    {
      "duty": "Manages the largest, most complex stand-alone and/or multiple complex projects from initial planning to completion."
    },
    {
      "duty": "Provides management and/or oversight to multiple projects and project teams."
    },
    {
      "duty": "Provides input, leads, and executes company and regional key strategic initiatives."
    },
    {
      "duty": "Delivers leadership messages to multiple audiences both internally and externally."
    },
    {
      "duty": "Coordinates field staffing and project changes."
    },
    {
      "duty": "Participates in project buy-out meetings with subcontractors and vendors."
    },
    {
      "duty": "Responsible for identifying and recruiting top talent."
    },
    {
      "duty": "Manages the timecard approval process and ensures reporting of accurate hours and proper cost codes."
    },
    {
      "duty": "Gains understanding of the project pursuit process and methodology."
    },
    {
      "duty": "Participates in the negotiation process with the owner and architect to gain agreement for project changes."
    },
    {
      "duty": "Responsible for document changes and impact on the project schedule."
    },
    {
      "duty": "Leads various meetings including daily stand-up and weekly trade meetings."
    },
    {
      "duty": "Updates drawings, logs, diaries, and inspection notebooks."
    },
    {
      "duty": "Manages material and equipment needs for the project."
    },
    {
      "duty": "Supports the Material and Other Costs (MOC) and Dunn Logistics Service Center (DLSC) procurement and approval processes."
    },
    {
      "duty": "Evaluates progress on self-perform work and makes adjustments as needed."
    },
    {
      "duty": "Manages timecard approval process to ensure reporting of accurate hours and proper cost codes."
    },
    {
      "duty": "Partners with project management to identify schedule and costs associated with project changes."
    },
    {
      "duty": "Participates with the project team in preparation and presentation for all project review meetings, including the monthly review process and other key project meetings."
    },
    {
      "duty": "Understands JE Dunn’s policy of non-discrimination and ensures positive, proactive implementation throughout the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 255,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering, or related field (Preferred). In lieu of the above requirements, equivalent relevant experience will be considered."
    }
  ]
}