{
  "meta": [
    {
      "job_title": "Medicaid Analyst Supervisor",
      "job_category": "Healthcare",
      "job_class": "Supervisor",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Supervises a unit of Medicaid Analysts with responsibility for the maintenance of acceptable standards of assistance."
    },
    {
      "duty": "Ensures strict adherence to all rules and regulations by all personnel in the unit."
    },
    {
      "duty": "Ensures that work production and quality meet state, regional, and national goals established by the respective administrators."
    },
    {
      "duty": "Assists Medicaid Analysts in especially sensitive or difficult applications by advising on procedural issues, policy, and decisions."
    },
    {
      "duty": "Plans and coordinates in-service training for personnel in the unit."
    },
    {
      "duty": "Monitors case development through reviews as directed by agency policy, previous review findings, and quality control findings."
    },
    {
      "duty": "Interprets program policy to subordinates to ensure consistency with federal rules, regulations, and guidelines."
    },
    {
      "duty": "Monitors work flow in the unit including controlling distribution of cases and completing weekly and monthly statistical reports."
    },
    {
      "duty": "Interviews applicants and recipients concerning their rights in relation to fair hearings."
    },
    {
      "duty": "Interviews complainants and investigates possible adjustments."
    },
    {
      "duty": "Responds to requests in accordance with the Privacy Act and the Freedom of Information Act."
    },
    {
      "duty": "Conducts special investigations and studies."
    },
    {
      "duty": "Develops and maintains files for corrective action."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor's degree plus three years of professional social services experience."
    }
  ]
}