{
  "meta": [
    {
      "job_title": "Business Development Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 130000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead evaluation of acquisition, licensing, and partnership opportunities from a US-perspective, in collaboration with US business leaders, Business Development, New Product Planning, and Corporate Strategy."
    },
    {
      "duty": "Develop a framework and process for evaluation of acquisition, licensing, and partnership opportunities."
    },
    {
      "duty": "Maintain a keen understanding of the US-C business and broader US healthcare marketplace."
    },
    {
      "duty": "Create and maintain a 'pitch deck' of US overview and capabilities to showcase to potential partners."
    },
    {
      "duty": "Scout for acquisition, licensing, and partnership opportunities proactively by building constructive partnerships with banks/advisors/investors and keeping a pulse on the opportunity landscape."
    },
    {
      "duty": "Lead the exploration of an internal advisory group, which would include creating a strategy and business case to serve as a US-C project enabler to address strategic consulting needs."
    },
    {
      "duty": "Advise on US-C divisional strategy from a product and portfolio perspective."
    }
  ],
  "skills": [
    {
      "skill": "Strategic Thinking",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Organizational Skills",
      "experience": 10
    },
    {
      "skill": "Financial Acumen",
      "experience": 10
    },
    {
      "skill": "Influencing Without Authority",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Business Development",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelors’ degree requiredMinimum 10 years of relevant work experienceDemonstrated strategic thinking, project management and organizational skillsAbility to ingest and synthesize large amounts of informationStrong executive presence as well as written and verbal communication skills, including story tellingAdvanced PowerPoint skillsFinancial and business acumenAbility to work and collaborate with multiple stakeholders across functionsAbility to be a consistent high-level contributor to multiple projects, processes or functionsExperience influencing without authority"
    }
  ]
}