{
  "meta": [
    {
      "job_title": "Mental Health Therapist",
      "job_category": "Therapist",
      "job_class": "Mental Health",
      "sector": "Healthcare",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cognitive Behavioral Therapy",
      "experience": 3
    },
    {
      "skill": "Crisis Intervention",
      "experience": 3
    },
    {
      "skill": "Clinical Documentation",
      "experience": 3
    },
    {
      "skill": "Suicide Risk Assessment",
      "experience": 3
    },
    {
      "skill": "Telehealth Counseling",
      "experience": 3
    },
    {
      "skill": "Digital Health Integration",
      "experience": 3
    },
    {
      "skill": "Cultural Responsiveness",
      "experience": 3
    },
    {
      "skill": "Tech-Savviness",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide evidence-based care through synchronous live video sessions to adults with a wide range of emotional disorders."
    },
    {
      "duty": "Collaborate with psychiatric providers to support comprehensive treatment and with fellow therapists as part of the growing therapist community."
    },
    {
      "duty": "Utilize automatically administered symptom self-assessments, functional improvement, and goal progress measures to monitor and adjust treatment plans."
    },
    {
      "duty": "Maintain timely clinical documentation through user-friendly, reliable therapist portal that includes digital tools for streamlined documentation."
    },
    {
      "duty": "Receive support and consultation from the Therapy Leadership Team when needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s or doctorate degree in clinical psychology, counseling, or clinical social work from an accredited program."
    },
    {
      "credential": "Independent license in the state where you reside (e.g., LCSW, LMFT, LMHC, LPC) from the USA."
    },
    {
      "credential": "Licensed independently as a Therapist, Counselor, or Psychologist for at least 1 year."
    },
    {
      "credential": "Preferably 2 years of recent experience providing cognitive behavioral therapy and other evidence-based interventions to individual adults struggling with depression, anxiety, and other mental health disorders."
    },
    {
      "credential": "Must be available for at least 9+ hours a week."
    },
    {
      "credential": "Must welcome treating all populations and be committed to delivering culturally responsive care."
    },
    {
      "credential": "Tech-savviness and enthusiasm for integrating digital solutions into clinical practice."
    }
  ]
}