{
  "meta": [
    {
      "job_title": "Financial Analyst I",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Microsoft Excel",
      "experience": 3
    },
    {
      "skill": "PowerBI",
      "experience": 2
    },
    {
      "skill": "SAP",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform financial analysis of business performance looking for trends in facilities spend and performance."
    },
    {
      "duty": "Work collaboratively with cross functional teams to gather data and provide insights in facilities and construction spend analysis."
    },
    {
      "duty": "Develop and produce weekly and monthly scorecard reporting used by Senior Management to drive business performance."
    },
    {
      "duty": "Provide regular financial analysis and presentations of P&L results for leadership team and private equity ownership team."
    },
    {
      "duty": "Provide insights as to the business drivers of changes in Facilities R&M, Capital Expenditures, and New Store Project budgets."
    },
    {
      "duty": "Develop and produce reporting for Field Operations and the facilities team to help identify store level opportunities for improvement with regards to facilities and Capital Projects."
    },
    {
      "duty": "Assist in tracking and highlighting financial performance and investment returns for new stores."
    },
    {
      "duty": "Think critically about Facilities and Construction processes to drive automation, efficiency, accuracy and other improvements."
    },
    {
      "duty": "Complete analyses in support of ad-hoc and strategic projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, or a related field (Master's preferred)"
    }
  ]
}