{
  "meta": [
    {
      "job_title": "Accounts Payable Specialist",
      "job_category": "Finance",
      "job_class": "Specialist",
      "sector": "Accounting",
      "salary": 50000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Process Accounts Payable (AP) and ensure recording of cash disbursement transactions to the general ledger utilizing accounts payable application, AvidXchange"
    },
    {
      "duty": "Manage AvidXchange AP processing inbox and assign invoices to the appropriate department approval workflow; Perform invoice detail research and clear exceptions queue timely"
    },
    {
      "duty": "Manage proper vendor maintenance and ensure vendor information is updated in applicable accounting systems"
    },
    {
      "duty": "Maintain, administer, and troubleshoot accounts payable application "
    },
    {
      "duty": "Prepare and ensure timely filing of annual 1099s for applicable vendors"
    },
    {
      "duty": "Communicate with Internal and external staff regarding AP processing"
    },
    {
      "duty": "Perform month-end close tasks "
    },
    {
      "duty": "Prepare account reconciliations "
    },
    {
      "duty": "Review general ledger activity and calculate monthly accruals, prepayments, and other accounting adjustments"
    },
    {
      "duty": "Create and maintain supporting schedules and analyses for various general ledger accounts"
    },
    {
      "duty": "Prepare and process financial transactions and record monthly journal entries"
    },
    {
      "duty": "Retrieve and review finance related mail and distribute/file appropriately"
    },
    {
      "duty": "Provide Audit support. Prepare and provide supporting documentation and schedules for financial audits and other financial reviews as needed. Assists in GL and TB analyses. Participates in meetings with Audit firm for all parent level audits"
    },
    {
      "duty": "Demonstrate proper document retention and support the development retention policies related to finance and accounting documents"
    },
    {
      "duty": "Provide operational support regarding accounting and finance-related matters to department/program teams"
    },
    {
      "duty": "Assist in the development of departmental policies and procedures."
    },
    {
      "duty": "Identify opportunities to streamline existing processes, focusing upon enhancing efficiencies with the Finance/Accounting team"
    }
  ],
  "skills": [
    {
      "skill": "Accounts Payable Processing",
      "experience": 3
    },
    {
      "skill": "Financial Reporting",
      "experience": 3
    },
    {
      "skill": "Vendor Management",
      "experience": 3
    },
    {
      "skill": "General Ledger Reconciliation",
      "experience": 3
    },
    {
      "skill": "Financial Auditing",
      "experience": 3
    },
    {
      "skill": "Document Retention",
      "experience": 3
    },
    {
      "skill": "Finance Support",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting or related is essential, CPA preferred"
    }
  ]
}