{
  "meta": [
    {
      "job_title": "Dispatcher",
      "job_category": "HVAC/R",
      "job_class": "Dispatcher",
      "sector": "HVAC/R",
      "remote": false,
      "salary": 19.0
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintain Service priorities and job turnaround within SLA guidelines."
    },
    {
      "duty": "Dispatch work orders during business hours for assigned districts."
    },
    {
      "duty": "Maintain Service Standards for Schedule Adherence, NTE Management, IVR Compliance, Client Forms, and Work Order Resolution."
    },
    {
      "duty": "Communicate job progress with Account Managers, advise them on scheduling delays."
    },
    {
      "duty": "Work with Regional Service Manager and Field Supervisors to coordinate proper technician assignments for quoted repairs."
    },
    {
      "duty": "Plan Preventative Maintenance to achieve scheduling requirements within SLA’s."
    },
    {
      "duty": "Ensure timely and accurate delivery of information from the field, including IVR confirmation, relaying completion notes to client and KPI’s for Technicians in system."
    },
    {
      "duty": "Follow up on all return statuses and work with Account Manager to keep job moving."
    },
    {
      "duty": "Work with the Regional Service Manager on any unscheduled truck repairs."
    },
    {
      "duty": "Monitor technician time on jobs and guide them to work more efficiently if they are taking too long."
    },
    {
      "duty": "Assess entire workload and determine manpower for over time and weekend work."
    },
    {
      "duty": "Issue POs to techs in assigned area and schedule all approved quoted repairs within 2 business days of part delivery."
    }
  ],
  "skills": [
    {
      "skill": "Dispatcher Experience",
      "experience": 3
    },
    {
      "skill": "Computer Skills",
      "experience": 5
    },
    {
      "skill": "Multi-tasking",
      "experience": 5
    },
    {
      "skill": "Adaptability",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High school education or GED required; Associates and/or bachelor’s degree preferred."
    }
  ]
}