{
  "meta": [
    {
      "job_title": "Product Marketing Director",
      "job_category": "Marketing",
      "job_class": "Director",
      "sector": "Marketing",
      "salary": 145000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote product lines across multiple brands."
    },
    {
      "duty": "Lead a team of product marketing specialists, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's online presence, optimizing the website and social media channels for maximum engagement and conversions."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase products and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 12
    },
    {
      "skill": "Team Leadership",
      "experience": 12
    },
    {
      "skill": "Market Analysis",
      "experience": 12
    },
    {
      "skill": "Online Presence Management",
      "experience": 12
    },
    {
      "skill": "Event Planning",
      "experience": 12
    },
    {
      "skill": "Data Analysis",
      "experience": 12
    },
    {
      "skill": "Digital Marketing",
      "experience": 12
    },
    {
      "skill": "Communication Skills",
      "experience": 12
    },
    {
      "skill": "Organizational Skills",
      "experience": 12
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in engineering, marketing or related area, and a minimum of 12 years progressive experience working in product marketing, marketing or relevant education and experience, with a minimum of 5 years supervisory/management experience; or combination of relevant education and experience. Master’s Degree in marketing or related area preferred."
    }
  ]
}