{
  "meta": [
    {
      "job_title": "Health Club Attendant",
      "job_category": "Health & Wellness",
      "job_class": "Attendant",
      "sector": "Health & Wellness",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Fitness Industry Experience",
      "experience": 1
    },
    {
      "skill": "Exercise Supervision",
      "experience": 1
    },
    {
      "skill": "CPR Certification",
      "experience": 1
    },
    {
      "skill": "First Aid Certification",
      "experience": 1
    },
    {
      "skill": "AED Certification",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide exercise floor supervision, including warm welcomes, magic moments, and fond farewells by connecting with each Member on the floor."
    },
    {
      "duty": "Clean and maintain all areas of the fitness floor and equipment."
    },
    {
      "duty": "Assist with set up and tear down of other athletic areas including but not limited to the squash courts, racquetball courts, volleyball, and basketball courts."
    },
    {
      "duty": "Constantly monitor Members on the fitness floor and evaluate Member fitness needs, including providing a demonstration of equipment if necessary."
    },
    {
      "duty": "Attend to Members with special needs while working out on the floor."
    },
    {
      "duty": "Connect Members to other Members through ongoing contact with the Members and promotion of Club activities."
    },
    {
      "duty": "Create personalized service for Members, including providing towels and water service while Members are exercising."
    },
    {
      "duty": "Promote the facility amenities, programs, and the Club while maintaining a high level of professionalism and service that aligns with the values, philosophies, and standards of the Club."
    },
    {
      "duty": "Perform close-of-business functions following guidelines and procedures established by the Club."
    },
    {
      "duty": "Responsible for seeing that daily assignments are completed in their respective areas."
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma, or equivalent."
    },
    {
      "credential": "Certification in CPR, First Aid and AED within 6 months."
    }
  ]
}