{
  "meta": [
    {
      "job_title": "Medical Director",
      "job_category": "Medical",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 220000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medical Research",
      "experience": 5
    },
    {
      "skill": "Clinical Trials Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Affairs",
      "experience": 5
    },
    {
      "skill": "Scientific Writing",
      "experience": 5
    },
    {
      "skill": "Clinical Development",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, design, and execute early clinical development and proof-of-concept trials conducted by the Transformational Research Unit (TRU)."
    },
    {
      "duty": "Provide clinical and scientific expertise to the design of studies, writing of protocols, and other study and regulatory-related documents."
    },
    {
      "duty": "Participate in the analysis and interpretation of data, ensure integrity of trial data, and assist in reporting of study results including preparation of scientific summaries, abstracts, and manuscripts."
    },
    {
      "duty": "Ensure compliance with SOPs, ICH, GCP, and other national and international regulatory requirements."
    },
    {
      "duty": "Serve as a leading member, or participant, at multiple internal review groups and utilize novel and creative methods to resolve clinical development problems."
    },
    {
      "duty": "Interface with US/international regulatory authorities, as appropriate, in support of the development objectives for clinical programs and assist Regulatory Strategy staff in the compilation of submissions and in the responses to inquiries."
    },
    {
      "duty": "Leverage medical expertise in clinical specialty and subspecialty areas of training and certification to guide and educate TRU and Global Novo Nordisk organization to emerging advances and innovative opportunities in these therapeutic areas."
    },
    {
      "duty": "Participate in safety review meetings and provide medical monitoring of ongoing clinical trials."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "MD or the international equivalent is required. Specialty and subspecialty training and expertise in indications that are at the core of Novo Nordisk’s therapeutic interests, such as diabetes, obesity, endocrine disease, and/or orphan or rare diseases desired. Strong scientific background with experience in reviewing & interpreting scientific and study data is required. Track record of scientific publications strongly preferred."
    }
  ]
}