{
  "meta": [
    {
      "job_title": "Director of Employee Relations",
      "job_category": "Human Resources",
      "job_class": "Director",
      "sector": "Management",
      "salary": 135000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Employee Relations",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Investigation",
      "experience": 5
    },
    {
      "skill": "Employment Practices",
      "experience": 5
    },
    {
      "skill": "Training Development",
      "experience": 5
    },
    {
      "skill": "Stakeholder Collaboration",
      "experience": 5
    },
    {
      "skill": "HR Service Delivery",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide management oversight for evaluating, directing, and overseeing the Employee Relations Advisor’s performance of core Employee Relations functions."
    },
    {
      "duty": "Design and implement policies, procedures, and best practice processes for conducting and documenting investigations, corrective actions, and training materials to ensure appropriate and consistent implementation in accordance with best practices."
    },
    {
      "duty": "Proactively identify and report on trends impacting organizational risk, employee engagement, and turnover, and recommend policy and practice changes and training to improve trends and effectuate positive change."
    },
    {
      "duty": "Develop training content on employment practices and deliver content as a subject matter expert."
    },
    {
      "duty": "Collaborate with key stakeholders."
    },
    {
      "duty": "Handle individual employee relations matters involving senior management, or other matters as requested by the Vice President of Human Resources or the Chief Human Resources Officer."
    },
    {
      "duty": "Proactively participate in the HR leadership team, be a collaborative partner with the HR Centers of Excellence, and model a transformational approach to HR service delivery."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business, or a related field (Master's preferred)"
    }
  ]
}