{
  "meta": [
    {
      "job_title": "Systems Administrator",
      "job_category": "Information Technology",
      "job_class": "Administrator",
      "sector": "Information Technology",
      "salary": 85000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the deployment, life-cycle maintenance, inventory, monitoring, and support of all IT infrastructure systems including servers, storage devices, and network equipment."
    },
    {
      "duty": "Ensure timely response to all infrastructure tickets, phone calls, and system-generated alerts."
    },
    {
      "duty": "Participate in day-to-day activities as well as project work for the IT infrastructure team."
    },
    {
      "duty": "Execute service continuity, and disaster recovery exercises for all assets within scope."
    },
    {
      "duty": "Collaborate with Service Desk, Cyber Security, and Development teams to ensure security, administration, and support is appropriate and prioritized."
    },
    {
      "duty": "Demonstrate the firm's values of Accountability, Integrity, Excellence, Grit, and Love."
    },
    {
      "duty": "Ensure day to day activities align with established priorities and objectives."
    },
    {
      "duty": "Collaborate with colleagues, building trust-based relationships throughout the firm."
    },
    {
      "duty": "Openly exchange ideas and opinions in addition to listening with consideration."
    },
    {
      "duty": "Resolve conflict utilizing direct and respectful communication."
    },
    {
      "duty": "Hold self and others accountable for their words and actions."
    },
    {
      "duty": "Focus on the root cause of events and the prevention of recurrence."
    },
    {
      "duty": "Embody continuous improvement for all aspects of self and work."
    },
    {
      "duty": "Leverage best practices to allow institutionalized quality of service."
    },
    {
      "duty": "Effectively control through process mapping, system/practice documentation, and monitoring."
    },
    {
      "duty": "Convey a sense of urgency and bias for action."
    },
    {
      "duty": "Convey a sense of urgency and bias for action."
    },
    {
      "duty": "Convey a sense of urgency and bias for action."
    },
    {
      "duty": "Demonstrate expertise in establishing a culture of positive collaboration among cross-functional teams comprised of diverse personalities, skill sets, and levels of experience."
    }
  ],
  "skills": [
    {
      "skill": "Network Administration",
      "experience": 5
    },
    {
      "skill": "System Administration",
      "experience": 5
    },
    {
      "skill": "IT Infrastructure Management",
      "experience": 5
    },
    {
      "skill": "Cyber Security",
      "experience": 5
    },
    {
      "skill": "Virtualization (VMWare & AzureAD)",
      "experience": 5
    },
    {
      "skill": "Microsoft Products (Active Directory, Windows Server, Windows Workstations, SCCM/MECM, SCOM, PowerShell Shell Scripting, AzureAD)",
      "experience": 5
    },
    {
      "skill": "Office 365 Products (Exchange, SharePoint, Teams)",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Incident Management",
      "experience": 5
    },
    {
      "skill": "Continuity Management",
      "experience": 5
    },
    {
      "skill": "Positive Collaboration",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in network administration, system administration, computer science, information technology, cyber security, or equivalent work experience in areas of system/network administration.CCNA certification desired, may be substituted for demonstrated work experience.3+ years of systems and network administration experience."
    }
  ]
}