{
  "meta": [
    {
      "job_title": "Quality Manager",
      "job_category": "Office",
      "job_class": "Manager",
      "sector": "Quality Assurance",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Weld Inspection",
      "experience": 7
    },
    {
      "skill": "Quality Control",
      "experience": 7
    },
    {
      "skill": "NDE",
      "experience": 7
    },
    {
      "skill": "ASNT Certification",
      "experience": 7
    },
    {
      "skill": "ISO Standards",
      "experience": 5
    },
    {
      "skill": "Auditing",
      "experience": 5
    },
    {
      "skill": "Materials and Metallurgy",
      "experience": 5
    },
    {
      "skill": "Technical Consulting",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "MS Office",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Read and interpret blue prints, manuals, and specifications."
    },
    {
      "duty": "Inspect, approve or reject welds according to specifications."
    },
    {
      "duty": "Inspect raw materials."
    },
    {
      "duty": "Provide information regarding processes and specifications to welders, supervisors and other appropriate members."
    },
    {
      "duty": "Test welders for qualifications."
    },
    {
      "duty": "Perform random visual inspections of Civil, Soils activities including Compaction tests, Backfill operations, Soils Analysis and final visual inspections."
    },
    {
      "duty": "QA inspection of in progress construction work activities."
    },
    {
      "duty": "Document any non-conformance or corrective action that has occurred and follow through to end results and NCR closeout."
    },
    {
      "duty": "Attend weekly meetings on active projects and report quality activities."
    },
    {
      "duty": "Review, comment and approve the Sub-Contractors QA manuals and procedures for adherence to the Clients specifications and standards."
    },
    {
      "duty": "Assist with RFI resolution that pertains to welding, quality and NDE issues."
    },
    {
      "duty": "Develop audit schedules and checklists."
    },
    {
      "duty": "Perform routine Quality audits on Sub-Contractors’ works and quality records."
    },
    {
      "duty": "Apply standard quality tools to perform Root Cause Analysis for Corrective and Preventive Actions."
    },
    {
      "duty": "Coordinate all internal and external quality audits."
    },
    {
      "duty": "Provide training of Corporate Quality Management Systems to all employees."
    },
    {
      "duty": "Performa periodic reviews of Quality Management Systems with Senior management to ensure compliance and effectiveness."
    },
    {
      "duty": "Review, maintain and update the Management System Manual to ensure that it is concurrent with corporate policies and guidelines."
    },
    {
      "duty": "Inspect and review WPS, PQR and WQR."
    },
    {
      "duty": "Generate Quality Control Plans (QCPs), Inspection Test Plans (ITPs) and Non-Conformance Reports (NCR's)."
    },
    {
      "duty": "Ensure that all hard copy and electronic databases of quality related documents are initiated and maintained."
    },
    {
      "duty": "Communicate with the project manager, fabrication shops, clients, sub-contractors and other third parties to resolve quality related issues."
    },
    {
      "duty": "Survey and qualify new suppliers and fabricators."
    },
    {
      "duty": "Implement, review and improve the current quality management systems."
    },
    {
      "duty": "Review client specifications and project documents. Provide technical expertise and technical consulting in welding, weld code interpretation, weld procedure development, and weld fabrication methods."
    },
    {
      "duty": "Advise operations and field staff on welding and inspection requirements and provide training sessions as needed."
    },
    {
      "duty": "Assure that the contract obligations for testing and record keeping are adhered to."
    },
    {
      "duty": "Control calibrated measuring and test equipment used in the course of our business. Keep calibration records and ensure that all testing equipment has current calibration records."
    },
    {
      "duty": "Ensure proper turnover of complete quality control package(s). Responsible for ensuring that turnover documentation is maintained, organized and turned over on schedule."
    },
    {
      "duty": "All other duties as normally required by our QA/QC Department, and as required by day-to-day business. "
    },
    {
      "duty": "Perform other duties as assigned by the supervisor as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED preferred. AWS Certified Weld Inspector (CWI) required. Current ASNT certification in PT, UT, MT, and/or RT with Level II certification preferred"
    }
  ]
}