{
  "meta": [
    {
      "job_title": "Petroleum Field Service Technician",
      "job_category": "Maintenance",
      "job_class": "Technician",
      "sector": "Energy",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Fueling Equipment Maintenance",
      "experience": 3
    },
    {
      "skill": "Electrical Troubleshooting",
      "experience": 3
    },
    {
      "skill": "Point of Sale Systems",
      "experience": 3
    },
    {
      "skill": "Mechanical Aptitude",
      "experience": 5
    },
    {
      "skill": "IT/Retail Point of Sale",
      "experience": 3
    },
    {
      "skill": "Hydraulic Systems",
      "experience": 3
    },
    {
      "skill": "Equipment Repair",
      "experience": 3
    },
    {
      "skill": "Driving and Operating Machinery",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintaining fueling equipment, Point of Sale systems, and related equipment at convenience stores and service stations."
    },
    {
      "duty": "Performing installation, preventive maintenance, troubleshooting, and repair of fueling equipment, including dispensers, POS and controllers, tank monitors, USTs and related piping and controls, hydraulic systems, and sumps."
    },
    {
      "duty": "Obtaining and maintaining Verifone (VASC) certification (company will provide paid training)."
    },
    {
      "duty": "Operating a company vehicle and providing shared call and coverage for after-hours emergencies (approximately one week per month)."
    },
    {
      "duty": "Assisting with winter plowing and snow removal, renovation and construction projects, and performing initial assessments of issues with building and grounds."
    },
    {
      "duty": "Conducting monthly safety and preventive maintenance audits, and assisting outside tradespeople, contractors, and inspectors with accessing the building and providing necessary information."
    },
    {
      "duty": "Assisting with tank replacements and general renovations, and performing additional tasks as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Background in electrical, mechanical, and/or IT/retail point of sale is strongly preferred."
    },
    {
      "credential": "Additional construction and/or commercial building maintenance experience is helpful."
    },
    {
      "credential": "Valid driver's license and the ability to operate a work truck, hand tools, and machinery is required."
    }
  ]
}