{
  "meta": [
    {
      "job_title": "Senior Director Business Operations",
      "job_category": "Operations",
      "job_class": "Director",
      "sector": "Management",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Direct and oversee health insurance operations programs in multiple service areas including billing and enrollments, call center, customer service, etc."
    },
    {
      "duty": "Manage service levels, identify service opportunities, new business implementations, and product expansions."
    },
    {
      "duty": "Develop and monitor service levels to ensure compliance with state, federal, and company metrics and standards."
    },
    {
      "duty": "Direct the identification, development, and implementation programs centered on quality and operations excellence."
    },
    {
      "duty": "Initiate ongoing and special projects including process improvement evaluations and analysis, department business development, ROI analysis, and annual satisfaction initiatives."
    },
    {
      "duty": "Direct all membership-related initiatives including identification of business need, strategy recommendation, project outline, management of deliverables, and ROI."
    },
    {
      "duty": "Work collaboratively to facilitate the design, development, and implementation of policies, procedures, and practices related to service operations."
    },
    {
      "duty": "Establish and maintain working relationships with external sources such as CMS for regulatory and compliance guidance."
    },
    {
      "duty": "Develop and maintain collaborative relationships with health plans, other business units, IT partners, and oversee training and business processes as necessary."
    },
    {
      "duty": "Direct and oversee the continuous improvement of multiple systems for critical operations to enable business objectives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business or related field or equivalent experience. 10+ years of business operations and systems integration experience for call center, enrollment, billing, payment processing, or similar operations applications. Previous management experience including responsibilities for hiring, training, assigning work, and managing performance of staff."
    }
  ]
}