{
  "meta": [
    {
      "job_title": "Diamond Grader",
      "job_category": "Quality Control",
      "job_class": "Grader",
      "sector": "Quality Control",
      "salary": 72500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Diamond Grading",
      "experience": 3
    },
    {
      "skill": "Colored Stone Grading",
      "experience": 2
    },
    {
      "skill": "Excel",
      "experience": 3
    },
    {
      "skill": "Microsoft Word",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Inventory Control",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Grading, evaluating and plotting certified stones (colored stones & diamonds) that are either under consideration for purchase or on stones that are in existing inventory/ product."
    },
    {
      "duty": "Grading and sorting melee diamonds according to MM size, color, clarity requirements."
    },
    {
      "duty": "Inspecting diamonds in finished jewelry and loose layouts for non-HW quality diamonds or for damaged stones in an effort to maintain HW quality standards and in order to guarantee consistency and integrity of our product."
    },
    {
      "duty": "Communicating with the Director and Gemstone Buyer on supplier rejection rates and reasons."
    },
    {
      "duty": "Responsible for ensuring that all Inventory Control requirements are being met throughout the grading/selecting and stocking processes."
    },
    {
      "duty": "Reviewing loose diamonds returned from the manufacturing process to ensure HW diamond standards are still in effect."
    },
    {
      "duty": "Evaluating Jewelry designs/renderings by estimating the size of diamonds needed and calculating estimated costs associated with manufacturing the specific piece."
    },
    {
      "duty": "Assisting the Director- Gemstone Purchasing on special projects, as warranted."
    },
    {
      "duty": "Filling work orders, as needed, by selecting diamonds that adhere to our strict quality and matching standards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "G.G. degree"
    }
  ]
}