{
  "meta": [
    {
      "job_title": "iCIMS Talent Cloud Platform Implementation Specialist",
      "job_category": "Information Technology",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 57000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Customer Success",
      "experience": 3
    },
    {
      "skill": "Software Implementation",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Customer Training",
      "experience": 3
    },
    {
      "skill": "Technical Support",
      "experience": 3
    },
    {
      "skill": "System Integration",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Client Communication",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the implementation process of iCIMS Talent Cloud platform for new and existing customers, ensuring the complete solution is delivered on time."
    },
    {
      "duty": "Configure customer's instance of the product based on the information gathered during the sales and requirements gathering process, ensuring alignment with customer goals."
    },
    {
      "duty": "Support the customer go-live process by configuring the platform, facilitating training sessions, and providing standard processes for adoption."
    },
    {
      "duty": "Solve issues through final resolution during customer launch and through the hypercare period, ensuring customer satisfaction."
    },
    {
      "duty": "Support a seamless handoff to the appropriate account team(s) after the hypercare period."
    },
    {
      "duty": "Become an iCIMS certified technical expert in all related products."
    },
    {
      "duty": "Ensure overall customer success including an effective sales handoff, project planning, status reporting, multi-functional accountability, and customer training through best practice consultation."
    },
    {
      "duty": "Explain system-to-system integrations and conduct software training sessions to help customers synthesize complex technical information and user adoption."
    },
    {
      "duty": "Support customers in researching business processes, diagnosing and resolving on-demand (web-based) software issues."
    },
    {
      "duty": "Prioritize competing requests from customers, partnering internally with key collaborators to ensure success."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 100,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Technology, Computer Science, or a related field (Master's preferred)"
    },
    {
      "credential": "PMP certification"
    },
    {
      "credential": "Customer Success related certifications"
    }
  ]
}