{
  "meta": [
    {
      "job_title": "Leave Specialist",
      "job_category": "HR",
      "job_class": "Specialist",
      "sector": "HR",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the day-to-day oversight of the leave of absence and disability related process."
    },
    {
      "duty": "Prepares internal & external communications regarding leave of absences and disability programs."
    },
    {
      "duty": "Serves as a point of contact to staff and leadership on matters related to leave of absence, and disability."
    },
    {
      "duty": "Interprets and applies leave-related policies and government regulations."
    },
    {
      "duty": "Provides input and recommendations for changes in human resource policies and procedures."
    },
    {
      "duty": "Oversees leave of absence and disability related programs. Ensures compliance with all government regulations, including ADA and FMLA, and ensures program objectives are in line with the overall goals of the organization. Seeks to minimize financial costs by partnering with Occupational Health to facilitate accommodations and return to work for disabled employees."
    },
    {
      "duty": "Updates and maintains the HR Systems of Record with all information pertaining to an employee's leave."
    },
    {
      "duty": "Designs and delivers training to both leadership and employees on human resource policies and programs."
    }
  ],
  "skills": [
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "HR Policy and Procedure Knowledge",
      "experience": 5
    },
    {
      "skill": "Program Evaluation",
      "experience": 5
    },
    {
      "skill": "ADA and FMLA Knowledge",
      "experience": 5
    },
    {
      "skill": "Occupational Health Partnership",
      "experience": 5
    },
    {
      "skill": "HR Systems Management",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "Associate’s degree in Human Resources, Business Administration or related field"
    }
  ]
}