{
  "meta": [
    {
      "job_title": "Clinical Research Associate",
      "job_category": "Research",
      "job_class": "Associate",
      "sector": "Research",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "CRA Monitoring",
      "experience": 5
    },
    {
      "skill": "Site Management",
      "experience": 5
    },
    {
      "skill": "Clinical Data Management",
      "experience": 5
    },
    {
      "skill": "Compliance (ICH GCP)",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Study Metrics Reporting",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform site management and monitoring activities associated with clinical studies across various phases."
    },
    {
      "duty": "Develop and update study-related trackers and monitoring tools as requested."
    },
    {
      "duty": "Assist in the assessment of CRAs and provide support to Clinical Operations."
    },
    {
      "duty": "Co-monitor with other CRAs and assist in assessing CRA performance."
    },
    {
      "duty": "Provide additional support to Clinical Operations staff and participate in department initiatives."
    },
    {
      "duty": "Review and ensure adherence to ICH GCP, local regulatory requirements, and protocol procedures."
    },
    {
      "duty": "Establish and maintain a good working relationship with site staff and assist with timely data entry and query resolution."
    },
    {
      "duty": "Assist in updating study metrics, compiling status reports, and training of CRAs."
    },
    {
      "duty": "Participate in study team meetings, and lead CRA meetings if required."
    },
    {
      "duty": "Provide additional training to site staff and assist in vendor issues as they arise."
    },
    {
      "duty": "Liaise with Data Management during all stages of a study to assist with query resolution as required."
    },
    {
      "duty": "Verify investigator maintenance of study documentation, source documentation, drug accountability, and safety reporting."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in science, medical health, or related discipline or equivalent relevant experience"
    }
  ]
}