{
  "meta": [
    {
      "job_title": "Vehicle Integration Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Process product level requirements and pull together respective engineering teams to decompose into components, interfaces, dynamic behaviors, and resource consumption targets."
    },
    {
      "duty": "Support and review software and hardware design, implementation, and test cases"
    },
    {
      "duty": "Identify, document and highlight cross-functional gaps and dependencies - proactively work towards creative solutions to resolve integration issues and ensure vehicle functionality"
    },
    {
      "duty": "Work with test and integration engineers to ensure full test coverage is defined and implemented for software feature implementations."
    },
    {
      "duty": "Develop and execute vehicle integration plans, pulling together relevant sub-system components while keeping track of overall program milestones and delivery objectives"
    },
    {
      "duty": "Deep-dive into vehicle log data and source code if required to root-cause system-level issues and facilitate rapid issue resolution in collaboration with domain experts. Post root cause analysis, suggest changes to upstream processes and subsystems, including diagnostics and other tools"
    },
    {
      "duty": "Work across the company to contribute to a cohesive variant management strategy that operates efficiently, including but not limited to software build configurations and upgrade capabilities."
    }
  ],
  "skills": [
    {
      "skill": "Engineering",
      "experience": 5
    },
    {
      "skill": "Debugging",
      "experience": 5
    },
    {
      "skill": "Datalog Tools",
      "experience": 5
    },
    {
      "skill": "Automotive Hardware and Software",
      "experience": 5
    },
    {
      "skill": "Vehicle Safety Concepts",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ]
}