{
  "meta": [
    {
      "job_title": "Analyst, Conflicts Management",
      "job_category": "Management",
      "job_class": "Analyst",
      "sector": "Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Conflict Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Decision Making",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide all aspects of support to the Firm, Partners, and offices regarding conflicts management."
    },
    {
      "duty": "Assist and review all information submitted on Conflicts Management Requests (CMR) for accuracy and completeness, ensuring that all required information has been provided and is accurate."
    },
    {
      "duty": "Identify and analyze all potential conflicts of interest and propose concise resolutions to Firm Attorneys to clear these conflicts per professional responsibility obligations and Firm policy."
    },
    {
      "duty": "Advance the clearance of conflicts of interest by directly communicating with Firm Partners."
    },
    {
      "duty": "Obtain waiver letters from Partners and clients when made necessary by jurisdictional guidelines, to facilitate New Business Intake (NBI) while protecting client relationships and the Firm's business interests."
    },
    {
      "duty": "Maintain detailed records on all aspects of the conflicts management process for internal documentation and audit purposes."
    },
    {
      "duty": "Adhere to all Firm policies regarding conflicts of interest and escalate issues to Management and the Director of Responsibility, when appropriate."
    },
    {
      "duty": "Process CMRs within the agreed Service Level Agreement."
    },
    {
      "duty": "Engage and collaborate with team members through the presentation of ideas and recommendations regarding best practice, continuous improvement, departmental processes, policies, and procedures."
    },
    {
      "duty": "Provide support and assistance on important team projects and initiatives, when required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree or work experience in this field."
    }
  ]
}