{
  "meta": [
    {
      "job_title": "Recruiter",
      "job_category": "Human Resources",
      "job_class": "Recruiter",
      "sector": "HR",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Recruitment",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Marketing",
      "experience": 2
    },
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Customer Relations",
      "experience": 3
    },
    {
      "skill": "Interviewing",
      "experience": 3
    },
    {
      "skill": "Strategic Planning",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Negotiation",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage full recruitment life cycle from discovery meetings, research, sourcing, interviews, project management to offer negotiation and closing deals."
    },
    {
      "duty": "Participate in Discovery Meetings with customers to understand assignments requirements."
    },
    {
      "duty": "Manage all sourcing activities and talent pipelines using various channels in order to fulfill client assignments."
    },
    {
      "duty": "Design job descriptions and interview questions per assignments prerequisites."
    },
    {
      "duty": "Establish candidates’ credentials and fit for the role by conducting interviews, analyzing responses and comparing qualifications."
    },
    {
      "duty": "Document interactions, outreach, and screening results; present shortlist of candidates in a timely manner."
    },
    {
      "duty": "Build strong relationships with clients, identify their recruiting needs and wants and encourage customer feedback."
    },
    {
      "duty": "Develop effective working relationships with colleagues and clients."
    },
    {
      "duty": "Create a healthy and motivating work environment and atmosphere, listen to team members’ feedback."
    },
    {
      "duty": "Offer honest feedback to Operations Excellence Manager to streamline the recruiting process."
    },
    {
      "duty": "Identify opportunities to improve performance, develop initiatives, and roll-out solutions."
    },
    {
      "duty": "Coordinate interviews, candidate screening and evaluation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business, or a related field (Master's preferred)"
    },
    {
      "credential": "Certification in Recruitment or HR (e.g. PHR, SHRM-CP)"
    }
  ]
}