{
  "meta": [
    {
      "job_title": "Warehouse Manager",
      "job_category": "Warehouse Management",
      "job_class": "Manager",
      "sector": "Logistics",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Operations Management",
      "experience": 5
    },
    {
      "skill": "Warehouse Logistics",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Warehouse Operations",
      "experience": 5
    },
    {
      "skill": "Scheduling",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Retail Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage a 5-10k sq ft distribution center and the local warehouse operating team."
    },
    {
      "duty": "Recruit, lead, coach & retain a high-performing team of Shift Leads (3+) and Operations Associates (6+)."
    },
    {
      "duty": "Responsible for ensuring high quality and maintaining key quality metrics including order accuracy and fulfillment speed."
    },
    {
      "duty": "Own the day-to-day operations of the DashMart warehouse, ensuring the site processes run smoothly, efficiently and safely."
    },
    {
      "duty": "Use data to identify pain-points or areas of inefficiency within the warehouse and current processes. Design, build and execute process improvement projects."
    },
    {
      "duty": "Work cross-functionally with central teams including inventory and training teams to provide the team with the tools and resources to achieve quality and operational goals."
    },
    {
      "duty": "Own scheduling and be responsible for managing a labor budget."
    },
    {
      "duty": "Use data to identify pain-points or areas of inefficiency within the warehouse and current processes. Design, build and execute process improvement projects."
    },
    {
      "duty": "Use data to identify pain-points or areas of inefficiency within the warehouse and current processes."
    },
    {
      "duty": "Work cross-functionally with central teams including inventory and training teams to provide the team with the tools and resources to achieve this goal."
    },
    {
      "duty": "Use data to identify pain-points or areas of inefficiency within our warehouse and current processes."
    },
    {
      "duty": "Design, build and execute process improvement projects to improve warehouse operations, quality metrics, and the employee experience."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Operations, Warehouse Logistics, Retail Management, Fulfillment, or related field (Master's preferred)"
    }
  ]
}