{
  "meta": [
    {
      "job_title": "Production Supervisor",
      "job_category": "Manufacturing",
      "job_class": "Supervisor",
      "sector": "Manufacturing",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise and organize staff to optimize production processes and minimize costs."
    },
    {
      "duty": "Maintain a safe and clean work environment by educating and directing personnel on the use of all PPE, tools, equipment, and resources."
    },
    {
      "duty": "Establish and enforce organizational quality standards to maintain quality service."
    },
    {
      "duty": "Communicate job expectations, plan, monitor, and appraise job results, coach, counsel, and discipline employees."
    },
    {
      "duty": "Monitor steps of the production process, observe process metrics, control points, and equipment, and implementing cost reductions."
    },
    {
      "duty": "Schedule and assign parts, machines, and personnel, and report results of the processing flow on shift production summaries."
    },
    {
      "duty": "Call for repairs, evaluate new equipment and techniques to ensure operation of equipment."
    },
    {
      "duty": "Compile, initiate, sort, and analyze production performance records and data, and respond to requests for manufacturing information."
    },
    {
      "duty": "Resolve personnel problems by analyzing data, investigating issues, identifying solutions, and recommending actions."
    },
    {
      "duty": "Supervise, motivate, and evaluate staff to reach goals and document inventory transactions."
    },
    {
      "duty": "Oversee warehousing, shipping, receiving, and handling of materials, and supervise transport of materials to and from departments."
    },
    {
      "duty": "Ensure material needs are met throughout the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ]
}