{
  "meta": [
    {
      "job_title": "Environmental Services Technician",
      "job_category": "Environmental Services",
      "job_class": "Technician",
      "sector": "Hospitality",
      "salary": 22000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Cleaning Performs cleaning procedures in patient care areas, ancillary departments, and public areas. Knowledge and methods used in current position assigned. Demonstrates ability to follow specific procedures as indicated."
    },
    {
      "duty": "Customer service Displays good Guest Relation skills by maintaining courteous, considerate relations with the medical staff, fellow employees, clients, visitors, and etc. Conforms to hospital dress code. Demonstrates team spirit towards accomplishment of goals. Displays a positive attitude."
    },
    {
      "duty": "Demonstrates flexibility and adaptability Accepts department schedules, work assignment, and procedures. Adheres to sick leave policy, punctuality, tardiness, and hospital policies. Possesses flexibility, and adaptation to modified work schedules. Begins/ends shifts according to posted schedule."
    },
    {
      "duty": "Department safety Keen awareness of surroundings, completes work order forms for repairs. Follows through to ensure correction of noted repairs."
    },
    {
      "duty": "Emergency preparedness Demonstrates knowledge and participates in hospital wide Emergency Emergency Preparedness Plans, Safety Policies, and Hazardous Material Procedures. Observes all policies and procedures. Remains in compliance with regulatory agencies. Attends yearly inservice."
    },
    {
      "duty": "Equipment maintenance Operates and maintains department equipment for better efficiency, safety, cost reduction, and quality. Properly handles equipment to avoid damage to hospital property. Checks equipment for frayed cords, changes filters, keep equipment clean. Removes out-of-service equipment from service."
    },
    {
      "duty": "Other duties as assigned Prioritizes work, uses time efficiently, and demonstrates initiative. Organizes resources to complete assigned tasks. Completes work assignment within expected time frame. Responds to overhead paging/beeper within five minutes."
    },
    {
      "duty": "Performs general cleaning duties Familization with procedures and application of procedures. Documents linen usage and floor care performance. Fills Clean Linen closet according to inventory listing. Empties Soiled Linen two times a day or when needed. Uses Universal Cleaning Procedures daily. Removal of trash/bio-hazard waste according to procedures."
    }
  ],
  "skills": [
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Hospitality Industry Experience",
      "experience": 1
    },
    {
      "skill": "Cleaning Procedures",
      "experience": 1
    },
    {
      "skill": "Adaptability",
      "experience": 1
    }
  ]
}