{
  "meta": [
    {
      "job_title": "Environmental Consultant",
      "job_category": "Environmental Consulting",
      "job_class": "Professional",
      "sector": "Environmental Engineering",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Environmental Remediation",
      "experience": 5
    },
    {
      "skill": "Groundwater Treatment",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Environmental Regulations",
      "experience": 5
    },
    {
      "skill": "Client Interface",
      "experience": 5
    },
    {
      "skill": "Site Management",
      "experience": 5
    },
    {
      "skill": "Technical Submissions",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Strong Communication",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct environmental assessments and remediation projects, ensuring compliance with federal and state regulations."
    },
    {
      "duty": "Manage groundwater treatment services and oversee construction activities for environmental projects."
    },
    {
      "duty": "Interact with regulatory agencies to ensure adherence to environmental regulations and permit requirements."
    },
    {
      "duty": "Prepare and submit technical reports, proposals, and documents for environmental projects."
    },
    {
      "duty": "Collaborate with project teams, provide strong communication, and interface with clients to ensure project success."
    },
    {
      "duty": "Provide hands-on site management and investigation for environmental projects, ensuring safety and compliance."
    },
    {
      "duty": "Utilize project management skills to lead and supervise environmental project teams effectively."
    },
    {
      "duty": "Demonstrate a strong understanding of environmental regulations, including RCRA, CERCLA, and HSCA."
    },
    {
      "duty": "Communicate effectively with clients, regulatory agencies, and project stakeholders to ensure project success."
    },
    {
      "duty": "Work independently and in a supervisory capacity to oversee all aspects of environmental projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Environmental or Civil Engineering (Professional Engineer license required)"
    }
  ]
}