{
  "meta": [
    {
      "job_title": "Research Director for Medical Education",
      "job_category": "Education",
      "job_class": "Research Director",
      "sector": "Medical Education",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Principal Investigator",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 5
    },
    {
      "skill": "Data Collection Platforms",
      "experience": 5
    },
    {
      "skill": "Published Manuscripts",
      "experience": 5
    },
    {
      "skill": "Mentoring Learners",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Programs",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create an environment that motivates, educates, supports, and provides necessary resources to optimize research and scholarly output of College of Medicine learners."
    },
    {
      "duty": "Facilitate improvements in the research approval process."
    },
    {
      "duty": "Serve as a liaison between College of Medicine and hospital partners to facilitate clinical and medical education research."
    },
    {
      "duty": "Offer instruction and curriculum development of research and statistics courses and/or lessons, including content development."
    },
    {
      "duty": "Develop resources to provide research education to the College of Medicine community."
    },
    {
      "duty": "Assist the College of Medicine in the support of Undergraduate and Graduate Medical Education programs through mentoring and instruction."
    },
    {
      "duty": "Facilitate communication between hospitals’ Research Committees and College of Medicine learners and assist with the necessary processes."
    },
    {
      "duty": "Deliver lecture series for Graduate Medical Education learners spanning from basics of research through more complex topics in research including statistics."
    },
    {
      "duty": "Develop, direct, and organize College of Medicine-wide Research and Scholarship Day(s) in collaboration with Student Affairs and Staff."
    },
    {
      "duty": "Conduct research in the area of interest and mentor and involve learners in personal research."
    },
    {
      "duty": "Collaborate with faculty in the College of Medicine on conducting and assisting with research projects."
    },
    {
      "duty": "Represent the College of Medicine to advance clinical and medical education research."
    },
    {
      "duty": "Serve in additional roles as determined by the Assistant Dean for Clinical Research to further support research and scholarly pursuit for learners and the College of Medicine’s strategic goals."
    },
    {
      "duty": "Participate in the College of Medicine Research and Scholarship Committee as an appointed member based on job responsibilities as the Research Director for Medical Education."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 180,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "PhD, MD, or DO degree (Medical Degree Preferred)"
    }
  ]
}