{
  "meta": [
    {
      "job_title": "Operations Team Lead",
      "job_category": "Operations",
      "job_class": "Lead",
      "sector": "Management",
      "salary": 45000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform the operational process and support operations functions related to inventory control such as accepting truck manifests, returns to vendor, transfers, mail outs/delivery, store supplies ordering and model best practices."
    },
    {
      "duty": "Plan ahead and properly prep receiving area for expected merchandise."
    },
    {
      "duty": "Assign associate roles during the receiving (unload and sort), merchandise processing/prepping, and stocking process and ensure that they completely understand each of their functions."
    },
    {
      "duty": "Maintain the cleanliness and organizational standards for the receiving area and stockroom."
    },
    {
      "duty": "Develop and work from a daily prioritized workload plan."
    },
    {
      "duty": "Process transfers, returns to vendors (RTV), damages, and mark out of stock (MOS) merchandise in partnership with Asset Protection."
    },
    {
      "duty": "Lead the maintenance tasks including light bulb replacement, ceiling tile replacement and replacing sales floor and maintenance supplies."
    },
    {
      "duty": "Bail cardboard and prepare plastic for recycling."
    },
    {
      "duty": "Ensure the cleanliness of the sales floor and the receiving area following processing on truck days."
    },
    {
      "duty": "Maintain a safe shopping and working environment."
    },
    {
      "duty": "Support the Omni functions in the store including picking, packing, and shipping customer orders."
    },
    {
      "duty": "Open and close the store, including weekends."
    },
    {
      "duty": "Approve select point of sale transactions such as returns and voids."
    },
    {
      "duty": "Resolve customer service issues as needed."
    },
    {
      "duty": "Understand and be able to use all building operating systems."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED equivalent"
    }
  ]
}