{
  "meta": [
    {
      "job_title": "Esthetician",
      "job_category": "Beauty",
      "job_class": "Specialist",
      "sector": "Beauty",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Greet and welcome guests in the warmest manner."
    },
    {
      "duty": "Provide assistance to the guests at all times."
    },
    {
      "duty": "Communicate with the guest in a clear and professional manner."
    },
    {
      "duty": "Perform all treatments and services as required by the standards of the Spa/hotel."
    },
    {
      "duty": "Explain facial treatments and products used, which include techniques and benefits."
    },
    {
      "duty": "Knowledgeable on all spa products used including ingredients, contraindications, and benefits."
    },
    {
      "duty": "Provide a guest with a prescription card, which lays out the products recommended for purchase and how to use at home."
    },
    {
      "duty": "Handle opening and closing procedures."
    },
    {
      "duty": "Set up, stock linen and products, clean treatment rooms, and dispensary daily."
    },
    {
      "duty": "Disinfect and sanitize equipment & implements after each use."
    },
    {
      "duty": "Follow the cosmetology rules and regulations."
    },
    {
      "duty": "Report to Spa Manager any guest skin reactions or guest concerns."
    },
    {
      "duty": "Clean the spa daily or as needed."
    },
    {
      "duty": "Read and update the daily logbook and communicate relevant information."
    },
    {
      "duty": "Maintain a safe, sanitary, and professional work area."
    },
    {
      "duty": "Attend meetings and training as requested."
    },
    {
      "duty": "Promote all treatments and products offered in the spa and salon."
    },
    {
      "duty": "Requisition supplies or place orders accordingly."
    },
    {
      "duty": "Utilize the phone according to the Post Oak standards."
    },
    {
      "duty": "Respond properly in any hotel emergency or safety situation."
    },
    {
      "duty": "Perform other tasks or projects as assigned by hotel management."
    },
    {
      "duty": "Understand and be fully versed on The Post Oak standards, procedures, and guest confidentiality."
    },
    {
      "duty": "Be certified in CPR (Cardiopulmonary Resuscitation)."
    },
    {
      "duty": "Work flexible days/hours as needed based on the business demands of the spa/hotel."
    },
    {
      "duty": "Good speech and hearing required to handle phones and communicate with the guest."
    },
    {
      "duty": "Standing, walking, bending, squatting, kneeling, and half kneeling for cleaning. Lifting and carrying towels, carrying gallon container of product. Overhead reaching."
    }
  ],
  "skills": [
    {
      "skill": "Skin Care",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Sanitation and Safety Standards",
      "experience": 5
    },
    {
      "skill": "Spa Procedure Knowledge",
      "experience": 5
    }
  ]
}