{
  "meta": [
    {
      "job_title": "Supply Planner",
      "job_category": "Supply Chain",
      "job_class": "Planner",
      "sector": "Supply Chain",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Forecasting",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Procurement",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and manage the rolling supply plan based on the latest demand plan, inventory levels, supply chain, and sourcing variables."
    },
    {
      "duty": "Issue and manage production orders and inventory deployment with established contract manufacturers for finished goods, promotional display materials, and WIP. Prioritize orders for new launch, promotional, and major skus."
    },
    {
      "duty": "Manage contractor invoicing and billing ensuring validity."
    },
    {
      "duty": "Communicate to key stakeholders potential risks to the supply plan."
    },
    {
      "duty": "Work with all cross-functional teams including demand planning, marketing, sales, R&D, and contract manufacturers to ensure alignment with new product development timing, capacity planning, and replenishment orders."
    },
    {
      "duty": "Monitor aggregate inventory units and COGS at Case and pallet locations for capacity planning. Monitor the validity of 3PL inventory and ameliorate with 3PL as needed."
    },
    {
      "duty": "Provide a monthly production plan by Product Line in units and cost of goods for incorporating into the monthly S&OP Management review. Include status reports on new launch and promotional programs. Include the latest Excess and Obsolete summary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in supply chain management, finance, or business-related field. Master's degree a plus."
    }
  ]
}