{
  "meta": [
    {
      "job_title": "Resort Manager",
      "job_category": "Hospitality",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Operations Management",
      "experience": 4
    },
    {
      "skill": "Financial Analysis",
      "experience": 4
    },
    {
      "skill": "Employee Training",
      "experience": 4
    },
    {
      "skill": "Marketing",
      "experience": 3
    },
    {
      "skill": "Sales Performance",
      "experience": 3
    },
    {
      "skill": "Staff Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leading the resort team through daily operations by maintaining standards of conduct, cleanliness, and safety."
    },
    {
      "duty": "Managing resort staffing by creating schedules, communicating staffing needs, interviewing and hiring, and terminating when necessary."
    },
    {
      "duty": "Training and coaching resort team members based on company standards, policies, and guidelines; recognizing talented team members and developing them for growth in the company."
    },
    {
      "duty": "Keeping a high-level of communication through resort, regional, and corporate teams regarding resort operations and partnering with regional maintenance crew on any building issues."
    },
    {
      "duty": "Maintaining excellent customer service metrics such as NPS (Net Promoter Score) and reviews on Google and social media."
    },
    {
      "duty": "Utilizing financial tools and analyzing financial reports to identify and address trends and issues in sales and performance."
    },
    {
      "duty": "Managing labor cost, payroll, and appropriate inventory of supplies."
    },
    {
      "duty": "Organizing and maintaining policies and procedures for both back-of-house and front-of-house operations."
    },
    {
      "duty": "Responsible for assisting new and current team members in completing their required courses and training guides, while providing ongoing coaching for development."
    },
    {
      "duty": "Preparing and delivering annual performance reviews to team members on a timely basis."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Associate’s degree or equivalent from two-year college or technical school; or minimum two years related experience with strong training skills. Previous experience in animal care or other related field preferred. Prior management experience in retail, restaurant, hospitality operations or similar. Basic skills with common computer software, including Microsoft Office Suite."
    }
  ]
}