{
  "meta": [
    {
      "job_title": "Health and Safety Specialist",
      "job_category": "Safety",
      "job_class": "Specialist",
      "sector": "Chemical",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety Regulations",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Safety Program Management",
      "experience": 5
    },
    {
      "skill": "OSHA Standards",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Safety Data Analysis",
      "experience": 5
    },
    {
      "skill": "Human and Organizational Performance",
      "experience": 5
    },
    {
      "skill": "Safety Culture Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Partner with operations, maintenance, and construction services to achieve a shared vision for safety, identify opportunities, and develop improvement strategies."
    },
    {
      "duty": "Lead the application of OSHA standards and industry best practices, integrating them into the organization through management system ownership, routine interactions, and auditing."
    },
    {
      "duty": "Analyze safety data, metrics, and trends to identify areas for improvement and collaborate to prevent incidents and injuries."
    },
    {
      "duty": "Own safety-related programs, ensuring alignment with regulations and requirements, implementing the plan, do, check, adjust mindset with involvement from those closest to the work."
    },
    {
      "duty": "Develop and deliver safety programs to enhance employees' awareness and understanding of Human and Organization Performance (HOP) and other safety-related content."
    },
    {
      "duty": "Utilize human and organizational performance principles and tools to assess and improve safety culture, identify organizational weaknesses, and develop strategies for continuous system improvement."
    },
    {
      "duty": "Foster a proactive safety culture by promoting Human and Organization Performance, employee engagement, participation in safety programs, and recognition of safety achievements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or higher in safety, engineering, or related technical discipline (Master's preferred)"
    },
    {
      "credential": "ASP/CSP Certification"
    },
    {
      "credential": "Supervisory Experience"
    }
  ]
}