{
  "meta": [
    {
      "job_title": "Medical Biller",
      "job_category": "Healthcare",
      "job_class": "Biller",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Medical Billing",
      "experience": 3
    },
    {
      "skill": "Healthcare Regulations",
      "experience": 3
    },
    {
      "skill": "Health Insurance Knowledge",
      "experience": 3
    },
    {
      "skill": "Electronic Medical Record (EMR) Systems",
      "experience": 3
    },
    {
      "skill": "Critical Thinking",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review and interpret medical records to evaluate the validity of payer denials."
    },
    {
      "duty": "Follow-up on submitted claims in accordance with payer and facility policies, research rejections and denials, document account activity, post adjustments."
    },
    {
      "duty": "Prepare and submit clean claims to all insurance companies either electronically or by paper."
    },
    {
      "duty": "Research and resolve claim holds/rejections and denials. Verify patient benefits, eligibility, and coverage as needed."
    },
    {
      "duty": "Draft appeal letters to insurance companies to overturn denied or underpaid claims; rebill claims as necessary including additional documentation."
    },
    {
      "duty": "Maintain current on all private and government payer billing regulations and policy for denial prevention."
    },
    {
      "duty": "Assess accuracy of demographic and policy information within patient accounts and updates as needed."
    },
    {
      "duty": "Respond to correspondence and phone calls related to patient accounts and answer billing and charge related inquires by patients, staff, managed care organizations, etc."
    },
    {
      "duty": "Communicate daily with internal and external customers via phone calls and written communications."
    },
    {
      "duty": "Assist in patient collections and reconciling deposit."
    },
    {
      "duty": "Identify billing or coding issues and request re-bills, secondary billing, or corrected bills as needed."
    },
    {
      "duty": "Research billing and collection trends, problems, and issues that result in delayed claim processing and denials."
    },
    {
      "duty": "Document all communication and transactions in patient accounts accurately and completely."
    },
    {
      "duty": "Draft appeal letters to insurance companies to overturn denied or underpaid claims; rebill claims as necessary including additional documentation."
    },
    {
      "duty": "Maintain patient confidence and protect medical office operations by keeping patient information confidential."
    },
    {
      "duty": "Contribute to team effort by accomplishing related results as needed."
    },
    {
      "duty": "Communicate with Leads to identify and resolve all RCM issues."
    },
    {
      "duty": "Pursue and participate in education to remain current with changes in the Healthcare industry."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 30
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma/GED"
    },
    {
      "credential": "Minimum of 2 years related experience in a medical billing setting and/or experience with an Electronic Medical Record a plus. EPIC Certification preferred"
    }
  ]
}