{
  "meta": [
    {
      "job_title": "Hire Coordination Specialist",
      "job_category": "Customer Service",
      "job_class": "Coordinator",
      "sector": "Sales",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as the principal point of contact for Aggreko’s customers throughout the rental process after the order is placed."
    },
    {
      "duty": "Manage all internal touchpoints during the lifecycle of the rental."
    },
    {
      "duty": "Collaborate with the sales and operations teams to ensure a successful customer experience."
    },
    {
      "duty": "Meet the expectations and requirements for customers; get first-hand customer information, act with the customers in mind; establish and maintain effective relationships with customers and gain their trust and respect."
    },
    {
      "duty": "Own the customers' problems and assume responsibility for actions, decisions, and communication, to drive for a successful outcome."
    },
    {
      "duty": "Provide timely, appropriate, and useful information to others; determine the most effective method of communication."
    },
    {
      "duty": "Negotiate skillfully in tough situations with both internal and external groups; settle differences with a minimum of noise; win concessions without damaging relationships; communicate with impact that is direct and diplomatic."
    },
    {
      "duty": "Travel up to 25% located across North America."
    }
  ],
  "skills": [
    {
      "skill": "Customer Focus",
      "experience": 5
    },
    {
      "skill": "Sales and Operations Collaboration",
      "experience": 5
    },
    {
      "skill": "Effective Communication",
      "experience": 5
    },
    {
      "skill": "Negotiation Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Travel Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree plus relevant experience in a business-to-business (B2B) environment, preferably within a fast-paced rental or logistics space."
    }
  ]
}