{
  "meta": [
    {
      "job_title": "Office Technician (Typing)",
      "job_category": "Clerical",
      "job_class": "Office Technician",
      "sector": "Administrative",
      "salary": 42000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Typing",
      "experience": 2
    },
    {
      "skill": "Clerical Work",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepare, compose and type correspondence utilizing various computer programs."
    },
    {
      "duty": "Maintain tickler for Chief of Plant Operations III to ensure deadlines are met."
    },
    {
      "duty": "Maintain a daily calendar for scheduling meetings and appointments."
    },
    {
      "duty": "Answer telephones calls and refer to appropriate department."
    },
    {
      "duty": "Gather information and prepare monthly and quarterly reports."
    },
    {
      "duty": "Complete travel authorization, car request, travel expense claim and training paperwork."
    },
    {
      "duty": "Type annual Individual Development Plans (STD Form 637) and Reports of Performance for Probationary Employee (STD Form 636), using the information supplied by the supervisors."
    },
    {
      "duty": "Work with the Chief of Plant Operations III to help ensure that all reports and annual physicals are up to date."
    },
    {
      "duty": "Type Major/Minor Capital Outlay and Special Repair Budget Proposals and distribute appropriately."
    },
    {
      "duty": "Enter emergency and daily work order request on the Maintenance Connection computer system."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "One year of experience in California state service performing clerical duties at a level of responsibility equivalent to that of an Office Assistant, Range B. OR Experience: Two years of experience in typing and clerical work."
    }
  ]
}