{
  "meta": [
    {
      "job_title": "EV Infrastructure Architect",
      "job_category": "Engineering",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Help develop and maintain the company's North America EV infrastructure strategy, ensuring it aligns with the overall business goals and vision."
    },
    {
      "duty": "Define and communicate technical requirements for EV charging projects, including hardware and software components."
    },
    {
      "duty": "Lead the design and implementation of EV charging infrastructure projects, ensuring they meet technical, operational, and regulatory requirements."
    },
    {
      "duty": "Collaborate with cross-functional teams, including electrical and civil engineers, to ensure project compliance with local and national regulations and standards."
    },
    {
      "duty": "Keep abreast of risks and opportunities in the energy markets in various US and Canadian service territories."
    },
    {
      "duty": "Optimize the electricity sourcing strategy and electricity sourcing operations for electric vehicle charging, taking into account grid, market, regulatory and grant conditions in the service territories."
    },
    {
      "duty": "Evaluate and recommend new EV charging technologies and solutions."
    },
    {
      "duty": "Conduct ongoing research and analysis of market trends and emerging technologies related to EV charging infrastructure."
    },
    {
      "duty": "Provide technical guidance and support to project teams, customers, and stakeholders."
    },
    {
      "duty": "Ensure projects are delivered on time, within budget, and to the required quality standards."
    }
  ],
  "skills": [
    {
      "skill": "Electric Vehicle (EV) Charging Infrastructure",
      "experience": 5
    },
    {
      "skill": "Technical Requirements Definition",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Electrical Engineering",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Energy Market Optimization",
      "experience": 5
    },
    {
      "skill": "Research and Analysis",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s or Master’s degree in electrical engineering, computer science, or related field."
    }
  ]
}