{
  "meta": [
    {
      "job_title": "Quality Manager",
      "job_category": "Quality Assurance",
      "job_class": "Manager",
      "sector": "Quality Assurance",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide leadership and guidance for the department, work to improve core processes, and manage projects."
    },
    {
      "duty": "Identify areas of continuous improvement within the quality department and in the Quality Management System."
    },
    {
      "duty": "Maintain and develop quality and inspection planning, monitor suppliers and manufacturing processes, and develop inspection and testing systems and methods for data collection, analysis, and reporting."
    },
    {
      "duty": "Direct generation of First Article Inspection (FAI) Reports, manufacturing and process certs, and Root Cause and Corrective Actions."
    },
    {
      "duty": "Manage, supervise and oversee the training, qualification, and workload of Inspection and Quality Assurance personnel."
    },
    {
      "duty": "Train team members in QMS system and maintain training records."
    },
    {
      "duty": "Manage internal and external audits for customers and third-party audits to attain required certifications."
    },
    {
      "duty": "Work with all departments to ensure processes are followed to meet audit standards."
    },
    {
      "duty": "Maintain Calibration of Measuring and test equipment in all areas and maintaining records."
    },
    {
      "duty": "Be involved in new product development and review all new jobs for proper documentation and that the customer's needs are being addressed, as well as identifying gaging needs for new as well as existing work."
    },
    {
      "duty": "Work with customers on deviation approvals for dimensional and cosmetic issues, discuss possible engineering changes to improve part manufacturability, and address concerns on shipping preservation issues or part quality."
    },
    {
      "duty": "Assure and assist in the timely completion of part quality documentation requirements, including but not limited to: ballooned drawings, inspection check sheets, SPC charts, process flow diagrams, process failure mode and effects analysis', process control plans, dimensional layout requirements, part submission warrants, capability study, and measurement system analysis."
    },
    {
      "duty": "Maintain quality-related documents and work instructions for all company processes."
    },
    {
      "duty": "Maintain safe operations by adhering to safety procedures and regulations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Quality Management, Engineering, or a related field (Master's preferred)"
    }
  ]
}