{
  "meta": [
    {
      "job_title": "Accounts Receivable Specialist",
      "job_category": "Finance",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure accurate and efficient reconciliation of Key customers with large projects allowing for timely collection of amounts owed."
    },
    {
      "duty": "Work with BU project managers to Identify, investigate and resolve collection issues in order to ensure collection in a timely manner."
    },
    {
      "duty": "Identify debit balance and other situations that will impact the cash forecast and communicate the status to the cash application team."
    },
    {
      "duty": "Lead meetings with internal and external customers to resolve AR issues."
    },
    {
      "duty": "Record and maintain all third-party collections and bankruptcy activity."
    },
    {
      "duty": "Partner with the credit analysts with respect to collection issues and credit holds to determine if changes to credit limits are needed."
    },
    {
      "duty": "Proactively engage and interact with the sales organizations regarding account status, orders, and payments in order to maximize revenue opportunities."
    },
    {
      "duty": "Identify customers to be considered for monthly bad debt reserve based upon aging, payment trends, and country risk."
    },
    {
      "duty": "Supply collections information for internal and external audits."
    },
    {
      "duty": "Ensure accurate and efficient reconciliations and reporting of all open and collectible disputes for assigned key customers."
    },
    {
      "duty": "Work with BU partner and Sales to Identify root causes for disputes and resolve all deductions in a timely manner with a clear understanding of the impact to the business."
    },
    {
      "duty": "Generate reports to measure and prioritize AR team daily performance and align with team metrics."
    },
    {
      "duty": "Seek opportunities for continued improvements in AR collection process, efficiencies, and best practices within the CSS team."
    },
    {
      "duty": "Work with various teams to implement identified solutions and reduce operational inefficiencies."
    },
    {
      "duty": "Living Hitachi Energy’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business."
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree (or equivalent experience) in the field of Finance, Accounting, or Business Administration."
    }
  ]
}