{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Risk Analysis",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Scheduling",
      "experience": 5
    },
    {
      "skill": "Lean Process",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead all aspects of the company’s safety culture and create awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Support the preconstruction team including quantity takeoff, trade coordination and scope of work development, scope review, bid package development, schedule development, bid list creation and bid advertisement."
    },
    {
      "duty": "Manage the plan and implementation of the buyout schedule. Verify pricing and scope, identify successful bidders, provide gap analysis against initial scope, and manage issuance of subcontracts."
    },
    {
      "duty": "Coordinate with Logistics to obtain pricing on materials and equipment."
    },
    {
      "duty": "Identify potential schedule impacts including scope, weather, manpower, and changes, and facilitate mitigation plans for these impacts."
    },
    {
      "duty": "Provide appropriate written documentation for decisions affecting various aspects of the project such as budget, schedule, legal, quality, and/or safety."
    },
    {
      "duty": "Lead overall project closeout process using best practice standards, tools, and processes such as the close-out punch list, financials, subcontracts, warranties, etc. Interface with region/company legal counsel as appropriate."
    },
    {
      "duty": "Various other project management duties, including monthly project reviews, progress meetings, pay applications, cost forecast, and project budgeting."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering, or related field. In lieu of the above requirements, equivalent relevant experience will be considered."
    }
  ]
}