{
  "meta": [
    {
      "job_title": "HR Coordinator",
      "job_category": "Human Resources",
      "job_class": "Coordinator",
      "sector": "HR",
      "salary": 55000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Audits information in PeopleSoft on a daily, bi-weekly, monthly and yearly basis."
    },
    {
      "duty": "Schedule new hire orientations and prepares orientation packets and paperwork for incoming employees."
    },
    {
      "duty": "Maintains updated supplies of required pamphlets, documents and new hire forms."
    },
    {
      "duty": "Responsible for the onboarding process of all new hires, terminations, salary, position and status changes, etc., including preparation of Personnel Action Notices (PAN)."
    },
    {
      "duty": "Central participant in new hire orientation covering policies and serving as back up to the HR coordinator in orientation, as needed."
    },
    {
      "duty": "Prepare and coordinate exit interviews for staff."
    },
    {
      "duty": "Compile and maintain electronic employee personnel files, including scanning documents into OnBase."
    },
    {
      "duty": "Assists with recruiting by receiving applicants, conducting applicable testing, and interviewing for certain staff positions including Year-Up interns."
    },
    {
      "duty": "Responds to general inquiries regarding HR policy and procedures, time and attendance, and payroll-related questions."
    },
    {
      "duty": "Responsible for coordinating office events supported by HR, including but not limited to open enrollment; staff appreciation; flu shot and biometric screenings; monthly birthdays; and staff retirement celebrations."
    },
    {
      "duty": "Manages the non-employee process for the DC Office including coordinating use of temporary employees."
    },
    {
      "duty": "Serves as liaison for Cristo Rey High School Intern Program, including supervising interns."
    },
    {
      "duty": "Post and maintain labor law posters."
    },
    {
      "duty": "Responsible for office notary applications and commission renewal process."
    },
    {
      "duty": "Monitors and reconciles Time and Attendance data entry by staff including leaves of absences (STD, FMLA and Workers Comp)."
    },
    {
      "duty": "Update and maintain weekly HR status report."
    },
    {
      "duty": "Assists with other projects as required and assigned."
    }
  ],
  "skills": [
    {
      "skill": "MS Office Suite",
      "experience": 2
    },
    {
      "skill": "HRIS System",
      "experience": 2
    },
    {
      "skill": "Recruiting",
      "experience": 2
    },
    {
      "skill": "Onboarding",
      "experience": 2
    },
    {
      "skill": "Employee Record Keeping",
      "experience": 2
    },
    {
      "skill": "Staff Management",
      "experience": 2
    },
    {
      "skill": "Event Coordination",
      "experience": 2
    },
    {
      "skill": "Labor and Employment Law",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from an accredited college or university"
    },
    {
      "credential": "Proficiency with MS Office Suite, including Word, Excel and PowerPoint applications"
    },
    {
      "credential": "Previous HR experience in a law firm"
    },
    {
      "credential": "Prior experience with Peoplesoft Human Resources Information System"
    },
    {
      "credential": "Professional HR certification (PHR / SHRM-CP)"
    }
  ]
}