{
  "meta": [
    {
      "job_title": "Web/Linux Jr System Administrator",
      "job_category": "IT/Technology",
      "job_class": "Administrator",
      "sector": "Software Engineering",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HTML",
      "experience": 2
    },
    {
      "skill": "CSS",
      "experience": 2
    },
    {
      "skill": "PHP",
      "experience": 2
    },
    {
      "skill": "WordPress Customization",
      "experience": 2
    },
    {
      "skill": "Linux Red Hat",
      "experience": 2
    },
    {
      "skill": "System Administration",
      "experience": 3
    },
    {
      "skill": "Web Support",
      "experience": 3
    },
    {
      "skill": "IT Support",
      "experience": 3
    },
    {
      "skill": "PowerShell Scripting",
      "experience": 2
    },
    {
      "skill": "Bash Scripting",
      "experience": 2
    },
    {
      "skill": "PHP Coding",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage RedHat Linux web servers and Windows application servers."
    },
    {
      "duty": "Perform regular patching and updates for application and web servers."
    },
    {
      "duty": "Collaborate with the IT Security & Compliance team to remediate vulnerabilities and perform necessary security patching and hardening procedures as needed."
    },
    {
      "duty": "Support content updates, development, maintenance, and enhancements of the school websites."
    },
    {
      "duty": "Set up and configure new websites as needed."
    },
    {
      "duty": "Monitor web server performance, identifying bottlenecks, and optimizing system resources."
    },
    {
      "duty": "Proficient in writing and modifying PHP code to maintain website functionality."
    },
    {
      "duty": "Maintain and troubleshoot Mac and PC systems in classrooms, labs, and offices."
    },
    {
      "duty": "Schedule and deploy operating system and application updates for computers."
    },
    {
      "duty": "Support computer application deployment and maintenance through PowerShell and Bash scripting development."
    },
    {
      "duty": "Image and set up new computers received at the School of Communication."
    },
    {
      "duty": "Create, publish, distribute, monitor, and enforce computer lab policies and regulations."
    },
    {
      "duty": "Perform daily checks of lab and classroom computers and troubleshoot issues as needed."
    },
    {
      "duty": "Respond to incoming technical support requests from School of Communication faculty, staff, and students."
    },
    {
      "duty": "Log and manage technical support requests through an incident management system."
    },
    {
      "duty": "Support Apple Enterprise JAMF for managing school’s endpoint environment."
    },
    {
      "duty": "Create and maintain PowerShell and Bash scripts used for installations and system configurations."
    },
    {
      "duty": "Develop command-line scripts for server-side tasks, automation, and administrative tasks."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's and Minimum 2 years of web development, 2 years systems Linux administration and one year desktop/server support REQUIRED"
    }
  ]
}