{
  "meta": [
    {
      "job_title": "Vendor Liaison Specialist 2",
      "job_category": "Vendor Liaison",
      "job_class": "Specialist",
      "sector": "Technical Services & Solutions",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "Procurement",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Software Asset Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with first-line management to guarantee the availability of the technical inputs for 3rd party software license procurement and software maintenance renewals."
    },
    {
      "duty": "Serve as a Professional Buyer / Designated Procurement Representative (DPR) and Subcontract Technical Representative (STR) for purchases via Ariba catalogs and PCard."
    },
    {
      "duty": "Proactively anticipate, identify, and address supplier performance issues to ensure software maintenance dates are met."
    },
    {
      "duty": "Work with Procurement to evaluate and recommend potential Suppliers based on Management Level (Quality Level), and establish technical and performance requirements of the item or services to be procured."
    },
    {
      "duty": "Assist the Procurement Specialist with supplier negotiations as required."
    },
    {
      "duty": "Collaborate with internal legal counsel to ensure procurement specifications meet prime contract requirements."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 70,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in a relevant area from an accredited institution and a minimum of 5 years related experience; or, an equivalent combination of education and experience."
    },
    {
      "credential": "Active DOE L or Q clearance, or equivalent, transferable clearance."
    },
    {
      "credential": "Certified Software Asset Manager (CSAM)"
    }
  ]
}