{
  "meta": [
    {
      "job_title": "Contracts and Procurement Specialist",
      "job_category": "Procurement",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Contract Administration",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Risk Mitigation",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Legal and FAR/DFARS Knowledge",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Attention to Detail",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate Requests for Information (RFIs)/Requests for Proposal (RFPs)/Requests for Quotation (RFQs) with internal and external customers."
    },
    {
      "duty": "Coordinate Estimate Requests (ERs) and Statements of Work (SOWs) with internal and external customers."
    },
    {
      "duty": "Coordinate proposal preparation, manage and prepare internal documentation for gate approvals as required, and obtain management approval for submission to the customer."
    },
    {
      "duty": "Develop proposal and contract strategy to include risk mitigation and responsibility as the primary point of contact for the review of terms and conditions of contract/requirement documents for compliance."
    },
    {
      "duty": "Develop negotiation strategy and leads negotiations of proposal with commercial and/or government customers ensuring customer needs are satisfied while meeting business and financial objectives."
    },
    {
      "duty": "Performs contract administration from contract award to contract closeout, including internal notification of contract award, coordination of requirements to functional departments, contract notifications to customer, identification and resolution of changes, monitor funding and expenditures, facilitation of invoicing, coordination of import/export licenses and authorizations, documentation of delivery/completion to the customer, and contract closeout."
    },
    {
      "duty": "Assess, maintain, and utilize information management systems for reports/metrics, correspondence, files, presentations, analyses, and contract administration."
    },
    {
      "duty": "Manage special assignments and projects within Contracts."
    },
    {
      "duty": "Coordinate with and influence personnel in multiple functions, Integrated Program Teams (IPTs), and Centers of Excellence (COEs) and at a variety of levels to ensure effective and efficient compliance with contractual and customer requirements."
    },
    {
      "duty": "Adapt and improve business processes/practices to meet company goals and satisfy customer needs."
    },
    {
      "duty": "Demonstrate exceptional customer relationship management skills. Primary liaison between external customer and company for contractual matters."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Business Administration or a related field; MBA preferred."
    }
  ]
}