{
  "meta": [
    {
      "job_title": "Financial Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Financial",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Forecasting",
      "experience": 5
    },
    {
      "skill": "SAP System",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "MS Office",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Monitor, analyze, and interpret financial data to evaluate alternatives and recommend appropriate business solutions."
    },
    {
      "duty": "Support and forecast financial operations of the business, acting as a business partner to the Factory Controller."
    },
    {
      "duty": "Execute accurate and timely completion of accounting activities for overall financial statement preparation."
    },
    {
      "duty": "Prepare financial and management reports for different departments within the organization and for HUB & factory manager."
    },
    {
      "duty": "Analyze and control financial performance indicators, review accounting records, and participate in monthly closing."
    },
    {
      "duty": "Support in budget and monthly forecast preparation, including monthly cost tracking of Cost Centers and periodic review of cost center expenses."
    },
    {
      "duty": "Track overdue receivables and actively participate in collection & dispute resolution."
    },
    {
      "duty": "Take part in the implementation of new SAP Version 'REIWA' Project and conduct reconciliations of accounts as necessary."
    },
    {
      "duty": "Participate in SOX control testing, prepare relevant documentation, and prepare the project cost report."
    },
    {
      "duty": "Adhere to the core values of safety and integrity and take responsibility for actions while caring for colleagues and the business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in finance, accounting, or business administration (Master's preferred)"
    }
  ]
}