{
  "meta": [
    {
      "job_title": "Nurse Practitioner",
      "job_category": "Healthcare",
      "job_class": "Practitioner",
      "sector": "Medical",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medical Histories",
      "experience": 5
    },
    {
      "skill": "Physical Examinations",
      "experience": 5
    },
    {
      "skill": "Medical Tests Review",
      "experience": 5
    },
    {
      "skill": "Health History Recording",
      "experience": 5
    },
    {
      "skill": "Medical Consultations",
      "experience": 5
    },
    {
      "skill": "Medical Records Review",
      "experience": 5
    },
    {
      "skill": "Health Standards Application",
      "experience": 5
    },
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Basic Life Support",
      "experience": 5
    },
    {
      "skill": "Electronic Medical Documentation",
      "experience": 5
    },
    {
      "skill": "English Communication",
      "experience": 5
    },
    {
      "skill": "Judgment and Decision-making",
      "experience": 5
    },
    {
      "skill": "Genesis Training",
      "experience": 5
    },
    {
      "skill": "Health Screening",
      "experience": 5
    },
    {
      "skill": "Diagnostic Procedures",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform medical histories, physical examinations, and reviews of required medical tests and documents pertaining to consultations and medical histories on applicants for the Armed Forces."
    },
    {
      "duty": "Secure a thorough health history from the applicant and record findings."
    },
    {
      "duty": "Arrange (but not performing) Medical consultations to include but not limited to orthopedics, psychiatry, ears, nose and throat specialty, dermatology, internal medicine, and dental."
    },
    {
      "duty": "Accomplish the specified quantity and quality of work within the schedule and hours allotted."
    },
    {
      "duty": "Perform records review/consult reviews and results reviews."
    },
    {
      "duty": "Abide by DoD, USMEPCOM, and other applicable instructions, regulations, and policies."
    },
    {
      "duty": "Apply accession medical standards to determine applicant medical qualifications."
    },
    {
      "duty": "Become proficient in the application of accession medical standards to determine suitability of applicants for military service."
    },
    {
      "duty": "Provide highest regard to applicant dignity."
    },
    {
      "duty": "Abide by and follow IAW, Privacy Act and HIPPA."
    },
    {
      "duty": "Participate in MEPS local, medical peer reviews."
    },
    {
      "duty": "Use Philosophy Known as “Red Carpet Treatment”."
    },
    {
      "duty": "Comply with all installation policies and procedures."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Baccalaureate Degree from an accredited school of nursing (National League of Nursing) Master's or Doctoral Degree from a program accredited by the American Academy of Nurse Practitioners Certificate Program (ANPCP) or the American Nurses Credentialing Center (ANCC). Possess current unrestricted license to practice as a Nurse Practitioner in one of the fifty states, the District of Columbia, the Commonwealth of Puerto Rico, Guam, or the U.S. Virgin Islands. Minimum of one (1) year post-graduate experience in direct patient care within the last three (3) years. Possess and maintain a current certification of Basic Life Support (BLS) Training from the American Heart Association or American Red Cross training for Healthcare Providers."
    }
  ]
}