{
  "meta": [
    {
      "job_title": "Regional Technology Enablement Lead",
      "job_category": "Technology",
      "job_class": "Lead",
      "sector": "Technology",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technology Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Business Development",
      "experience": 10
    },
    {
      "skill": "Relationship Management",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Mentorship",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and communicate a vision and implementation strategies for local and regional technology groups."
    },
    {
      "duty": "Maintain active market knowledge and support regional and corporate strategic initiatives."
    },
    {
      "duty": "Guide business development efforts and coordinate teaming decisions with leadership."
    },
    {
      "duty": "Drive the use of innovative technology within the markets served by VHB core service groups in the region."
    },
    {
      "duty": "Manage and grow key client relationships and establish strategic partnerships with technology vendors."
    },
    {
      "duty": "Serve as team leader of the regional technology staff and support the advancement of elevating data/technology with the regional team members."
    },
    {
      "duty": "Take an active role in the development and mentoring of staff, as well as manage and maintain project schedules and budgets."
    },
    {
      "duty": "Collaborate with PMO to manage financial progress on projects and represent VHB at regional conferences, seminars, and industry events."
    },
    {
      "duty": "Manage and prepare technical and cost proposals and develop or oversee training programs that position VHB to be forward-thinking on data and technology initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BS in Computer Science or related discipline (Master's preferred)"
    },
    {
      "credential": "10+ years of IT experience, preferably in the AEC industry"
    },
    {
      "credential": "Prior leadership experience"
    }
  ]
}