{
  "meta": [
    {
      "job_title": "Special Education – Educational Assistant, Specialized Classroom",
      "job_category": "Education",
      "job_class": "Educational Assistant",
      "sector": "Special Education",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Instructional Assistance",
      "experience": 2
    },
    {
      "skill": "Behavior Intervention",
      "experience": 3
    },
    {
      "skill": "Social Skills Instruction",
      "experience": 3
    },
    {
      "skill": "Data Collection",
      "experience": 2
    },
    {
      "skill": "Language Support",
      "experience": 2
    },
    {
      "skill": "Adaptive Equipment Usage",
      "experience": 2
    },
    {
      "skill": "Health Task Implementation",
      "experience": 2
    },
    {
      "skill": "Bilingual Communication",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide instructional assistance to students under the direct supervision of a certified teacher."
    },
    {
      "duty": "Participate actively in the process of collecting specific data related to students’ behaviors and contribute to the development of students’ behavior support plans through sharing data."
    },
    {
      "duty": "Implement social skills instruction and behavior intervention plans specially designed by the teacher and behavior support staff utilizing crisis prevention and intervention strategies."
    },
    {
      "duty": "Utilize district-approved de-escalation and physical intervention techniques when needed in specialized and general education classroom settings."
    },
    {
      "duty": "Provide input into the development of individualized sensory plans for students; support students’ development of self-regulation ability through the skillful use of sensory tools."
    },
    {
      "duty": "Communicate with students during instruction and interpersonal interaction using language structure, tone, and body language that promotes positive student behavior, conflict resolution, and problem solving."
    },
    {
      "duty": "Meet students' physical, communication, and instructional needs by using adaptive equipment."
    },
    {
      "duty": "Perform health tasks and implement individualized protocols, as delegated by the medical staff and assigned by the classroom."
    },
    {
      "duty": "Assist in supervision of students in the classroom as well as other settings."
    },
    {
      "duty": "Work effectively with and respond to people from diverse cultures or backgrounds."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150
    },
    {
      "student_teacher": 100
    },
    {
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent required; two-years of college or associate’s degree preferred."
    },
    {
      "credential": "Multicultural and/or bilingual candidates preferred."
    }
  ]
}