{
  "meta": [
    {
      "job_title": "Quality Assurance Specialist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Administration of the Corrective and Preventive Action (CAPA) process and participation in CAPA-related activities."
    },
    {
      "duty": "Execute Investigations, Root Cause Analysis, Correction, Corrective, and Preventive Action activities."
    },
    {
      "duty": "Assist in coordinating and executing objectives throughout the company in cooperation with other departments, to maximize product quality and operating system efficiency/effectiveness while minimizing cost."
    },
    {
      "duty": "Identify and coordinate resolution of system inefficiencies that contribute to increased quality costs."
    },
    {
      "duty": "Assess results of Customer Complaint investigations and Corrective Actions for application, validity, and conformance to FDA regulatory, ISO and Customer requirements."
    },
    {
      "duty": "Utilize CAPA problem solving techniques to reduce internal and external failures, selects sound techniques to solve problems effectively, and assess results for application, validity, and conformance to specifications."
    },
    {
      "duty": "Develop and analyze statistical data in relationship to assigned tasks to determine adequacy of present standards and establish proposed quality improvements, including analysis of current inspection methods and sample plans."
    },
    {
      "duty": "Evaluate compliance using relevant information and individual judgment to determine whether events or processes comply with specifications, operating procedures, or standards."
    },
    {
      "duty": "Assist in implementing ISO and FDA quality systems compliance."
    },
    {
      "duty": "Support and maintain all policies of the company, including but not limited to applicable FDA regulatory and ISO requirements, Health and Safety Requirements and Continuous Improvement initiatives."
    },
    {
      "duty": "IVD Experience is a plus."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Healthcare Administration, Clinical Laboratory Science, Medical Technology or a related field (Master's preferred)"
    }
  ]
}