{
  "meta": [
    {
      "job_title": "Construction Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Telecommunications/Wireless Construction",
      "experience": 3
    },
    {
      "skill": "Outside Plant Construction",
      "experience": 3
    },
    {
      "skill": "RF Sweep Test",
      "experience": 3
    },
    {
      "skill": "NESC, NEC, OSHA Standards",
      "experience": 3
    },
    {
      "skill": "Budget Development and Execution",
      "experience": 5
    },
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Site Acquisition Procedures",
      "experience": 5
    },
    {
      "skill": "Blueprint Reading",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "MS Office and Project Management Software",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for all aspects of construction on client projects including: on-site management, coordination of contractors, OEM installers and customer representatives."
    },
    {
      "duty": "Represent client as the expert on construction issues relating to construction/modification of collocation or DAS and small cell projects, including in-building iDAS, public right-of-way oDAS, venues and small cell construction along with the associated inside & outside plant construction methods."
    },
    {
      "duty": "Coordinate and attend site walks and preconstruction meetings with contractor and all applicable jurisdictions."
    },
    {
      "duty": "Understand prevailing rates for all construction work and ensure client is receiving competitive rates for quality work."
    },
    {
      "duty": "Ensure accurate and complete files are maintained for projects and appropriate closeout documents are distributed in a timely manner and are in accordance with corporate and customer standards."
    },
    {
      "duty": "Make recommendations based on priority and need to ensure the project and budget are maintained."
    },
    {
      "duty": "Act as client safety observer and Quality Assurance representative while at the site ensuring compliance with client safety program and related workmanship practices."
    },
    {
      "duty": "Provide updates on construction status to leadership, including tracking of specific dates and deliverables."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School degree"
    }
  ]
}