{
  "meta": [
    {
      "job_title": "Development Manager",
      "job_category": "Fundraising",
      "job_class": "Manager",
      "sector": "Non-profit",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Fundraising",
      "experience": 5
    },
    {
      "skill": "Grant Writing",
      "experience": 5
    },
    {
      "skill": "Donor Relationship Management",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "CRM Management",
      "experience": 5
    },
    {
      "skill": "Event Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage fundraising activities, including cultivation of existing supporters and identifying new funding streams."
    },
    {
      "duty": "Participate in planning annual fundraising event and develop an annual fundraising strategy."
    },
    {
      "duty": "Work with the leadership team and Board to meet or exceed annual fundraising goals and ensure visibility of the organization."
    },
    {
      "duty": "Provide high level support for and coordination of activities related to soliciting interest in the organization, writing grant proposals and reports, and managing funder relationships."
    },
    {
      "duty": "Represent TFN’s mission and vision in meetings with funders, donors, Board members, and the public."
    },
    {
      "duty": "Develop short- and long-term development strategies and create an annual calendar of fundraising activities."
    },
    {
      "duty": "Cultivate current supporters, identify new prospective funding opportunities, and manage all grant proposals and reports."
    },
    {
      "duty": "Be the principal liaison between all funders and TFN leadership/staff and Board members, including organizing meetings."
    },
    {
      "duty": "Utilize CRM software to track donations, steward donors, and ensure all donors are acknowledged and recognized in a timely manner."
    },
    {
      "duty": "Manage Terra Firma National’s relationship with its Board of Directors and assist in the development of a communications strategy."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree"
    }
  ]
}