{
  "meta": [
    {
      "job_title": "Construction Project Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 160000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Architectural Drawing Interpretation",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Project Management Software",
      "experience": 5
    },
    {
      "skill": "Sage 300 CRE",
      "experience": 5
    },
    {
      "skill": "Web-based Applications",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure thorough and competent management of project schedule, budget, resource allocation, and documentation during the complete lifecycle of the build."
    },
    {
      "duty": "Maintain timely and effective communication with team, field, client, owner’s rep, design partner, etc."
    },
    {
      "duty": "Participate in project estimating and prepare pre-construction control estimates and schedules with the superintendent."
    },
    {
      "duty": "Track, review, and report on project financials and conduct value engineering as needed with cost analysis and recommendations."
    },
    {
      "duty": "Develop project schedules and review with appropriate in-house team, co-own the active build project schedule, and co-own the active build project schedule and all elements with the superintendent."
    },
    {
      "duty": "Identify, qualify, and manage subcontractors, managing materials-related activities, project documentation, and assuring project closeout."
    },
    {
      "duty": "Conduct post-construction project occupancy review and act as project liaison to Service Department as needed."
    },
    {
      "duty": "Participate in company growth, community engagement, and milestone cultivation in-keeping with company strategic objectives."
    },
    {
      "duty": "Review shop drawings for windows, cabinets, and other building elements as needed."
    },
    {
      "duty": "Assure project closeout including warranties, materials, finish schedules, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Construction Management degree or other relevant education plus experience"
    }
  ]
}