{
  "meta": [
    {
      "job_title": "Construction Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Leads all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Manages and oversees company staff, subcontractors, suppliers and programs such as Safety, Quality and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Coordinates and manages the care, custody and control of the project site."
    },
    {
      "duty": "Creates, manages, changes and implements the project’s schedule as needed, in conjunction with the Project Manager."
    },
    {
      "duty": "May be responsible for tracking and monitoring project budget and costs by using the project management system’s cost reports and data from the project manager."
    },
    {
      "duty": "Communicates key project information to owners, design team, governing authorities, subcontractors, suppliers and other departments."
    },
    {
      "duty": "Assists in the selection of the formwork, tools and equipment necessary to complete self-perform operations."
    },
    {
      "duty": "Manages timecard approval process to ensure reporting of accurate hours and proper cost codes."
    },
    {
      "duty": "Supports the project closeouts by supervising pre-punch activities and coordinating activities with the owner, architect and governing authorities."
    },
    {
      "duty": "Participates in the negotiation process with the owner and architect to gain agreement for project changes."
    },
    {
      "duty": "Understands and applies the terms and conditions of the owner and subcontractor contracts for the project."
    },
    {
      "duty": "Responsible for identifying and recruiting top talent."
    },
    {
      "duty": "Leads, supports and promotes a culture of diversity and inclusion within JE Dunn."
    },
    {
      "duty": "Effectively delivers leadership messages to multiple audiences both internally and externally."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering or related field (Preferred)"
    },
    {
      "credential": "12+ years construction experience."
    },
    {
      "credential": "10+ years field supervision experience."
    },
    {
      "credential": "Experience leading Lean principles on projects (Preferred)"
    }
  ]
}