{
  "meta": [
    {
      "job_title": "Paralegal",
      "job_category": "Legal",
      "job_class": "Paralegal",
      "sector": "Corporate",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide a range of legal support and administration to the M&A and Corporate teams."
    },
    {
      "duty": "Manage General Corporate Housekeeping matters including entity formation and dissolution; obtaining EINS, and registering entities in respective states for income tax purposes."
    },
    {
      "duty": "Coordinate Due Diligence Checklists and Disclosure Schedules, draft requests and track responses."
    },
    {
      "duty": "Create organizational documents, including articles of incorporation or dissolution, stock certificates and purchase agreements."
    },
    {
      "duty": "Draft, file, register and manage various new business entity documents for corporations, LLCs and partnerships with state and federal agencies."
    },
    {
      "duty": "Assist with questions from business units regarding various legal entities, structure, etc."
    },
    {
      "duty": "Facilitate completion of commercial contracts in compliance with corporate templates and legal best practices, ensure appropriate contract authorization."
    },
    {
      "duty": "Perform legal research."
    },
    {
      "duty": "Drafting legal contracts, correspondence, and other documents."
    },
    {
      "duty": "Organizing and maintaining documents in a paper or electronic filing system."
    }
  ],
  "skills": [
    {
      "skill": "Legal Support",
      "experience": 5
    },
    {
      "skill": "Corporate Housekeeping",
      "experience": 5
    },
    {
      "skill": "Due Diligence",
      "experience": 5
    },
    {
      "skill": "Legal Drafting",
      "experience": 5
    },
    {
      "skill": "Business Entity Management",
      "experience": 5
    },
    {
      "skill": "Legal Research",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Document Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Certificate of completion from an ABA-approved paralegal certification program of education and training, or an associate degree in paralegal studies."
    }
  ]
}