{
  "meta": [
    {
      "job_title": "Construction Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Leads all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Investigates safety incidents and retrains staff and needed."
    },
    {
      "duty": "Provides management of subcontractors and organization of the overall job and workflow."
    },
    {
      "duty": "Manages and oversees company staff, subcontractors, suppliers and programs such as Safety, Quality, and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Develops work plans for subcontractors and self-performed work."
    },
    {
      "duty": "Coordinates and manages the care, custody and control of the project site."
    },
    {
      "duty": "Leads various meetings including daily standup and weekly trade meetings."
    },
    {
      "duty": "Attends, manages, and participates in appropriate progress and/or project OAC meetings."
    },
    {
      "duty": "Creates, manages, changes and implements the project’s schedule as needed, in conjunction with the Project Manager."
    },
    {
      "duty": "May be responsible for tracking and monitoring project budget and costs by using the project management system’s cost reports and data from the project manager."
    },
    {
      "duty": "Communicates key project information to owners, design team, governing authorities, subcontractors, suppliers, and other departments."
    },
    {
      "duty": "Follows the project filing and documentation organization system as dictated for the project."
    },
    {
      "duty": "Updates drawings, logs, diaries, and inspection notebooks."
    },
    {
      "duty": "Approves and/or records unit cost information for weekly reports and completes daily reports, logs, and tracking reports."
    },
    {
      "duty": "Evaluates progress on self-perform work and makes adjustments as needed."
    },
    {
      "duty": "Manages material and equipment needs for the project."
    },
    {
      "duty": "Supports the MOC (Material and Other Costs) and DLSC (Dunn Logistics Service Center) procurement and approval processes."
    },
    {
      "duty": "Assists in the selection of the formwork, tools, and equipment necessary to complete self-perform operations."
    },
    {
      "duty": "Manages timecard approval process to ensure reporting of accurate hours and proper cost codes."
    },
    {
      "duty": "Ensures quality compliance through the use of specifications, setting quality standards, in–house QA/QC and outside resources."
    },
    {
      "duty": "Supports the project closeouts by supervising pre-punch activities and coordinating activities with the owner, architect, and governing authorities."
    },
    {
      "duty": "Gains understanding of the project pursuit process and methodology."
    },
    {
      "duty": "Participates with the field operations leadership and the project team to put together a project pre-plan; implements, monitors, and adjusts as needed throughout the project lifecycle."
    },
    {
      "duty": "Partners with field leadership to establish field staffing for their assigned project."
    },
    {
      "duty": "Partners with project management to identify schedule and costs associated with project changes."
    },
    {
      "duty": "Participates in the negotiation process with the owner and architect to gain agreement for project changes."
    },
    {
      "duty": "Participates with the project team in preparation and presentation for all project review meetings, including the monthly review process and other key project meetings."
    },
    {
      "duty": "Participates in the project buyout meetings with subcontractors and vendors."
    },
    {
      "duty": "Understands and applies the terms and conditions of the owner and subcontractor contracts for the project."
    },
    {
      "duty": "Responsible for identifying and recruiting top talent."
    },
    {
      "duty": "Leads, supports, and promotes a culture of diversity and inclusion within JE Dunn."
    },
    {
      "duty": "Understands JE Dunn’s policy of non-discrimination and ensures positive, proactive implementation throughout the organization."
    },
    {
      "duty": "Manages the largest, most complex stand-alone and/or multiple complex projects from initial planning to completion."
    },
    {
      "duty": "Provides management and/or oversight to multiple projects and project teams."
    },
    {
      "duty": "Provides input, leads, and executes company and regional key strategic initiatives."
    },
    {
      "duty": "Participates in the development of relevant company training content."
    },
    {
      "duty": "Responsible for the selection and development of internal subject matter experts."
    },
    {
      "duty": "Effectively delivers leadership messages to multiple audiences both internally and externally."
    },
    {
      "duty": "Ability to perform work accurately and completely, and in a timely manner."
    },
    {
      "duty": "Communication skills, verbal and written (Advanced)."
    },
    {
      "duty": "Ability to conduct effective presentations (Advanced)."
    },
    {
      "duty": "Proficiency in MS Office (Intermediate)."
    },
    {
      "duty": "Ability to apply fundamentals of the means and methods of construction management to projects."
    },
    {
      "duty": "Thorough knowledge of project processes and how each supports the successful completion of a project."
    },
    {
      "duty": "Ability to build relationships with team members that transcend a project."
    },
    {
      "duty": "Proficiency in project management and accounting software (Intermediate)."
    },
    {
      "duty": "Proficiency in required JE Dunn construction technology (Advanced)."
    },
    {
      "duty": "Proficiency in scheduling software (Intermediate)."
    },
    {
      "duty": "Ability to apply Lean process and philosophy (Intermediate)."
    },
    {
      "duty": "Knowledge of specific trades and scopes of work (Advanced)."
    },
    {
      "duty": "Knowledge of self-perform and labor productivity (Advanced)."
    },
    {
      "duty": "Ability to manage budgets, maximize profitability and generate future work through building relationships (Advanced)."
    },
    {
      "duty": "Knowledge of organizational structure and available resources."
    },
    {
      "duty": "Ability to understand document changes and impact to the project schedule."
    },
    {
      "duty": "Knowledge of layout skill (Advanced)."
    },
    {
      "duty": "Knowledge of crane flagging and rigging (Advanced)."
    },
    {
      "duty": "Knowledge of productivity rates and cost management skills (Intermediate)."
    },
    {
      "duty": "Ability to build relationships and collaborate within a team, internally and externally."
    },
    {
      "duty": "Bachelor’s degree in construction management, engineering or related field (Preferred).In lieu of the above requirements, equivalent relevant experience will be considered."
    },
    {
      "duty": "12+ years construction experience.10+ years field supervision experience."
    },
    {
      "duty": "Experience leading Lean principles on projects (Preferred)."
    },
    {
      "duty": "Valid and unrestricted driver's license required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering or related field (Preferred).In lieu of the above requirements, equivalent relevant experience will be considered."
    }
  ]
}