{
  "meta": [
    {
      "job_title": "Clinical Supervisor for Emergency Services",
      "job_category": "Behavioral Health",
      "job_class": "Supervisor",
      "sector": "Behavioral Health",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides supervision to clinical staff. Provides individual, family, couple or group therapy as indicated."
    },
    {
      "duty": "Provide direct client services to MH clients including individual, family, couples or group therapy. Includes provide 27.10 emergency response as indicated."
    },
    {
      "duty": "Effectively communicate with other MH personnel regarding client needs."
    },
    {
      "duty": "Utilizes Center technology for timely record keeping and report-writing."
    },
    {
      "duty": "Interface with other community agencies and resources to optimize service to MH clients."
    },
    {
      "duty": "Assist in providing or arranging for case management services if needed."
    },
    {
      "duty": "Is responsible for record-keeping and reports as may be required by Center administration, and to subscribe to the code of ethics of this discipline."
    },
    {
      "duty": "Provides leadership and support to staff in the development of their individual Developmental Plan."
    },
    {
      "duty": "Participates with other administrative staff in facilitating staff grievances, complaints and discipline appropriately."
    },
    {
      "duty": "Effectively uses the model of management endorsed by this organization."
    },
    {
      "duty": "Provides leadership in understanding and implementing the Center's objectives, goals, mission and values."
    },
    {
      "duty": "Exhibits the leadership qualities / skills expected of a person in a supervisory position."
    },
    {
      "duty": "Offers mental health consultation on a planned, formal or informal basis to allied disciplines in the community."
    },
    {
      "duty": "Work closely with MH management and personnel to create new client service programs and evaluate those existing programs."
    },
    {
      "duty": "Identify community resources and facilitate client referrals."
    },
    {
      "duty": "Serve as a liaison and resource to San Luis Valley community agencies and area educators concerning persons with mental illness."
    },
    {
      "duty": "Delegates responsibility appropriately."
    },
    {
      "duty": "Provides adequate and timely evaluation of staff."
    },
    {
      "duty": "Along with the Program Coordinator, oversees specific grants as assigned and completes necessary documentation according to requirements of the grants."
    }
  ],
  "skills": [
    {
      "skill": "Clinical Supervision",
      "experience": 5
    },
    {
      "skill": "Therapy",
      "experience": 5
    },
    {
      "skill": "Leadership Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Case Management",
      "experience": 5
    },
    {
      "skill": "Patient Advocacy",
      "experience": 5
    },
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "Mental Health Consultation",
      "experience": 5
    },
    {
      "skill": "Resource Management",
      "experience": 5
    },
    {
      "skill": "Crisis Intervention",
      "experience": 5
    },
    {
      "skill": "Record Keeping",
      "experience": 5
    },
    {
      "skill": "Ethical Compliance",
      "experience": 5
    },
    {
      "skill": "Staff Evaluation",
      "experience": 5
    },
    {
      "skill": "Grant Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in Clinical Psychology, Counseling, or a related field (Ph.D. preferred)"
    }
  ]
}