{
  "meta": [
    {
      "job_title": "Inside Sales/Applications Engineer",
      "job_category": "Sales",
      "job_class": "Engineer",
      "sector": "Sales",
      "salary": 70000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Generate revenue by soliciting and obtaining orders; producing quotes and proposals; understanding and interpreting technical requirements; providing technical information; developing accounts in support of the Business Segment Managers, Territory Managers, and Sales Engineers."
    },
    {
      "duty": "Assess competitors by analyzing and summarizing competitor information and trends; identifying sales opportunities."
    },
    {
      "duty": "Telephone/Videomeets with prospects and existing customers to identify appropriate contacts, qualify and drive leads through the sales pipeline."
    },
    {
      "duty": "Qualifies and generates sales opportunities by researching and identifying potential accounts; soliciting new accounts; building rapport; preparing quotations."
    },
    {
      "duty": "Engages in technical discussions with potential clients through demonstrations and presentations."
    },
    {
      "duty": "Identifies and closes additional purchases of products."
    },
    {
      "duty": "Develops accounts by checking customer's buying history; suggesting related and new items; explaining feature, function, benefit, and proof."
    },
    {
      "duty": "Maintains and improves quality results by following standards; recommending improved policies and procedures."
    },
    {
      "duty": "Updates job knowledge by studying new product descriptions; participating in educational opportunities."
    },
    {
      "duty": "Accomplishes department and organization goals by accepting ownership for accomplishing new and different requests; exploring opportunities to add value to job accomplishments."
    },
    {
      "duty": "Working within a proven 9-step sales process. Develops and supports 3 wide 3 deep relationships with customers and prospects."
    },
    {
      "duty": "Remains knowledgeable and up-to-date on changes and developments in the B2B infrastructure and e-commerce industries."
    },
    {
      "duty": "Prepare and present demonstrations and applications of company products to customers."
    },
    {
      "duty": "Perform pre and post-sales technical support to customers for their specific applications."
    },
    {
      "duty": "Conduct internal and external product and application training."
    },
    {
      "duty": "Interface with sales, engineering, manufacturing, and quality functions to ensure the successful specification, sale, and installation of existing and new products."
    },
    {
      "duty": "Act as a technical resource to customers and other departments to address inquiries and problems."
    },
    {
      "duty": "Country of Origin, HTS Code Requests, and compliance requests (ex. RoHS)"
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. Mechanical Engineering, B.S. Electrical Engineering, B.S. Engineering Mechanics, B.S. Computer Engineering, B.S. Industrial Engineering, Equivalent Technical Degree, B.S.B.A. Marketing"
    },
    {
      "credential": "Proficiency in Computer Programs such as Microsoft Word, Excel, PowerPoint, Google Suite, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 50
    }
  ]
}