{
  "meta": [
    {
      "job_title": "Information Technology Manager",
      "job_category": "Office",
      "job_class": "Manager",
      "sector": "Technology",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "IT Administration",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Application Management",
      "experience": 5
    },
    {
      "skill": "Business Process Analysis",
      "experience": 5
    },
    {
      "skill": "Vista ERP System",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Process Optimization",
      "experience": 5
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 5
    },
    {
      "skill": "Technical Training",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create, maintain, and expand the company’s business systems for driving efficiency through technology projects."
    },
    {
      "duty": "Manage IT Administration, Project Management, and Application Management."
    },
    {
      "duty": "Identify, categorize, and implement technology projects to enhance and automate business processes."
    },
    {
      "duty": "Develop and manage project budgets and schedules."
    },
    {
      "duty": "Assist in optimizing the scope, benefits, and risks of proposed projects, and manage user and management expectations."
    },
    {
      "duty": "Leverage existing technology platforms to drive additional value."
    },
    {
      "duty": "Be the lead interface between departments to ensure stakeholder needs are met."
    },
    {
      "duty": "Surface and document department requirements, conduct interviews with project stakeholders, and present results."
    },
    {
      "duty": "Create and document operational interface instructions for business applications, test for operational readiness, and integrate data collection and reporting into the ERP system."
    },
    {
      "duty": "Maintain responsibility over key business applications and be the Subject Matter Expert in various business applications."
    },
    {
      "duty": "Train personnel on business applications and provide technical assistance and mentoring as needed."
    },
    {
      "duty": "Perform additional assignments as directed, including travel and field assignments."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "4-year College degree preferred, High school diploma or GED required"
    }
  ]
}