{
  "meta": [
    {
      "job_title": "Talent Acquisition Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruitment",
      "experience": 7
    },
    {
      "skill": "OFCCP Compliance",
      "experience": 7
    },
    {
      "skill": "EEO Knowledge",
      "experience": 7
    },
    {
      "skill": "Negotiation Skills",
      "experience": 7
    },
    {
      "skill": "Microsoft Office",
      "experience": 7
    },
    {
      "skill": "Applicant Tracking System",
      "experience": 7
    },
    {
      "skill": "Human Resource Information Systems",
      "experience": 7
    },
    {
      "skill": "Interviewing Skills",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and maintain effective communication channels with hiring managers and business leadership."
    },
    {
      "duty": "Identify and execute steps for internal career advancement and succession planning."
    },
    {
      "duty": "Develop and execute the company's diversity recruitment strategy to support compliance objectives."
    },
    {
      "duty": "Establish relationships with colleges, universities, and professional organizations to attract diverse candidates."
    },
    {
      "duty": "Support affirmative action team to complete timely submissions of affirmative action plan."
    },
    {
      "duty": "Maintain strict confidentiality and demonstrate exceptional interpersonal and communication skills."
    },
    {
      "duty": "Ensure compliance with regulatory requirements and maintain a high level of quality in recruitment administrative processes."
    },
    {
      "duty": "Build good working relationships with recruitment agencies and contract staffing companies."
    },
    {
      "duty": "Exhibit a strong sense of urgency to meet the organization's staffing needs."
    },
    {
      "duty": "Exercise full discretionary authority to assign work to recruitment staff and work independently to deliver work products against aggressive deadlines."
    },
    {
      "duty": "Work with creativity and latitude to meet goals and objectives, relying on experience and judgment to plan and accomplish goals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, HR, Organizational Development, or related field (Master's preferred)"
    }
  ]
}