{
  "meta": [
    {
      "job_title": "Senior Sales Relationship Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 175000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 9
    },
    {
      "skill": "Client Prospecting",
      "experience": 9
    },
    {
      "skill": "Market Share Analysis",
      "experience": 9
    },
    {
      "skill": "User Feedback Analysis",
      "experience": 9
    },
    {
      "skill": "Marketing Collateral Development",
      "experience": 9
    },
    {
      "skill": "Industry Events Planning",
      "experience": 9
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Market trading capabilities to potential clients, focusing on ETFs, Options and Futures."
    },
    {
      "duty": "Prospect new clients and increase existing client interest demonstrated through increased client inquiry."
    },
    {
      "duty": "Increase trading volume demonstrated through incremental revenues."
    },
    {
      "duty": "Increase market share and stay ahead of any competition."
    },
    {
      "duty": "Obtain and share user feedback and make thoughtful suggestions around systems enhancements, functionality, and usability."
    },
    {
      "duty": "Work with product management, sales associates, and analysts to achieve and exceed sales goals and maximize end-user training."
    },
    {
      "duty": "Coordinate the development and refinement of marketing collateral, as needed, with the Marketing team."
    },
    {
      "duty": "Identify industry events to attend, as applicable."
    },
    {
      "duty": "Work with the Relationship Managers to ensure a coordinated approach to our client base."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "9+ years’ significant experience in a sales capacity. Prior broker/dealer, buy-side firm, or other electronic trading venue experience. Detailed knowledge of the ETF market, fixed income markets, and derivatives. Passion for electronic trading and the resilience to effectively promote its continued evolution through MarketAxess products."
    }
  ]
}