{
  "meta": [
    {
      "job_title": "Construction Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Leads all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Manages and oversees company staff, subcontractors, suppliers and programs such as Safety, Quality and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Develops work plans for subcontractors and self-performed work."
    },
    {
      "duty": "Coordinates and manages the care, custody and control of the project site."
    },
    {
      "duty": "Leads various meetings including daily standup and weekly trade meetings."
    },
    {
      "duty": "Creates, manages, changes and implements the project’s schedule as needed, in conjunction with the Project Manager."
    },
    {
      "duty": "Communicates key project information to owners, design team, governing authorities, subcontractors, suppliers and other departments."
    },
    {
      "duty": "Manages material and equipment needs for the project."
    },
    {
      "duty": "Participates in the negotiation process with the owner and architect to gain agreement for project changes."
    },
    {
      "duty": "Understands JE Dunn’s policy of non-discrimination and ensures positive, proactive implementation throughout the organization."
    },
    {
      "duty": "Manages fairly complex stand-alone projects from start to finish."
    },
    {
      "duty": "Assumes responsibility for management, scheduling, production, safety and quality on their project or their portion of the project."
    },
    {
      "duty": "Identifies, understands and actively manages project risks."
    },
    {
      "duty": "Participates with project team in project pursuits."
    },
    {
      "duty": "Utilizes awareness, experience and knowledge to identify problems and recommends solutions for review and implementation by the team."
    },
    {
      "duty": "Manages deliverables provided by a variety of internal resources and functions such as IPS, logistics, etc."
    },
    {
      "duty": "Partners with field leadership to establish field staffing for their assigned project."
    },
    {
      "duty": "Participates with the field operations leadership and the project team to put together a project pre plan; implements, monitors and adjusts as needed throughout the project lifecycle."
    },
    {
      "duty": "Manages timecard approval process to ensure reporting of accurate hours and proper cost codes."
    },
    {
      "duty": "Understands and applies the terms and conditions of the owner and subcontractor contracts for the project."
    },
    {
      "duty": "Responsible for identifying and recruiting top talent."
    },
    {
      "duty": "Leads, supports and promotes a culture of diversity and inclusion within JE Dunn."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering or related field (Preferred)"
    }
  ]
}