{
  "meta": [
    {
      "job_title": "IT Support Specialist",
      "job_category": "IT",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "IT Support",
      "experience": 3
    },
    {
      "skill": "Incident Management",
      "experience": 3
    },
    {
      "skill": "Hardware Deployment",
      "experience": 3
    },
    {
      "skill": "Knowledge Base Documentation",
      "experience": 3
    },
    {
      "skill": "Customer Engagement",
      "experience": 3
    },
    {
      "skill": "Relationship Building",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide exceptional IT support (Incident and IMAC) to internal customers ensuring a high level of customer satisfaction."
    },
    {
      "duty": "Ensure service levels for customers are met, identifies opportunities for improvements and implements these as agreed upon."
    },
    {
      "duty": "Stage and configure machines for new hires and deploy new hardware as needed."
    },
    {
      "duty": "Work with the Build Center team to provide timely delivery on all hardware deployments."
    },
    {
      "duty": "Complete workstation replacements for users that qualify for new workstation replacements."
    },
    {
      "duty": "Test, configure, install and manage repair of all IT related equipment (hardware and software)."
    },
    {
      "duty": "Knowledge base documentation contribution."
    },
    {
      "duty": "Accurately log and track ticket related workload in a timely fashion."
    },
    {
      "duty": "Customer engagement – Ensure frequent and timely updates to internal customers regarding status of any outstanding issues and work that is in progress."
    },
    {
      "duty": "Form effective relationships with Business, Brands, Corporate functions, Delivery, Apps Support, fellow team members and External Service Providers."
    },
    {
      "duty": "Above all, focus on support of people as opposed to the technology."
    }
  ]
}