{
  "meta": [
    {
      "job_title": "Senior Resource Technician",
      "job_category": "Operations",
      "job_class": "Technician",
      "sector": "Manufacturing",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Aptitude",
      "experience": 4
    },
    {
      "skill": "Equipment Operation",
      "experience": 5
    },
    {
      "skill": "Preventative Maintenance",
      "experience": 5
    },
    {
      "skill": "Warehouse Material Handling",
      "experience": 4
    },
    {
      "skill": "Packaging",
      "experience": 4
    },
    {
      "skill": "GMP Practices",
      "experience": 5
    },
    {
      "skill": "Facilities Maintenance",
      "experience": 4
    },
    {
      "skill": "Process Safety Management (PSM)",
      "experience": 4
    },
    {
      "skill": "Utility Equipment Monitoring",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Operate various equipment related to hop processing, including tanks, agitators, pumps, valves, filtration equipment, and heat exchangers."
    },
    {
      "duty": "Control and monitor multiple processes covered by OSHA’s Process Safety Management Standards."
    },
    {
      "duty": "Participate in Process Safety Management (PSM) as an individual contributor."
    },
    {
      "duty": "Perform preventative and predictive maintenance on mechanical equipment."
    },
    {
      "duty": "Provide breakdown support and troubleshooting for equipment as needed."
    },
    {
      "duty": "Responsible for maintaining good GMP practices, plant sanitation, and facilities maintenance."
    },
    {
      "duty": "Perform warehouse material handling functions, including forklift operation and loading and unloading of materials."
    },
    {
      "duty": "Package advanced hop products into standard containers, including filling, sealing, labeling, palletizing, and handling of product."
    },
    {
      "duty": "Provide support and monitoring of utility-related equipment, including boilers, compressors, water softeners, etc."
    },
    {
      "duty": "Provide support and monitoring of other relevant equipment as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Technical background (through an apprenticeship or an associate degree program) and experience in an operations role, preferably in a food or beverage industry or other similar facilities."
    },
    {
      "credential": "Experience in a maintenance-based role, manufacturing environment, and the food and beverage industry is preferred."
    }
  ]
}