{
  "meta": [
    {
      "job_title": "Clinical Business Operations Site Contracting Contractor",
      "job_category": "Contracts",
      "job_class": "Business Operations",
      "sector": "Pharmaceuticals",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Draft, review and negotiate contracts in accordance with established standards and guidelines."
    },
    {
      "duty": "Collaborate with internal stakeholders across departments to incorporate and finalize contract working changes, ensuring accuracy and alignment with all parties' requirements."
    },
    {
      "duty": "Monitor vendor compliance with contract terms, promptly identifying and addressing any deviations and highlighting potential risks or issues related to adherence to the appropriate parties."
    },
    {
      "duty": "Monitor contract-related expenses and financial commitments to ensure alignment with approved budgets and financial targets."
    },
    {
      "duty": "Generate routine reports summarizing contract status, KPIs, negotiated cost savings, and vendor performance for management review."
    },
    {
      "duty": "Maintain an organized digital repository for contracts, amendments, and related documentation."
    },
    {
      "duty": "Serve as a bridge between internal departments, external vendors, and service providers to ensure information is shared seamlessly."
    },
    {
      "duty": "Analyze contract data periodically and provide insights to management for decision making and process enhancements."
    },
    {
      "duty": "Provide administrative support across the contract's lifecycle, including data entry, document formatting, and communication coordination."
    },
    {
      "duty": "Effectively identify and escalate contract-related challenges or deviations from established protocols to management, providing timely insights for informed decision making and resolution."
    }
  ],
  "skills": [
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Vendor Relationship Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Report Generation",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Legal Compliance",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Digital Repository Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business Administration, Legal Studies, Life Sciences, or related field (Master's preferred)"
    },
    {
      "credential": "5+ years of progressive experience in clinical research site contracting and budgeting oversight roles within a pharmaceutical company, CRO, or relevant industry vendor."
    },
    {
      "credential": "Knowledgeable with contract management and fair market value principles, legal terminology, and negotiation concepts."
    },
    {
      "credential": "Adept at navigating contract processes from inception to execution."
    },
    {
      "credential": "Proficiently oversee and enforce contract terms and conditions."
    },
    {
      "credential": "Intermediate proficiency with Microsoft Office suite (Outlook, Word, Excel, PowerPoint) and Adobe."
    },
    {
      "credential": "Demonstrate a strong capacity to adjust to shifting and competing priorities, varying work assignments, and evolving deliverables."
    },
    {
      "credential": "Ability to work with international colleagues demonstrating an ability to bridge the differences between cultural nuances."
    }
  ]
}