{
  "meta": [
    {
      "job_title": "Design Specialist",
      "job_category": "Art & Design",
      "job_class": "Specialist",
      "sector": "Art & Design",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conceptualize and design model home interiors in line with the \n\"Perry Homes\" brand."
    },
    {
      "duty": "Identify and evaluate trends and design styles."
    },
    {
      "duty": "Select, purchase, coordinate, and maintain inventory necessary to create budgeted model home designs. \"Inventory\" includes artwork, furnishings, rugs, lamps, plants, floral arrangements, and a variety of other decorating accessories."
    },
    {
      "duty": "Manage the set-up of model homes to make certain inventory is arranged in model homes in accordance with intended designs."
    },
    {
      "duty": "Prepare, coordinate and complete schedules, records and paperwork as necessary to carry out job duties."
    },
    {
      "duty": "Collaborate with other design team members on projects."
    },
    {
      "duty": "Assist in maintaining the Accessory Warehouse, model home revisions, and close downs."
    },
    {
      "duty": "Determine reuse/returned furniture and accessories for donation."
    },
    {
      "duty": "Schedule new and current vendor appointments."
    },
    {
      "duty": "Assist Manager and Director of Model Homes on projects."
    }
  ],
  "skills": [
    {
      "skill": "Artistic skill & insight",
      "experience": 4
    },
    {
      "skill": "Creativity combined with flexibility",
      "experience": 4
    },
    {
      "skill": "Strong multi-tasking and time management skills",
      "experience": 4
    },
    {
      "skill": "Demonstrated computer skills including a working knowledge of MS Office products, including Outlook, Excel, Word, and PowerPoint",
      "experience": 4
    },
    {
      "skill": "Valid Driver’s License with acceptable driving record and reliable transportation",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "College degree in Interior Design or another design-related field required."
    }
  ]
}