{
  "meta": [
    {
      "job_title": "Contracts Manager",
      "job_category": "Legal",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Contract Review & Redline",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Legal Contract Management",
      "experience": 5
    },
    {
      "skill": "PeopleSoft",
      "experience": 5
    },
    {
      "skill": "Oracle",
      "experience": 5
    },
    {
      "skill": "Certified Professional in Supply Management (CPSM)",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Read, review, and redline contracts, as well as negotiate contract terms."
    },
    {
      "duty": "Identify, lead, and execute spend category and supply strategies."
    },
    {
      "duty": "Work with key business partners to prioritize sourcing initiatives and/or contract negotiations."
    },
    {
      "duty": "Manage Requests for Information (RFI) and Proposal (RFP) from suppliers, competitive bidding events, supplier proposal reviews, and negotiations with suppliers."
    },
    {
      "duty": "Collaborate with corporate legal services to identify supplier negotiation strategies and review and execute contracts."
    },
    {
      "duty": "Periodically review and analyze supply chain to ensure supplier base is consistent with corporate responsibility goals."
    },
    {
      "duty": "Evaluate the utilization of the products used post implementation."
    },
    {
      "duty": "Implement process improvements, increase operational efficiencies, ensure data accuracy, compliance, and positive customer experience."
    },
    {
      "duty": "Evaluate spending and vendors to identify and execute strategic sourcing initiatives, contract negotiations, and additional sourcing and category management activities."
    },
    {
      "duty": "Manage stakeholder engagement throughout the initiative, delegation of activities and tasks to drive process to completion."
    },
    {
      "duty": "Provide periodic updates, report on progress and expected results to business area leadership."
    },
    {
      "duty": "Analyze and continuously monitor market and industry data to ensure programs remain competitive."
    },
    {
      "duty": "Leverage process teams, applications, and tools to identify the best approach for handling operational transactions and drive efficiency."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in business, finance, supply chain, economics, or contract law."
    },
    {
      "credential": "Certified Professional in Supply Management (C.P.S.M. or CMRP) preferred."
    }
  ]
}