{
  "meta": [
    {
      "job_title": "IT Network Administrator",
      "job_category": "Information Technology",
      "job_class": "Administrator",
      "sector": "Software Engineering",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintains and supports the corporate network, including troubleshooting network performance issues, and routine maintenance of servers, computers, printers, and other technology infrastructure."
    },
    {
      "duty": "Acts as the first-level support and central contact for issues received via the ticketing system, emails, walk-ins, and/or telephone inquiries from the user community."
    },
    {
      "duty": "Provides application and hardware help desk support, ensuring technology users receive exceptional service or help with their questions and concerns."
    },
    {
      "duty": "Configures, supports, and maintains the corporate network, servers, and email, emphasizing security, integrity, and recoverability."
    },
    {
      "duty": "Monitors network performance, health, and capacity and implements necessary adjustments to ensure optimal functionality and reliability."
    },
    {
      "duty": "Maintains an accurate hardware/software inventory for all relevant IT-managed networking hardware/software."
    },
    {
      "duty": "Researches and resolves problems and issues, ensuring network security by implementing and maintaining appropriate access controls, firewalls, and intrusion detection systems."
    },
    {
      "duty": "Maintains level 1 support of electronic access control and network-connected camera systems for all locations."
    },
    {
      "duty": "Maintains and supports audio/visual and teleconference systems, as well as telecom/VOIP hardware/software."
    },
    {
      "duty": "Conducts all business in accordance with company policies and procedures, and appropriate government laws and regulations."
    }
  ],
  "skills": [
    {
      "skill": "Network Maintenance",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Hardware/Software Inventory",
      "experience": 5
    },
    {
      "skill": "Security Implementation",
      "experience": 5
    },
    {
      "skill": "Access Control Management",
      "experience": 5
    },
    {
      "skill": "Audio/Visual Systems Support",
      "experience": 5
    },
    {
      "skill": "Telecom/VOIP Support",
      "experience": 5
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Technology, Computer Science, or a related field (Master's preferred)"
    }
  ]
}