{
  "meta": [
    {
      "job_title": "Financial Accounting Manager",
      "job_category": "Accounting/Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Accounting",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "General Ledger",
      "experience": 4
    },
    {
      "skill": "Reinsurance",
      "experience": 4
    },
    {
      "skill": "U.S. GAAP and IFRS",
      "experience": 4
    },
    {
      "skill": "Insurance Knowledge",
      "experience": 4
    },
    {
      "skill": "Statutory Filings",
      "experience": 4
    },
    {
      "skill": "Microsoft Office",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support and supervise the financial accounting and statutory reporting processes for the Canadian Branch."
    },
    {
      "duty": "Manage the quarterly and annual data gathering to complete the PC-2 Canadian statutory Filing."
    },
    {
      "duty": "Supervise statutory reporting staff and work collaboratively with others from the Accounting, Actuarial and Legal Divisions."
    },
    {
      "duty": "Manage the monthly Canadian Branch financial reporting close, including the closing schedule and timely and accurate posting of journal entries."
    },
    {
      "duty": "Review monthly statutory financial results for accuracy and reasonableness."
    },
    {
      "duty": "Coordinate with financial planning department on the completion of the annual five-year plan."
    },
    {
      "duty": "Ensure the development and maintenance of proper work papers and other documentation and retain them in accordance with the Company's record retention policy."
    },
    {
      "duty": "Review the PC-2 for accuracy and completeness."
    },
    {
      "duty": "Complete or review annual Canadian statutory footnotes as appropriate."
    },
    {
      "duty": "Ensure external auditors are provided with timely data for financial and regulatory capital Audits."
    },
    {
      "duty": "Ensure the quarterly commentary is accurate and complete."
    },
    {
      "duty": "Manage all reports required to be completed for Canadian regulator (OSFI), Canadian provincial regulators, and Canadian statistical bureaus."
    },
    {
      "duty": "Comply with OSFI requests on a timely basis."
    },
    {
      "duty": "Ensure that the Branch’s internal capital target ratio is maintained. Prepare recommendations to senior management for changes in capital funding levels."
    },
    {
      "duty": "Ensure that adequate and proper funding is in place before year-end for all unregistered reinsurers."
    },
    {
      "duty": "Manage with the Appointed Actuary the completion of the reserve reviews, capital adequacy testing, internal capital target setting, and the economic capital review."
    },
    {
      "duty": "Prepare and update Canadian Branch policies and procedures documentation as needed."
    },
    {
      "duty": "Prepare journal entries for all manual business and financial products."
    },
    {
      "duty": "Prepare invoices and/or disbursement requests for financial products as required."
    },
    {
      "duty": "Review and approve Federal Excise Tax report."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree in Accounting."
    }
  ]
}