{
  "meta": [
    {
      "job_title": "Global Alliance Director for Salesforce",
      "job_category": "Sales",
      "job_class": "Director",
      "sector": "Alliances",
      "salary": 209850,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Strategic Partnerships",
      "experience": 7
    },
    {
      "skill": "Business Development",
      "experience": 7
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 7
    },
    {
      "skill": "Marketing Collaboration",
      "experience": 7
    },
    {
      "skill": "Sales Enablement",
      "experience": 7
    },
    {
      "skill": "Strategic Selling",
      "experience": 7
    },
    {
      "skill": "Cloud Data and Analytics",
      "experience": 7
    },
    {
      "skill": "Multi-tasking",
      "experience": 7
    },
    {
      "skill": "Negotiation",
      "experience": 7
    },
    {
      "skill": "Communication",
      "experience": 7
    },
    {
      "skill": "Problem Solving",
      "experience": 7
    },
    {
      "skill": "Market Analysis",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Be accountable for the success of our relationships with Salesforce and other partnerships, measured through new business opportunities, solution adoption, support of the Snowflake sales team and joint GTM activities."
    },
    {
      "duty": "Engage directly with strategic customers, partners and internal stakeholders as a primary point of contact on our partnerships."
    },
    {
      "duty": "Coordinate the launch of various integrations or joint solutions with Salesforce and other partners."
    },
    {
      "duty": "Coordinate our joint presence at each other’s key events or related industry events."
    },
    {
      "duty": "Develop innovative integrations or business models that align Snowflake objectives."
    },
    {
      "duty": "Collaborate with Marketing and Sales teams to build joint go-to-market plans, marketing engines, and sales strategies materials."
    },
    {
      "duty": "Develop joint sales plays that effectively position Salesforce and other partners in conjunction with the core benefits of Snowflake."
    },
    {
      "duty": "Drive sales enablement efforts around joint solutions across the global Snowflake sales organization; be the partner evangelist within the Snowflake sales organization."
    },
    {
      "duty": "Coordinate the launch of various integrations or joint solutions with Salesforce and other partners."
    },
    {
      "duty": "Coordinate our joint presence at each other’s key events or related industry events."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100
    },
    {
      "student_teacher": 80
    },
    {
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of 7 years of relevant sales, business development, or alliances experience.\nStrong business and financial acumen and an ability to forge creative solutions.\nDemonstrated ability to effectively collaborate across large functional teams (product, sales, finance, legal) in support of customer/partner success.\nStrong skills in multi-tasking, communications, negotiation, organization, and teamwork.\nAn ability to work independently to solve complex problems and deliver growth metrics.\nStrong strategic selling/business development skills.\nExperience in the cloud data and analytics market is preferred; Experience working at or partnering with Salesforce is preferred.\nMBA or advanced degree is a plus."
    }
  ]
}