{
  "meta": [
    {
      "job_title": "Safety Manager",
      "job_category": "Safety",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety Management",
      "experience": 15
    },
    {
      "skill": "Compliance Management",
      "experience": 15
    },
    {
      "skill": "OSHA Regulations",
      "experience": 15
    },
    {
      "skill": "Leadership",
      "experience": 15
    },
    {
      "skill": "Risk Management",
      "experience": 15
    },
    {
      "skill": "Training & Development",
      "experience": 15
    },
    {
      "skill": "EHS Management",
      "experience": 15
    },
    {
      "skill": "Communication Skills",
      "experience": 15
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 15
    },
    {
      "skill": "Construction Site Work",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and champion the safety vision and strategy at all levels of the organization to drive ownership of a comprehensive approach to safety engagement."
    },
    {
      "duty": "Develop, implement, analyze, and evaluate continuous improvement of all safety programs while staying abreast of any changes to laws and regulations that impact the organization."
    },
    {
      "duty": "Oversee compliance with all safety, health, and environmental laws, regulations, corporate policies and customer requirements."
    },
    {
      "duty": "Influence and coach business leaders on development of robust action plans to improve safety performance and to implement strategy moving forward."
    },
    {
      "duty": "Maintain and monitor EHS Management System and associated metrics to determine progress and effectiveness of safety initiatives, programs, processes, and policies."
    },
    {
      "duty": "Interact with insurance companies to manage risk, worker's compensation claims and other return to work programs while developing and implementing cost saving measures to conserve company resources."
    },
    {
      "duty": "Assist individual company safety leaders and mentor the development of the safety team including selection, training, evaluation, and counseling."
    },
    {
      "duty": "Communicate and collaborate with central leadership, regional operations, and project teams to ensure safety strategies, programs, corporate policies and expectations are properly understood and adhered to."
    },
    {
      "duty": "Perform special projects and complete all other duties, as assigned, for the general support of the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Safety Management, Occupational Health and Safety, or related degree; CSP, a plus."
    }
  ]
}