{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Construction Management",
      "experience": 10
    },
    {
      "skill": "Safety Management",
      "experience": 10
    },
    {
      "skill": "Quality Control",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Lean Management",
      "experience": 10
    },
    {
      "skill": "Negotiation",
      "experience": 10
    },
    {
      "skill": "Construction Technology",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead all aspects of the company’s safety culture and create awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Provide management of subcontractors and organization of the overall job and workflow."
    },
    {
      "duty": "Manage and oversee company staff, subcontractors, suppliers, and programs such as Safety, Quality, and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Develop work plans for subcontractors and self-performed work."
    },
    {
      "duty": "Coordinate and manage the care, custody, and control of the project site."
    },
    {
      "duty": "Lead various meetings including daily standup and weekly trade meetings."
    },
    {
      "duty": "Create, manage, change, and implement the project’s schedule as needed, in conjunction with the Project Manager."
    },
    {
      "duty": "Track and monitor project budget and costs by using the project management system’s cost reports and data from the project manager."
    },
    {
      "duty": "Communicate key project information to owners, design team, governing authorities, subcontractors, suppliers, and other departments."
    },
    {
      "duty": "Follow the project filing and documentation organization system as dictated for the project."
    },
    {
      "duty": "Update drawings, logs, diaries, and inspection notebooks."
    },
    {
      "duty": "Approve and/or record unit cost information for weekly reports and complete daily reports, logs, and tracking reports."
    },
    {
      "duty": "Evaluate progress on self-perform work and make adjustments as needed."
    },
    {
      "duty": "Manage material and equipment needs for the project."
    },
    {
      "duty": "Support the procurement and approval processes."
    },
    {
      "duty": "Assist in the selection of the formwork, tools, and equipment necessary to complete self-perform operations."
    },
    {
      "duty": "Manage timecard approval process to ensure reporting of accurate hours and proper cost codes."
    },
    {
      "duty": "Ensure quality compliance through use of specifications, setting quality standards, in–house QA/QC, and outside resources."
    },
    {
      "duty": "Support project closeouts by supervising pre-punch activities and coordinating activities with the owner, architect, and governing authorities."
    },
    {
      "duty": "Gain understanding of the project pursuit process and methodology."
    },
    {
      "duty": "Participate with the field operations leadership and the project team to put together a project pre plan; implement, monitor, and adjust as needed throughout the project lifecycle."
    },
    {
      "duty": "Participate in the negotiation process with the owner and architect to gain agreement for project changes."
    },
    {
      "duty": "Participate with the project team in preparation and presentation for all project review meetings, including the monthly review process and other key project meetings."
    },
    {
      "duty": "Participate in the project buy out meetings with subcontractors and vendors."
    },
    {
      "duty": "Understand and apply the terms and conditions of the owner and subcontractor contracts for the project."
    },
    {
      "duty": "Identify and recruit top talent."
    },
    {
      "duty": "Lead, support, and promote a culture of diversity and inclusion within the organization."
    },
    {
      "duty": "Understand the policy of non-discrimination and ensure positive, proactive implementation throughout the organization."
    },
    {
      "duty": "Manage the largest, most complex stand-alone and/or multiple complex projects from initial planning to completion."
    },
    {
      "duty": "Provide management and/or oversight to multiple projects and project teams."
    },
    {
      "duty": "Provide input, lead, and execute company and regional key strategic initiatives."
    },
    {
      "duty": "Participate in the development of relevant company training content."
    },
    {
      "duty": "Responsible for the selection and development of internal subject matter experts."
    },
    {
      "duty": "Effectively deliver leadership messages to multiple audiences both internally and externally."
    },
    {
      "duty": "Valid and unrestricted driver's license required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering or related field (Preferred). In lieu of the above requirements, equivalent relevant experience will be considered."
    }
  ]
}