{
  "meta": [
    {
      "job_title": "API MuleSoft Consultant",
      "job_category": "Information Technology",
      "job_class": "Consultant",
      "sector": "Software Engineering",
      "salary": 115000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "MuleSoft 4.4",
      "experience": 5
    },
    {
      "skill": "CI/CD Pipeline Implementation",
      "experience": 5
    },
    {
      "skill": "MuleSoft Runtime Fabric (RTF)",
      "experience": 5
    },
    {
      "skill": "Linux OS",
      "experience": 5
    },
    {
      "skill": "GitHub Workflow Implementation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the MuleSoft Development Backlog according to the Specification of the vendor Design and Functional design teams."
    },
    {
      "duty": "Adhere to Santander’s guidelines and Standards for Management and deployment of MuleSoft different environments provided by the infrastructure team following Devops best practices and backlog priorities."
    },
    {
      "duty": "Generate, modify, and Evolve the MuleSoft Development archetype based on APIS adhering to the code standards established."
    },
    {
      "duty": "Support the integration and coordination of parallel programming between the App teams in order to optimize development times and management of software releases according to prioritized backlog."
    },
    {
      "duty": "Establish together with the Devops area, the Management of the repository and the code and versioning strategy for the correct control of the code base and continuous integration."
    },
    {
      "duty": "Participate in architecture Sessions to establish and design technical solutions for project or integration based on approved blueprints."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Software Engineering, or a related field (Master's preferred)"
    }
  ]
}