{
  "meta": [
    {
      "job_title": "Sr. Workday Talent & Performance/Absence Business Systems Analyst",
      "job_category": "Business Systems Analysis",
      "job_class": "Senior Analyst",
      "sector": "Management",
      "salary": 155000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Workday HCM",
      "experience": 7
    },
    {
      "skill": "Absence Management",
      "experience": 7
    },
    {
      "skill": "Talent & Performance Management",
      "experience": 7
    },
    {
      "skill": "Configuration",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "System Enhancement",
      "experience": 7
    },
    {
      "skill": "Test Plan Development",
      "experience": 7
    },
    {
      "skill": "Reporting",
      "experience": 7
    },
    {
      "skill": "Business Process Analysis",
      "experience": 7
    },
    {
      "skill": "Data Privacy",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Expert level understanding of Workday Talent & Performance Management, Core HCM, and Absence business processes, technical & configuration capability, and maintain a level of mastery for future releases."
    },
    {
      "duty": "Stay well-informed on and manage Workday system enhancement, releases and changes. Educate our HR teams on enhancements and lead associated deployment activities, inclusive of regression testing, data & integration validation, downstream impact analysis and assurance of overall system performance/stability."
    },
    {
      "duty": "Partner with key stakeholders to create system configuration documents, detailed functional specification documents, test plans and test cases and ultimately leading testing strategy for the system and user acceptance testing."
    },
    {
      "duty": "Develop and create customized reports, dashboards for all areas of the business."
    },
    {
      "duty": "Work with HR and L&D teams to integrate talent development strategies into the Workday platform. Implement tools for identifying high-potential employees, succession planning, and career paths. Ensure the accuracy and integrity of Talent/ Absence-related data in the Workday system and that absence policies in the Workday system are compliant with legal requirements and align with the organization's policies."
    },
    {
      "duty": "Assist in ensuring that all development efforts stay within budget and are completed by agreed to deadlines. Safeguard sensitive information and ensure data privacy."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "7+ years of business systems analysis/engineering, solution design, configuration and deployment experience in Workday HCM, Absence, Talent/performance in a global environment. Full life cycle implementation & production support experience. Extensive understanding of the end-to-end functional HR business processes. Demonstrable ability to configure absence types, policies, accruals, and other absence-related settings within the Workday system. Customize performance evaluation forms, competency frameworks, and talent profiles to meet the organization's needs. Strong knowledge of defining performance management processes, including goal setting, continuous feedback, and performance reviews. Designed, configured and implemented workflows for performance appraisal cycles, including self-assessment, manager reviews, and calibration sessions. Self-starter, self-motivated, able to work independently, prioritize effectively, and perform multiple tasks under minimal supervision. Intellectually curious to learn new technologies and applications. Workday Certifications in Absence, Talent & Performance are highly desirable. Additional Workday certification in another module is preferred. Experience with other Workday modules - HR Case Mgmt, Peakon, Journey. Strong expertise in Workday business processes, Security, and Reporting frameworks. CornerStone OnDemand LMS, Jira, Project Management & ADP GlobalView experience. Data migration and testing lead experience."
    }
  ]
}