{
  "meta": [
    {
      "job_title": "Financial Project Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Management",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Accounting",
      "experience": 6
    },
    {
      "skill": "Team Leadership",
      "experience": 6
    },
    {
      "skill": "Budget Planning",
      "experience": 6
    },
    {
      "skill": "Microsoft Office",
      "experience": 6
    },
    {
      "skill": "Construction Industry Knowledge",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive the culture within department and project teams on the foundation of the company core values and guiding principles."
    },
    {
      "duty": "Assign Project Financial Specialists to specific projects and oversee work deliverables."
    },
    {
      "duty": "Review and approve monthly construction and development draw packages ensuring 7-day Draw Schedule is met and journal entries are complete, including billings and fee."
    },
    {
      "duty": "Field questions from Project Financial Specialists on contracts, draws, invoices, etc."
    },
    {
      "duty": "Lead processes to set up and close out projects; establish draw due dates for new projects; create schedules to ensure all required tasks are completed timely; prepare final reconciliations at close out; verify all final unconditional lien waivers are received; obtain required signatures on retainage release notices; and participate in weekly project team meetings."
    },
    {
      "duty": "Approve construction department expense reports."
    },
    {
      "duty": "Mentor, train, manage, and provide leadership and direction for Project Financial Specialists."
    },
    {
      "duty": "Assist Project Financial Director develop, implement, and maintain annual budget for Project Financial Team and initiatives."
    },
    {
      "duty": "Enforce policies and procedures that pertain to the Project Financial Teams, Field Staff, and Project Managers."
    },
    {
      "duty": "Ensure all Project Financial Team deadlines for direct cost updates, draws, contract execution, PCCO/CCO entries, GCPay approvals, invoices, journal entries, reconciliations, construction expense approvals, etc., are being regularly met and proactively communicate any challenges that might prevent this from occurring."
    },
    {
      "duty": "Maintain constant, proactive, and clear communications with Project Financial Director regarding project status, team dynamics, team and individual performance, potential risk, challenges, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Accounting, Finance or Business, preferred. Notary Public. A minimum 4 to 6 years of experience in accounting, finance, and/or construction cost management required with a minimum of 4 years spent in a management position. Job cost experience preferred. Account payable / Accounts receivable experience preferred. Must be proficient in Microsoft Office applications [Excel, Word & Power Point a must]. Must possess a high level of professionalism, organization, and maintain confidentiality. Ability to work in a fast-paced environment. Must be knowledgeable about applicable state lien laws. Construction industry experience, preferred."
    }
  ]
}