{
  "meta": [
    {
      "job_title": "Internal Audit Associate",
      "job_category": "Accounting",
      "job_class": "Associate",
      "sector": "Accounting",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "SOX Controls Testing",
      "experience": 3
    },
    {
      "skill": "Risk Assessment",
      "experience": 3
    },
    {
      "skill": "Internal Audit",
      "experience": 3
    },
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Process Documentation",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "CPA",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform testing over the design and operating effectiveness of assigned SOX controls and review testing performed by staff members."
    },
    {
      "duty": "Coordinate and attend walkthroughs, send and manage requests, and document process narratives, flowcharts, and risk control matrices."
    },
    {
      "duty": "Assist in evaluation of SOC 1 reports."
    },
    {
      "duty": "Maintain SOX platform and ensure data is up to date."
    },
    {
      "duty": "Oversee work performed by team members."
    },
    {
      "duty": "Play a critical role in the continued enhancement of the SOX program in response to a changing control environment and changing processes and technology within the Company."
    },
    {
      "duty": "Maintain a high level of visibility across the organization with various levels of Management and serve as a key point of contact for lines of business."
    },
    {
      "duty": "Manage communications with key partners, including messaging of SOX objectives and requirements, managing request lists, and facilitating discussions on controls."
    },
    {
      "duty": "Collaborate with business line partners to review SOX documentation (risk control matrices, narratives, flowcharts) and identify areas where control enhancements and/or documentation improvements are needed in some of the highest risk areas of the Company."
    },
    {
      "duty": "Complete and/or review SOX testing for key controls identified in the walkthrough process. Coordinate testing approach and align expectations with external auditors to ensure documentation and testing complies with industry standards (including PCAOB) and allows for reliance by the external auditors."
    },
    {
      "duty": "Perform other duties/special projects as assigned."
    }
  ],
  "subjective_elements": [
    {
      "student_teacher": 50,
      "soldier_general": 30,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in accounting or related field required, CPA or CIA designation preferred"
    }
  ]
}