{
  "meta": [
    {
      "job_title": "LVN",
      "job_category": "Nursing",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Assessment Data Collection",
      "experience": 1
    },
    {
      "skill": "Basic Life Support",
      "experience": 1
    },
    {
      "skill": "LVN Experience",
      "experience": 1
    },
    {
      "skill": "IV Therapy/Blood Withdrawal Certification",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Patient Education",
      "experience": 1
    },
    {
      "skill": "Plan of Care",
      "experience": 1
    },
    {
      "skill": "Patient Advocacy",
      "experience": 1
    },
    {
      "skill": "Documentation",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs individualized nursing care for patients/families under the direction of an RN."
    },
    {
      "duty": "Uses and practices basic assessment data collection, participates in planning, executes interventions in accordance with the Plan Of Care and contributes to evaluation of outcomes."
    },
    {
      "duty": "Communicates to ensure patient/family educated Plan Of Care and planned treatments."
    },
    {
      "duty": "Documents assessment data collected and communicates/contributes data to RN for analysis and interpretation."
    },
    {
      "duty": "Coordinates patient care activities, workflow, and patient progress with other healthcare team members."
    },
    {
      "duty": "Implements plan of care per department guidelines and refers practices outside of scope to RN."
    },
    {
      "duty": "Gives constructive feedback to peers regarding work performance and notifies supervisor of suspected performance issues."
    },
    {
      "duty": "Encourages patient and family participation in decision making and acts to uphold individual/family rights."
    },
    {
      "duty": "Identifies learning needs including barriers/readiness and recognizes barriers to communication with patient and family."
    },
    {
      "duty": "Demonstrates understanding of patient/family goals and makes recommendations to the multidisciplinary team in development of the patient's plan of care."
    },
    {
      "duty": "Updates written plan of care per direction of RN and collects data indicative of patient/family response to care per department guidelines."
    },
    {
      "duty": "Reports data/information to team members in determining the need to alter goals and interventions and contributes observations and data to patient care conferences."
    },
    {
      "duty": "Documents patients' response to care."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "1 Year LVN experience in an acute care setting or related area.AHA Basic Life Support for Healthcare Professional (AHA BLS Healthcare) - American Heart Association -REQUIREDCalifornia Licensed Vocational Nurse (LVN) - CA Board of Vocational Nursing & Psychiatric Technicians -REQUIRED"
    }
  ]
}