{
  "meta": [
    {
      "job_title": "Buyer II",
      "job_category": "Procurement",
      "job_class": "Associate",
      "sector": "Procurement",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Contract Development",
      "experience": 2
    },
    {
      "skill": "Bidding Process Administration",
      "experience": 2
    },
    {
      "skill": "Financial Records Management",
      "experience": 2
    },
    {
      "skill": "Market Research",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Negotiation Skills",
      "experience": 2
    },
    {
      "skill": "Database Management",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review, prepare, source, and analyze solicitation documents and procure a wide variety of high-value supplies, services, materials, and equipment."
    },
    {
      "duty": "Identify repetitive commodity buying patterns for possible university-wide contracts and issue a broad range of contracts including professional service agreements, leases, software related agreements, and other miscellaneous campus contracts."
    },
    {
      "duty": "Prepare contracts to ensure that goods and services are delivered consistent with contract and bid specifications and negotiate routine terms and conditions according to the California State Statutes and Codes."
    },
    {
      "duty": "Develop and negotiate contracts and agreements for services and leases; award and prepare complex customized purchase orders, contracts, service agreements, or leases."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Equivalent to an undergraduate degree in purchasing, marketing, accounting, business, or other appropriate field. Additional experience which has demonstrated that the applicant has acquired and successfully applied the knowledge and abilities shown above may be substituted for the required education on a year-for-year basis"
    }
  ]
}