{
  "meta": [
    {
      "job_title": "Engineering Technologist",
      "job_category": "Engineering",
      "job_class": "Technologist",
      "sector": "Engineering",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Apply technical skills to evaluate options and design safe, cost-effective, and reliable facilities for residential, commercial, and industrial projects."
    },
    {
      "duty": "Demonstrate the ability to properly apply various codes, requirements, regulations, policies, and procedures to all assigned work."
    },
    {
      "duty": "Develop skills to safely make job-site visits and interact with construction personnel."
    },
    {
      "duty": "Prepare project and job packages that include material lists, requisitions, labor estimates, site drawings, and construction drawings for various installations of electrical facilities."
    },
    {
      "duty": "Develop skills to accurately evaluate loading on distribution equipment such as transformers & fusing."
    },
    {
      "duty": "Learn utility construction practices on public right of way (ROW) and private land."
    },
    {
      "duty": "Communicate job status to assure client expectations and deliverable dates are met."
    },
    {
      "duty": "Develop relationships with key internal and external customers while supporting both company and client's business goals and expectations."
    },
    {
      "duty": "Maintain files and records in an organized manner."
    },
    {
      "duty": "Mentor under experienced personnel, supervision, management, and PE."
    },
    {
      "duty": "Perform other duties as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering or a related field (Master's preferred)"
    }
  ],
  "skills": [
    {
      "skill": "Technical Design",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Client/Customer Design",
      "experience": 2
    },
    {
      "skill": "Workflow Processes/Procedures",
      "experience": 2
    },
    {
      "skill": "Design Software",
      "experience": 3
    },
    {
      "skill": "Work Management Tools",
      "experience": 2
    },
    {
      "skill": "Utility Construction Practices",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    }
  ]
}