{
  "meta": [
    {
      "job_title": "Senior Technical Writer",
      "job_category": "Technical Writing",
      "job_class": "Lead II",
      "sector": "Creative Design",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technical Writing",
      "experience": 5
    },
    {
      "skill": "Agile Environments",
      "experience": 5
    },
    {
      "skill": "Information Design",
      "experience": 5
    },
    {
      "skill": "Bilingual Skills",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Visio",
      "experience": 5
    },
    {
      "skill": "Confluence",
      "experience": 3
    },
    {
      "skill": "JIRA",
      "experience": 3
    },
    {
      "skill": "Healthcare Insurance Processes",
      "experience": 3
    },
    {
      "skill": "Agile Processes",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages projects independently and creates content targeted to both business and technical audiences."
    },
    {
      "duty": "Collaborates with software developers, quality engineers, and product managers to produce clear, concise, well-written documentation."
    },
    {
      "duty": "Tests user documentation against system functionality."
    },
    {
      "duty": "Works with client support teams to analyze and address external customers' documentation needs."
    },
    {
      "duty": "Drives documentation projects to completion within established timeframes."
    },
    {
      "duty": "Manages product documentation schedules within release deadlines."
    },
    {
      "duty": "Works within established style guidelines and assists in their continued evolution."
    },
    {
      "duty": "Conducts meetings in person and online."
    },
    {
      "duty": "Analyzes market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Plans and oversees participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measures and reports on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 30,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Technical Communications or a related field. A relevant combination of education and experience may be considered in lieu of a degree. Continuous learning, as defined by the Company’s learning philosophy, is required. Certification or progress toward certification is highly preferred and encouraged."
    }
  ]
}