{
  "meta": [
    {
      "job_title": "NA Revenue Growth Management Technical Product Owner",
      "job_category": "Product Management",
      "job_class": "Product Owner",
      "sector": "IT",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Business Case Development",
      "experience": 5
    },
    {
      "skill": "Technology Solutions",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Reporting Technologies",
      "experience": 5
    },
    {
      "skill": "CPG Industry",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with senior leadership to identify opportunities and technology solutions, develop business cases, and gain alignment for technology investment and project decisions."
    },
    {
      "duty": "Lead projects of medium and large complexity, and act as a Liaison between the various IT organizations to ensure successful delivery of initiatives to the business partners."
    },
    {
      "duty": "Champion the change management efforts of IT initiatives with the business partner community."
    },
    {
      "duty": "Interface with suppliers and vendors to evaluate software, hardware, or services and make recommendations."
    },
    {
      "duty": "Ensure Service Level Agreements are established and meet expectations of the business partners."
    },
    {
      "duty": "Perform analysis, design, implementation, and maintenance activities."
    },
    {
      "duty": "Participate in the business planning activities by identifying future business demand and working with NA Sales and Commercial Operations for alignment and funding."
    },
    {
      "duty": "Provide coaching/guidance to peers, junior team members, and consultants."
    },
    {
      "duty": "Demonstrate knowledge seeking and sharing behaviors across IT organizational boundaries in the performance of daily work and encourage junior associates to do the same."
    },
    {
      "duty": "Ensure that Kenvue information assets are appropriately identified, valued, and protected by complying with and enforcing all local and worldwide security policies."
    },
    {
      "duty": "Ensure that security is considered and emphasized in all Kenvue plans and actions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in IT field (Master's preferred)"
    }
  ]
}