{
  "meta": [
    {
      "job_title": "Data Engineering Product Lead",
      "job_category": "Data Engineering",
      "job_class": "Manager",
      "sector": "Digital Manufacturing",
      "salary": 275000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Engineering",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Product Management",
      "experience": 10
    },
    {
      "skill": "System Development",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "Technical Architecture",
      "experience": 10
    },
    {
      "skill": "Data Warehousing",
      "experience": 7
    },
    {
      "skill": "Python",
      "experience": 7
    },
    {
      "skill": "AWS",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Communication",
      "experience": 10
    },
    {
      "skill": "Agile Methodology",
      "experience": 10
    },
    {
      "skill": "Strategic Thinking",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Set the vision for best-in-class data engineering products and lead teams working on multiple data pipelines."
    },
    {
      "duty": "Lead the definition, implementation, and review of the organization's systems development management framework."
    },
    {
      "duty": "Drive work across the products to strategically align with business outcomes and oversee delivery of applications in the product line."
    },
    {
      "duty": "Collaboratively facilitate and guide data engineering and inter-departmental architectural and technical choices."
    },
    {
      "duty": "Oversee roadmap administration, maintenance and improvements to data infrastructure and data processing pipelines."
    },
    {
      "duty": "Develop organizational policies, standards, and guidelines for methods and tools and lead the development of organizational capabilities for methods and tools."
    },
    {
      "duty": "Lead, develop, and grow a high-performing data engineering team and collaboratively facilitate and guide data engineering and inter-departmental architectural and technical choices."
    },
    {
      "duty": "Accountable for the design, development, and delivery of high-quality, performant, scalable, well-tested, and compliant technical solutions."
    },
    {
      "duty": "Partner with engineers, data scientists, product teams, and business stakeholders to contextualize data and prepare and deliver complex data sets and data models."
    },
    {
      "duty": "Implement and reinforce data engineering best practices and processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Information Technology, Computer Science, Computer Engineering, or a related field (Master’s degree preferred)"
    }
  ]
}