{
  "meta": [
    {
      "job_title": "Behavioral Health Technician",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mental Health Support",
      "experience": 2
    },
    {
      "skill": "Therapeutic Group Sessions",
      "experience": 2
    },
    {
      "skill": "Crisis Intervention",
      "experience": 2
    },
    {
      "skill": "Healthcare Support",
      "experience": 2
    },
    {
      "skill": "Patient Care",
      "experience": 2
    },
    {
      "skill": "Data Input",
      "experience": 2
    },
    {
      "skill": "Vital Signs Monitoring",
      "experience": 2
    },
    {
      "skill": "CPR Certification",
      "experience": 2
    },
    {
      "skill": "Behavioral Health Environment",
      "experience": 2
    },
    {
      "skill": "English Language Fluency",
      "experience": 2
    },
    {
      "skill": "Computer Skills",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide a safe, supportive, and therapeutic environment for psychiatric patients."
    },
    {
      "duty": "Aid in reality orientation, behavior modification plans/therapy, and informal support therapy to patients/families."
    },
    {
      "duty": "Conduct verbal de-escalation of potentially aggressive patients and facilitate age-appropriate play for children."
    },
    {
      "duty": "Assist in interviewing patients and families for routine admission data and orienting patients and families to the facility."
    },
    {
      "duty": "Provide data input during team discussions and meetings to assist in developing therapeutic plans and objectives."
    },
    {
      "duty": "Assist with personal care, position changes, range of motion exercises, and transfers for patients."
    },
    {
      "duty": "Observe, collect, and document patient information obtained while providing care and promptly report significant changes in the patient's condition to a registered nurse or physician."
    },
    {
      "duty": "Participate in restraining combative patients as necessary and provide care and monitoring of patients in seclusion and/or restraint."
    },
    {
      "duty": "Reinforce routine teaching given to patients by the registered nurse or physician and document patient understanding of instructions."
    },
    {
      "duty": "Distribute patient education materials at the request of patients and/or health care providers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or GED"
    },
    {
      "credential": "Licensed as a Nursing Assistant I by the North Carolina Department of Health and Human Services."
    },
    {
      "credential": "Crisis Prevention Institute (CPI) certification within 60 days from date of hire."
    },
    {
      "credential": "Cardiopulmonary Resuscitation (CPR) certification or Basic Life Support (BLS) for Healthcare Provider certification"
    }
  ]
}