{
  "meta": [
    {
      "job_title": "Business to Business Sales Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 120000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build a book of residual income through B2B sales and client acquisition."
    },
    {
      "duty": "Proactively seek out business opportunities and maintain a high level of activity through client prospecting."
    },
    {
      "duty": "Lead critical business discussions with business owners to identify and solve their promotion and sales challenges."
    },
    {
      "duty": "Maintain and manage client relationships for future revenue growth."
    },
    {
      "duty": "Utilize the custom CRM platform for effective client acquisition and management."
    },
    {
      "duty": "Demonstrate compelling and persistent communication skills to bring concepts to life and drive sales."
    },
    {
      "duty": "Maintain a hit list and prioritize opportunities for maximum sales effectiveness."
    },
    {
      "duty": "Engage in face-to-face networking and portfolio building activities."
    },
    {
      "duty": "Train in all aspects of publishing and receive ongoing support to meet high-performance standards."
    },
    {
      "duty": "Use a compelling, provocative communication style to sit at the top of the sales leaderboard."
    },
    {
      "duty": "Take control of the future with a refusal to lose attitude and apply for limited territories."
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Client Prospecting",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Sales, Business, or a related field (Master's preferred)"
    }
  ]
}