{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Project Management",
      "experience": 10
    },
    {
      "skill": "Client Relationship Management",
      "experience": 10
    },
    {
      "skill": "Risk Evaluation",
      "experience": 10
    },
    {
      "skill": "Contract Negotiation",
      "experience": 10
    },
    {
      "skill": "Quality Assurance",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Safety Enforcement",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead, manage, and coordinate all phases of one or more construction projects from preconstruction through closeout."
    },
    {
      "duty": "Develop and maintain long-lasting relationships with clients, the design community, and organizations to enhance future business development opportunities."
    },
    {
      "duty": "Ensure strict adherence to ethics and compliance requirements on all construction projects."
    },
    {
      "duty": "Provide leadership in risk evaluation, contract negotiations, fee and pricing decisions."
    },
    {
      "duty": "Oversee the development of the master project schedule and manage its implementation."
    },
    {
      "duty": "Provide oversight for budget and financial management for all construction projects."
    },
    {
      "duty": "Support and drive utilization of various construction initiatives and technologies."
    },
    {
      "duty": "Oversee the administration of the Quality Assurance/Quality Control (QA/QC) program."
    },
    {
      "duty": "Drive enforcement of safety protocols by the project staff."
    },
    {
      "duty": "Become a good corporate citizen in the community and maximize company-controlled resources to benefit business unit goals and objectives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree plus minimum of eighteen years' related experience or an equivalent combination of education, training and/or experience."
    },
    {
      "credential": "Thorough knowledge of construction cost, scheduling, estimating, purchasing, and engineering principles and techniques, as well as accounting principles."
    },
    {
      "credential": "Proven written and verbal communication abilities, proficiency with computer applications, including Microsoft Office Suite of programs."
    },
    {
      "credential": "Ability to read, understand and interpret contract documents, drawings, specifications, scopes of work and project schedule."
    }
  ]
}