{
  "meta": [
    {
      "job_title": "Digital Ingest Specialist",
      "job_category": "Technology",
      "job_class": "Specialist",
      "sector": "Technology",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "File Ingestion",
      "experience": 3
    },
    {
      "skill": "Quality Control",
      "experience": 3
    },
    {
      "skill": "Transcoding",
      "experience": 3
    },
    {
      "skill": "Digital Media Workflow",
      "experience": 3
    },
    {
      "skill": "Technical Troubleshooting",
      "experience": 3
    },
    {
      "skill": "Avid Edit Software",
      "experience": 3
    },
    {
      "skill": "Content Transfer",
      "experience": 3
    },
    {
      "skill": "Data Management",
      "experience": 3
    },
    {
      "skill": "Video and Audio Delivery",
      "experience": 3
    },
    {
      "skill": "Digital Screening",
      "experience": 3
    },
    {
      "skill": "Remote Interface Control",
      "experience": 3
    },
    {
      "skill": "Technical Support",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conversion of various media files from one format to another; migration of data and media to or from other devices."
    },
    {
      "duty": "Assist Producers, Shows, Assignment Desk and other “clients” with the Media Ingest process."
    },
    {
      "duty": "Transfer content between various workgroups upon the request of the clients."
    },
    {
      "duty": "Operate and manage the interface required to record feeds directly into the AVID system, specifically Cyradis."
    },
    {
      "duty": "Provide Quality Control of incoming feeds."
    },
    {
      "duty": "First contact for Producers and Clients when file-based ingest issues arise. Troubleshoot issues and seek assistance from the appropriate party."
    },
    {
      "duty": "Back-up digital media as requested or required, verify successful ingest of media before original data is returned to the client or media is formatted."
    },
    {
      "duty": "Assess best way to ingest a variety of file types, troubleshoot problematic file formats and Codecs."
    },
    {
      "duty": "Import files from other locations, such as Latakoo, Web Sites and FTP sites."
    },
    {
      "duty": "Create digital screening exports for producers and clients, delivered online or as physical memory."
    },
    {
      "duty": "Coordinate with Producers and Clients to organize footage efficiently when it is Ingested."
    },
    {
      "duty": "Utilize various online methods to gather interviews using Skype, Zoom, FaceTime, etc."
    },
    {
      "duty": "Provide guidance to users during the production day."
    },
    {
      "duty": "Set Audio/Video levels to spec and verify signal quality of remotes prior to air"
    },
    {
      "duty": "Knowledge in booking, coordination, and understanding of streaming technology such as LiveU, iNet, or Dejero."
    },
    {
      "duty": "Remote interface based control of technical infrastructure including satellite receivers, decoders, and router control."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Technology, Computer Science, or a related field (Master's preferred)"
    }
  ]
}