{
  "meta": [
    {
      "job_title": "General Manager",
      "job_category": "Management",
      "job_class": "General Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage hotel operations to maximize profits and achieve the highest level of guest satisfaction."
    },
    {
      "duty": "Interview, select, train, schedule, coach and support associates, ensuring they perform in accordance with established brand or hotel standards and consistent with HHM core values."
    },
    {
      "duty": "Tour and visually inspect property on a daily basis."
    },
    {
      "duty": "Monitor cost control, property condition, cleanliness, quality of product, and service throughout hotel."
    },
    {
      "duty": "Supervise development of and revision to business plan, annual budget, financial reports and annual and monthly forecasts that clearly explain operational effectiveness, trends and variances."
    },
    {
      "duty": "In conjunction with sales leader, develop and implement sales and marketing plans."
    },
    {
      "duty": "Critically review reports of occupancy and revenue, partner with revenue management professionals to analyze trends and implement changes to maximize room revenue."
    },
    {
      "duty": "Maintain positive rapport with associates and customers and communicate regularly with the public, staff, corporate office, and owners."
    },
    {
      "duty": "Handle associate issues appropriately and in conjunction with human resources following HHM policies."
    },
    {
      "duty": "Participate in community affairs and maintain positive public image for HHM and hotel."
    },
    {
      "duty": "Ensure safety practices and procedures are followed and proper emergency and security procedures are maintained."
    },
    {
      "duty": "Travel to attend corporate meetings, sales trips, and serve on committees."
    },
    {
      "duty": "Monitor quality assurance scores and/or guest feedback and communicate to and train associates accordingly."
    },
    {
      "duty": "Create specific, measurable, achievable, realistic, and timely action plans to drive culture of guest service and above-average GSS score and remedy guest service deficiencies."
    },
    {
      "duty": "Oversee sales department operations and regularly participate in sales calls/client visits."
    },
    {
      "duty": "Participate in Chamber of Commerce and local associations to network with members of the neighborhood/community."
    },
    {
      "duty": "Follow sustainability guidelines and practices related to HHM’s EarthView program."
    },
    {
      "duty": "Perform other duties as requested by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Associate or Bachelor’s Degree in Business, Hospitality or a related field."
    }
  ]
}