{
  "meta": [
    {
      "job_title": "Front End Associate",
      "job_category": "Retail",
      "job_class": "Associate",
      "sector": "Retail",
      "salary": 30000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure the area of responsibility is maintained in accordance with company policies and procedures by properly handling returns; zoning the area; arranging and organizing merchandise; and identifying shrink and damages."
    },
    {
      "duty": "Provide member service by maintaining exit areas; reviewing member receipts; acknowledging the member and identifying member needs; assisting members with purchasing decisions; assisting members with locating merchandise."
    },
    {
      "duty": "Provide member service by maintaining self-checkout area; resolving member issues and concerns; promoting Sam's Club products and services; providing guidance and support to members regarding self-service technology; processing member purchases; assisting with payments, returns, refunds, and exchanges according to company policies and procedures for different membership and payment types; assisting members with transactions utilizing self-checkout area."
    },
    {
      "duty": "Assist with securing and safeguarding Sam's Club assets and property by observing and communicating potential criminal activity according to company policies and procedures; maintaining paperwork, logs, and other required documentation; executing emergency response procedures; and ensuring compliance with company security and safety practices."
    },
    {
      "duty": "Assist with the training of Member Frontline Service associates on company processes and procedures; teaching new technology and tool functionality; delivering new program rollout training; and providing continuous learning and process improvement opportunities."
    },
    {
      "duty": "Comply with company policies, procedures, and standards of ethics and integrity by implementing related action plans; using the Open Door Policy; and applying these in executing business processes and practices."
    },
    {
      "duty": "Complete work assignments and priorities by using policies, data, and resources; collaborating with managers, co-workers, customers, and other business partners; identifying priorities, deadlines, and expectations; carrying out tasks; communicating progress and information; determining and recommending ways to address improvement opportunities; and adapting to and learning from change, difficulties, and feedback."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent"
    }
  ]
}