{
  "meta": [
    {
      "job_title": "Business Development Manager",
      "job_category": "Business Development",
      "job_class": "Manager",
      "sector": "Real Estate",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote real estate rental services."
    },
    {
      "duty": "Lead a team of business development specialists, fostering collaboration and guiding their efforts towards achieving set sales and growth goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's market share in accordance with the company’s objectives for growth, customer satisfaction, and retention."
    },
    {
      "duty": "Plan and oversee the development and implementation of the annual strategic plan for networking and client acquisition."
    },
    {
      "duty": "Conduct client discovery calls and package pricing and proposals in accordance with company policies and strategies."
    },
    {
      "duty": "Collaborate with the Client Relations & Support department through the completion of the account onboarding process."
    },
    {
      "duty": "Attend and participate in client meetings and networking events as determined by the plan."
    },
    {
      "duty": "Manage clients throughout the sales process until the service agreement is finalized and all onboarding checklists are completed."
    },
    {
      "duty": "Develop and implement strategic action plans for each department goal."
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Client Management",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Account Development",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Networking"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Marketing, or a related field (Master's preferred)"
    }
  ]
}