{
  "meta": [
    {
      "job_title": "Construction Laborer",
      "job_category": "Construction",
      "job_class": "Laborer",
      "sector": "Trade",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for tasks involving physical labor at construction projects."
    },
    {
      "duty": "Assist other craft workers in their trades and may perform other duties as necessary or required."
    },
    {
      "duty": "Performing physical labor in assistance with jobsite clean-up, rough carpentry, site logistics, fencing, deck and platform building, protection systems, and construction waste areas."
    },
    {
      "duty": "Review jobsite needs with the superintendents and foreman and participate in the activities of subcontractors and suppliers."
    },
    {
      "duty": "Review project perimeter for security and cleanliness daily, and may perform fire watch duties as needed."
    },
    {
      "duty": "Operate equipment such as forklifts, backhoe, skidsteer, excavator, compactors, and construction hoist."
    },
    {
      "duty": "Assist with the overall site safety and quality programs as required and ensuring Trade employees/subcontractors compliance with all applicable safety codes, regulations, and jobsite security."
    },
    {
      "duty": "Determine the appropriate tool need to do the job."
    },
    {
      "duty": "Maintain positive working relationships with customers, contractors, suppliers, and other employees."
    },
    {
      "duty": "Ability to travel and accommodate night and weekend work as needed."
    },
    {
      "duty": "Ability to work independently with minimal supervision."
    },
    {
      "duty": "Display a high level of teamwork, integrity, commitment, and leadership in daily operations."
    },
    {
      "duty": "Responsible for basic tools (pouches, hammer, tape, kleins, chalk line, etc) and power tools provided by the company."
    },
    {
      "duty": "Knowledge of materials, methods, and the tools involved in the construction or repair of buildings and other structures."
    },
    {
      "duty": "Comprehend safety instructions and signage, communicate effectively in emergency situations, and understand written safety instructions from tool and equipment manufacturers."
    },
    {
      "duty": "Valid driver’s license preferred."
    }
  ]
}