{
  "meta": [
    {
      "job_title": "Operations Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Healthcare Operations",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Patient Access Management",
      "experience": 5
    },
    {
      "skill": "Supervision",
      "experience": 5
    },
    {
      "skill": "HIPAA Compliance",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "EHRS",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide operational support for assigned areas, including managing support staff and provider schedules, and improving patient access."
    },
    {
      "duty": "Supervise support staff, handle work schedule matters, and enforce attendance policies."
    },
    {
      "duty": "Track key performance indicators to recognize successful performance and identify problem areas."
    },
    {
      "duty": "Coordinate patient access issues, streamline scheduling workflows, and maintain full provider schedules."
    },
    {
      "duty": "Assist with service line performance improvement projects in collaboration with site leadership."
    },
    {
      "duty": "Establish and maintain working relationships with community partners and collaborators."
    },
    {
      "duty": "Oversee maintenance and function of service line specific equipment and participate in the Performance Improvement Program."
    },
    {
      "duty": "Implement job responsibilities in a manner consistent with the Legacy's Mission, Code of Ethics, and cultural diversity objectives."
    },
    {
      "duty": "Responsible for departmental orders and stocking of supplies, as well as performing other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 150,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree or equivalent, required. Certifications/licenses as applicable to their area of responsibility. At least 3 years’ experience in a healthcare setting, required. A master’s degree in business or healthcare operations (or equivalent) may substitute for 2 years of experience in the healthcare setting. At least 2 years’ experience in administration and supervision of staff preferred. Experience in Microsoft Office Suite and EHRS preferred."
    }
  ]
}