{
  "meta": [
    {
      "job_title": "Marketing & Design Assistant",
      "job_category": "Marketing",
      "job_class": "Assistant",
      "sector": "Marketing",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 3
    },
    {
      "skill": "Design",
      "experience": 3
    },
    {
      "skill": "Adobe Creative Suite",
      "experience": 3
    },
    {
      "skill": "Online CMS Platforms",
      "experience": 3
    },
    {
      "skill": "Event Planning",
      "experience": 3
    },
    {
      "skill": "Marketing Research",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Contribute to the strategic visions of the Marketing Department and assist with the implementation and evaluation of marketing tactics."
    },
    {
      "duty": "Develop and maintain a deep understanding of FHM subject matter, target audiences, and competitor activities."
    },
    {
      "duty": "Undertake daily administrative tasks to ensure the functionality and coordination of the department’s efforts."
    },
    {
      "duty": "Support visual branding initiatives and marketing collateral creation, including assets for social media, print collateral, signage, logo creation, layout design, and presentations."
    },
    {
      "duty": "Responsible for all in-house printing projects, including packaging and shipping."
    },
    {
      "duty": "Drive in-house business card production and distribution processes."
    },
    {
      "duty": "Manage the automation and distribution of closing gifts via the CRM platform."
    },
    {
      "duty": "Assist with the development of training and presentation materials."
    },
    {
      "duty": "Maintain inventory of promotional items and marketing collateral."
    },
    {
      "duty": "Update marketing contact databases and track leads across all marketing initiatives."
    },
    {
      "duty": "Provide ongoing marketing support and training to sales team members on an as-needed basis."
    },
    {
      "duty": "Assist with planning events and in-person marketing activities."
    },
    {
      "duty": "All other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Four-year degree in Arts & Design, Communications, Marketing, or related field. 1-2 years relevant coursework or work experience. Strong online portfolio of creative and/or written work is a plus."
    }
  ]
}