{
  "meta": [
    {
      "job_title": "Administrative Specialist",
      "job_category": "Business Administration",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Administrative Support",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Report Writing",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Policy Development",
      "experience": 5
    },
    {
      "skill": "Coordination",
      "experience": 5
    },
    {
      "skill": "Financial Audit",
      "experience": 5
    },
    {
      "skill": "Personnel Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide administrative and staff support services, and develop plans for meeting organizational objectives."
    },
    {
      "duty": "Implement, administer, control, and monitor programs, projects, and processes."
    },
    {
      "duty": "Perform analyses, prepare reports and presentations, and serve as liaison with others within and outside the organization."
    },
    {
      "duty": "Support/assist administrative, technical, and/or management personnel, gather information, prepare special reports and presentations, and maintain records."
    },
    {
      "duty": "Coordinate activities in support of safety, health, financial, and overall operations of the site."
    },
    {
      "duty": "Study management methods to improve workflow, simplify reporting procedures, measure performance standards, and implement cost reductions."
    },
    {
      "duty": "Analyze unit operating practices, create and revise systems, review and answer correspondence, and compile, store, and retrieve management data."
    },
    {
      "duty": "Serve as administrative liaison within and outside the organization regarding administrative issues concerning outside services, purchasing, personnel, facilities, and operations."
    },
    {
      "duty": "Provide functional and operational guidance to administrative and clerical staff as required, to include operating in a lead capacity."
    },
    {
      "duty": "May be responsible for specific activities related to training requirements, time and attendance records, terminations, new hires, transfers, operating reports, statistical records, purchase requisition review, work request coordination, field property administration, material and waste inventory, budget development, organizational self-assessment, administration of self-assessment programs, and preparation of reports for general administrative problems."
    },
    {
      "duty": "Conduct financial and operational audits, and develop organizational self-assessment criteria, administration of self-assessment programs, and preparation of reports for general administrative problems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, GED, or other equivalent State Credential. Associate or bachelor degree preferred."
    }
  ]
}