{
  "meta": [
    {
      "job_title": "Property Manager",
      "job_category": "Real Estate",
      "job_class": "Manager",
      "sector": "Property Management",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Pull and review daily and weekly reports as assigned, including but not limited to evictions, delinquencies, renewals, marketing, upcoming move ins and move outs."
    },
    {
      "duty": "Complete rent ready and move in inspections on vacant properties as needed to ensure homes are in a move in ready condition. Complete light cleaning and report any deficiencies to maintenance manager and field superintendents when needed."
    },
    {
      "duty": "Responsible for conducting all new resident orientations, marketing of homes and occupied home inspections as required."
    },
    {
      "duty": "Follow up on all new leads and feedback, encourage property tours and applications, assist with questions regarding property, application process and qualifications."
    },
    {
      "duty": "Record and update resident and property information in accordance with company policy, processes, and procedures."
    },
    {
      "duty": "Responsible for assisting with revenue management and expenses to include occupancy, leasing, renewals, delinquencies, maintenance, and repairs, if applicable to your market."
    },
    {
      "duty": "Build rapport with vendors, colleagues and clients while maintaining professionalism and friendliness."
    },
    {
      "duty": "Weekend hours required as needed."
    },
    {
      "duty": "Our organization follows a hybrid work structure where employees can work remotely or from the office, as needed, based on manager's discretion, and demands of the business. Candidates in this role should expect to work up to four days a week in the office."
    },
    {
      "duty": "Performs other duties and assist with special projects assigned."
    }
  ],
  "skills": [
    {
      "skill": "Property Management",
      "experience": 2
    },
    {
      "skill": "Real Estate License",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Maintenance Management",
      "experience": 2
    },
    {
      "skill": "Marketing",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Oklahoma real estate / brokers license is required\nMinimum of two years of property management experience\nHigh school diploma or general education degree (GED) is required\nProven computer skills and previous experience with property management software required\nValid state driver’s license and reliable transportation"
    }
  ]
}