{
  "meta": [
    {
      "job_title": "Audit & Assurance Project Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Accounting",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Audit Experience",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist large client engagements with overall management of engagement delivery."
    },
    {
      "duty": "Improve overall engagement economics to improve ROI."
    },
    {
      "duty": "Monitor A/R and WIP for clients Provide high level administration support with client billing and adjustments – work with engagement manger to determine accuracy and completion"
    },
    {
      "duty": "Analyze key metrics on engagements and propose solutions, work with engagement managers"
    },
    {
      "duty": "Assist managers with scheduling fieldwork, managing client readiness, changes to team schedule – working closely with resource management team Review engagement metrics and budget to ensure staffing is accurate, correct hours to budget, communicate with resource management team on changes"
    },
    {
      "duty": "Coordination for other resources on engagements such as Global Delivery team members or IT Assurance support Communicate with client to determine fieldwork dates and expectations for onsite Crowe support ensuring appropriate items are provided prior to the onsite visit"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Accounting or a related field (Master's preferred)"
    }
  ]
}