{
  "meta": [
    {
      "job_title": "Retail Projects Coordinator",
      "job_category": "Retail",
      "job_class": "Coordinator",
      "sector": "Retail",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate, track and report on all Retail-based projects, initiatives, and programs."
    },
    {
      "duty": "Develop, organize, and coordinate the daily communications of bank matters that impact the branch network."
    },
    {
      "duty": "Support Retail management with the coordination of all Retail sales initiatives."
    },
    {
      "duty": "Utilize system capabilities (e.g., BIC, CRM) to track and analyze branch and individual employee sales performance and the monitoring of sales campaigns/events."
    },
    {
      "duty": "Assist with development, implementation and promotion of retail banking projects (e.g., financial literacy programs, product/service launches, promotional campaigns, branch-of-the-future technology and designs)."
    },
    {
      "duty": "Organize Retail Management Meetings with input for the agenda, report creation and documentation (minutes) for the meetings."
    },
    {
      "duty": "Oversee management of monthly Head Teller meeting initiative in conjunction with Training department and Branch Administrator."
    },
    {
      "duty": "Manage direction of the Retail Mobile Staff to include daily scheduling, time/attendance tracking in Paylocity, and collection/reporting of float evaluations."
    },
    {
      "duty": "Maintain and keep current all branch monthly staffing schedules to accurately determine and address staffing needs with guidance from Retail Management."
    },
    {
      "duty": "Perform all duties in accordance with prescribed regulatory compliance guidelines and bank policies and procedures."
    },
    {
      "duty": "Represent the Bank in the communities it serves by participating in civic/community organizations to assist in brand awareness and supporting the Bank's mission of being a dedicated and responsible corporate citizen."
    }
  ],
  "skills": [
    {
      "skill": "Project Coordination",
      "experience": 5
    },
    {
      "skill": "Retail Sales Analysis",
      "experience": 5
    },
    {
      "skill": "System Utilization (BIC, CRM)",
      "experience": 5
    },
    {
      "skill": "Event Organization",
      "experience": 5
    },
    {
      "skill": "Meeting Management",
      "experience": 5
    },
    {
      "skill": "Staff Scheduling",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Community Engagement",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration or related field (Master's preferred)"
    }
  ]
}