{
  "meta": [
    {
      "job_title": "QA Tester",
      "job_category": "Information Technology",
      "job_class": "Tester",
      "sector": "Software Engineering",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Integration Testing",
      "experience": 5
    },
    {
      "skill": "Quality Engineering",
      "experience": 5
    },
    {
      "skill": "Test Automation",
      "experience": 5
    },
    {
      "skill": "Performance Testing",
      "experience": 5
    },
    {
      "skill": "Agile-Scrum Methodology",
      "experience": 5
    },
    {
      "skill": "Data Testing Tools",
      "experience": 5
    },
    {
      "skill": "SmartBear Products",
      "experience": 5
    },
    {
      "skill": "Programming",
      "experience": 5
    },
    {
      "skill": "Test Management",
      "experience": 5
    },
    {
      "skill": "Integration Systems",
      "experience": 5
    },
    {
      "skill": "Reviewing Quality Processes",
      "experience": 5
    },
    {
      "skill": "User Acceptance Test Plans",
      "experience": 5
    },
    {
      "skill": "Test Automation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prioritize, schedule, and complete test tasks for multiple projects with overlapping schedules."
    },
    {
      "duty": "Partner with Scrum Masters, Product Owners, and Project Leads to create comprehensive testing strategies for project teams considering project scope, Test types, and timelines."
    },
    {
      "duty": "Learn and adapt quickly to new technologies in a challenging environment."
    },
    {
      "duty": "Coordinate with project stakeholders to ensure test environment availability and schedule tests."
    },
    {
      "duty": "Lead and manage a team of testers dedicated to the project."
    },
    {
      "duty": "Utilize test management tools like Jira to track and report on testing progress."
    },
    {
      "duty": "Maintain a test traceability matrix, linking test cases to requirements and results."
    },
    {
      "duty": "Demonstrate a strong understanding of integration systems and dependencies."
    },
    {
      "duty": "Communicate test progress and metrics to the Test Manager and project team regularly."
    },
    {
      "duty": "Coordinate and implement the Test data strategy, including data refresh, data mapping, and data ingestion."
    },
    {
      "duty": "Utilize data testing tools to validate data accuracy and integrity during integration."
    },
    {
      "duty": "Partner closely with the development teams to replicate and resolve issues."
    },
    {
      "duty": "Assist in reviewing and refining existing Quality process, controls, and best practices."
    },
    {
      "duty": "Act as a strong advocate for quality and share knowledge to other team members within the company."
    },
    {
      "duty": "Ensure all projects meet both functional and non-functional requirements and map to test cases."
    },
    {
      "duty": "Assist QE Manager in establishing/evolving Quality Engineering processes and procedures to ensure the use of best practices."
    },
    {
      "duty": "Act as a SME for all quality aspects and coordinate with business teams to create user acceptance test plans."
    },
    {
      "duty": "Expand the use of test automation across project teams."
    },
    {
      "duty": "Contributing to the success of our multi-year project by ensuring seamless data integration and top-notch testing practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Computer Science, Business Administration, or related discipline"
    }
  ]
}