{
  "meta": [
    {
      "job_title": "Outdoor Advertising Account Executive",
      "job_category": "Sales",
      "job_class": "Sales Representative",
      "sector": "Sales",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Proactively identify and pursue new opportunities by prospecting clients in various industries and setting up client-needs analysis meetings (CNAs)"
    },
    {
      "duty": "Being a consultant to understand your clients’ objectives, budgets and target demographics. Recommending the most effective billboard locations and helping guide them through the creative process to maximize their ROI."
    },
    {
      "duty": "Prepare a customized proposal that shows the benefits of partnering with Times Shamrock Outdoor and what we can do to help their business grow."
    },
    {
      "duty": "Work closely with our Director of Outdoor Media, creative department, scheduling departing and finance office to ensure the seamless execution of your clients advertising campaign while providing them exceptional service."
    },
    {
      "duty": "Stay up to date with industry trends, competitive analysis and market insights to identify new opportunities for growth."
    },
    {
      "duty": "Work with the Director of Outdoor Media to develop a strategy to hit your sales goals on a monthly basis."
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Consultative Selling",
      "experience": 3
    },
    {
      "skill": "Market Research",
      "experience": 3
    },
    {
      "skill": "Client Relationship Management",
      "experience": 3
    },
    {
      "skill": "Proposal Writing",
      "experience": 2
    },
    {
      "skill": "Collaboration",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Marketing, Advertising or a related field preferred but not required."
    }
  ]
}