{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Construction",
      "job_class": "Construction Manager",
      "sector": "Construction",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety Management",
      "experience": 12
    },
    {
      "skill": "Project Management",
      "experience": 12
    },
    {
      "skill": "Leadership",
      "experience": 12
    },
    {
      "skill": "Budget Management",
      "experience": 12
    },
    {
      "skill": "Contract Management",
      "experience": 12
    },
    {
      "skill": "Construction Technology",
      "experience": 10
    },
    {
      "skill": "Lean Principles",
      "experience": 10
    },
    {
      "skill": "Quality Compliance",
      "experience": 10
    },
    {
      "skill": "Team Building",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Manages and oversees company staff, subcontractors, suppliers and programs such as Safety, Quality and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Coordinates and manages the care, custody and control of the project site."
    },
    {
      "duty": "Creates, manages, changes, and implements the project’s schedule as needed, in conjunction with the Project Manager."
    },
    {
      "duty": "Manages timecard approval process to ensure reporting of accurate hours and proper cost codes."
    },
    {
      "duty": "Understands and applies the terms and conditions of the owner and subcontractor contracts for the project."
    },
    {
      "duty": "Responsible for identifying and recruiting top talent."
    },
    {
      "duty": "Understands JE Dunn’s policy of non-discrimination and ensures positive, proactive implementation throughout the organization."
    },
    {
      "duty": "Manages the largest, most complex stand-alone and/or multiple complex projects from initial planning to completion."
    },
    {
      "duty": "Provides input, leads and executes company and regional key strategic initiatives."
    },
    {
      "duty": "Manages budgets, maximizes profitability, and generates future work through building relationships."
    },
    {
      "duty": "Effectively delivers leadership messages to multiple audiences both internally and externally."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering, or related field (Preferred). In lieu of the above requirements, equivalent relevant experience will be considered."
    }
  ]
}