{
  "meta": [
    {
      "job_title": "NetSuite Developer/Administrator",
      "job_category": "Software Engineering",
      "job_class": "Developer/Administrator",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "NetSuite ERP Management",
      "experience": 4
    },
    {
      "skill": "Enterprise Application Knowledge",
      "experience": 5
    },
    {
      "skill": "Technical Support",
      "experience": 4
    },
    {
      "skill": "Software Development",
      "experience": 5
    },
    {
      "skill": "SQL",
      "experience": 5
    },
    {
      "skill": "Customization & Configuration",
      "experience": 4
    },
    {
      "skill": "Integration",
      "experience": 4
    },
    {
      "skill": "Technical Documentation",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver company-wide business solutions through application configuration, development, and support activities."
    },
    {
      "duty": "Troubleshoot applications and software for all internal customers, such as finance, operations, supply chain, and other business units."
    },
    {
      "duty": "Define, develop, test, analyze, maintain, and improve in-house and vendor provided software applications."
    },
    {
      "duty": "Research, design, document, and modify software specifications throughout the systems development life cycle."
    },
    {
      "duty": "Analyze and assess existing business systems and procedures."
    },
    {
      "duty": "Assist in defining software development project plans, including scoping, scheduling, and implementation."
    },
    {
      "duty": "Conduct research into software application products and services in support of business requirements."
    },
    {
      "duty": "Recommend, schedule, and perform software improvements and upgrades."
    },
    {
      "duty": "Serve as technical point of contact for ERP application (NetSuite) and provide hands-on support for NetSuite users."
    },
    {
      "duty": "Design and implement technology solutions in NetSuite modules according to business and stakeholder requirements."
    },
    {
      "duty": "Architect, design, build and deliver NetSuite solutions for optimizing the usability and functionality of the system."
    },
    {
      "duty": "Ensure systems integrations with NetSuite are built for scale and maintain accuracy and completeness of data flowing into NetSuite from external systems."
    },
    {
      "duty": "Stay ahead of new NetSuite features, provide recommendations for improvements, and participate in technical design/code reviews & audits."
    },
    {
      "duty": "Maintain user roles/access, build/maintain user interface entry forms, email and PDF templates, and work with end users on usability/ Help Desk issues."
    },
    {
      "duty": "Liaise with vendors for efficient implementation of new software products or systems and resolution of any adaptation issues."
    },
    {
      "duty": "Work with NetSuite and implementation partner teams on automating data integrations with NetSuite."
    },
    {
      "duty": "Ensure systems integrations with NetSuite are built for scale and maintain accuracy and completeness of data."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 70,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Certified NetSuite Administrator preferred"
    }
  ]
}