{
  "meta": [
    {
      "job_title": "Market Vice President",
      "job_category": "Management",
      "job_class": "Vice President",
      "sector": "Management",
      "salary": 165000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Leadership",
      "experience": 7
    },
    {
      "skill": "Sales Strategy",
      "experience": 7
    },
    {
      "skill": "Team Management",
      "experience": 7
    },
    {
      "skill": "Training and Development",
      "experience": 7
    },
    {
      "skill": "P&L Management",
      "experience": 7
    },
    {
      "skill": "Account Management",
      "experience": 7
    },
    {
      "skill": "Business Strategy",
      "experience": 7
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and direct operations within a given market to achieve ongoing revenue growth, profitability, and productivity in multiple service offerings."
    },
    {
      "duty": "Supervise Directors, Managers, Account Executives, Associates, and other staff."
    },
    {
      "duty": "Promote cross-selling and proactive sharing of account information among divisions under their control."
    },
    {
      "duty": "Develop and execute the overall sales plan for the market including territory alignment, account assignment, and adherence to KPI requirements."
    },
    {
      "duty": "Manage and deploy company assets in a cost-effective manner."
    },
    {
      "duty": "Work directly with other Market Vice Presidents and Directors to develop and share ideas and business strategies across markets."
    },
    {
      "duty": "Participate in client visits and monitor the overall client satisfaction rate in the market."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree and seven plus years of related product/business experience preferably within the staffing industry. Proven sales record of accomplishment in developing large accounts. Previous experience managing multiple locations and staff levels is essential."
    }
  ]
}