{
  "meta": [
    {
      "job_title": "Control Center Specialist",
      "job_category": "Engineering",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "NERC CIP Regulatory Standards",
      "experience": 5
    },
    {
      "skill": "Cyber Security Technologies",
      "experience": 5
    },
    {
      "skill": "Network Architecture and Topologies",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "System Audit and Information Security",
      "experience": 5
    },
    {
      "skill": "Troubleshooting Network Switches and Routers",
      "experience": 5
    },
    {
      "skill": "Communication Protocols and Browser Technologies",
      "experience": 5
    },
    {
      "skill": "Distributive Control System (DCS)",
      "experience": 5
    },
    {
      "skill": "Third Party Datalink Protocols",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide subject matter expert level procedural and technical support operations at Power Generation Divisions control centers and power plants."
    },
    {
      "duty": "Maintain cyber & physical access to meet corporate standards and/or NERC CIP standards."
    },
    {
      "duty": "Perform duties related to asset management including but not limited to inventory of systems."
    },
    {
      "duty": "Execute weekly, monthly, quarterly & annual reviews & documentation based on corporate compliance standards and/or NERC CIP Regulations."
    },
    {
      "duty": "Work closely with Subject Matter Experts (SME) and vendors to complete project goals including audits, vulnerability assessments, and mitigations."
    },
    {
      "duty": "Support cyber security improvement and lifecycle projects."
    },
    {
      "duty": "Prepare documentation in support of audits and maintaining compliance of PGD Sites in the area of the Corporate and/or NERC CIP Regulations."
    },
    {
      "duty": "Provide full-time technical support to the operations and business unit personnel."
    },
    {
      "duty": "Perform system testing and documentation to critical systems during significant changes and/or upgrades."
    },
    {
      "duty": "Analyze and identify the root cause of - and implement comprehensive technical solutions to - complex application deficiencies and system issues."
    },
    {
      "duty": "Develop new (and improve existing) processes with the goal of increasing productivity, reducing risk of system failure, promoting efficiency in workflow, and meeting or exceeding the key operational performance targets."
    },
    {
      "duty": "Establish, document, and maintain procedures and guidelines related to the day-to-day operational support provided to the operations and business unit personnel."
    },
    {
      "duty": "Travel to power plants for onsite troubleshooting support."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's degree in Engineering, Information Technology, or a related field"
    }
  ]
}