{
  "meta": [
    {
      "job_title": "Account Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Experience",
      "experience": 3
    },
    {
      "skill": "Medical Sales",
      "experience": 2
    },
    {
      "skill": "Infection Prevention Industry",
      "experience": 1
    },
    {
      "skill": "Prospecting",
      "experience": 3
    },
    {
      "skill": "Cold Calling",
      "experience": 3
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify and close new business opportunities within established and new accounts in a geographically dispersed territory."
    },
    {
      "duty": "Focus call activities on multi-specialty ambulatory surgery centers (ASCs) and hospitals within assigned accounts."
    },
    {
      "duty": "Establish and maintain customer relationships and overall financial performance within assigned territory through consultative and clinical value-based selling."
    },
    {
      "duty": "Develop and implement territory sales strategy and plan for local hospitals and IDN accounts not covered by the Corporate Accounts teams."
    },
    {
      "duty": "Conduct product demonstration, training presentations, and in-servicing based upon Customer’s needs."
    },
    {
      "duty": "Anticipate customer needs, develop innovative solutions to streamline customer workflows, and think creatively to identify new revenue streams."
    },
    {
      "duty": "Continually acquire, maintain, and expand personal understanding of features, benefits, applications, and market conditions, enhancing the needs for our current and future products."
    },
    {
      "duty": "Participate in local chapters AORN, IAHCSMM, SGNA, and/or other relevant organizations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent required. Minimum of 3 years of sales experience, or 2 years of medical sales experience, or 1 year of sales experience plus 1 year of infection prevention industry experience."
    },
    {
      "credential": "Experience prospecting for new business and cold calling."
    },
    {
      "credential": "Preferred experience selling to hospitals, ASC’s, and Inpatient/Outpatient Endoscopy Suites."
    },
    {
      "credential": "Candidates must possess a valid driver's license issued in the United States."
    },
    {
      "credential": "The ability to travel based on the requirements of the role. Must live in or be willing to relocate within defined territory."
    }
  ]
}