{
  "meta": [
    {
      "job_title": "Procurement Manager",
      "job_category": "Procurement",
      "job_class": "Manager",
      "sector": "Procurement",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Analyze the supply marketplace by conducting research and bidding activities such as RFx’s, Identify and execute cost savings initiatives to improve costs without compromising quality, and advocate change in support of company/department projects."
    },
    {
      "duty": "Lead the process of qualifying, selecting, and testing new supplier partners, and maintain working knowledge of business trends including industry issues, cost drivers, global pricing, market conditions, and economic indicators."
    },
    {
      "duty": "Evaluate economic and commodity conditions to identify areas of opportunity, serve as the internal subject matter expert for product cost and sourcing expertise."
    },
    {
      "duty": "Conduct regular supplier business reviews that capture spend, performance, technology roadmaps, business growth strategies, and supply market changes, and participate in S&OP process and coordinates supplier's production to meet demand."
    },
    {
      "duty": "Develop and cultivate relationships with current and potential supplier partners, establish service level agreements and other terms and conditions to drive value for the brand."
    },
    {
      "duty": "Manage supplier contracts and ensure completion of legal requirements, manage supply risk by qualifying and testing secondary and/or alternate sources of supply, drive the implementation of new tools and processes to improve the strategic sourcing methods."
    },
    {
      "duty": "Evaluate system spend to establish patterns for sourcing seasonality, communicate the impact of sourcing decisions to franchisees and internal management, build collaborative relationships with Legal, R&D, QA, Operations, and other internal stakeholders to drive innovation."
    },
    {
      "duty": "Build relationships with supplier working team/contacts, act as a leader, manager, and mentor within the organization, and perform other responsibilities as assignments by management."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in supply chain, finance, or another related field (Master's preferred)"
    }
  ]
}