{
  "meta": [
    {
      "job_title": "Construction Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Construction",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Provide engineering support to superintendents and crafts, verifies materials, equipment, workmanship and assures results meet design requirements."
    },
    {
      "duty": "Assure construction activities are executed in a safe manner with the highest quality standards possible while monitoring the cost and schedule of any given work activity."
    },
    {
      "duty": "Interface and coordinate all aspects of construction with design, procurement, security, safety, operations, health physics, quality control, scheduling, cost and management."
    },
    {
      "duty": "Develop construction scope turnover packages and coordinate systems completion and test activities in support of the turnover schedule."
    },
    {
      "duty": "Direct the preparation of work packages and familiarize craft in specific work package requirements."
    },
    {
      "duty": "Coordinate with design agencies to ensure timely issuance of new design or design changes."
    },
    {
      "duty": "Lead constructability program in area and provide technical expertise for construction methods and practices."
    },
    {
      "duty": "Responsible to ensure that construction work is done correctly and completely."
    },
    {
      "duty": "Provide technical and programmatic direction to subordinate construction engineering personnel as required."
    },
    {
      "duty": "Administer assigned subcontracts."
    },
    {
      "duty": "Design temporary construction facilities as requested by managers."
    },
    {
      "duty": "Assist in establishing maintenance requirements for all permanent plant equipment."
    },
    {
      "duty": "Coordinate subcontract activities to ensure materials, equipment and workmanship comply with contract documents."
    },
    {
      "duty": "Developed installation/modification work instructions and work plans."
    },
    {
      "duty": "Performed job hazard analysis for construction activities."
    },
    {
      "duty": "Experience with civil and architectural installation/modification designed and constructed in accordance with national codes and standards including IBC, ACI, AISC, OSHA."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma, GED, or other equivalent State Credential"
    }
  ]
}