{
  "meta": [
    {
      "job_title": "Sheet Metal Tech Lead",
      "job_category": "Manufacturing",
      "job_class": "Tech Lead",
      "sector": "Manufacturing",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sheet Metal Fabrication",
      "experience": 5
    },
    {
      "skill": "Blueprint Reading",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Install hardware such as bolts, nuts, screws, rivets, nut plates, and other hardware as instructed by customer specifications or engineering drawings."
    },
    {
      "duty": "Set up machines to form and cut material using press brakes, presses, and shear in accordance with operation process sheets or drawings under the direction from the department Lead or supervisor."
    },
    {
      "duty": "Remove burrs, nibble marks, and surface blemishes using file, deburr tool, sandpaper, disc sander, orbital sander, power buffer to provide finishes required by the blueprint, standards or operation sheets."
    },
    {
      "duty": "Inspect or measure work using a rule, calipers, Pi Tape, gauges and/or templates."
    },
    {
      "duty": "Cut, grind, or file workpieces to layout lines."
    },
    {
      "duty": "Complete operation, documentation and ensure to wand out correct information."
    },
    {
      "duty": "Notify the department lead of problems with the work orders, documentation, production hardware, and processes."
    },
    {
      "duty": "Run operation to ensure part quantity and production requirements."
    },
    {
      "duty": "Move job order to the next operation staging area using a pallet mover or work carts."
    },
    {
      "duty": "Follow company policies and proper safety practices."
    },
    {
      "duty": "Follow the proper procedures to ensure compliance with the requirements of the customer."
    },
    {
      "duty": "Maintain a clean, safe, and organized work area and keep equipment and machines clean in good working order."
    },
    {
      "duty": "Contribute to SS program and LEAN concepts."
    },
    {
      "duty": "Must be able to work in and promote a TEAM environment."
    },
    {
      "duty": "Use good shop practices to assure the accuracy and quality required for the jobs."
    },
    {
      "duty": "Promote good moral and communications among all employees."
    },
    {
      "duty": "Perform other duties as required."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent"
    }
  ]
}