{
  "meta": [
    {
      "job_title": "Business Intelligence Manager",
      "job_category": "IT",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 145000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "VBA Programming",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "SAS Programming",
      "experience": 5
    },
    {
      "skill": "SQL Server",
      "experience": 5
    },
    {
      "skill": "ETL Development",
      "experience": 5
    },
    {
      "skill": "MS Office (Excel, Access)",
      "experience": 5
    },
    {
      "skill": "Technical Connectivity",
      "experience": 5
    },
    {
      "skill": "Healthcare Data Analysis",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the development and execution of comprehensive data analytics and reporting strategies to support business operations and maximize end user's potential."
    },
    {
      "duty": "Oversee and manage the refinement of datasets, models, and tools for complex data analytics services, providing support to internal and external clients."
    },
    {
      "duty": "Manage and supervise the Commercial Informatics staff, including mentoring, work product review, and documentation of technical specifications."
    },
    {
      "duty": "Ensure adherence to industry and enterprise best practices in vendor-supplied technical solutions and support strategic partners' operations."
    },
    {
      "duty": "Oversee the expansion of ad hoc reporting to include support for Emblem Health business, developing a knowledge base of EH-related products/platforms and corresponding warehouse data."
    },
    {
      "duty": "Create and maintain the 'single source of truth' reporting for all Fixed-Funding related business, including monthly financial statement calculations/reporting used directly in reserving and finance capacities."
    },
    {
      "duty": "Develop, maintain, and enhance datasets, models, and reporting related to Fixed Funding Solutions, Large and Small Group external reporting, Underwriting and Actuarial Rating Models, Predictive Analysis, Membership, Provider."
    },
    {
      "duty": "Serve as the point of contact for data feed development and testing, as well as represent the department in support of IT Enterprise Data Warehouse initiatives."
    },
    {
      "duty": "Develop technical processes when formal IT resources are not available and perform data analysis to support new ad hoc requests from management."
    },
    {
      "duty": "Partner with all IT and business areas to identify opportunities to improve operational and service-related processes through improving the existing application portfolio functionality."
    },
    {
      "duty": "Ensure the development, implementation, and enforcement of policies, procedures, and best practices for operational efficiency, data management, and department standards for SQL Server's suite of tools inside HCM."
    },
    {
      "duty": "Collaborate with Business & IT Leadership Team to inform and facilitate implementation of migration plan to new architectures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 40,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Mathematics, Statistics or Financial Management; MBA preferred."
    }
  ]
}