{
  "meta": [
    {
      "job_title": "IT Project Manager",
      "job_category": "Technology",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 125000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Risk Assessment",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "IT Infrastructure Management",
      "experience": 8
    },
    {
      "skill": "Communication Skills",
      "experience": 9
    },
    {
      "skill": "Problem-Solving",
      "experience": 8
    },
    {
      "skill": "Vendor Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage technical aspects of projects to ensure they adhere to being On Scope, On Time, On Budget, On Quality, and On Benefit."
    },
    {
      "duty": "Plan projects in detail, set schedules and corresponding milestones, tasks, and work breakdown segments for all project stakeholders."
    },
    {
      "duty": "Leverage expertise to reduce risk, problem solve, bring together various technical and functional stakeholders, and drive consensus."
    },
    {
      "duty": "Analyze project proposals to determine time frame, funding limitations, and appropriate processes for accomplishing projects."
    },
    {
      "duty": "Provide leadership and motivation to project team members throughout the project life cycle."
    },
    {
      "duty": "Implement a project communication plan and perform risk assessment with implementation of mitigation plans."
    },
    {
      "duty": "Ensure that project goals are in line with business objectives and achieved."
    },
    {
      "duty": "Establish standards and procedures for project reporting and documentation."
    },
    {
      "duty": "Prepare project reports and presentations for management, client, or others."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business or computer science; or equivalent related work experience."
    }
  ]
}