{
  "meta": [
    {
      "job_title": "Cybersecurity Practice Manager",
      "job_category": "Cybersecurity",
      "job_class": "Manager",
      "sector": "Information Technology",
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Design, develop, and execute the vision of the cybersecurity framework and solutions for client services."
    },
    {
      "duty": "Ensure highly scalable, reliable, and secure solutions across the solution set."
    },
    {
      "duty": "Familiarity with industry standard frameworks and compliance requirements such as NIST 800, ISO 27001, CMMC, FISMA, GDPR, NERC-CIP, SOC 2, HIPAA, FERPA, FINRA, PCI-DSS, ITARS, DFARS, and CCPA."
    },
    {
      "duty": "Play a lead role in developing the cybersecurity portfolio and solution delivery."
    },
    {
      "duty": "Assist in investigating security events and providing coaching and mentoring to other team members."
    },
    {
      "duty": "Lead all cybersecurity focused tasks and engagements."
    },
    {
      "duty": "Promote information and cybersecurity throughout the internal organization and with clients."
    },
    {
      "duty": "Advise on emerging vulnerabilities and newly introduced risks to internal and client resources."
    },
    {
      "duty": "Provide technical leadership for all information and cybersecurity platforms."
    },
    {
      "duty": "Serve as the final escalation point for all information and cybersecurity related platforms and technical issues."
    },
    {
      "duty": "Oversee and participate in the administration of all information and cybersecurity technology platforms."
    },
    {
      "duty": "Take a lead role in threat hunting, detection, and response to cybersecurity incidents."
    },
    {
      "duty": "Select new information and cybersecurity platforms and solutions."
    },
    {
      "duty": "Execute regular technical risk assessments of systems and infrastructure."
    },
    {
      "duty": "Manage the installation, configuration, and monitoring of new information and cybersecurity platform technologies."
    },
    {
      "duty": "Provide maintenance assistance to all information and cybersecurity platform technologies."
    },
    {
      "duty": "Provide coaching and mentoring on information and cybersecurity platform technologies."
    },
    {
      "duty": "Articulate the value of information and cybersecurity within the business to internal team members and client stakeholders."
    },
    {
      "duty": "Maintain current security certifications and attend industry seminars and relevant continuing education events."
    },
    {
      "duty": "Support the sales team to produce solutions for customers."
    },
    {
      "duty": "Build and manage strong relationships with distributors and partners for technical support, configurations, and pricing related to information and cybersecurity products."
    },
    {
      "duty": "Work directly with clients and the team to support quoting and procurement requests."
    },
    {
      "duty": "Establish strong relationships with business operational and service delivery units."
    },
    {
      "duty": "Build relationships with customers technical and management staff."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Technology, Cybersecurity, or a related field (Master's preferred)"
    }
  ]
}