{
  "meta": [
    {
      "job_title": "Human Resources Intern",
      "job_category": "Human Resources",
      "job_class": "Intern",
      "sector": "Human Resources",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruitment",
      "experience": 1
    },
    {
      "skill": "Employee Onboarding",
      "experience": 1
    },
    {
      "skill": "HRIS Management",
      "experience": 1
    },
    {
      "skill": "Employee Relations",
      "experience": 1
    },
    {
      "skill": "HR Compliance",
      "experience": 1
    },
    {
      "skill": "Event Coordination",
      "experience": 1
    },
    {
      "skill": "MS Office",
      "experience": 1
    },
    {
      "skill": "Written Communication",
      "experience": 1
    },
    {
      "skill": "Verbal Communication",
      "experience": 1
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 1
    },
    {
      "skill": "Organizational Skills",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in scheduling interviews and communicating with candidates."
    },
    {
      "duty": "Help prepare new hire welcome packets and materials. Assist in organizing and conducting orientation sessions."
    },
    {
      "duty": "Maintain accurate and up-to-date employee files and records. Assist in data entry and organization of HR databases."
    },
    {
      "duty": "Contribute to ongoing HR projects such as policy updates, employee engagement initiatives, and HRIS implementation. Conduct research to support HR strategies and initiatives."
    },
    {
      "duty": "Assist in the implementation of the new HRIS system. Assess the capabilities of current HRIS applications."
    },
    {
      "duty": "Provide support in addressing employee inquiries and concerns. Assist in scheduling meetings related to employee performance and feedback."
    },
    {
      "duty": "Assist in ensuring compliance with labor laws and regulations. Help with the preparation of documentation for audits. Assist in rollout of the new employee handbook."
    },
    {
      "duty": "Assist in planning and organizing company events, workshops, and team-building activities for the HR department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Enrolled in a university or college program at junior or senior level, preferred course of study to include Psychology, Human Resources, Communications, or related discipline. Minimum GPA of 3.0."
    },
    {
      "credential": "Strong attention to detail. Outstanding time-management skills. Previous administrative experience."
    }
  ]
}