{
  "meta": [
    {
      "job_title": "Maintenance Technician",
      "job_category": "Maintenance",
      "job_class": "Technician",
      "sector": "Maintenance",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Facility Maintenance",
      "experience": 2
    },
    {
      "skill": "General Maintenance Trades",
      "experience": 2
    },
    {
      "skill": "Mechanical Knowledge",
      "experience": 2
    },
    {
      "skill": "Cleaning and Sanitizing",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Check the ticket system for new maintenance requests every morning"
    },
    {
      "duty": "Acknowledge that tickets have been read by changing the status to pending, put notes in the system daily, and change the status in the system as the status changes."
    },
    {
      "duty": "Create a ticket in the ticket system for any work performed that is not already on a ticket."
    },
    {
      "duty": "Fulfill maintenance requests given by Children’s Harbor staff thru the facilities ticket system app daily."
    },
    {
      "duty": "Repairing, servicing, and up-keep of buildings and homes"
    },
    {
      "duty": "Assists with maintaining building security"
    },
    {
      "duty": "On-call for emergencies 24/7, on-call will be scheduled on a rotating basis"
    },
    {
      "duty": "Campus safety, report concerns to Facilities Director"
    },
    {
      "duty": "Walkthrough of all the houses monthly (Per DCF guidelines)"
    },
    {
      "duty": "Makes minor plumbing repairs, as necessary"
    },
    {
      "duty": "Assists with departmental and employee office moves"
    },
    {
      "duty": "Make trips to the hardware store when in need of supplies"
    },
    {
      "duty": "Reporting of negligence"
    },
    {
      "duty": "Ensure that buildings are rust free"
    },
    {
      "duty": "Check grounds on a weekly basis for ant piles, and wasp nests; treat them accordingly"
    },
    {
      "duty": "Identify and submit a request for repairs that require professional expertise to Facilities Director for approval"
    },
    {
      "duty": "Monitors contractor performance and works closely with outside vendors and contractors to ensure work is completed according to specifications"
    },
    {
      "duty": "Performs basic electrical work and determines when an electrician is required"
    },
    {
      "duty": "Hangs pictures and shelving, as needed"
    },
    {
      "duty": "Dismantles and installs furniture"
    },
    {
      "duty": "Transport goods or equipment as assigned"
    },
    {
      "duty": "Test landscape irrigation system bi-monthly"
    },
    {
      "duty": "Ensure that garbage is picked up on campus daily"
    },
    {
      "duty": "Assist with donations distribution"
    },
    {
      "duty": "Assist with CH vehicles maintenance and repairs"
    },
    {
      "duty": "Assist with events set up and clean up"
    },
    {
      "duty": "Assist with volunteers’ projects"
    },
    {
      "duty": "Perform vehicle maintenance inspection and clean vehicles monthly."
    },
    {
      "duty": "Ensure facility maintenance and facilities/grounds are clean, orderly, and in child-safe conditions always."
    },
    {
      "duty": "Ensure and coordinate vehicle maintenance."
    },
    {
      "duty": "Reports any physical safety issues to the Director of Facilities/Director of Operations."
    },
    {
      "duty": "Performs a variety of cleaning activities such as sweeping, mopping, dusting, and polishing all common areas (staff bathrooms, kitchens, hallways, conference rooms, offices, and common areas in the Administration building)"
    },
    {
      "duty": "Ensure all rooms/houses are inspected according to DCF and CH standards"
    },
    {
      "duty": "Notify the Facilities Director of any damages in the homes"
    },
    {
      "duty": "Daily sanitization of Main campus and Lauderhill common/high transit areas (staff bathrooms, kitchens, hallways, conference rooms, offices, doorknobs, and campus grounds) following CDC and OSHA guidelines"
    },
    {
      "duty": "Washing windows as needed"
    },
    {
      "duty": "Pressure cleaning sidewalks as needed"
    },
    {
      "duty": "Monitoring and tracking cleaning supplies and placing orders with prior approval of the Facilities Director"
    },
    {
      "duty": "Reporting any necessary repairs or replacements to Facilities Director"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Two years of working experience in facility maintenance. Knowledge of general maintenance trades.Mechanical knowledge, which includes knowledge of tools.Knowledge of and experience in cleaning and sanitizing rooms following proper CDC guidelines."
    }
  ]
}