{
  "meta": [
    {
      "job_title": "Maintenance Technician",
      "job_category": "Maintenance",
      "job_class": "Technician",
      "sector": "Construction",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist and complete work orders for resident requests for service, as well as routine upkeep on the community by diagnosing the source or cause of the defect or problem, and making repairs in accordance with established policies, procedures, safety standards, and code requirements."
    },
    {
      "duty": "Oversee and complete the “make-ready” process to prepare vacant apartment homes for leasing and new move-ins by completing the pre-move-out inspection, creating a “punch” list of maintenance work needed, scheduling vendors and contractors as needed, obtaining needed supplies and materials, completing all maintenance tasks, and inspecting completed work."
    },
    {
      "duty": "Develop standards for the cleanliness and overall appearance of the community’s grounds, amenities, building exteriors, market-ready unit interiors, breezeways, curbs, signage, leasing office, central garbage areas, parking lots, and other buildings and common areas to ensure that they reflect and represent the high quality of the community and Greystar standards."
    },
    {
      "duty": "Periodically inspect work performed by other service team members to assess effectiveness of policies and procedures and develop corrective action plans as needed."
    },
    {
      "duty": "Periodically inspect work performed by contractors, vendors, and other service providers to verify the work, materials, and services meet quality standards, scope, and specifications as required."
    },
    {
      "duty": "Maintain adequate inventory of spare parts and maintenance materials and work with Community Manager to order supplies and tools as needed to stay within budgetary guidelines."
    },
    {
      "duty": "Conduct regularly scheduled safety meetings, ensure all MSDS sheets are current and readily accessible, and keep up to date on all safety-related laws and requirements to ensure community compliance."
    },
    {
      "duty": "Demonstrate customer service skills by treating residents and others with respect, answering questions from team and residents, responding sensitively to complaints about maintenance services, and assigned work orders with efficiency and urgency."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": []
}