{
  "meta": [
    {
      "job_title": "Direct Material Technical Buyer",
      "job_category": "Purchasing",
      "job_class": "Non-Exempt",
      "sector": "Purchasing",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Lead Purchasing Projects that could impact multiple corporate facilities and develop Should Be Cost of components within assigned commodity."
    },
    {
      "duty": "Evaluate Supplier Quotation Cost Breakdown Details and develop negotiation strategy."
    },
    {
      "duty": "Research and understand market trends, create a Benchmark on assigned commodities, create a Make –vs- Buy analysis, evaluation of Localization/LCC/Mexico sourcing, and comprehend the impact of technology on the product."
    },
    {
      "duty": "Create the Commodity Strategy for Key Commodities, evaluate commodity and suppliers to determine the type of agreement required, and negotiate and implement the decided level of the contract."
    },
    {
      "duty": "Identify cost reduction activities from the product design stage through the production life of the product purchased."
    },
    {
      "duty": "Lead negotiations with suppliers, support Buyer P3 and P4 levels, mentor new employees, and provide guidance to other levels on assignments, projects, or negotiations."
    },
    {
      "duty": "Support Supplier Advancement Engineer in VA/VE and Kaizen supplier workshops, provide management of Supplier Risk, and Quarterly reporting of KPIs to each Key Supplier."
    },
    {
      "duty": "Frequent travel to suppliers (international travel a possibility) and generate a map of Supplier Processes including Bekido and Chokko rates at time of quotation."
    },
    {
      "duty": "Work overtime as required, occasional Saturdays and/or Sundays when directed, and ensure thorough understanding of JNA Purchasing Policies and Procedures."
    },
    {
      "duty": "Perform other duties as assigned by Purchasing Manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "4 Year College Degree with Focus in Business Administration, Accounting, or Engineering. Requires 3+ Years Automotive Direct Material Purchasing Experience"
    }
  ]
}