{
  "meta": [
    {
      "job_title": "Store Replenisher",
      "job_category": "Retail",
      "job_class": "Entry-Level",
      "sector": "Sales",
      "salary": 28000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performing total store recovery, refills, culling, and replenishing of product across multiple departments in the store as needed."
    },
    {
      "duty": "Assisting with loading, unloading, and moving heavy, bulky products to support in-stock conditions when needed."
    },
    {
      "duty": "Checking shipments for out-of-date and damaged product to ensure freshness and quality."
    },
    {
      "duty": "Reporting all out-of-date and damaged product issues to the Manager."
    },
    {
      "duty": "Assisting with stocking and refilling merchandise as needed."
    },
    {
      "duty": "Collecting carts from the parking lot and organizing, cleaning, emptying bins, and preparing the sales floor."
    },
    {
      "duty": "Eliminating cardboard and trash on shelves and merchandising fixtures, and cleaning shelves and all merchandising fixtures to keep the sales floor area clean and safe."
    },
    {
      "duty": "Adhering to all SOPs for safety and sanitation to minimize shrink through careful handling of product."
    },
    {
      "duty": "Achieving productivity standards and complying with all federal, state, and company regulations and standards for product freshness, food safety, and sanitation."
    },
    {
      "duty": "Maintaining a clean and safe store environment for the customer shopping experience and providing customer service by answering product-related questions and assisting customers in a friendly manner. Scanning customer items and completing transactions in a fast and friendly manner, as needed."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Material Handling",
      "experience": 2
    },
    {
      "skill": "Attention to Detail",
      "experience": 3
    },
    {
      "skill": "Product Knowledge",
      "experience": 2
    },
    {
      "skill": "Sanitation and Safety Procedures",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 40,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": []
}