{
  "meta": [
    {
      "job_title": "Maintenance Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "TPM",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 5
    },
    {
      "skill": "Predictive Maintenance Systems",
      "experience": 5
    },
    {
      "skill": "Visual Plant Concepts",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "CAD",
      "experience": 5
    },
    {
      "skill": "Circuit Design (Hydraulics, Pneumatics, and Electrical)",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Six Sigma",
      "experience": 5
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 5
    },
    {
      "skill": "Continuous Improvement",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Apply engineering concepts to optimize equipment, procedures, and departmental budgets to achieve better Maintainability Reliability, and availability of equipment."
    },
    {
      "duty": "Plan, evaluate, organize, and implement installation, maintenance, and repair activities to minimize downtime and maximize safety of employees."
    },
    {
      "duty": "Coordinate maintenance project schedule, prepare project status reports, and secure appropriate resources for projects."
    },
    {
      "duty": "Drive asset care and Total Productive Maintenance strategies, lead maintenance planning, and process procedure improvements using reliability tools."
    },
    {
      "duty": "Manage predictive maintenance programs including Thermal Scanning, Ultrasonic, and Vibration monitoring to ensure compliance with established standards."
    },
    {
      "duty": "Analyze predictive maintenance data, review engineering specs, and design modifications to process equipment for reliability capability."
    },
    {
      "duty": "Perform and lead Failure Mode Equipment Analyses (FMEA's), conduct root cause analysis, and ensure timely and high-quality Professional Maintenance (PM)."
    },
    {
      "duty": "Develop and maintain standard operating and maintenance procedures, maintain records of plant and equipment performance, and prepare and maintain data sheets and diagrams."
    },
    {
      "duty": "Review entire projects, assist in capital project management, maintain communications with project stakeholders, determine project staffing needs, and manage project staff."
    },
    {
      "duty": "Continuous evaluation of workplace for safety concerns, support for safety initiatives, adherence to plant rules and safety regulations, and coordination with other departments."
    },
    {
      "duty": "Provide input for the maintenance budget, support autonomous maintenance through training of operators, and ensure equipment basic conditions are maintained throughout the plant."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 170,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. in Mechanical Engineering"
    }
  ]
}