{
  "meta": [
    {
      "job_title": "Director, Assistant Controller",
      "job_category": "Accounting & Finance",
      "job_class": "Director",
      "sector": "Accounting",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Accounting",
      "experience": 10
    },
    {
      "skill": "GAAP",
      "experience": 10
    },
    {
      "skill": "SEC Reporting",
      "experience": 10
    },
    {
      "skill": "SOX Compliance",
      "experience": 10
    },
    {
      "skill": "Financial Statement Preparation",
      "experience": 10
    },
    {
      "skill": "M&A Analysis",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Auditing",
      "experience": 10
    },
    {
      "skill": "Financial Strategy",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee SEC and External Reporting ensuring compliance with reporting requirements for three SEC registrants, private GAAP subsidiary financial statements, and financial statements for various benefit plans."
    },
    {
      "duty": "Maintain and execute the Company’s SOX program, ensuring effective and efficient design and operating effectiveness of internal controls."
    },
    {
      "duty": "Evaluate all significant and unusual transactions, researching technical accounting implications with an understanding of ASC 980 – Regulated Operations, documenting, and socializing conclusions with leadership and auditors."
    },
    {
      "duty": "Research, assess, and implement all new, relevant accounting guidance throughout the company’s businesses."
    },
    {
      "duty": "Manage the Company’s relationship with external auditors."
    },
    {
      "duty": "Research and guide financial strategies for new business development and M&A opportunities."
    },
    {
      "duty": "Research, plan, perform due diligence, and record effects of significant business acquisitions and other transactions with a technical accounting impact."
    },
    {
      "duty": "Ensures adequate staff, systems, controls, and processes in place to meet requirements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance or Accounting (CPA Required)"
    },
    {
      "credential": "Minimum of ten (10) years of accounting experience including experience in accounting research; strong knowledge of SEC, SOX and GAAP requirements."
    },
    {
      "credential": "Knowledge of FERC's Uniform System of Accounts is a plus."
    }
  ]
}