{
  "meta": [
    {
      "job_title": "Industrial Maintenance Mechanic",
      "job_category": "Maintenance",
      "job_class": "Mechanic",
      "sector": "Industrial",
      "salary": 58000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensures operation of machinery and mechanical equipment by completing preventive maintenance requirements on engines, motors, pneumatic tools, conveyor systems, and production machines; following diagrams, sketches, operations manuals, manufacturer's instructions, and engineering specifications; troubleshooting malfunctions."
    },
    {
      "duty": "Knowledge of mechanical, hydraulic and pneumatic systems repair."
    },
    {
      "duty": "Locates sources of problems by observing mechanical devices in operation; listening for problems; using precision measuring and testing instruments."
    },
    {
      "duty": "Removes defective parts by dismantling devices; using hoists, and hand and power tools; examining form and texture of parts."
    },
    {
      "duty": "Determines changes in dimensional requirements of parts by inspecting used parts; using rules, calipers, micrometers, and other measuring instruments."
    },
    {
      "duty": "Adjusts functional parts of devices and control instruments by using hand tools, levels, plumb bobs, and straightedges."
    },
    {
      "duty": "Fabricates repair parts by using machine shop instrumentation and equipment such as but not limited to vertical milling machine, drill press, Lathe and welding."
    },
    {
      "duty": "Maintains equipment, parts, and supplies inventories by checking stock to determine inventory level; anticipating needed equipment, parts, and supplies; placing and expediting orders; verifying receipt."
    },
    {
      "duty": "Conserves maintenance resources by using equipment and supplies as needed to accomplish job results."
    },
    {
      "duty": "Maintains technical knowledge by attending educational workshops; reviewing technical publications; establishing personal networks."
    },
    {
      "duty": "Maintains continuity among work teams by documenting and communicating actions, irregularities, and continuing needs."
    },
    {
      "duty": "Maintains safe and clean working environment by complying with procedures, rules, and regulations."
    },
    {
      "duty": "Ability to read blueprint, layout, install and maintain various equipment."
    },
    {
      "duty": "Effectively communicate problems and solutions to resolve mechanical problems."
    },
    {
      "duty": "Participate in the on-the-job training of line mechanics and apprentices as needed."
    },
    {
      "duty": "Use computerized maintenance system to retrieve and enter information."
    },
    {
      "duty": "Observe safe work practices and ensure work does not endanger others."
    },
    {
      "duty": "Perform other duties as required"
    }
  ],
  "skills": [
    {
      "skill": "Preventive Maintenance",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Fabrication",
      "experience": 5
    },
    {
      "skill": "Technical Knowledge",
      "experience": 5
    },
    {
      "skill": "Blueprint Reading",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Training",
      "experience": 5
    },
    {
      "skill": "Computerized Maintenance Systems",
      "experience": 5
    },
    {
      "skill": "Safety Protocols",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Journeyman’s papers OR equivalent degree with 3 to 5 years’ experience performing complex work in industrial maintenance as a machine repair mechanic OR 10 years of experience"
    }
  ]
}