{
  "meta": [
    {
      "job_title": "Career Coach",
      "job_category": "Social Services",
      "job_class": "Case Manager",
      "sector": "Human Services",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Case Management",
      "experience": 2
    },
    {
      "skill": "Social Service",
      "experience": 2
    },
    {
      "skill": "Community Resources",
      "experience": 2
    },
    {
      "skill": "Counseling",
      "experience": 2
    },
    {
      "skill": "Microsoft Word",
      "experience": 2
    },
    {
      "skill": "Microsoft Excel",
      "experience": 2
    },
    {
      "skill": "Written Communication",
      "experience": 2
    },
    {
      "skill": "Verbal Communication",
      "experience": 2
    },
    {
      "skill": "Problem Solving",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide holistic and comprehensive case management and career coaching services to students, including intake assessment, development of short-term and long-term goals, career planning, progress monitoring, and general advocacy."
    },
    {
      "duty": "Conduct job and life skill training, initial student interviews and assessments, and recruitment activities."
    },
    {
      "duty": "Identify barriers to employment, develop action plans for students, and assist in implementing action plans."
    },
    {
      "duty": "Establish partnerships with local businesses, connect students to internship and employment opportunities, and maintain regular contact with students on internship."
    },
    {
      "duty": "Provide advocacy for students facing barriers, engage in general case management, and maintain detailed client records."
    },
    {
      "duty": "Participate in staff meetings, staff training programs, and supervisory sessions, and interact with guests and volunteers with a positive attitude."
    },
    {
      "duty": "Conduct follow-up communications with graduates of the program to ensure their progress."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Human Services field preferred; A minimum of 2 years case management or social service experience can be substituted for degree"
    }
  ]
}