{
  "meta": [
    {
      "job_title": "Desktop Support Admin/Engineer",
      "job_category": "IT",
      "job_class": "Admin/Engineer",
      "sector": "Technical",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "User Administration",
      "experience": 2
    },
    {
      "skill": "Identity Access Management (IAM)",
      "experience": 2
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 2
    },
    {
      "skill": "Troubleshooting Methodology",
      "experience": 2
    },
    {
      "skill": "Attention to Detail",
      "experience": 2
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 2
    },
    {
      "skill": "Adaptability",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Receive and process requests from employees for system or application access-related issues received via phone calls or directly in the ticketing system."
    },
    {
      "duty": "Administer employee onboarding process for the IT department, including creation and disbursement of access, ensuring timely deployment of new equipment and post-hire follow-up."
    },
    {
      "duty": "Administer employee off-boarding process for the IT department, including removal of access in a timely manner and ensuring collection and return of equipment."
    },
    {
      "duty": "Process employee changes, such as location or job title changes, in concert with the Identity Access Management (IAM) system, as appropriate."
    },
    {
      "duty": "Create and maintain user administration documentation, such as procedures or user access matrices."
    },
    {
      "duty": "Assist with audits and exams by fulfilling audit requests, performing audit remediation and participating in audit meetings for user administration-related activities."
    },
    {
      "duty": "Assist in the administration and maintenance of the Identity Access Management (IAM) system."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 70,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent education and experience"
    }
  ]
}