{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and develop teams effectively by teaching, training, and actively listening to associates; communicating and collaborating with all levels of associates regarding store operations, business initiatives, and company direction."
    },
    {
      "duty": "Model and demonstrate exceptional customer service standards to store associates; manage and support customer service initiatives; ensure customer needs, complaints, and issues are successfully resolved, and provide process improvement leadership."
    },
    {
      "duty": "Drive the financial performance and sales of the designated store area by reviewing and evaluating P&L statements; managing and assisting in budgeting, forecasting and controlling expenses; monitoring merchandise presentation, inventory flow, and operational processes; and developing action plans to mitigate shrink."
    },
    {
      "duty": "Provide supervision and development opportunities for hourly associates by hiring, training, and mentoring of associates; assigning duties; setting clear expectations; providing associate recognition; communicating expectations consistently and effectively; and recruiting and developing qualified associates to meet staffing needs."
    },
    {
      "duty": "Coordinate, complete, and oversee job-related activities and assignments by developing and maintaining relationships with key stakeholders; supporting plans and initiatives to meet customer and business needs; identifying and communicating goals and objectives; building accountability for and measuring progress in achieving results; identifying and addressing improvement opportunities; and promoting continuous learning."
    },
    {
      "duty": "Ensure compliance with company policies and procedures and support company mission, values, and standards of ethics and integrity by implementing related action plans; utilizing and supporting the Open Door Policy; and providing direction and guidance on applying these in executing business processes and practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "2 years' of college; OR 1 year's retail experience and 1 year's supervisory experience; OR 2 years' general work experience and 1 year's supervisory experience. "
    }
  ]
}