{
  "meta": [
    {
      "job_title": "Sr. Buyer",
      "job_category": "Procurement",
      "job_class": "Senior",
      "sector": "Supply Chain",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "MRP Reports Evaluation",
      "experience": 5
    },
    {
      "skill": "Supplier Coordination",
      "experience": 5
    },
    {
      "skill": "Inventory Planning",
      "experience": 5
    },
    {
      "skill": "Cost Control",
      "experience": 5
    },
    {
      "skill": "Logistics Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Regulated Industries Knowledge",
      "experience": 5
    },
    {
      "skill": "Medical Device Manufacturers Knowledge",
      "experience": 5
    },
    {
      "skill": "World-class Manufacturing Knowledge",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluates MRP reports for scheduling raw materials and coordinates delivery with suppliers."
    },
    {
      "duty": "Approves suppliers based on company qualifications and maintains quality file system."
    },
    {
      "duty": "Manages the purchasing systems for defective materials and resolves dispositioned materials with suppliers."
    },
    {
      "duty": "Seeks out the best sources of supply based on price, quantity, service, and reliability and negotiates pricing and payment terms."
    },
    {
      "duty": "Conducts analysis on potential savings or increased efficiency, and plans inventory cycle from Customer Order through Supplier relationships to shipment."
    },
    {
      "duty": "Coordinates logistics for incoming and outgoing shipments, manages customer relationships, and participates in customer and supplier meetings."
    },
    {
      "duty": "Prepares reports and presentations to institute change, and acts as a subject matter expert for the Supply Chain Department."
    },
    {
      "duty": "Travel to suppliers, direct department activities, and uphold company core values."
    },
    {
      "duty": "Determine which vendors to use for orders, ideal inventory levels, and best-in-class frameworks, systems, and processes."
    },
    {
      "duty": "Design processes for streamlining work and analyze potential areas for savings or efficiencies."
    },
    {
      "duty": "Ability to define problems, collect data, establish facts, draw valid conclusions, and interpret technical instructions."
    },
    {
      "duty": "Ability to read, analyze, interpret scientific and technical journals, financial reports, and effectively present information to management, public groups, or boards of directors."
    },
    {
      "duty": "Ability to calculate figures, apply basic algebra and geometry, and communicate effectively in negotiations and relationship building."
    },
    {
      "duty": "Strong understanding of regulated industries, medical device manufacturers, and world-class manufacturing principles."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master's Degree or MBA degree required, 4+ years related experience"
    }
  ]
}