{
  "meta": [
    {
      "job_title": "CMP Technical Services Specialist II",
      "job_category": "Animal Care",
      "job_class": "Specialist",
      "sector": "Biomedical Research",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Animal Health Care",
      "experience": 4
    },
    {
      "skill": "Laboratory Animal Science",
      "experience": 4
    },
    {
      "skill": "Training and Development",
      "experience": 4
    },
    {
      "skill": "Quality Control Testing",
      "experience": 4
    },
    {
      "skill": "Animal Shipping and Receiving",
      "experience": 4
    },
    {
      "skill": "Data Management",
      "experience": 4
    },
    {
      "skill": "Surgical and Post-Surgical Care",
      "experience": 4
    },
    {
      "skill": "Online Presence Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Comparative Medicine Program Animal Health Services Coordinator to ensure service goals related to research, husbandry, and veterinary needs are consistently met."
    },
    {
      "duty": "Instruct group animal handling workshops and one-on-one technical training sessions. Assist with instruction during surgical short course and vet tech course sessions."
    },
    {
      "duty": "Perform activities related to paraveterinary health care procedures. Drive to various CMP facilities to assist with preventative medicine programs and animal health treatments."
    },
    {
      "duty": "Assist with technical services involving CMP core procedures including injections, blood collection, anesthesia, and tissue collections. Record technical service work in a log to be billed out monthly."
    },
    {
      "duty": "Assist with the daily care of breeding colonies, selection of new breeders based on expressed goals of the investigators, and maintaining breeding records."
    },
    {
      "duty": "Assist with procurement procedures, receiving newly acquired laboratory animals, and research animal transfers between non-approved vendors or institutions, both domestic and international."
    },
    {
      "duty": "Assist with quality control testing for the CMP cage washers, autoclaves, water bottles and water purification, treatment and distribution systems, and room sanitation."
    },
    {
      "duty": "Create and maintain animal health records and training records. Update and input data into logs or databases. Maintain an acceptable level of cleanliness and organization in areas the Health Division oversees."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 80,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree in a related field or any equivalent combination of education and experience. Successful completion of a formal laboratory animal science course may substitute for three months of laboratory animal care experience."
    },
    {
      "credential": "Successful completion of CMP Laboratory Animal Science Course."
    },
    {
      "credential": "Valid driver license and good driving record. Must be able to obtain State of Texas class \"C\" vehicle driver license within 30 days of employment. Successful completion of a minimum of 3 CMP Laboratory Animal Science Courses within the first year of employment. Successful completion of Barrier Colony Management, Good Laboratory Practices and SBAT training within first 6 months of employment."
    },
    {
      "credential": "Registered Veterinary Technician (RVT) or Animal Health Technician (AHT) certification, or American Association for Laboratory Animal Science Laboratory Animal Technologist (LATG) certification."
    }
  ]
}