{
  "meta": [
    {
      "job_title": "Project Administrator",
      "job_category": "Administration",
      "job_class": "Administrator",
      "sector": "Administration",
      "salary": 55000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Review all foodservice equipment and design projects sold to ensure that the quotes are properly converted into the ERP project modules."
    },
    {
      "duty": "Work closely with Contract Operations, Credit and Contract Sales to help facilitate the execution of projects."
    },
    {
      "duty": "Responsible for project billings to the customer and reviewing costs and profit margins."
    },
    {
      "duty": "Ensure projects are executed properly, reviewing freight, pricing and labor prior to customer invoicing and upon project wind down."
    },
    {
      "duty": "Reconcile all change orders, returns and shipments to ensure they are properly reflected in project metrics prior to generating customer invoicing."
    },
    {
      "duty": "Prepare project summary invoice for Contract Sales and Credit to review with customers."
    },
    {
      "duty": "Create, update and distribute weekly open jobs status report."
    },
    {
      "duty": "Process J05 orders (Job Credits) by reviewing that change orders are completed and accurate."
    },
    {
      "duty": "Pick/Pack/Deliver all non-inventory job lines."
    },
    {
      "duty": "Support Manager of Project Administration in reviewing and closing of projects."
    },
    {
      "duty": "Assists in report generation to track and report on job completion and profitability."
    },
    {
      "duty": "Perform other related duties as required and assigned."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Accounting",
      "experience": 2
    },
    {
      "skill": "Microsoft Office",
      "experience": 2
    },
    {
      "skill": "Communication",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "Associate’s degree or related experience, or equivalent Military or practical experience."
    },
    {
      "credential": "Basic accounting or job quoting experience."
    }
  ]
}