{
  "meta": [
    {
      "job_title": "Hydroblasting Technician",
      "job_category": "Maintenance",
      "job_class": "Technician",
      "sector": "Maintenance",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "High Pressure Water Unit Operation",
      "experience": 3
    },
    {
      "skill": "Equipment Set-Up",
      "experience": 3
    },
    {
      "skill": "Safety Procedures",
      "experience": 3
    },
    {
      "skill": "Physical Abilities Test",
      "experience": 3
    },
    {
      "skill": "Mechanical Fundamentals",
      "experience": 3
    },
    {
      "skill": "Equipment Troubleshooting",
      "experience": 3
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 3
    },
    {
      "skill": "Computer Literacy",
      "experience": 3
    },
    {
      "skill": "Driving",
      "experience": 3
    },
    {
      "skill": "Physical Effort",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Utilize a high pressure water unit to clean various equipment such as process lines, heat exchanger tubes, condensers, and drains."
    },
    {
      "duty": "Assist in the set-up of equipment prior to operation and the actual cleaning operation utilizing various hoses, lances, nozzles, and water pressure up to 40,000 psi."
    },
    {
      "duty": "Assemble, adjust, and dismantle all high pressure cleaning equipment and accessories."
    },
    {
      "duty": "Follow all safety procedures and wear necessary personal protective equipment."
    },
    {
      "duty": "Operate and maintain hydroblasting cleaning unit to clean and unplug process equipment plant wide."
    },
    {
      "duty": "Drive a 2-ton truck used to transport the hydroblasting unit."
    },
    {
      "duty": "Read, understand, and follow all safety requirements, rules, and guidelines."
    },
    {
      "duty": "Use hand tools, power tools, and equipment."
    },
    {
      "duty": "Climb as necessary to reach the job and work from ladders, scaffolds, and platforms at elevated heights."
    },
    {
      "duty": "Perform work such as assembly, adjustment, and dismantlement of all hydroblasting cleaning equipment and accessories."
    },
    {
      "duty": "Troubleshoot equipment problems, make routine repairs, and inspect assigned equipment."
    },
    {
      "duty": "Concentrate on job tasks and perform computer training tasks using MyLearning Lab and Outlook."
    },
    {
      "duty": "Work in hazardous noise environments and be able to perform the essential elements of the positions with or without reasonable accommodations."
    },
    {
      "duty": "Work odd and unusual hours, including nights and weekends, and work considerable overtime."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED"
    },
    {
      "credential": "Good writing, communication, and reading comprehension skills"
    }
  ]
}