{
  "meta": [
    {
      "job_title": "Program Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Social Services",
      "salary": 98000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "Supervisory Experience",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Outcome Evaluation",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Crisis Intervention",
      "experience": 5
    },
    {
      "skill": "Customer Focus",
      "experience": 5
    },
    {
      "skill": "Team Performance",
      "experience": 5
    },
    {
      "skill": "Clinical Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops, interprets, and ensures consistent implementation of program philosophy, objectives, standards, policies, procedures, and program practices."
    },
    {
      "duty": "Ensures effective coordination of services for children and families with other providers, both internal and external, by supporting the development of constructive relationships and problem-solving barriers."
    },
    {
      "duty": "Provides direct supervision, coaching and mentoring to the direct service staff."
    },
    {
      "duty": "Supports the program with stand by quick response training and implementation."
    },
    {
      "duty": "Hires, trains, and manages overall performance of direct service staff, as assigned."
    },
    {
      "duty": "Monitors and reviews defined outcome achievement for youth and families, as well as satisfaction levels for youth, families, and referring workers and agencies to develop appropriate training and tools to enhance services."
    },
    {
      "duty": "Analyzes and integrates the use of outcome data to improve service delivery within assigned team."
    },
    {
      "duty": "Initiates and participates in organizational quality improvement efforts."
    },
    {
      "duty": "Manages day-to-day operations including utilization of human and other resources."
    },
    {
      "duty": "Oversees and approves financial expenditures within assigned fiscal authority to ensure good stewardship and management within budgeted parameters."
    },
    {
      "duty": "Driving to appointments with clients and their families or other key contacts."
    },
    {
      "duty": "Physical interactions with children of variable ages such as but not limited to games, sports, and other activities."
    },
    {
      "duty": "Performs other responsibilities, as assigned, to support specific department/business needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 200,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Master's degree in social work, Marriage and Family Counseling, Psychology, or related field (LMFT, LCSW, LPCC preferred)"
    }
  ]
}