{
  "meta": [
    {
      "job_title": "IT Support Engineer",
      "job_category": "Information Technology",
      "job_class": "Engineer",
      "sector": "Information Technology",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "IT Technical Support",
      "experience": 5
    },
    {
      "skill": "Network and Server Support",
      "experience": 5
    },
    {
      "skill": "Software Installation",
      "experience": 5
    },
    {
      "skill": "Device Configuration",
      "experience": 5
    },
    {
      "skill": "Desktop and Laptop Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Support",
      "experience": 5
    },
    {
      "skill": "ServiceNow Ticketing System",
      "experience": 5
    },
    {
      "skill": "Active Directory Management",
      "experience": 5
    },
    {
      "skill": "Technical Guidance",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide onsite IT technical support for end-user desktops, laptops, and office IT, including network and server support."
    },
    {
      "duty": "Install and configure software on end-user systems and servers, and support new user onboarding."
    },
    {
      "duty": "Support offboarding activities, including collecting and managing IT assets, and providing executive/VIP support."
    },
    {
      "duty": "Manage IP phone and video conference support, as well as level 1 multifunction printers support."
    },
    {
      "duty": "Configure, deploy, and troubleshoot enterprise and personal desktop and laptop computers, midrange servers, and network devices."
    },
    {
      "duty": "Handle tickets on ServiceNow or similar ticketing system, troubleshoot VPN, and provide application support with Microsoft Office and SharePoint."
    },
    {
      "duty": "Troubleshoot MS Windows 10 and MS Office 365 issues for end-users, and manage office IT asset and stock management."
    },
    {
      "duty": "Coordinate external vendors when engaged for support, work independently, and coordinate in-house IT projects."
    },
    {
      "duty": "Provide technical guidance, prioritize workload, and lead the project support team, including asset/stock management, e-waste management, onsite training, and vendor co-ordination."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Technology or related field"
    }
  ]
}