{
  "meta": [
    {
      "job_title": "Program Coordinator II",
      "job_category": "Education",
      "job_class": "Coordinator",
      "sector": "Education",
      "salary": 52500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Youth Engagement",
      "experience": 4
    },
    {
      "skill": "Curriculum Development",
      "experience": 4
    },
    {
      "skill": "Community Partnership",
      "experience": 4
    },
    {
      "skill": "Program Coordination",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Public Presentation",
      "experience": 5
    },
    {
      "skill": "Time and Task Management",
      "experience": 5
    },
    {
      "skill": "Partnership Building",
      "experience": 5
    },
    {
      "skill": "Social Media Management",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Spanish Language",
      "experience": 3
    },
    {
      "skill": "Volunteer Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Internalize youth engagement curriculum and lessons to proficiently facilitate them for an audience."
    },
    {
      "duty": "Execute youth engagement lessons in K12 schools and with youth and their families."
    },
    {
      "duty": "Record student engagement and post-test data in shared tracker to support impact tracking."
    },
    {
      "duty": "Maintain a calendar of engagement activities including school workshops, community events, and other engagement opportunities."
    },
    {
      "duty": "Develop partnerships with local schools, community-based organizations, and other related entities with shared or aligned missions."
    },
    {
      "duty": "Coordinate the participation of volunteers in office programming as needed."
    },
    {
      "duty": "Track engagement metrics and provide regular reports on impact."
    },
    {
      "duty": "Execute youth engagement lessons using Office curriculum and resources in community spaces."
    },
    {
      "duty": "Table at community events to increase awareness of the Office and distribute relevant resources to youth and their families."
    },
    {
      "duty": "Recruit and support volunteers and other TAMU-affiliated staff to become active partners in the Office’s youth engagement work."
    },
    {
      "duty": "Maintain a regional social media account on behalf of the Office for Youth Engagement and use it to raise community awareness of resources and programs."
    },
    {
      "duty": "Provide feedback on curriculum and resources to improve them."
    },
    {
      "duty": "Make recommendations related to new content and resources to be developed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 128,
      "student_teacher": 64,
      "introvert_extrovert": 96
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Education or a related field (Master’s preferred)"
    },
    {
      "credential": "Class “C” vehicle operator’s license or ability to obtain within 30 days of employment."
    }
  ]
}