{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Construction",
      "job_class": "General Superintendent",
      "sector": "Construction",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Provides management of subcontractors and organization of the overall job and workflow."
    },
    {
      "duty": "Manages and oversees company staff, subcontractors, suppliers and programs such as Safety, Quality and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Develops work plans for subcontractors and self-performed work."
    },
    {
      "duty": "Coordinates and manages the care, custody and control of the project site."
    },
    {
      "duty": "Leads various meetings including daily standup and weekly trade meetings."
    },
    {
      "duty": "Communicates key project information to owners, design team, governing authorities, subcontractors, suppliers and other departments."
    },
    {
      "duty": "Supports the project closeouts by supervising pre-punch activities and coordinating activities with the owner, architect and governing authorities."
    },
    {
      "duty": "Gains understanding of the project pursuit process and methodology."
    },
    {
      "duty": "Partners with field leadership to establish field staffing for their assigned project."
    },
    {
      "duty": "Partners with project management to identify schedule and costs associated with project changes."
    },
    {
      "duty": "Understands and applies the terms and conditions of the owner and subcontractor contracts for the project."
    },
    {
      "duty": "Responsible for identifying and recruiting top talent."
    },
    {
      "duty": "Leads, supports and promotes a culture of diversity and inclusion within JE Dunn."
    },
    {
      "duty": "Effectively delivers leadership messages to multiple audiences both internally and externally."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 200,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering or related field (Preferred).In lieu of the above requirements, equivalent relevant experience will be considered."
    },
    {
      "credential": "12+ years construction experience. 10+ years field supervision experience. Experience leading Lean principles on projects (Preferred)."
    }
  ]
}