{
  "meta": [
    {
      "job_title": "Residency Program Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 64330,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Administrative Experience",
      "experience": 3
    },
    {
      "skill": "Residency Program Management",
      "experience": 3
    },
    {
      "skill": "Compliance Management",
      "experience": 3
    },
    {
      "skill": "Database Management",
      "experience": 3
    },
    {
      "skill": "Staff Coordination",
      "experience": 3
    },
    {
      "skill": "Program Coordinator",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensuring compliance with current guidelines of relevant medical associations and specialty boards for the residency program."
    },
    {
      "duty": "Coordinating day-to-day operations of the department’s residency and/or fellowship program."
    },
    {
      "duty": "Maintaining rotation schedules, grand round appointments, and accurate records of current and past residents."
    },
    {
      "duty": "Coordinating all aspects of the resident/fellow interview process and ensuring applicant credentials are in compliance with current guidelines."
    },
    {
      "duty": "Implementing and managing the New Innovations residency management software."
    },
    {
      "duty": "Coordinating Orientation Day for new house staff and maintaining demographic information in relevant tracking systems."
    },
    {
      "duty": "Serving as a resource for all house staff personnel and assisting in resolving problems and concerns."
    },
    {
      "duty": "Assisting International applicants with VISA requirements and submitting required documents."
    },
    {
      "duty": "Monitoring licensing requirements and following up with applicants regarding missing credentials."
    },
    {
      "duty": "Acting as the primary resource management representative of the organization and engaging with relevant thought leaders and policy-makers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent experience"
    },
    {
      "credential": "Certified as TAGME (Training Administrators of Graduate Medical Education) preferred"
    }
  ]
}