{
  "meta": [
    {
      "job_title": "Technical SME/Project Manager",
      "job_category": "Engineering",
      "job_class": "Project Manager",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Agile Delivery Management",
      "experience": 10
    },
    {
      "skill": "Program Management",
      "experience": 10
    },
    {
      "skill": "Technical Management",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Automation",
      "experience": 10
    },
    {
      "skill": "Project Communication",
      "experience": 10
    },
    {
      "skill": "Project Oversight",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Process Improvement",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Problem-solving",
      "experience": 10
    },
    {
      "skill": "Client Satisfaction",
      "experience": 10
    },
    {
      "skill": "Project Lifecycle Deployment",
      "experience": 10
    },
    {
      "skill": "Business Process Analysis",
      "experience": 10
    },
    {
      "skill": "Quality Assurance",
      "experience": 10
    },
    {
      "skill": "Presentation Development",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage Agile delivery model and program governance and oversight."
    },
    {
      "duty": "Analyze and manage parallel projects under a complex program, strategic roadmap creation, and performance metric monitoring."
    },
    {
      "duty": "Serve as an escalation point for customer concerns and provide leadership and direction to direct reports and key stakeholders."
    },
    {
      "duty": "Improve product line performance through automation and continuous integration pipelines."
    },
    {
      "duty": "Collect, analyze, manage, and report key Product Line execution status and metrics across all aspects of the Agile product development lifecycle."
    },
    {
      "duty": "Support fast turnaround requests for data calls and be able to understand the ask and request data from the appropriate program resource."
    },
    {
      "duty": "Define requirements and plans project lifecycle deployment, coordinate with cross-discipline team members, and ensure project communication plans are executed."
    },
    {
      "duty": "Conduct research, analyze information needs, and perform analysis to support the delivery of relevant artifacts."
    },
    {
      "duty": "Establish effective project communication plans and ensuring their execution."
    },
    {
      "duty": "Verify data and information and analyze it to suit the direction of a project, track, forecast, and report on project progress."
    },
    {
      "duty": "Leverage excellent writing and presentation development skills and create compelling, concise narratives and visualizations using PowerPoint."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in a Business, Engineering, or Technical discipline plus 15 years of experience; 10 additional years of experience can be substituted for the degree requirement. Preferred certifications include PMP, SAFe, and knowledge in DevSecOps environment."
    }
  ]
}