{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 12
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Quality Compliance",
      "experience": 10
    },
    {
      "skill": "Team Collaboration",
      "experience": 10
    },
    {
      "skill": "Communications",
      "experience": 10
    },
    {
      "skill": "Planning",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Manages and oversees company staff, subcontractors, suppliers, and programs such as Safety, Quality, and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Coordinates and manages the care, custody, and control of the project site."
    },
    {
      "duty": "Creates, manages, changes, and implements the project’s schedule as needed, in conjunction with the Project Manager."
    },
    {
      "duty": "Manages material and equipment needs for the project."
    },
    {
      "duty": "Supports the MOC (Material and Other Costs) and DLSC (Dunn Logistics Service Center) procurement and approval processes."
    },
    {
      "duty": "Assists in the selection of the formwork, tools, and equipment necessary to complete self-perform operations."
    },
    {
      "duty": "Participates in the negotiation process with the owner and architect to gain agreement for project changes."
    },
    {
      "duty": "Understands and applies the terms and conditions of the owner and subcontractor contracts for the project."
    },
    {
      "duty": "Responsible for identifying and recruiting top talent."
    },
    {
      "duty": "Leads, supports, and promotes a culture of diversity and inclusion within JE Dunn."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering, or related field (Preferred). In lieu of the above requirements, equivalent relevant experience will be considered."
    }
  ]
}