{
  "meta": [
    {
      "job_title": "Internal Audit Manager",
      "job_category": "Audit",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "J-SOX Compliance",
      "experience": 5
    },
    {
      "skill": "GAAP/IFRS",
      "experience": 5
    },
    {
      "skill": "Multicultural Environment",
      "experience": 5
    },
    {
      "skill": "Audit Management",
      "experience": 5
    },
    {
      "skill": "Oracle",
      "experience": 5
    },
    {
      "skill": "Corporate Governance",
      "experience": 5
    },
    {
      "skill": "Internal Audits",
      "experience": 5
    },
    {
      "skill": "IT Compliance",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and manage J-SOX audits for the company and its affiliates, including compliance audits for all in-scope business processes."
    },
    {
      "duty": "Identify risk areas and propose changes to existing systems of internal control to meet regulatory compliance standards."
    },
    {
      "duty": "Recommend policy changes and implementation procedures to ensure best practices in internal controls."
    },
    {
      "duty": "Assist with the co-ordination of the J-SOX audit compliance program with outside examiners and auditors."
    },
    {
      "duty": "Conduct corporate audits, including on-site audits according to Internal Aisin Standards covering various areas."
    },
    {
      "duty": "Communicate day-to-day activities with senior management in NA/Japan and assist with the identification, development, implementation, and analysis of internal controls."
    },
    {
      "duty": "Perform special projects, ATSG audits, and other duties as assigned."
    },
    {
      "duty": "Support all IT compliance related activities and monitor the remediation status of deficient internal controls."
    },
    {
      "duty": "Keep up to date with the changing audit guidance provided by the Japanese Financial Services Agency (FSA)."
    },
    {
      "duty": "Assist with the design and implementation of detailed business process plans, and monitor implementation progress for proposed action plans and control gaps."
    },
    {
      "duty": "Assist with the identification, development, implementation, and analysis of internal controls, and propose action plans for control gaps."
    },
    {
      "duty": "Examine existing documentation and assist with the implementation of changes to meet process requirements and ensure compliance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "IIA CIA certification"
    },
    {
      "credential": "Bachelor's degree in Business, Accounting, Finance or related major"
    }
  ]
}