{
  "meta": [
    {
      "job_title": "Business Information Security Officer",
      "job_category": "Information Security",
      "job_class": "Officer",
      "sector": "Information Technology",
      "salary": 140000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Strategic Alignment",
      "experience": 10
    },
    {
      "skill": "Business Enabling",
      "experience": 10
    },
    {
      "skill": "Relationship Building",
      "experience": 10
    },
    {
      "skill": "Cyber Risk Management",
      "experience": 10
    },
    {
      "skill": "Information Security",
      "experience": 10
    },
    {
      "skill": "Project Delivery",
      "experience": 10
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 10
    },
    {
      "skill": "Decision Making",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive strategic alignment between business unit objectives and enterprise security strategy."
    },
    {
      "duty": "Foster partnerships with stakeholders and develop relationships that promote trust and increase program implementation efficiency."
    },
    {
      "duty": "Influence the delivery and priority of service features and development of new security services or products based on strategic security needs."
    },
    {
      "duty": "Support the development of risk remediation action plans and ensure the priority of security work is balanced appropriately amongst other business priorities."
    },
    {
      "duty": "Stay current with the external threat environment for emerging threats and ensure advisement to relevant stakeholders on the appropriate course of action."
    },
    {
      "duty": "Collaborate with local counsel on incident resolution and regulatory compliance matters, as applicable."
    },
    {
      "duty": "Advocate for security recommendations for third-party risk management and advance the development of the security champion program."
    },
    {
      "duty": "Develop and maintain a network of industry contacts, perform or direct research on industry trends, competitors, business and IT products, and make strategic and tactical recommendations."
    },
    {
      "duty": "Participate in program increment planning events and influence the strategic cyber risk management vision that scales to the SBU."
    },
    {
      "duty": "Define and effectively communicate key performance indicators (KPIs), key risk indicators (KRIs), and metrics with other SBU aligned BISOs and CISO."
    },
    {
      "duty": "Commit to continual learning, particularly as it relates to regulatory, technology, and cybersecurity and privacy industry trends, applying knowledge to global strategy and program improvements."
    },
    {
      "duty": "Assist in the management of security incidents and events to protect IT assets, regulated data, and the company's reputation."
    },
    {
      "duty": "Make strategic and tactical recommendations based on research on industry trends, competitors, and business and IT products."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's Degree in technical or business discipline or related experience; Master's Degree preferred."
    }
  ]
}