{
  "meta": [
    {
      "job_title": "Receiving Logistics Coordinator",
      "job_category": "Logistics",
      "job_class": "Coordinator",
      "sector": "Logistics",
      "salary": 20000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Logistics Management",
      "experience": 2
    },
    {
      "skill": "Material Handling",
      "experience": 2
    },
    {
      "skill": "Inventory Control",
      "experience": 2
    },
    {
      "skill": "Database Management",
      "experience": 2
    },
    {
      "skill": "Warehousing",
      "experience": 2
    },
    {
      "skill": "Shipping Coordination",
      "experience": 2
    },
    {
      "skill": "Order Fulfillment",
      "experience": 2
    },
    {
      "skill": "Cost Control",
      "experience": 2
    },
    {
      "skill": "Forklift Operation",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Load, unload, and move materials within or near plant, yard, or work site."
    },
    {
      "duty": "Manage Materials being inducted/transferred, received and/or issued through the Repair and Overhaul Section and responsible for all Database entries."
    },
    {
      "duty": "Read work order or follows verbal instructions to ascertain materials or containers to be moved."
    },
    {
      "duty": "Open containers using steel cutters, crowbar, claw-hammer, or other hand tools."
    },
    {
      "duty": "Load and unload materials onto or from pallets, trays, racks, and shelves by hand."
    },
    {
      "duty": "Load materials into vehicles and installs strapping, bracing, or padding to prevent shifting or damage in transit."
    },
    {
      "duty": "Convey materials from storage or work sites to designated area using hand truck, electric dolly, wheelbarrow, or other device."
    },
    {
      "duty": "Secure lifting attachments to materials and conveys load to destination using hand-operated crane or hoist, signals crane, or hoisting operators to move load to destination."
    },
    {
      "duty": "Count, weigh, and record number of units of materials moved or handled on daily production sheet."
    },
    {
      "duty": "Attach identifying tags or labels to materials or mark information on cases, bales, or other containers."
    },
    {
      "duty": "Stack or assemble materials into bundles and band bundles together using banding machine and clincher."
    },
    {
      "duty": "Clamp sections of portable conveyor together or places conveyor sections on blocks or boxes to facilitate movement of materials or products."
    },
    {
      "duty": "Remove samples of materials, labels with identifying information, and take samples to laboratory for analysis."
    },
    {
      "duty": "Lift heavy objects by hand or using power hoist, and clean work area, machines, and equipment, using broom, rags, and cleaning compounds, to assist machine operators."
    },
    {
      "duty": "Coordinates the organization's daily logistical operations, including inventory control, order fulfillment, and distribution."
    },
    {
      "duty": "Organizes warehousing for goods."
    },
    {
      "duty": "Reviews inventory to ensure that product adjustments are properly applied."
    },
    {
      "duty": "Plans and schedules inbound and outbound shipments to internal or external customers based on needs."
    },
    {
      "duty": "Acts as liaison between customers, freight carriers and shipping department. Ensures on-time delivery of goods to customers, by investigating and resolving detention issues."
    },
    {
      "duty": "Assists in cost control by evaluating shipments, consolidating loads, and selecting most cost-efficient method of shipment within Department of Defense guidelines."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 40,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma with 2+ years of experience"
    }
  ]
}