{
  "meta": [
    {
      "job_title": "Guest Experience Lead",
      "job_category": "Retail",
      "job_class": "Lead",
      "sector": "Sales",
      "salary": 26000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Ensure all guests receive a quality in-store experience, providing or overseeing technical product education to meet the unique needs of each guest."
    },
    {
      "duty": "Drive store performance on the floor through guest experience and team achievement of daily sales or unit targets."
    },
    {
      "duty": "Provide input to team member performance evaluations, recommendations into store hiring decisions, and act as Supervisor on Duty (SOD) when leading the floor."
    },
    {
      "duty": "Bring the guest experience framework to life, leading from the floor to establish an exceptional and inclusive guest experience."
    },
    {
      "duty": "Conduct preparation activities to ensure in-store readiness for guests and ensure operational excellence of the store is maintained throughout the shift."
    },
    {
      "duty": "Review and interpret daily business data and metrics to track progress toward sales goals and motivate team to drive business results."
    },
    {
      "duty": "Participate in the store’s hiring process, including recruitment, selection and hiring recommendations, onboarding, and training."
    },
    {
      "duty": "Address team member performance and support their ongoing learning and development by providing direct feedback and in-the-moment recognition, coaching, demonstrations, and hands-on experiences."
    },
    {
      "duty": "Contribute to a respectful and inclusive team by establishing supportive working relationships and engaging with team members, creating a fun and productive environment."
    },
    {
      "duty": "Open and close the store in accordance with the opening and closing procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 150,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma/GED/equivalent, or above"
    }
  ]
}