{
  "meta": [
    {
      "job_title": "Equipment Procurement Specialist",
      "job_category": "Procurement",
      "job_class": "Specialist",
      "sector": "Logistics",
      "salary": 75000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Procurement",
      "experience": 4
    },
    {
      "skill": "Negotiation",
      "experience": 4
    },
    {
      "skill": "Budget Management",
      "experience": 4
    },
    {
      "skill": "Vendor Management",
      "experience": 4
    },
    {
      "skill": "Project Coordination",
      "experience": 4
    },
    {
      "skill": "Risk Assessment",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Resolve procurement issues with architects, subcontractors, consultants, suppliers, inspectors, owner’s representatives."
    },
    {
      "duty": "Ensure equipment/procurement packages are compliant with drawings and specifications."
    },
    {
      "duty": "Manage project budgets and submittals."
    },
    {
      "duty": "Assess conformance to contract specifications and resolve interpretation conflicts."
    },
    {
      "duty": "Negotiate and manage change orders within scope of authority and submit for approval by Logistics Manager."
    },
    {
      "duty": "Prepare independent analysis, obtain and check estimates for vendor changes, and resolve conflicts."
    },
    {
      "duty": "Oversee the close-out process and prepare final records for the project."
    },
    {
      "duty": "Supervise staff and assist in preparation of scope of work documents, coordination matrices, and bid documents for vendor bid packages."
    },
    {
      "duty": "Develop Purchase Orders, track vendor requirements, and develop reports such as project budget reports and cost reports."
    },
    {
      "duty": "Schedule and manage vendor coordination meetings, preconstruction meetings, and submittal review meetings. Job site and factory visits required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree plus a minimum of four years’ related experience or an equivalent combination of education, training, and/or experience."
    }
  ]
}