{
  "meta": [
    {
      "job_title": "Customer Experience Learning Manager",
      "job_category": "Customer Experience",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Facilitating Training",
      "experience": 8
    },
    {
      "skill": "Coaching",
      "experience": 8
    },
    {
      "skill": "Customer Service",
      "experience": 8
    },
    {
      "skill": "Resource Planning",
      "experience": 8
    },
    {
      "skill": "Change Management",
      "experience": 8
    },
    {
      "skill": "Instructional Design",
      "experience": 8
    },
    {
      "skill": "Technology",
      "experience": 8
    },
    {
      "skill": "Team Leadership",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide learning expertise across all customer experience departments in terms of needs analysis, design, delivery, and evaluation of key programs."
    },
    {
      "duty": "Develop frameworks to support and accelerate speed to competence of employees around skills, behaviors, systems, and processes."
    },
    {
      "duty": "Assist in the design and maintenance of all training tools and resources, ensuring all materials are up to date and support the design of new and innovative training sessions and e-learning modules."
    },
    {
      "duty": "Drive collaboration within the customer experience community and with business partners across the enterprise to ensure consistency of programs, they are well understood and contribute effectively to the Company’s overall business strategy."
    },
    {
      "duty": "Manage internal stakeholders and external suppliers to achieve the learning training objectives."
    },
    {
      "duty": "Train, coach, mentor, and develop colleagues across the customer experience community to higher levels of performance through effective training and coaching."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business, or a related field (Master's preferred)"
    }
  ]
}