{
  "meta": [
    {
      "job_title": "MRI Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 122500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "MRI Operations Management",
      "experience": 5
    },
    {
      "skill": "Staff Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Protocol Development",
      "experience": 5
    },
    {
      "skill": "MR Safety Standards",
      "experience": 5
    },
    {
      "skill": "Training & Mentorship",
      "experience": 5
    },
    {
      "skill": "Quality Assessment",
      "experience": 5
    },
    {
      "skill": "Policy & Procedure Review",
      "experience": 5
    },
    {
      "skill": "IT Resource Coordination",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage technical functions, activities, and operations of the MRI modality across multiple locations."
    },
    {
      "duty": "Prioritize overall activities, delegate work, and ensure appropriate staffing needs at all times."
    },
    {
      "duty": "Responsible for hiring, onboarding, training, mentorship, and performance management of technologists."
    },
    {
      "duty": "Monitor staff compliance with department and regulatory standards and ensure patient safety."
    },
    {
      "duty": "Assist Radiologists in developing new procedure protocols and ensure MR safety standards."
    },
    {
      "duty": "Coordinate installation and security of IT resources and troubleshoot problems concerning information systems."
    },
    {
      "duty": "Develop QA improvements based on continuous analysis of operations, policies, and procedures to ensure quality service."
    },
    {
      "duty": "Review policies and procedures, ensure compliance, and prepare quality assessment reports."
    },
    {
      "duty": "Coordinate activities with IT resources for installation and security, ACR Accreditation applications, and image submission."
    },
    {
      "duty": "Lead training and educational activities for all sites, and travel as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of a 2-year AMA approved Radiology school and at least 4 years of related experience, New York State Licensed X-Ray Technologist by the Department of Health, Registered X-Ray Technologist by American Registry of Radiologic Technologists (ARRT), ARRT/MRI certification, 2 years supervisory experience."
    }
  ]
}