{
  "meta": [
    {
      "job_title": "Mobile Crisis Responder",
      "job_category": "Mental Health",
      "job_class": "First Aid Responder",
      "sector": "Behavioral Health",
      "salary": 27,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Respond to community-based crisis situations in county-provided vehicle as part of a 24/7 community-based mobile crisis team."
    },
    {
      "duty": "Collaborate with other crisis responders to provide primary and secondary client screenings, basic first aid, crisis de-escalation, psychoeducation, outreach, and community support linkage."
    },
    {
      "duty": "Assist in driving the mobile field team van, providing primary screening, and administering first aid not exceeding the scope of training obtained through proper certification."
    },
    {
      "duty": "Complete clinical reports for Emergency Medical System (EMS) staff, administer Narcan in opioid overdose emergencies, and screen/test for COVID-19 and obtain standard vital signs for any client being transported."
    },
    {
      "duty": "Provide CPI de-escalation techniques and stabilization services in the community in a clinically and culturally appropriate manner, as well as participate in community outreach events."
    },
    {
      "duty": "Maintain confidentiality and HIPAA compliance, transport clients to appropriate level of care, and ensure the vehicle's cleanliness, orderliness, and good working condition."
    },
    {
      "duty": "Conduct visual inspection of vehicles, complete van binder checklist, and report accidents, incidents, or breakdowns involving vehicle(s) while in use."
    },
    {
      "duty": "Participate in required trainings and evaluations, department and agency meetings, and maintain a customer-focused service style."
    },
    {
      "duty": "Practice self-care, drive to appointments, and remain aware of stress in self and others."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma, GED, or equivalent education. Credentialed as an EMT in the state of California or EMT coursework successfully completed and credentialling must be completed within 60 days of hire. Must be certified in crisis intervention techniques within the first 30 days and annually."
    }
  ]
}