{
  "meta": [
    {
      "job_title": "Account Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 60000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Outbound Sales",
      "experience": 4
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 4
    },
    {
      "skill": "Salesforce",
      "experience": 4
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Negotiation",
      "experience": 4
    },
    {
      "skill": "Market Research",
      "experience": 4
    },
    {
      "skill": "Strategic Selling",
      "experience": 4
    },
    {
      "skill": "Consultative Selling",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Effectively utilizes an outbound sales process including, needs-based consultative selling to aid customers in achieving business goals through the use of EPS products and services."
    },
    {
      "duty": "Develops multi-level relationships with accounts to promote, market, and sell EPS brands to existing and potential customers within assigned territory."
    },
    {
      "duty": "Targets private, parochial, and charter schools within the given territory."
    },
    {
      "duty": "Effectively use SalesForce.com and Business Analytic tools to manage time and resources to provide updated information, competitive intelligence, and market trends with our customers."
    },
    {
      "duty": "Drives and creates a positive, collaborative team selling environment by developing a deep customer understanding of needs and leveraging internal departments to maximize revenue opportunities."
    },
    {
      "duty": "Ability to overcome objections and effectively deal with customer rejection."
    },
    {
      "duty": "Responsible for responding to customer inquiries in a timely manner and following up on all sales leads."
    },
    {
      "duty": "Drives continued growth by moving customers to our online order-entry platform."
    },
    {
      "duty": "Work directly with customer to assess, describe solutions, define products and create quotes."
    },
    {
      "duty": "Responsible for input to sales, profit forecasting overall sales, marketing plans, self-study of products and applications"
    },
    {
      "duty": "Attendance required at sales meetings as well as National and Regional conferences and trade shows, as well as occasional strategic customer meetings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business related field preferred; years of relevant experience considered in lieu of degree."
    }
  ]
}