{
  "meta": [
    {
      "job_title": "MS&T Senior Process Engineer",
      "job_category": "Process Engineering",
      "job_class": "Senior",
      "sector": "Manufacturing",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and complete experiments/deliverables at small and large/commercial scale to support project objectives that supports base business."
    },
    {
      "duty": "Champions and leads technical aspects for manufacturing process improvements through data analysis identification of critical process parameters, the proposal of alternate process modifications, assistance in conducting DOE to determine the best processes, assistance in conducting scale-up activities including pilot-scale and validation as required."
    },
    {
      "duty": "Oversees, prepares, reviews or approves technical memos or reports by analyzing data, developing conclusions and recommendations based on sound scientific principles."
    },
    {
      "duty": "Effectively leads, communicates, and partners with cross-functional peer group and management. Lead and/or participate as a technical team member or technical representative on cross functional teams."
    },
    {
      "duty": "Commercial business support including- change control deliverables/documentation, investigations, CAPAs, and APR data collection, analysis and review/approval. Write and/or approve standard operating procedures or provide input to SOPs, policies, and standards. Is a trusted voice for and provides technical advice on SOPs, policies, and procedures."
    },
    {
      "duty": "Leads technical aspects for solving critical supply issues, provide technical troubleshooting and recommendations using knowledge, experience, data analysis, and problem-solving tools to address sophisticated technical problems that may have a direct impact on commercial product quality or supply. May also prepare, review, or approve regulatory documents (e.g. related to NDA, ANDA, or SNDA)."
    }
  ],
  "skills": [
    {
      "skill": "Pharmaceutical Manufacturing",
      "experience": 4
    },
    {
      "skill": "GMPs",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Process Validation",
      "experience": 4
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 4
    },
    {
      "skill": "Material Interactions",
      "experience": 4
    },
    {
      "skill": "Problem-Solving",
      "experience": 4
    },
    {
      "skill": "Technical Writing",
      "experience": 4
    },
    {
      "skill": "Cross-Functional Communication",
      "experience": 4
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's of Science degree or equivalent in Engineering, Chemistry, Pharmacy or a related technical field required."
    },
    {
      "credential": "Master's degree preferred."
    }
  ]
}