{
  "meta": [
    {
      "job_title": "Client Accounts Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 135000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Billing Management",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 2
    },
    {
      "skill": "Accounting Systems",
      "experience": 2
    },
    {
      "skill": "Excel",
      "experience": 2
    },
    {
      "skill": "E-Billing Applications",
      "experience": 2
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and implement best practices for billing management functions."
    },
    {
      "duty": "Lead a team of billing specialists, ensuring overall alignment with the firm’s billing practices, policies, and procedures."
    },
    {
      "duty": "Provide daily supervision, support, and guidance to direct reports, ensure work assignments are completed in a timely manner, and meet the expectations of internal and external clients."
    },
    {
      "duty": "Interact with clients, attorneys, and business professionals, act as a point of escalation, research and resolve billing issues, including account analysis, and assist attorneys and the billing team with processing and collecting invoices in a timely manner."
    },
    {
      "duty": "Track team metrics to ensure the team is meeting service level requirements, analyze service level issues, and implement solutions expeditiously."
    },
    {
      "duty": "Participate and support project management initiatives, as well as lead and manage projects to include project planning, development, and execution."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Finance, Accounting or similar field (Master's preferred)"
    }
  ]
}