{
  "meta": [
    {
      "job_title": "Marketing Traffic Specialist",
      "job_category": "Marketing",
      "job_class": "Coordinator",
      "sector": "Marketing",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Agile Process Management",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Team Capacity Management",
      "experience": 3
    },
    {
      "skill": "Process Meeting Facilitation",
      "experience": 3
    },
    {
      "skill": "Technical Knowledge of JIRA",
      "experience": 3
    },
    {
      "skill": "Technical Knowledge of Microsoft Sharepoint",
      "experience": 3
    },
    {
      "skill": "Technical Knowledge of Microsoft Teams",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate and facilitate assigned Agile sprints and partner with Marketing department to manage team capacity, project sizing, and maintaining a backlog of unprioritized work."
    },
    {
      "duty": "Create, capture, and publish clear Agendas and Recaps as assigned, always in a timely manner and regularly lead or facilitate process meetings."
    },
    {
      "duty": "Partner with Sprint leaders to resolve identified blockers to team progress and revise processes in support of Agile sprint team’s capacity and growth."
    },
    {
      "duty": "Partner closely across teams to resolve timing conflicts, workload concerns, or changing requirements as needed and identify, intake, and scope additional or ad hoc needs as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or related experienceMinimum 2+ years experience in related fieldComfortable and confident speaking to or leading groupsShould be a strong written and verbal communicatorMust be positive and patient, work well with others, and possess strong diplomatic skillsMust demonstrate strong focus, sense of urgency, and adaptabilityShould be process oriented, with strong organization and time management skillsPrior experience working in Agile processes, including any is a plusTechnical knowledge of JIRA, Microsoft Sharepoint and Teams is preferred"
    }
  ]
}