{
  "meta": [
    {
      "job_title": "Warehouse Worker",
      "job_category": "Logistics and Supply Chain",
      "job_class": "Worker",
      "sector": "Logistics",
      "salary": 26000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Pick and deliver tools, materials, supplies and equipment within a work site."
    },
    {
      "duty": "Issues and returns tools to and from inventory."
    },
    {
      "duty": "Performs physical cycle counts of material."
    },
    {
      "duty": "Utilizes hand-held barcode reader in the performance of the above duties."
    },
    {
      "duty": "Operates common hand and power tools, including small forklift (maximum 10,000 lbs.) and other material handling equipment, i.e., pallet jack and power carts."
    },
    {
      "duty": "Loads and unloads PPL and supplier vehicles."
    },
    {
      "duty": "Places received materials into their proper location."
    },
    {
      "duty": "Performs routine local errands related to Logistics functions."
    },
    {
      "duty": "Performs miscellaneous yard and warehouse clean-up activities."
    },
    {
      "duty": "Only operates personal computer for employee related activities such as e-mail, time entry, Job Safety Analysis, training, etc."
    },
    {
      "duty": "Substitutes for Messenger."
    },
    {
      "duty": "Performs other related duties as assigned or as necessary."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High school education or equivalent."
    },
    {
      "credential": "Possess a valid motor vehicle operator’s license."
    },
    {
      "credential": "Ability to obtain valid and appropriate operator’s license and ability to operate material handling equipment e.g. forklift, material cart, van or pick-up truck (1 ton or less)."
    },
    {
      "credential": "Adequate physical ability to perform manual work associated with job duties."
    }
  ]
}