{
  "meta": [
    {
      "job_title": "Business Information Security Officer",
      "job_category": "Information Technology",
      "job_class": "Officer",
      "sector": "Software Engineering",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cybersecurity",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Stakeholder Management",
      "experience": 10
    },
    {
      "skill": "Security Strategy Development",
      "experience": 10
    },
    {
      "skill": "IT Concepts and Methodologies",
      "experience": 10
    },
    {
      "skill": "Project Delivery",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Strategically drive alignment between business unit objectives and enterprise security strategy, ensuring adherence to corporate security policies."
    },
    {
      "duty": "Initiate and foster partnerships with stakeholders, promoting trust and increasing efficiency of program implementation."
    },
    {
      "duty": "Influence and cascade a strategic cyber risk management vision, ensuring secure business operations without slowing innovation."
    },
    {
      "duty": "Develop and maintain a network of industry contacts, performing research on industry trends and making strategic recommendations."
    },
    {
      "duty": "Stay current with the external threat environment and advise relevant stakeholders on the appropriate course of action."
    },
    {
      "duty": "Support the development of risk remediation action plans, ensuring the priority of security work and management of security incidents."
    },
    {
      "duty": "Advocate security recommendations for third party risk management and expand the depth of security across application development teams."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or Master's Degree in technical or business discipline, or related experience; Master's Degree preferred."
    }
  ]
}