{
  "meta": [
    {
      "job_title": "Event Intern",
      "job_category": "Events",
      "job_class": "Intern",
      "sector": "Event Management",
      "salary": 25000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Event Planning",
      "experience": 1
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist with organizing and updating all documents on the ALE Shared Drive."
    },
    {
      "duty": "Proof envelopes for any mailings to ensure guest names and addresses are correct before mailing."
    },
    {
      "duty": "Facilitates vendor outreach with Events team."
    },
    {
      "duty": "Assembles specialty items, gift bags, and swag bags for events."
    },
    {
      "duty": "Tracks the arrival and check-in of all rented inventory to ensure all orders are confirmed and accounted for."
    },
    {
      "duty": "Compiles Event Binders for the ALE team consisting of guest lists, seating charts, event timelines, floor plans, and production schedules."
    },
    {
      "duty": "Picks up and drops off items from vendors and retailers."
    },
    {
      "duty": "Inventories ALE office and event supplies post-event and reorganize."
    },
    {
      "duty": "Books travel, hotel accommodations, vans/cars/limos for guests and ALE team."
    },
    {
      "duty": "Creates event timelines and other pertinent information related to each event with the Sr. Event Producers."
    },
    {
      "duty": "Supports the Sr. Event Producers with all functions from planning, load-in, event management, and load-out."
    },
    {
      "duty": "Works with the design team to ensure the day of event styling and setup meets Anna Lucia’s design deck specifications and expectations."
    },
    {
      "duty": "Organizes and inventories rental libraries including, but not limited to, fabric swatches, rental samples, etc."
    },
    {
      "duty": "Completes special projects as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Current college student, pursuing a degree in Event Management or Hospitality preferred."
    }
  ]
}