{
  "meta": [
    {
      "job_title": "Risk Management Supervisor",
      "job_category": "Risk Management",
      "job_class": "Supervisor",
      "sector": "Hospital Administration",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Assist Director of Risk Management in the management, supervision and coordination of activities of the Risk Management Department and staff at Jacobi Medical Center."
    },
    {
      "duty": "Develop and maintain a collaborative relationship with the medical, nursing and ancillary departments within the institution to promote and to facilitate the principals of risk management and patient safety."
    },
    {
      "duty": "Serve as departmental liaison to the administrative and medical staff providing guidance on medical-legal questions and issues with risk management and regulatory implications for the corporation, facility, facility personnel and patients and their families."
    },
    {
      "duty": "Maintain a proficiency and working knowledge of applicable 405 regulations, NYC Public Health Law, New York City Health + Hospitals (NYC H+H) corporate policies and procedures, DOH regulations, NYPORTS criteria and hospital policies and procedures to ensure hospital compliance and assist the facilities personnel."
    },
    {
      "duty": "Assist Director of Risk Management as liaison with NYC H+H counsel and outside counsel to facilitate the discovery process, claims management, and management of medical malpractice claims."
    },
    {
      "duty": "Participate in the development and implementation of Performance Improvement projects to maintain the level of services in a culture of safety, particularly through participation in the Patient Safety Committee processes and Root Cause Analysis discussions."
    },
    {
      "duty": "Review all cases for reportability to regulatory agencies and/or review for improvement of quality of care."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Baccalaureate Degree from an accredited college or university in Health Administration, Public Administration or approved related program or a Master's Degree from an accredited college or university in Hospital or Health Administration, Health Care Planning, Public Health, Administrative Medicine, Business Administration, Public Administration or approved related program."
    }
  ]
}