{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, direct, and coordinate construction operations, purchases, financial reporting, and project controls activities for an assigned portfolio of concurrent electrical projects."
    },
    {
      "duty": "Negotiate revisions, changes, and additions to contractual agreements with owners, architects, consultants, clients, suppliers, and subcontractors."
    },
    {
      "duty": "Execute major project purchases in collaboration with the operations team and regional leadership."
    },
    {
      "duty": "Manage project profitability for each project in his/her portfolio of work, including predictive analysis and revenue, cost, and profit forecasting."
    },
    {
      "duty": "Develop and implement quality control programs on projects."
    },
    {
      "duty": "Regularly visit projects to assess performance, progress, and quality and to ensure connectivity with the field and clients."
    },
    {
      "duty": "Prepare budgets for construction activities, oversee progress, and cost reports."
    },
    {
      "duty": "Develop and maintain relationships with peers at clients, architectural and engineering firms, and trade partners to ensure successful outcomes of projects."
    },
    {
      "duty": "Ensure that all safety and environmental policies of the Company and project owners are followed by all project personnel."
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BS in Construction Management, Electrical Engineering or equivalent work experience"
    },
    {
      "credential": "Strong knowledge of materials, methods, and tools required for electrical construction."
    },
    {
      "credential": "Experience managing projects $3 million and above."
    },
    {
      "credential": "Working knowledge of the NEC and be fluent in estimating processes."
    },
    {
      "credential": "Thorough knowledge of all aspects of construction (technology, equipment, materials, means, & methods, etc.)"
    }
  ]
}