{
  "meta": [
    {
      "job_title": "Director of Clinical Outcomes and Services",
      "job_category": "Healthcare",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Clinical Practice",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Clinical Software Knowledge",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Clinical Training",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute strategies to enhance clinical outcomes and support for healthcare customers."
    },
    {
      "duty": "Lead and coordinate the Clinical department's focus on project delivery, workflows, outcomes, and customer support."
    },
    {
      "duty": "Analyze data and metrics to evaluate company efficiency and drive an outcomes-driven and values-based approach."
    },
    {
      "duty": "Serve as a clinical subject matter expert and thought leader both internally and externally."
    },
    {
      "duty": "Provide leadership, professional services, training, and clinical support throughout presales and sales engagements, project lifecycle, and post-project phase."
    },
    {
      "duty": "Maintain strong relationships with customers and third parties, ensuring smooth delivery and support of products and services."
    },
    {
      "duty": "Participate in key account sales presentations, demonstrations, clinical evaluations, and clinical training."
    },
    {
      "duty": "Advocate an outcomes-first based approach, KPI measurements, and continuous advancement of product knowledge."
    },
    {
      "duty": "Develop and implement guidelines for employee recruitment, onboarding, training, evaluations, and promotion."
    },
    {
      "duty": "Establish and maintain a trusting, inclusive, and productive environment with opportunities for coaching, mentoring, and development."
    },
    {
      "duty": "Monitor and continuously reshape departmental best practices and processes to provide high employee and customer satisfaction."
    },
    {
      "duty": "Engage in ongoing evaluations of strategic partners within the industry and contribute to ISO certification and FDA certification."
    },
    {
      "duty": "Serve as an escalation point for project implementation, support, and customer-related issues."
    },
    {
      "duty": "Other duties as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Nursing, Registered Nurse BSN degree, or Master’s degree required."
    }
  ]
}