{
  "meta": [
    {
      "job_title": "Care Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Assessment",
      "experience": 3
    },
    {
      "skill": "Planning",
      "experience": 3
    },
    {
      "skill": "Critical Thinking",
      "experience": 3
    },
    {
      "skill": "Nursing Practice",
      "experience": 3
    },
    {
      "skill": "Patient Management",
      "experience": 3
    },
    {
      "skill": "Case Management",
      "experience": 3
    },
    {
      "skill": "Utilization Review",
      "experience": 3
    },
    {
      "skill": "Discharge Planning",
      "experience": 3
    },
    {
      "skill": "Epic Software",
      "experience": 2
    },
    {
      "skill": "Healthcare Compliance",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide comprehensive assessment, planning, and implementation of individual patient needs for enhanced patient management and satisfaction."
    },
    {
      "duty": "Integrate and perform functions of case management, utilization review, and discharge planning to promote continuity of care and cost effectiveness."
    },
    {
      "duty": "Prioritize patient cases, conduct assessments, and document care plans according to departmental guidelines."
    },
    {
      "duty": "Participate in care management meetings and collaborate with the care team to address patient concerns and progressions."
    },
    {
      "duty": "Coordinate family meetings and provide education on community resources and support groups for patients and their families."
    },
    {
      "duty": "Ensure appropriate communication of medical milestones and discharge plans to patients and families."
    },
    {
      "duty": "Document activities, events, and information per standards in established software systems in a timely, accurate, and complete manner."
    },
    {
      "duty": "Maintain confidentiality and compliance with privacy and health information policies."
    },
    {
      "duty": "Participate in process improvement initiatives and maintain current knowledge of institutional and departmental guidelines."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Graduation from a state-accredited school of professional nursing. If hired after October 1, 2015, must be enrolled in an accredited program within four years of employment and obtain a Bachelor's degree with a major in Nursing or a Master's degree with a major in Nursing within seven years of employment date."
    }
  ]
}