{
  "meta": [
    {
      "job_title": "Deputy Director, Business Vitality and Intelligence",
      "job_category": "Management",
      "job_class": "Director",
      "sector": "Management",
      "salary": 126423,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide visionary leadership and oversight to the Business Vitality and Intelligence Department. Collaborate with senior leadership to set departmental goals, execute strategic plans, and allocate resources effectively."
    },
    {
      "duty": "Lead efforts to foster growth and innovation within the local business ecosystem. Identify opportunities for new business development, partnerships, and investment, while ensuring alignment with the overall economic vitality goals of the community."
    },
    {
      "duty": "Develop and execute strategies to attract new businesses and industries to the area. Collaborate with stakeholders to create a compelling business proposition, leveraging the region's strengths and resources."
    },
    {
      "duty": "Implement programs to engage and support existing businesses, fostering an environment conducive to their growth and expansion. Proactively address challenges faced by local businesses and develop solutions to enhance their sustainability."
    },
    {
      "duty": "Oversee the collection, analysis, and interpretation of economic data and trends. Use business intelligence insights to inform decision-making, identify growth opportunities, and provide data-driven recommendations to stakeholders."
    },
    {
      "duty": "Collaborate with government agencies, private sector partners, academic institutions, and community organizations to build strategic alliances that further economic development goals."
    },
    {
      "duty": "Responsible for managing the department's budget, ensuring fiscal responsibility, and optimizing resource allocation to achieve departmental objectives."
    },
    {
      "duty": "Develop and monitor key performance indicators to track the effectiveness of departmental initiatives, programs, and projects."
    }
  ],
  "skills": [
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Business Strategy",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Economics, Public Administration, or related field (Master's degree preferred)."
    }
  ]
}