{
  "meta": [
    {
      "job_title": "Team Center Administrator",
      "job_category": "Software Engineering",
      "job_class": "Administrator",
      "sector": "Software Engineering",
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Teamcenter Installation, configuration, administration, performance tuning",
      "experience": 9
    },
    {
      "skill": "Multi-site collaboration and FMS setup and configurations",
      "experience": 9
    },
    {
      "skill": "Teamcenter customization and configuration of Active workspace, Portal and Server-side and CAD integrations",
      "experience": 9
    },
    {
      "skill": "Project management and execution with Agile SCRUM delivery methodology",
      "experience": 9
    },
    {
      "skill": "Administration of Linux and Windows VMs, IIS webservers, SQL/Oracle DB servers",
      "experience": 9
    },
    {
      "skill": "C, ITK, Java, SOA, Rest API, JavaScript, XML/XSLT, JSON, UI/UX",
      "experience": 9
    },
    {
      "skill": "Microsoft Azure Bot service, DevOps, CI/CD, Microsoft Azure, Docker and AKS management",
      "experience": 9
    },
    {
      "skill": "Requirements Gathering, Solution Design, Functional and implementation knowledge, coordination with offshore development teams, Customer Management skills",
      "experience": 7
    },
    {
      "skill": "Data Modeling and Migration",
      "experience": 7
    },
    {
      "skill": "Teamcenter customization involving ITK, SOA, BMIDE, Rich Client plugin & AWC",
      "experience": 7
    },
    {
      "skill": "Large and medium-sized complex project initiation, planning, execution, control, completion through monitoring, tracking & control",
      "experience": 7
    },
    {
      "skill": "Overall project development, production support, and maintenance activities",
      "experience": 7
    },
    {
      "skill": "Experience in implementation and support for Teamcenter solutions",
      "experience": 7
    },
    {
      "skill": "Integration of Teamcenter with MCAD, ECAD, MES, ERP, Polarion, ALM, CRP and other bespoke applications",
      "experience": 7
    },
    {
      "skill": "Building functional and technical specification documents using JIRA, Azure Cloud, Confluence",
      "experience": 7
    },
    {
      "skill": "Teamcenter deployment on Cloud Solution like AWS, Azure, Google",
      "experience": 7
    },
    {
      "skill": "In-depth knowledge of Teamcenter & AWC latest architecture",
      "experience": 7
    },
    {
      "skill": "Install/sysadmin/troubleshooting with integrations on SAP, Oracle, MES System, MCAD & ECAD",
      "experience": 7
    },
    {
      "skill": "Serve as the SPOC for the team to the project stakeholders, Promote team work, motivate, mentor and develop subordinates",
      "experience": 7
    },
    {
      "skill": "Experience with data migration, mapping, data validation to Teamcenter from legacy applications, Tc Enterprise etc.",
      "experience": 7
    },
    {
      "skill": "Previous migration experience with Enterprise PLM, ERP or MES systems",
      "experience": 7
    },
    {
      "skill": "Good understanding of Teamcenter Data Model and database schema of BOM, document management, change management, manufacturing planner",
      "experience": 7
    },
    {
      "skill": "Agile project methodology and Sprint wise delivery",
      "experience": 7
    },
    {
      "skill": "Knowledge in MES Applications",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Install, configure, and administer Teamcenter, and perform performance tuning and maintenance."
    },
    {
      "duty": "Manage Teamcenter multi-site collaboration and FMS setup and configurations."
    },
    {
      "duty": "Customize Teamcenter and configure Active workspace, Portal, Server-side and CAD integrations."
    },
    {
      "duty": "Project management and execution using Agile SCRUM delivery methodology."
    },
    {
      "duty": "Administer Linux and Windows VMs, IIS webservers, SQL/Oracle DB servers."
    },
    {
      "duty": "Lead project development, production support, and maintenance activities."
    },
    {
      "duty": "Prepare and update necessary documentation and assist in developing and maintaining system documentation."
    },
    {
      "duty": "Serve as the SPOC for the team to the project stakeholders, promoting teamwork, motivating, mentoring, and developing subordinates."
    },
    {
      "duty": "Experience with data migration, mapping, and data validation to Teamcenter from legacy applications."
    },
    {
      "duty": "Previous migration experience with Enterprise PLM, ERP, or MES systems."
    },
    {
      "duty": "Ensure successful initiation, planning, execution, control, and completion of large and medium-sized complex projects through monitoring, tracking & control."
    },
    {
      "duty": "Integration of Teamcenter with MCAD, ECAD, MES, ERP, Polarion, ALM, CRP, and other bespoke applications."
    },
    {
      "duty": "Plan and oversee deployment of Teamcenter on Cloud Solutions like AWS, Azure, Google."
    },
    {
      "duty": "Lead overall project development, production support, and maintenance activities."
    },
    {
      "duty": "Knowledge of Teamcenter & AWC latest architecture, and install/sysadmin/troubleshooting with integrations on SAP, Oracle, MES System, MCAD & ECAD."
    },
    {
      "duty": "Prepare functional and technical specification documents using JIRA, Azure Cloud, Confluence."
    },
    {
      "duty": "Implement and support Teamcenter solutions like BOM Management, Change management, Security modules including SSO/LDAP Integration, Material Management IMM, TcRA, Substance Compliance, Teamcenter Manufacturing etc."
    },
    {
      "duty": "Understanding of Teamcenter Data Model and database schema of BOM, document management, change management, manufacturing planner."
    },
    {
      "duty": "Work with Agile project methodology and Sprint wise delivery."
    },
    {
      "duty": "Knowledge in MES Applications will be an added advantage."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Software Engineering, Computer Science, or a related field (Master's preferred)"
    }
  ]
}