{
  "meta": [
    {
      "job_title": "Development Associate",
      "job_category": "Nonprofit Management",
      "job_class": "Associate",
      "sector": "Development",
      "salary": 62500,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supports and leads targeted projects in coordination with Chicago Booth’s Advancement Team in the New York Regional Office."
    },
    {
      "duty": "Provides general support for the New York Regional Office, collaborates with the Senior Director, U.S. and Global Individual Giving, and all gift officers in the office, and supports the fundraising goals of Chicago Booth’s Individual Giving Team."
    },
    {
      "duty": "Provides information in response to specific requests, directs calls, and provides other relevant information to appropriate individuals while using discretion and judgment working with confidential information."
    },
    {
      "duty": "Develops a network of professional contacts and provides assistance to other Booth and University offices that seek it."
    },
    {
      "duty": "Initiates projects that will be beneficial to the Individual Giving Team and anticipates next steps and follow-up related to fundraising activity and active prospect management."
    },
    {
      "duty": "Manages all administrative duties in the New York Regional Office."
    }
  ],
  "skills": [
    {
      "skill": "Nonprofit Management",
      "experience": 1
    },
    {
      "skill": "Fundraising",
      "experience": 1
    },
    {
      "skill": "Event Planning",
      "experience": 1
    },
    {
      "skill": "Project Management",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Database Management",
      "experience": 1
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required. A minimum of one year of work experience in nonprofit management, development, alumni relations, marketing, public relations, or similar work."
    }
  ]
}