{
  "meta": [
    {
      "job_title": "Account Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Retail Management",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Sales Forecasting",
      "experience": 5
    },
    {
      "skill": "Competitive Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Travel Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Strategically cultivate new accounts and seek opportunities to expand business with existing accounts; penetrate new markets; oversee development and maintain business relationships with customers."
    },
    {
      "duty": "Responsible for management of retail accounts for Private Label programs."
    },
    {
      "duty": "Collaborate with buyers/accounts to define and execute creative strategies and identify opportunities to drive sales and protect profitability."
    },
    {
      "duty": "Execute against monthly targets identified and agreed upon by management."
    },
    {
      "duty": "Project and deliver monthly & annual sales forecasts to meet financial targets and drive revenue growth."
    },
    {
      "duty": "Manage market prep and appointments as well as internal and external follow-up."
    },
    {
      "duty": "Partner with the design/merchandising teams to evaluate merchandise assortments, and marketing tools."
    },
    {
      "duty": "Shop the market to research and identify current trends and present competitive data to drive newness and business."
    },
    {
      "duty": "Provide competitive analysis to maintain awareness of the marketplace and to influence strategy."
    },
    {
      "duty": "Follow orders from inception to completion to ensure customer satisfaction."
    },
    {
      "duty": "Travel to accounts and trade shows."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Business Management, Fashion Merchandising, or related field."
    },
    {
      "credential": "Min. 3 + years of related experience in Private Label Sales."
    },
    {
      "credential": "Present and up-to-date list of current account relationships and contacts within fashion wholesale industry."
    },
    {
      "credential": "Excellent communication, presentation, and interpersonal skills; must be a proactive team player."
    },
    {
      "credential": "Adaptable to frequent changes and thrive in a deadline-driven environment."
    },
    {
      "credential": "Ability to travel as needed."
    }
  ]
}