{
  "meta": [
    {
      "job_title": "Senior Product Design Engineer",
      "job_category": "Engineering",
      "job_class": "Senior Engineer",
      "sector": "Engineering",
      "salary": 95000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Initiate and execute the Product Design and Development (PDD) process to ensure product definitions and specifications are met by all stakeholders."
    },
    {
      "duty": "Participate and contribute to product design meetings including product specifications, material selection, 3D CAD models, and detailed 2D drawings."
    },
    {
      "duty": "Collaborate as a member of cross-functional project teams from concept to testing, and ultimately to production."
    },
    {
      "duty": "Conduct design for manufacture assessments involving manufacturing expertise to ensure that final design will support lean manufacturing principles, build quantity, cost, and performance requirements."
    },
    {
      "duty": "Develop design concepts to meet cost objectives and, interface with vendors and suppliers to locate and approve components."
    },
    {
      "duty": "Administer design history and practice proper engineering document control processes to ensure drawings are up to date."
    },
    {
      "duty": "Work toward identifying commonality in design to assist with manufacturing standardization."
    },
    {
      "duty": "Demonstrate technical and written skills via generating and filing reports of design analyses for future reference and demonstrate interpersonal skills via preparing and presenting findings."
    },
    {
      "duty": "Provide timely response to Root Cause Analysis and Corrective action requests related to design issues and/or warranty problems to support the engineering solution applied in the field."
    },
    {
      "duty": "Assist peers with workloads as needed for total project completion by management expectations or production deadlines."
    },
    {
      "duty": "Proficient in promoting a safe and healthy work environment."
    },
    {
      "duty": "Adheres to established company policies and procedures paying special attention to safety regulations."
    },
    {
      "duty": "Wears personal protective equipment in accordance with training guidelines."
    },
    {
      "duty": "Maintain cleanliness in designated workspace by practicing 6S principles to reduce safety risks."
    }
  ],
  "skills": [
    {
      "skill": "Product Design and Development (PDD)",
      "experience": 6
    },
    {
      "skill": "Mechanical Engineering",
      "experience": 6
    },
    {
      "skill": "Electrical Engineering",
      "experience": 5
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "Data Analytics",
      "experience": 6
    },
    {
      "skill": "Communication Skills",
      "experience": 6
    },
    {
      "skill": "Computer-Aided Design (CAD) - SolidWorks",
      "experience": 6
    },
    {
      "skill": "System Applications and Products (Oracle) Software",
      "experience": 6
    },
    {
      "skill": "Statistical Process Control (SPC) and Just In Time (JIT) Strategizing",
      "experience": 6
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Mechanical Engineering, Electrical Engineering, or a related field or equivalent and/or combination of training and experience."
    }
  ]
}