{
  "meta": [
    {
      "job_title": "Delivery Manager",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 125000
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serves as the Chief Scrum Master across all delivery teams within a product."
    },
    {
      "duty": "Responsible for the overall solution delivery and support of large-scale programs with complex integrations."
    },
    {
      "duty": "Responsible for managing the communication across program stakeholders, defining mitigation strategies to remediate risks & issues, and assisting teams to ensure that the value being delivered aligns to the product vision defined by product managers."
    },
    {
      "duty": "Helps with the allocation of resources and provides teams with the necessary support to remediate impediments and reported issues."
    },
    {
      "duty": "Facilitates program increment (PI) sessions across all delivery pods aligned to a product, or value stream, and the accompanying planning sessions (pre and post PI planning sessions)"
    },
    {
      "duty": "Works with Product Owners and Scrum Masters to plan release schedules across products."
    },
    {
      "duty": "Supports product teams with the delivery of new features and capabilities while empowering them and allowing them to be self-organized."
    },
    {
      "duty": "Supports the Product Manager with the facilitation of system demos to demonstrate the integration of products to program stakeholders."
    },
    {
      "duty": "Leads program increment retrospectives to identify improvement opportunities that can be implemented to improve productivity."
    },
    {
      "duty": "Monitors delivery team metrics to evaluate progress against delivery milestones (e.g., release burnups)."
    },
    {
      "duty": "Aggregates individual delivery pod status into portfolio-level risks, assumptions and interdependencies."
    },
    {
      "duty": "Creates weekly reports highlighting the health of the overall delivery status to program leadership and various stakeholders."
    },
    {
      "duty": "Fosters collaboration between the delivery pods and stakeholders at the product level."
    },
    {
      "duty": "Leads regular \"Scrum-of-Scrum\" meetings with Scrum Masters from all product teams to drive alignment across development activities and review blockers or impediments impacting team productivity."
    },
    {
      "duty": "Coordinates the resolution of internal and external dependencies across value streams and shared services."
    },
    {
      "duty": "Drives tactical day-to-day delivery process, including removing impediments that negatively impact productivity or block the team's process."
    },
    {
      "duty": "Ensures effective communication, collaboration, coordination and team engagement in initiatives that cut across portfolios and products."
    },
    {
      "duty": "Assists in other areas of the department and company as necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Computer Science, or a related field (Master's preferred)"
    }
  ]
}