{
  "meta": [
    {
      "job_title": "Forklift Operator",
      "job_category": "Operations",
      "job_class": "Associate",
      "sector": "Logistics",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Complies with company policies, procedures, and standards of ethics and integrity by implementing related action plans; using the Open Door Policy; and applying these in executing business processes and practices."
    },
    {
      "duty": "Operates forklift following Company standards and guidelines by safely picking up, moving, placing, and positioning merchandise pallets."
    },
    {
      "duty": "Completes work assignments and priorities by using policies, data, and resources; collaborating with managers, co-workers, customers, and other business partners; identifying priorities, deadlines, and expectations; carrying out tasks; communicating progress and information; determining and recommending ways to address improvement opportunities; and adapting to and learning from change, difficulties, and feedback."
    },
    {
      "duty": "Receives, stocks, and organizes merchandise and supplies from distribution centers and suppliers throughout the facility by managing inventory flow; following company policy and procedures for utilizing equipment appropriately; merchandising; working inventory exceptions; correcting shelf capacities; and completing and retaining required paperwork, logs, and other documentation."
    },
    {
      "duty": "Provides member service by acknowledging the member and identifying member needs; providing guidance and support to members regarding self-service technology; assisting members with purchasing decisions; locating merchandise; resolving member issues and concerns; and promoting the company's products and services."
    },
    {
      "duty": "Maintains safety of facility according to company policies and procedures by conducting safety sweeps; following forklift spotting procedures; following procedures for handling and disposing of hazardous materials; following company steel standard guidelines; and correcting and reporting unsafe situations to management."
    },
    {
      "duty": "Maintains the sales floor and merchandising presentation in accordance with company policies and procedures by properly zoning the area; stocking and rotating merchandise; removing damaged or out-of-date goods; setting up, cleaning, and organizing product displays; maintaining modular integrity; receiving, sorting, staging, and delivering merchandise; ensuring prominent display of promotional and seasonal merchandise; processing defective merchandise; following company and regulatory policies and procedures for sanitation and food safety; and monitoring the area of shrink, security risks, and safety."
    },
    {
      "duty": "Ensures club pick up orders are filled by assisting with picking club pick up orders throughout the day and staging; ensuring products are selected and staged according to company policy and procedures; ensuring Merchandising Associates pick orders within acceptable timeframe and are staged properly; and performing occasional audits for accuracy."
    },
    {
      "duty": "Customer/Member Centered: Serve the Customer/Member : Shows care and concern when serving our customers/members. Asks questions in order to understand customer/member needs. Uses policies and information in order to exceed customer/member expectations. Finds and uses the right resources (people, products, tools) at the right time in order to resolve customer/member requests."
    },
    {
      "duty": "Judgment: Make Effective Choices : Uses policies, procedures, and/or guides to make good choices. Uses data and facts in order to make day-to-day decisions and involves others as needed. Recognizes what might be a problem and informs those who can correct it."
    },
    {
      "duty": "Planning and Improvement: Plan for and Improve Work : Accepts responsibility and meets expectations for own work. Identifies steps needed in order to carry out work as required."
    },
    {
      "duty": "Influence and Communicate: Share Information : Listens to others and asks questions to learn about what is needed. Communicates the right information to associates and leaders when they need it. Communicates in a respectful and professional manner."
    },
    {
      "duty": "Execution and Results: Get Results : Makes sure work is done correctly. Works on top priorities first. Makes a consistent effort to get results. Meets deadlines. Takes action in order to solve problems so work can be completed in a timely manner."
    },
    {
      "duty": "Ethics and Compliance: Perform to Ethical Standards : Follows company policies and procedures (for example, the Ten Foot Rule). Shows integrity and ethical behavior in all work situations. Reports ethical and compliance issues promptly. Adaptability: Adapt : Adapts to changing work demands. Stays focused on own work when faced with change or difficulties. Stays open to and learns from assignments and feedback."
    },
    {
      "duty": "Inventory: Handles, moves, and displays goods in safe and correct ways. Tracks goods, maintains in-stock levels, and controls shrinkage in a timely manner. Reports poor inventory practices and low in-stock levels in assigned area. Uses inventory tools and equipment in safe and correct ways."
    },
    {
      "duty": "Forklift: Operates and maintains forklifts in safe and correct ways. Reports poor or unsafe conditions or practices in assigned areas. Tells Management when forklifts are not in proper working order."
    },
    {
      "duty": "Technology: Proactively identifies Customers who need help, actively engages them, and assists them with Technology services and items. Models and helps others with technology services. Identifies shrink opportunities and problems with products, services and work areas, and takes steps to fix the problem. Properly maintains equipment and ensures products are organized and stocked in correct ways, and promptly fixes any problems."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "90 days of prior experience with Forklift Certification. Ability to safely utilize pallet jacks. Must be 18 years of age or older."
    }
  ]
}