{
  "meta": [
    {
      "job_title": "Customer Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Customer Service",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as a second level of contact for customers to support any post-sale issues or inquiries."
    },
    {
      "duty": "Leverage excellent written communication and de-escalation skills to provide the best solutions for every customer through active listening, demonstrating empathy, asking probing questions, education, and setting expectations for next steps."
    },
    {
      "duty": "Respond to customer ratings and reviews \nMay assist with conducting research and analysis of account history to assess levels of risk and detect fraud activity and respond to customer inquiries as appropriate."
    },
    {
      "duty": "Will partner closely with aligned Supervisor to share findings and assist in identifying current fraud trends and root causes."
    },
    {
      "duty": "Demonstrate qualities representative of A&F’s unique culture with a strong appreciation for customer service, inclusiveness, and a casual hospitality."
    },
    {
      "duty": "Primarily receive and respond to inbound email contacts but should feel comfortable flexing to support chat and voice inquiries as well as volume dictates."
    },
    {
      "duty": "Document exactly what action was taken or needs to be taken in the system."
    },
    {
      "duty": "Ensure proper security procedures are followed on all customer interactions."
    },
    {
      "duty": "Maintain thorough knowledge of systems so that information can be researched, and proper information is given to customer."
    },
    {
      "duty": "Learn and retain a thorough working knowledge of all existing and new products and services."
    },
    {
      "duty": "Achieve assigned Key Performance Indicators – e.g. CSAT, Quality, UPH."
    },
    {
      "duty": "Attend Team Meetings/additional training sessions as scheduled."
    },
    {
      "duty": "Performs other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Attention to Detail",
      "experience": 3
    },
    {
      "skill": "Empathy",
      "experience": 4
    },
    {
      "skill": "Multi-tasking",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent required"
    }
  ]
}