{
  "meta": [
    {
      "job_title": "Quality Supervisor",
      "job_category": "Quality Assurance",
      "job_class": "Supervisor",
      "sector": "Construction",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Construction Quality Plan",
      "experience": 5
    },
    {
      "skill": "Inspection Test Plan (ITP)",
      "experience": 5
    },
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Environmental Compliance",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Implement the RES Quality Management System and execute Quality Control Processes and Procedures for the Project Site Construction Team."
    },
    {
      "duty": "Develop and maintain the Construction Quality Plan and Inspection Test Plan (ITP) throughout the duration of the assigned project."
    },
    {
      "duty": "Prepare and track the Inspection Test Plan (ITP) with support of Subject Matter Experts (SME) throughout the Project Lifecycle."
    },
    {
      "duty": "Manage the Job Book Table of Contents (TOC) for project specific requirements and report client requested changes to the Project Manager."
    },
    {
      "duty": "Ensure Procore project folders are established and populated with required documentation, results, and data."
    },
    {
      "duty": "Lead and train project personnel to perform Quality Control (QC) inspections and identify potential Quality Issues or Incidents."
    },
    {
      "duty": "Provide routine reports on project quality status and metrics to Project and Corporate Leadership."
    },
    {
      "duty": "Conduct post-scope reviews and collaborate with Project management to identify and record Lessons Learned."
    },
    {
      "duty": "Communicate Quality issues and resolutions to the Project Client when required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor Degree Civil, Electrical or Industrial Engineering Degree (or equivalent 3 years of experience) preferred."
    }
  ]
}