{
  "meta": [
    {
      "job_title": "Senior Business Analyst",
      "job_category": "Information Technology",
      "job_class": "Senior",
      "sector": "Information Technology",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Business Process Reengineering",
      "experience": 5
    },
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "Requirement Gathering",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Software Testing",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Application Lifecycle Management",
      "experience": 5
    },
    {
      "skill": "Joint Application Development",
      "experience": 5
    },
    {
      "skill": "Detail Design Sessions",
      "experience": 5
    },
    {
      "skill": "Team Foundation Server",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform Business Process Reengineering (BPR), including assessment of existing business processes (As-Is Assessment), determination of future state (To-Be Assessment and Requirements), and Gap Analysis."
    },
    {
      "duty": "Facilitate Joint Application Development (JAD) or Detail Design Sessions (DDS) facilitation."
    },
    {
      "duty": "Document business process requirements and process diagram flows."
    },
    {
      "duty": "Engage as Liaison between business partner agency and information technology (IT) staff."
    },
    {
      "duty": "Collect, analyze, and document business requirements, business rules, processes, and legislation, and generate functional/system requirements documentation required for system development."
    },
    {
      "duty": "Plan and coordinate overall testing efforts to include test plan, creation, and execution of test scenarios for system integration testing (SIT) and User Acceptance Testing (UAT)."
    },
    {
      "duty": "Use specialized software (Team Foundation Server) for the creation and management of system application documentation, tracking system changes, tracking reported bugs, and creation of Test Plans, Test Suites, Test Cases."
    },
    {
      "duty": "Ensure compliance with all applicable Information technology policies and EBR-DC guidelines, security, and related standards."
    },
    {
      "duty": "Other related Application Lifecycle Management (ALM) activities related to the Business Analyst functions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Information Technology, or a related field (Master's preferred)"
    }
  ]
}