{
  "meta": [
    {
      "job_title": "Credit Risk Analyst",
      "job_category": "Analytics",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analytics",
      "experience": 4
    },
    {
      "skill": "Financial Reporting",
      "experience": 4
    },
    {
      "skill": "SQL Programming",
      "experience": 3
    },
    {
      "skill": "SAS Programming",
      "experience": 3
    },
    {
      "skill": "R Programming",
      "experience": 3
    },
    {
      "skill": "Excel",
      "experience": 4
    },
    {
      "skill": "Written Communication",
      "experience": 4
    },
    {
      "skill": "Verbal Communication",
      "experience": 4
    },
    {
      "skill": "Presenting Work",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Compile data used to perform analysis on large datasets using various tools."
    },
    {
      "duty": "Assist in the design of data pulls and MIS necessary to answer key questions and/or monitoring key business risk trends."
    },
    {
      "duty": "Support Credit Risk Management with ad hoc analysis and preparation of Board of Directors, investors, and rating agency presentations."
    },
    {
      "duty": "Build and maintain ongoing, periodic risk and investor reporting in Excel and other reporting tools."
    },
    {
      "duty": "Partner with key business groups including Operations, IT, Finance, and Audit to obtain data used to monitor key business activity, funding activity and answer ad hoc questions."
    },
    {
      "duty": "Build a strong knowledge of internal data fields and table structures."
    },
    {
      "duty": "Automate ongoing reporting with the help of IT."
    },
    {
      "duty": "Learn new systems, reporting tools, and programming languages."
    },
    {
      "duty": "Develop cross-functional background knowledge in order to provide back up support to other areas of Risk Management when needed."
    },
    {
      "duty": "Responsibilities are subject to change over time."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Business, Mathematics, Economics, Statistics or a similar quantitative discipline (Masters Preferred)"
    }
  ]
}