{
  "meta": [
    {
      "job_title": "Front Office Associate",
      "job_category": "Administration",
      "job_class": "Associate",
      "sector": "Healthcare",
      "salary": 38000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Greet and check-in patients scheduled for imaging services; register demographic information and process payment plans and copays."
    },
    {
      "duty": "Answer phones and handle calls in an efficient and friendly manner."
    },
    {
      "duty": "Act as a liaison between technologists and the patients waiting for exams and relay messages regarding scanner status and other clinic information."
    },
    {
      "duty": "Maintain front office lobby area by straightening magazines, organizing coffee supplies, and assisting with general office clean up."
    },
    {
      "duty": "Order office supplies as needed."
    },
    {
      "duty": "Maintain supply of patient information sheets."
    },
    {
      "duty": "Complete confirmation calls and provide preparation instructions to patients."
    },
    {
      "duty": "Fax reports, billing information, and medical release forms as requested."
    },
    {
      "duty": "Verify patient's insurance."
    },
    {
      "duty": "Pre-certify all exams with patient's insurance company and obtain insurance authorization."
    },
    {
      "duty": "Arrange transportation, interpreters, and hotel accommodations for patients when appropriate."
    },
    {
      "duty": "Enter and submit patient exam orders and verify orders match exam schedules."
    },
    {
      "duty": "Schedule referrals, ensure proper authorizations are obtained, and schedule walk-in patients."
    },
    {
      "duty": "Process requests for image orders and CDs from referring physicians and patients."
    },
    {
      "duty": "Maintain an up-to-date and accurate database on all current and potential referring physicians."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Microsoft Office",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Medical Office Experience",
      "experience": 1
    },
    {
      "skill": "Medical Terminology",
      "experience": 1
    },
    {
      "skill": "Insurance Knowledge",
      "experience": 1
    },
    {
      "skill": "Bilingual",
      "experience": 1
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or Equivalent"
    }
  ]
}