{
  "meta": [
    {
      "job_title": "Data Analyst",
      "job_category": "Data Analysis",
      "job_class": "Analyst",
      "sector": "Health PMO",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Report Writing",
      "experience": 5
    },
    {
      "skill": "Data Modeling",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "PowerBI Development",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 5
    },
    {
      "skill": "Data Presentation",
      "experience": 5
    },
    {
      "skill": "ETL Development",
      "experience": 5
    },
    {
      "skill": "Data Governance",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "MS Office",
      "experience": 5
    },
    {
      "skill": "MS SharePoint",
      "experience": 5
    },
    {
      "skill": "MS Teams",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Organize and analyze data related to training attendance and course relevance."
    },
    {
      "duty": "Utilize technical expertise to ensure accurate and high-quality data."
    },
    {
      "duty": "Design and present data in a way that assists individuals, businesses, and organizations in making better decisions."
    },
    {
      "duty": "Use automated tools to extract data from primary and secondary sources."
    },
    {
      "duty": "Remove corrupted data and fix coding errors and related problems."
    },
    {
      "duty": "Develop and maintain databases, and data systems - reorganizing data in a readable format."
    },
    {
      "duty": "Perform analysis to assess the quality and meaning of data."
    },
    {
      "duty": "Filter data by reviewing reports and performance indicators to identify and correct code problems."
    },
    {
      "duty": "Use statistical tools to identify, analyze, and interpret patterns and trends in complex data sets."
    },
    {
      "duty": "Assign numerical value to essential business functions for assessing and comparing business performance over periods of time."
    },
    {
      "duty": "Prepare reports for management stating trends, patterns, and predictions using relevant data."
    },
    {
      "duty": "Work with programmers, engineers, and management heads to identify process improvement opportunities and propose system modifications."
    },
    {
      "duty": "Devise data governance strategies and prepare final analysis reports for stakeholders."
    },
    {
      "duty": "Develop dimensional and relational data models for data marts, data warehouses, and operational data stores."
    },
    {
      "duty": "Design and develop ETL to map data from source systems to the DW and populate databases."
    },
    {
      "duty": "Validate ETL, databases, BI metadata, and reports to assure data quality."
    },
    {
      "duty": "Research data anomalies and provide recommendations for resolutions."
    },
    {
      "duty": "Support end users with specific ad hoc reporting and analytic needs."
    },
    {
      "duty": "Provide coordination support for all cohort and training roles."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Computer Science, Information Systems, Information Resource Management, Industrial Engineering, Operation Research or related fields PLUS 5 years experience."
    },
    {
      "credential": "Ability to pass VA Public Trust background investigation"
    }
  ]
}