{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the management and supervision of all areas assigned by the Store Manager and follows policies in regard to Customers, Associates and merchandising."
    },
    {
      "duty": "Assists in the analysis of Store reports to evaluate controllable expenses and overall Store performance."
    },
    {
      "duty": "Ensures proper scheduling of Associates to meet business objectives."
    },
    {
      "duty": "Assists in recruiting, hiring, training and developing non-exempt Associates."
    },
    {
      "duty": "Assists in the management of and continuous monitoring of actual expenditures to be within budget."
    },
    {
      "duty": "Understands that safety is the number one priority and practices safe behaviors in everything they do."
    },
    {
      "duty": "Treats all Customers, Associates, and other leaders with respect."
    },
    {
      "duty": "Represents and supports the Company brand at all times."
    },
    {
      "duty": "Ensures recovery, sizing and markdowns are completed to Company standards through teaching, assigning tasks, and following up per Company best practice."
    },
    {
      "duty": "Assists with training Associates on Loss Prevention awareness and Store shortage goals."
    },
    {
      "duty": "Assists with the annual inventory process including preparation and execution of inventory guidelines."
    }
  ],
  "skills": [
    {
      "skill": "Store Management",
      "experience": 2
    },
    {
      "skill": "Retail Operations",
      "experience": 2
    },
    {
      "skill": "Team Leadership",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Expense Control",
      "experience": 2
    },
    {
      "skill": "Loss Prevention",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Two or more years of Store or Assistant Store Manager experience in a retail environment."
    },
    {
      "credential": "Ability to perform basic mathematical calculations commonly used in retail environments."
    }
  ]
}