{
  "meta": [
    {
      "job_title": "Senior UX Researcher",
      "job_category": "UX Research",
      "job_class": "Senior",
      "sector": "Software Engineering",
      "salary": 125000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "User Research",
      "experience": 5
    },
    {
      "skill": "Generative Research",
      "experience": 5
    },
    {
      "skill": "Evaluative Research",
      "experience": 5
    },
    {
      "skill": "Design Thinking",
      "experience": 5
    },
    {
      "skill": "Agile Environment",
      "experience": 5
    },
    {
      "skill": "Research Tools",
      "experience": 5
    },
    {
      "skill": "Prototyping Tools",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Metrics Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct user research and deliver actionable insights for both generative and evaluative research to inform digital strategy and product development decisions."
    },
    {
      "duty": "Develop and maintain a research roadmap that aligns with product and UX priorities and reflects the most pressing needs of the business and its users."
    },
    {
      "duty": "Work with cross-functional teams to integrate research into agile development process and inform product and design decisions."
    },
    {
      "duty": "Identify common themes and areas of opportunity for future research and product development."
    },
    {
      "duty": "Communicate actionable insights in a clear and compelling way, relevant to business goals, project objectives, and user needs."
    },
    {
      "duty": "Establish goals, objectives, and benchmarks for improving the user experience, and measure the impact of design changes on user engagement, retention, and satisfaction."
    },
    {
      "duty": "Support the development and implementation of a democratized research program, and establish a process for reviewing and approving research studies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS, MS, or PHD in a research-related discipline (e.g., Human Computer Interaction, Interaction Design, Human Factors, Psychology, Anthropology, Cognitive Science)"
    }
  ]
}