{
  "meta": [
    {
      "job_title": "Total Rewards Analyst",
      "job_category": "Human Resources",
      "job_class": "Analyst",
      "sector": "Management",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Benefits Administration",
      "experience": 3
    },
    {
      "skill": "Employee Relations",
      "experience": 3
    },
    {
      "skill": "Healthcare Regulations",
      "experience": 3
    },
    {
      "skill": "HRIS Configuration",
      "experience": 3
    },
    {
      "skill": "Plan Compliance",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Market Analysis",
      "experience": 3
    },
    {
      "skill": "Benefit Plan Analysis",
      "experience": 3
    },
    {
      "skill": "Relationship Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Analyze, develop and administer employee health, welfare, and retirement plans for U.S. and Canadian populations."
    },
    {
      "duty": "Act as a liaison between benefits broker, insurance providers, and third parties to resolve benefit-related problems."
    },
    {
      "duty": "Ensure plans are administered in accordance with federal and state regulations and plan provisions are followed."
    },
    {
      "duty": "Assist in M&A due diligence processes by conducting benefit analysis of target companies."
    },
    {
      "duty": "Configure benefits module of ADP Vantage for ongoing enrollment and maintain eligibility file feeds sent to vendors."
    },
    {
      "duty": "Ensure all annual filings and notices are completed accurately and on time (1095’s, 5500’s, etc.)."
    },
    {
      "duty": "Administer health and welfare plans including enrollments and terminations."
    },
    {
      "duty": "Administer the 401(k) plan and lead the annual 401(k) audit in coordination with auditor, TPA, and accounting teams."
    },
    {
      "duty": "Analyze competitiveness of plans and recommend new enhancements or changes to maintain market competitiveness."
    },
    {
      "duty": "Lead the annual open enrollment period each year."
    },
    {
      "duty": "Generate and distribute benefit awareness program materials on a monthly basis to U.S. and Canadian employees."
    },
    {
      "duty": "Partner with HR, Legal, HRIS, Finance, Treasury, and executive management on benefits matters."
    },
    {
      "duty": "Carry out other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Human Resources, Business or related discipline, or equivalent experience required"
    },
    {
      "credential": "Professional in Human Resources (PHR), or SHRM Certified Professional (SHRM-CP) credential preferred"
    },
    {
      "credential": "Certified Benefits Professional (CBP) or Certified Employee Benefits Specialist (CEBS) preferred"
    }
  ]
}