{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Customer Support",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "High Voltage Service",
      "experience": 5
    },
    {
      "skill": "MSA Innosoft",
      "experience": 5
    },
    {
      "skill": "SAP Knowledge",
      "experience": 5
    },
    {
      "skill": "High Voltage Product Knowledge",
      "experience": 5
    },
    {
      "skill": "Customer Focus",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Problem-solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage the entire project lifecycle, including initiation, planning, execution, monitoring, and closeout, ensuring compliance with HSE guidelines."
    },
    {
      "duty": "Collaborate with commercial operations team to confirm customer and order information, review order handoffs, and manage order documentation."
    },
    {
      "duty": "Facilitate communication between commercial operations team and field/production operations to support Accounts Receivable reduction."
    },
    {
      "duty": "Maintain and reduce overdue payments, plan costs, and manage order margins, reporting any deviations and sharing lessons learned."
    },
    {
      "duty": "Provide administration assistance and support in project orders and turnkey projects, and communicate directly with customers for project updates, scheduling, and closeout documentation."
    },
    {
      "duty": "Manage commercial relations, communicate shipping and tracking information, verify necessary project and order documentation, confirm scope of supply, initiate invoicing, and manage Accounts Receivable process."
    },
    {
      "duty": "Send and follow-up customer satisfaction surveys related to the responsible orders."
    },
    {
      "duty": "Live Hitachi Energy’s core values of safety and integrity, taking responsibility for actions while caring for colleagues and the business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering or related field (Master's preferred)"
    }
  ]
}