{
  "meta": [
    {
      "job_title": "UX Designer",
      "job_category": "Design",
      "job_class": "Designer",
      "sector": "Software Engineering",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Motion Design",
      "experience": 4
    },
    {
      "skill": "UX Design",
      "experience": 4
    },
    {
      "skill": "Graphic Design",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 4
    },
    {
      "skill": "Collaboration",
      "experience": 4
    },
    {
      "skill": "After Effects",
      "experience": 4
    },
    {
      "skill": "Figma",
      "experience": 4
    },
    {
      "skill": "Communication",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Craft motion designs that are innovative, elegant, and beautiful, while being able to rapidly produce rough idea sketches and add perspectives to share with the team."
    },
    {
      "duty": "Create and design a plan for next steps to a certain problem to uplift a design."
    },
    {
      "duty": "Produce motion studies for user flows and quickly iterate on multiple design solutions."
    },
    {
      "duty": "Craft UX motion behaviors to guide and add delightful experience for users."
    },
    {
      "duty": "Communicate, defend, and build consensus around visual + motion definition and design direction."
    },
    {
      "duty": "Collaborate with software engineers to implement animation and motion concepts."
    },
    {
      "duty": "Understand technical constraints, user goals, and business requirements that shape current and future products."
    },
    {
      "duty": "Participate as a primary, co and contributing author on any project deliverables."
    },
    {
      "duty": "Advise on and provide alternative (out of the box) solutions."
    },
    {
      "duty": "Mentor and transfer knowledge to client project team members."
    },
    {
      "duty": "Participate in data conversion and data maintenance."
    },
    {
      "duty": "Provide thought leadership as well as hands-on technical configuration/development as needed."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS degree in Interaction or Graphic Design, Motion, Communication Design or equivalent design-related field (Master's preferred)"
    }
  ]
}