{
  "meta": [
    {
      "job_title": "Engineering Development Technician II",
      "job_category": "Engineering",
      "job_class": "Technician",
      "sector": "Software Engineering",
      "salary": 42000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Conduct mechanical, electrical, and composite fabrication support, troubleshooting, repair, and testing of integrated systems."
    },
    {
      "duty": "Operate and maintain shop equipment and tools (Hand tools, power tools, solder irons, manual lathe and mills, 3D printers, etc.)"
    },
    {
      "duty": "Meet scheduled timelines and, in some cases, aggressive deadlines to have hardware ready for project milestones."
    },
    {
      "duty": "Attend project meetings to discuss project schedule, design, hardware status, and other critical information."
    },
    {
      "duty": "Effectively document important processes and build techniques for successful readiness of equipment and transition of responsibilities to other individuals."
    },
    {
      "duty": "Build low volume assemblies in the prototype phase of product lifecycle."
    },
    {
      "duty": "Ensure that laboratory and machine shop areas and equipment are safe, clean, in good working order, and organized for all engineering staff to efficiently work. Other duties as assigned."
    },
    {
      "duty": "Maintain a high level of work practice and ensure that all safety guidelines and policies are met."
    },
    {
      "duty": "Requires local/domestic travel (both driving and flying) to test site locations and participating in development testing."
    },
    {
      "duty": "Must have a valid Driver's license and clean driving record."
    },
    {
      "duty": "Periods of development may require long irregular hours around deadlines, weekends, and some holidays and in field test environments."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 60,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or GED equivalent and/or equivalent certificate from a technical school"
    }
  ]
}