{
  "meta": [
    {
      "job_title": "Clinical Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides competent clinical nursing care consistent with professional standards. Reporting and accountable to the Nurse Manager/Director, the Clinical Nurse is responsible for coordinating and delivering patient care utilizing the nursing process in a hospital setting."
    },
    {
      "duty": "Participates in identifying and meeting learning needs of self. Attends education programs based on identified learning needs. With assistance, uses patient education materials relevant to patient population. Assesses readiness to learn of the patient/family/caregivers. Assesses developmental level of patient and factors affecting ability to learn. Evaluation of Care - Identifies expected patient outcomes. Seeks guidance as needed in revision of plan of care. Participates in discussion with members of the interdisciplinary team in evaluation of patient care. Communicates relevant information to promote continuity of care. Implementation - Demonstrates competence in care of patients with complex problems, including population-appropriate physical, psychosocial, educational and safety aspects of care. Performs bedside point of care testing as required for patient care plan. Utilizes healthcare organization and nursing standards, policies and procedures in delivery of care. Organizes and prioritizes care according to patient/family needs. Consults with appropriate resources in a timely fashion regarding patients with complex care issues, unusual teaching needs and/or those at high risk for discharge planning. Leadership - With assistance, develops goals to promote professional growth or minimize limitations. Achieves goals and objectives within identified time frame or renegotiates with supervisor. Is knowledgeable about activities which facilitate intra/interdepartmental collaboration. Participates in development and achievement of unit goals and performance improvement activities. Effectively uses communication systems. Participates in promoting cost-effective care. Gives feedback to co-workers. Is aware of public policy and regulatory guidelines affecting the health care environment. Promotes a safe, clean and secure hospital environment for all. Patient Assessment - Recognizes data from complex situations to determine priorities for care. Includes appropriate physical, psychosocial, education and safety needs. Synthesizes assessment data into meaningful whole prior to communication to others. Assesses and anticipates discharge needs of individual patients and families. Develops relationships with families that promote their ability to advocate for the patient and their own needs. Planning - Collaborates with patient/family to prepare or update the plan of care. Makes use of available multidisciplinary resources in planning care. Begins to use full range of communication as a means to convey planning. Identifies and addresses cultural and ethnic issues in planning patient care. Demonstrates ability to prioritize tasks for patients with complex problems. Research - Reads journals that contain studies or articles that may be applicable to practice. Brings ideas and questions to the staff at large for assessment of applicability."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Graduation from a school of professional nursing. Licensed to practice as a Registered Nurse in the state of North Carolina. Basic Life Support (BLS) for Healthcare Provider certification. One (1) year of nursing experience."
    }
  ]
}