{
  "meta": [
    {
      "job_title": "Community Maintenance Coordinator",
      "job_category": "Property Management",
      "job_class": "Coordinator",
      "sector": "Real Estate",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensures the physical aspects of the community are maintained and standards are met regarding the grounds, amenities and overall curb appeal."
    },
    {
      "duty": "Inspects the community throughout the day to remove litter, debris, and pet droppings and ensure all common areas and amenities are neat and free of litter at all times."
    },
    {
      "duty": "Removes trash and remaining items from vacant apartments prior to starting the make-ready process, transfers trash to dumpster or storage area as applicable, and cleans and maintains storage areas."
    },
    {
      "duty": "Completes assigned minor and routine service requests as requested by Service Supervisor and/or Community Manager, and assists the make-ready specialist in the turn process."
    },
    {
      "duty": "Changes all locks in accordance with the property’s policy and ensure gates to all pool areas are working according to codes and safety standards."
    },
    {
      "duty": "Distributes notices and communications to residents as necessary."
    },
    {
      "duty": "Informs appropriate supervisors of any observed hazard or potentially dangerous situation for residents, team members, guests and others."
    },
    {
      "duty": "Demonstrates customer services skills by treating residents and others with respect, answering resident questions, and responding sensitively to complaints about maintenance services."
    },
    {
      "duty": "Complies with safety and risk-management policies, attends routine safety meetings, completes required training on OSHA and other safety related laws and requirements, and reports accidents and incidents promptly and accurately."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Valid driver’s license to operate a golf cart on property"
    }
  ]
}