{
  "meta": [
    {
      "job_title": "Events and Meetings Planner",
      "job_category": "Event Planning",
      "job_class": "Planner",
      "sector": "Marketing",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Event Planning",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Organizational Skills",
      "experience": 7
    },
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute various internal and external-facing meetings for up to 500 people, including clients, prospects, consultants, and industry representatives."
    },
    {
      "duty": "Plan and execute PSCU’s Annual Member Conference, both in-person and/or virtual, in conjunction with the Meetings and Special Events Manager and the Events team."
    },
    {
      "duty": "Oversight of tradeshows, including budget management, creative deliverables, and serving as the internal lead on the events team."
    },
    {
      "duty": "Lead planning and execution for Thought Leadership events, including PSCU Insights Exchange and SPY Sessions, either in-person, virtual, or hybrid."
    },
    {
      "duty": "Partner with all facets of the Marketing team, Marketing Strategy, Communications, Creative, and Web/Digital, to create an excellent brand experience for all PSCU events."
    },
    {
      "duty": "Provide virtual meeting support where needed both internally and externally, serving as a subject matter expert in the virtual meeting space."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business, Marketing, or Communications, or equivalent combination of education and experience required. Masters preferred."
    }
  ]
}