{
  "meta": [
    {
      "job_title": "Leasing Manager",
      "job_category": "Real Estate",
      "job_class": "Manager",
      "sector": "Property Management",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Executes the property’s marketing, leasing, and renewal strategies to achieve occupancy, revenue, and resident retention goals by performing all activities related to leasing and marketing to new residents, providing resident satisfaction throughout the term of the lease, and securing resident lease renewals."
    },
    {
      "duty": "Performs all sales and leasing activities to achieve the property’s revenue and occupancy goals by greeting and qualifying prospects, conducting property tours and showing apartment homes, continuing the relationship with prospects through follow-up and consistent discovery, processing applications, credit screening, and criminal background checks, preparing the lease and move-in package, and ensuring a smooth resident move-in and lease signing."
    },
    {
      "duty": "Collects all pertinent information from prospective residents at move-in and record as appropriate."
    },
    {
      "duty": "Continually update the market survey to stay informed about current market and competitor conditions that may impact the community’s occupancy, market rent, and sales results, develops and implements short- and long-term marketing plans and goals to sustain occupancy, and follows the property’s established policies related to concessions, specials, and other programs to boost occupancy."
    },
    {
      "duty": "Designs and executes marketing activities and events to create and drive traffic to the property, including implementing resident referral and employer outreach programs, using internet marketing tools (Craigslist, Facebook, e-mail, and other websites), and following other property-specific marketing plans, drives, and special programs."
    },
    {
      "duty": "Uses the on-site property management software application (Entrata, Yardi, etc.) to track apartment availability, record traffic and leasing activities, manage resident and prospect data, and capture critical demographic and other information about existing and future residents."
    },
    {
      "duty": "Ensures that the property and show units meet the Company’s standards for show quality by daily inspecting the marketing corridor and leasing tour, communicating maintenance and upkeep needs to the property’s maintenance team members, merchandising and ensuring a physically appealing show unit and/or model and amenities, and preparing the leasing office for daily leasing activities."
    },
    {
      "duty": "Executes and performs activities in support of the property’s lease renewal program by preparing lease renewal letters and packages for residents, meeting with and contacting renewing residents in advance of move-out dates, and ensuring that lease renewal documents are signed and implemented on time."
    },
    {
      "duty": "Responds quickly and courteously to resident and client/owner concerns and questions, and takes prompt action to solve problems and/or document and convey resident or other requests to the appropriate individual(s)."
    },
    {
      "duty": "Demonstrates customer services skills by treating residents and others with respect, answering resident questions, and responding sensitively to complaints about maintenance services."
    },
    {
      "duty": "Attends community and networking events, aligns themselves with local associations and community organizations, and participates in outreach marketing efforts as necessary to drive traffic to community and generate viable referral sources and new business leads."
    },
    {
      "duty": "Follow-up – Utilizes current CRM to maintain an accurate and up-to-date prospect database. Assist with daily, meaningful prospect follow-up. Helps the team perform the required number of follow-up contacts in accordance with Greystar standards through phone calls, personal visits, notes, etc. Coordinate prospect and depositor related creative follow up deliveries with couriers, shipping, Amazon, etc. Sales Collateral – Organize and ensure adequate supply of fully assembled sales collateral, marketing and outreach packets. Maintain files and marketing materials for realtors, transition companies, and moving companies. Maintain Sales Consultant - SH copies of all floor plans, in hard copy and email versions."
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}