{
  "meta": [
    {
      "job_title": "Clinical Laboratory Manager",
      "job_category": "Healthcare",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Laboratory Science",
      "experience": 5
    },
    {
      "skill": "Laboratory Management",
      "experience": 5
    },
    {
      "skill": "Staffing and Scheduling",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Laboratory Information Systems",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct the daily operational activities of the department/lab name; both the technical and non-technical operations."
    },
    {
      "duty": "Effectively manage the staffing of the department and monitor the production schedule to ensure adequate coverage and proper use of overtime, and adjust as needed."
    },
    {
      "duty": "Directly supervise, train, and mentor laboratory supervisors and have ownership and responsibility for all departmental staff."
    },
    {
      "duty": "Ensure the diagnostics laboratory provides market leading service levels, meeting the needs of our clients and corporate service metrics established for TAT."
    },
    {
      "duty": "Resolve client inquiries and operational issues in a timely manner by consulting with the Medical Director, Technical Director, QA, other laboratory managers, discipline directors, laboratory directors or corporate operations."
    },
    {
      "duty": "Ensure laboratory is compliant with corporate, state and federal regulatory requirements (CAP, CLIA, State, ISO, etc) related to personnel safety and quality of laboratory testing as well as professional conduct."
    },
    {
      "duty": "Assist with developing and implementing laboratory procedures and installation of equipment and methods."
    },
    {
      "duty": "Manage staff including recruiting & hiring qualified and enthusiastic employees, performance management, training and development."
    },
    {
      "duty": "Ensure effective communication with leadership, clients, sales, corporate operations, as well as direct reports and all departmental staff."
    },
    {
      "duty": "Conduct departmental meetings and ensure appropriate departmental communication."
    },
    {
      "duty": "Investigate deviations from established procedures to ensure effective corrective action."
    },
    {
      "duty": "Maintain technical knowledge in the assigned department(s) for the laboratory testing."
    },
    {
      "duty": "Maintain a clean and safe work environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Biology, Chemistry, Clinical Laboratory Science, Medical Technology or meet local regulatory (CLIA & State) requirements. Minimum 2 years of experience as a Technologist in a clinical diagnostics laboratory, and minimum 1 year of prior supervisor experience managing several direct reports. ASCP certification is required/preferred."
    }
  ]
}