{
  "meta": [
    {
      "job_title": "City Controller",
      "job_category": "Finance",
      "job_class": "Management",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 5
    },
    {
      "skill": "Finance Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "IT Management",
      "experience": 5
    },
    {
      "skill": "Pension Administration",
      "experience": 5
    },
    {
      "skill": "Public Financial Management",
      "experience": 5
    },
    {
      "skill": "MUNIS System",
      "experience": 5
    },
    {
      "skill": "Administrative Law",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and administer the City's General Fund budget, Special Revenue Funds, and Capital Bonding Funds."
    },
    {
      "duty": "Provide stewardship for the City's funds and accounts, and report directly to the Mayor."
    },
    {
      "duty": "Lead and manage functional areas including Accounting and Financial Management, Purchasing and Procurement, Risk Management, Debt Issuance and Management, Tax Collection and Assessment, Payroll/Pension, and Information Technology."
    },
    {
      "duty": "Make sound decisions, think strategically, and handle multiple business initiatives and priorities."
    },
    {
      "duty": "Guide the Finance Department during a period of significant organizational change."
    },
    {
      "duty": "Work with City officials, service providers, and consultants, and have strong technological experience with financial/accounting systems."
    },
    {
      "duty": "Interpret relevant Charter, Ordinance, state and federal laws, and ensure compliance."
    },
    {
      "duty": "Commit to living in the City of New Haven if not already a resident."
    },
    {
      "duty": "Be bonded, and have elector status in the city of New Haven within six months of appointment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 125,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Graduation from an accredited four year college or university with major course work in accounting, finance, or a related field; a Master's Degree in Public Administration, Business Administration or related field preferred."
    }
  ]
}