{
  "meta": [
    {
      "job_title": "Vice President of Software Development",
      "job_category": "Software Development",
      "job_class": "Vice President",
      "sector": "Management",
      "salary": 240000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Strategic Leadership",
      "experience": 10
    },
    {
      "skill": "Software Development",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "Communication",
      "experience": 10
    },
    {
      "skill": "Data Governance",
      "experience": 10
    },
    {
      "skill": "Technology Strategy",
      "experience": 10
    },
    {
      "skill": "Innovation Management",
      "experience": 10
    },
    {
      "skill": "Security Standards",
      "experience": 10
    },
    {
      "skill": "Policy Processing",
      "experience": 10
    },
    {
      "skill": "Insurance Industry Knowledge",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide strategic leadership for the software development team, overseeing all aspects of software design, development, and implementation."
    },
    {
      "duty": "Collaborate closely with business stakeholders to understand their needs and align software development initiatives with organizational goals."
    },
    {
      "duty": "Work with the executive team to formulate technology strategies that enhance operational efficiency and drive business growth."
    },
    {
      "duty": "Lead and mentor cross-functional teams to deliver high-quality software solutions on time and within budget."
    },
    {
      "duty": "Develop and maintain software development policies, procedures, and best practices to ensure consistency and excellence."
    },
    {
      "duty": "Drive the adoption of innovative technologies and methodologies to enhance software development processes."
    },
    {
      "duty": "Ensure compliance with data governance policies and security standards in software solutions."
    },
    {
      "duty": "Communicate complex technical concepts to non-technical stakeholders in a clear and concise manner."
    },
    {
      "duty": "Provide insights and recommendations to senior leadership on technology trends and their impact on the business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 200,
      "student_teacher": 150,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree (BA/BS) from a four-year college or university, preferably in Computer Science or related field. Advanced degree (MS/MBA) is a plus."
    }
  ]
}