{
  "meta": [
    {
      "job_title": "Senior Messaging Engineer",
      "job_category": "Engineering",
      "job_class": "Senior",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide infrastructure and O365 application support, including level three support for questions and problems related to O365 applications, service integration, and related hardware and software."
    },
    {
      "duty": "Interface with various technical teams to implement new technologies and support existing technologies, including Networking, Windows, Storage, and Information Security."
    },
    {
      "duty": "Architect and manage large scale and technically complex projects and upgrades, including Office 365 tenant management."
    },
    {
      "duty": "Execute projects and resolve complex problems in varying systems, including Enterprise level archiving, Exchange/Exchange Online, Active Directory, MS TEAMS, SharePoint Online, Conditional Access, and InTune."
    },
    {
      "duty": "Demonstrate strong team leading skills, superior work ethic, and ability to manage projects with little supervision."
    },
    {
      "duty": "Documentation and communication skills, providing recommendations on changes and design enhancements to improve the environment, services, processes, and security."
    },
    {
      "duty": "Participate in 24-hour on-call rotation and other duties as assigned."
    },
    {
      "duty": "Build relationships with team members and customers, and enhance intrateam collaboration. Provide superior customer support and ensure new technology initiatives are stable and readily maintained."
    },
    {
      "duty": "Provide in-depth diagnosis by gathering, organizing, and analyzing data for research and problem solving."
    }
  ],
  "skills": [
    {
      "skill": "Microsoft Active Directory Design and Support",
      "experience": 6
    },
    {
      "skill": "Microsoft Exchange Server and O365",
      "experience": 6
    },
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "PowerShell Scripting",
      "experience": 6
    },
    {
      "skill": "Antispam Technologies Administration",
      "experience": 6
    },
    {
      "skill": "Active Directory, Shared Mailbox, and Resource Mailbox Management",
      "experience": 6
    },
    {
      "skill": "SMTP Services",
      "experience": 6
    },
    {
      "skill": "Security Roles Configuration (Exchange environment)",
      "experience": 6
    },
    {
      "skill": "DNS and Related Entries (SPF, DKIM, Dmarc, Mx records)",
      "experience": 6
    },
    {
      "skill": "Networking Tools (Fiddler, Wireshark)",
      "experience": 6
    },
    {
      "skill": "Server Virtualization Technology Deployment and Management",
      "experience": 6
    },
    {
      "skill": "VMWare and HP Blade Servers",
      "experience": 6
    },
    {
      "skill": "Communication and Collaboration",
      "experience": 6
    },
    {
      "skill": "PowerShell Scripting (Ad hoc and troubleshooting)",
      "experience": 6
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree or equivalent education and experience. MCSE certification required."
    }
  ]
}