{
  "meta": [
    {
      "job_title": "Digital Transformation Lead",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage productive relationships with assigned business units, operations, and transformation leaders to analyze operational, financial, and project/portfolio data as needed to support the planning and implementation of transformation initiatives."
    },
    {
      "duty": "Effectively lead programs and large projects to achieve defined business outcomes by creating high performing teams of business, IT and third-party stakeholders focused on initiating, designing, and delivering digital solutions."
    },
    {
      "duty": "Serve as a primary point of contact for business sponsors and other stakeholders."
    },
    {
      "duty": "Experience with digital technologies and digital transformation projects highly preferred, i.e., implementation of new technologies, site development, UI (User Interface), workflows, etc."
    },
    {
      "duty": "Demonstrate strong business acumen and leadership with a focus on driving results, removing execution barriers, and anticipating and managing program risks."
    },
    {
      "duty": "Strong project and program management skills including the ability to create a quality project schedule, manage project interdependencies and oversee the development of estimates, benefit commitments, and overall project costs including contingency."
    },
    {
      "duty": "Extremely proficient with MS Office Apps - MS Project, PowerPoint, Excel, Word."
    }
  ],
  "skills": [
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Digital Transformation",
      "experience": 5
    },
    {
      "skill": "Business Acumen",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "MS Office Applications",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, IT, or a related field (Master's preferred)"
    }
  ]
}