{
  "meta": [
    {
      "job_title": "Sales Supervisor",
      "job_category": "Sales",
      "job_class": "Supervisor",
      "sector": "Sales",
      "salary": 78000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Directly manage a team of direct sales representatives and community relations specialists."
    },
    {
      "duty": "Facilitate the success of the team by setting a direction, establishing goals, and conducting meetings to ensure the success and alignment of the team."
    },
    {
      "duty": "Conduct one-on-one coaching sessions and ride-alongs with all DSR’s to support the skills necessary to be successful and exceed their goals."
    },
    {
      "duty": "Train and motivate individual DSR’s in a manner which will allow them to achieve their highest potential."
    },
    {
      "duty": "Responsible for hiring and developing new direct sales representatives who are a great fit for our culture."
    },
    {
      "duty": "Maintain a territory and achieve individual sales targets that includes the SMB opportunities within the market."
    },
    {
      "duty": "Facilitate the sales process for local special project requests from government partners."
    },
    {
      "duty": "Establish and maintain effective relationships with customers, partners, vendors, and internal departments."
    },
    {
      "duty": "Engage with the General Manager, Regional Vice President, and CMO by offering timely communication, accurate forecasting which includes early, mid-month and final reporting, and overall strategic direction of the team."
    },
    {
      "duty": "Track overall sales to budget on a monthly and quarterly basis."
    },
    {
      "duty": "Partners with Sales Supervisor’s in other markets for best practice sharing."
    },
    {
      "duty": "Responsible for building individual sales quotas for DSR’s with buy-in from the GM, Regional VP, and CMO."
    },
    {
      "duty": "Responsible for meeting monthly and quarterly sales quotas for the team."
    },
    {
      "duty": "Engage with the Marketing team with market needs and insight from the field to improve sales."
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Forecasting",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree"
    }
  ]
}