{
  "meta": [
    {
      "job_title": "Insurance Officer",
      "job_category": "Insurance",
      "job_class": "Officer",
      "sector": "Insurance",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as primary agent for the servicing of crop insurance policies which includes gathering acreage reports and production histories."
    },
    {
      "duty": "Provide servicing to Hail Policies and Supplemental Insurance Products."
    },
    {
      "duty": "Responsible for sales production of Multi-Peril Crop Insurance (MPCI), Crop Hail and Supplemental insurance products to customer and non-customer prospects."
    },
    {
      "duty": "Develop personal marketing plan and update annually around customer needs and risk tolerance."
    },
    {
      "duty": "Represent Farm Credit Services of America at industry events and other ag related events in the region."
    },
    {
      "duty": "Serve as subject matter expert and make sales presentations at insurance sales seminars as needed."
    },
    {
      "duty": "Responsible for providing referrals to other members of Farm Credit Servies of America’ sales teams."
    },
    {
      "duty": "Develop proposals for one-on-one sales calls with customers or prospects, utilizing financial information gathered independently and from interaction with Financial Officers, Retail Commercial Lenders, and Agribusiness Capital Officers in preparation of prospect sales calls."
    },
    {
      "duty": "Assist with organizing and coordinating insurance programs within assigned marketing areas."
    },
    {
      "duty": "Process insurance forms from multiple insurance vendors for Multi-Peril Crop Insurance (MPCI), Crop Hail and Supplemental products including analyzing and entering applications online."
    },
    {
      "duty": "Leverage customer’s precision farming data to gather acreage reporting and production reporting information."
    },
    {
      "duty": "Enter acreage reports utilizing insurance company software according to underwriting requirements and current processes and procedures."
    },
    {
      "duty": "Develop and maintain a working relationship with insurance vendor representatives to improve sales and service to regional offices and customers."
    },
    {
      "duty": "Make business placement decisions based upon AIP products and offerings."
    },
    {
      "duty": "Experience in an agriculture related field with sales and service, Relationship management and/or sales experience"
    }
  ],
  "skills": [
    {
      "skill": "Crop Insurance Servicing",
      "experience": 5
    },
    {
      "skill": "Sales Production",
      "experience": 5
    },
    {
      "skill": "Marketing Plan Development",
      "experience": 5
    },
    {
      "skill": "Sales Presentations",
      "experience": 5
    },
    {
      "skill": "Referral Networking",
      "experience": 5
    },
    {
      "skill": "Financial Information Analysis",
      "experience": 5
    },
    {
      "skill": "Precision Farming Data Utilization",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Agriculture Sales",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Agriculture, Finance, or Business preferred"
    }
  ]
}