{
  "meta": [
    {
      "job_title": "Inside Sales Store Support Specialist",
      "job_category": "Sales",
      "job_class": "Support",
      "sector": "Sales",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Sales Management",
      "experience": 3
    },
    {
      "skill": "Account Management",
      "experience": 3
    },
    {
      "skill": "Product Knowledge",
      "experience": 3
    },
    {
      "skill": "CRM Management",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Tech Savvy",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Task Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide outstanding customer service through phone, email, and chat channels, assisting customers with inquiries, orders, and product information."
    },
    {
      "duty": "Actively engage with customers to understand their needs, recommend suitable products, and upsell when appropriate to drive sales."
    },
    {
      "duty": "Manage a portfolio of existing accounts, building strong relationships and ensuring customer satisfaction to encourage repeat business."
    },
    {
      "duty": "Proactively seek out new sales opportunities through outbound calls and follow up on leads to achieve sales targets."
    },
    {
      "duty": "Dispense Product Knowledge: Develop a deep understanding of our products and services to assist customers with informed purchasing decisions."
    },
    {
      "duty": "Provide Sales Support: Collaborate with the sales team to identify opportunities, follow up on leads, and contribute to achieving sales targets."
    },
    {
      "duty": "Process sales orders accurately and efficiently, ensuring timely delivery and customer satisfaction."
    },
    {
      "duty": "Participate in sales meetings, training sessions, and team-building activities to foster a positive work environment."
    },
    {
      "duty": "Maintain detailed and accurate records of all customer interactions in the CRM system."
    },
    {
      "duty": "Problem Solving: Address and resolve customer complaints or concerns promptly, escalating complex issues to the appropriate department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or Equivalent"
    }
  ]
}