{
  "meta": [
    {
      "job_title": "Facilities Manager",
      "job_category": "Facilities Management",
      "job_class": "Manager",
      "sector": "Facilities Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Facilities Management",
      "experience": 5
    },
    {
      "skill": "HVAC/R",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Maintenance",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads and participates in teams in Facilities Management- HVAC/R by using and sharing resources, information, and tools; determining Customer needs and business priorities; coordinating and executing work assignments; providing advice, feedback, and support to ensure timelines and work quality are achieved; and modeling and helping others with how to adapt to change or new challenges."
    },
    {
      "duty": "Oversees and implements special projects for field operations by collecting data; evaluating new technology capabilities; correcting deficiencies; and providing suggestions for changes and improvements."
    },
    {
      "duty": "Provides required paperwork by completing forms (for example, expense vouchers, weekly summaries, refrigerant logs, work orders); and submitting to senior leadership."
    },
    {
      "duty": "Ensures compliance with applicable Occupational Safety and Health Administration and Environmental Protection Agency regulations and guidelines by performing work according to practices and procedures outlined in the Walmart heating, ventilation, air conditioning, and refrigeration (HVAC/R) safety policy and environmental guidelines; and reclaiming ozone-depleting refrigerants."
    },
    {
      "duty": "Ensures compliance with applicable federal, state, and local HVAC/R industry regulations and guidelines (for example, building codes, indoor air quality , cold chain requirements) by conducting inspections; and making repairs."
    },
    {
      "duty": "Maintains quality standards by inspecting installations and modifications of new HVAC/R equipment and Energy Management Systems (EMS); ensuring contract compliance; and identifying and reporting deficiencies."
    },
    {
      "duty": "Ensures available resources for HVAC/R maintenance and repair by managing refrigerant levels and parts inventory; recording HVAC/R purchases and usage; tracking and ordering HVAC/R parts; and developing relationships with HVAC/R parts suppliers and contractors."
    },
    {
      "duty": "Ensures financial sustainability by compiling and reporting budget information to the regional manager of Facilities; requesting replacement HVAC/R equipment for facilities; submitting warranty claims; reviewing journals and invoices; conducting price comparisons of refrigerant, parts, and travel related costs; and developing scopes of work for projects (for example, rooftop units , condenser coil replacements)."
    },
    {
      "duty": "Provides training (for example, safety, control troubleshooting, oil system operation and adjustment) by traveling to company facilities for on-site sessions; performing on-site HVAC/R repairs for hands-on learning; evaluating the Technician skill sets; and reporting back to senior leadership."
    },
    {
      "duty": "Ensures working order of HVAC/R, and EMS, and direct digital control equipment by troubleshooting, diagnosing, maintaining, and repairing equipment; performing major and minor preventive maintenance; providing feedback about troubleshooting best practices; and managing district workloads with external service providers."
    },
    {
      "duty": "Demonstrates up-to-date expertise and applies this to the development, execution, and improvement of action plans by providing expert advice and guidance to others in the application of information and best practices; supporting and aligning efforts to meet customer and business needs; and building commitment for perspectives and rationales."
    },
    {
      "duty": "Provides and supports the implementation of business solutions by building relationships and partnerships with key stakeholders; identifying business needs; determining and carrying out necessary processes and practices; monitoring progress and results; recognizing and capitalizing on improvement opportunities; and adapting to competing demands, organizational changes, and new responsibilities."
    },
    {
      "duty": "Models compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity by incorporating these into the development and implementation of business plans; using the Open Door Policy; and demonstrating and assisting others with how to apply these in executing business processes and practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Vocational or Technical HVAC/R certification and 5 years' experience in mechanical maintenance or construction-related field for commercial HVAC/R and building controls OR 7 years' experience in mechanical maintenance or construction-related field for commercial HVAC/R and building controls or related field."
    }
  ]
}