{
  "meta": [
    {
      "job_title": "Safety Investigator",
      "job_category": "Engineering",
      "job_class": "Technical Expert",
      "sector": "Software Engineering",
      "salary": 183550,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Autonomous Vehicle Systems",
      "experience": 5
    },
    {
      "skill": "Safety Investigation",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Written and Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Regulatory Interaction",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and own a comprehensive safety investigation program that addresses technical risk, human factors, system safety, and organizational risks."
    },
    {
      "duty": "Lead investigations into significant events impacting our fleet or safety profile including collisions, near misses, or trends."
    },
    {
      "duty": "Conduct root cause analysis using industry standard methodologies while tailoring approach to the level of complexity and safety risk potential of the event or concern."
    },
    {
      "duty": "Work with teams across Cruise to develop solutions to address findings to continuously improve safety and system performance and determine short and long-term corrective and preventive actions."
    },
    {
      "duty": "Perform periodic analysis of investigation findings to identify and assess trends affecting safety."
    },
    {
      "duty": "Participate in program audits to ensure effective traceability and readiness for internal and external reviews."
    },
    {
      "duty": "Promote safety culture at Cruise through our Safety Management System including leading efforts to expand our safety assurance and risk management programs related to investigations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science in Engineering, Computer Science, Safety, Human Factors, or a related technical degree and 5+ years work experience (M.S. or Ph.D. preferred)"
    }
  ]
}