{
  "meta": [
    {
      "job_title": "Senior Automation Engineer",
      "job_category": "Engineering",
      "job_class": "Senior Engineer",
      "sector": "Supply Chain",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Robotics",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Facility Design",
      "experience": 5
    },
    {
      "skill": "Cost Proposal",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Manufacturing",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Designing, building, testing, and implementing automation/robotics solutions for distribution centers."
    },
    {
      "duty": "Assessing and leading research projects to improve process efficiency and implement innovative manufacturing concepts."
    },
    {
      "duty": "Examining business case and tradeoffs for new distribution concepts, process development, and automation equipment procurement."
    },
    {
      "duty": "Planning robot installation programs, specifying robot capabilities, and preparing cost proposals and efficiency studies."
    },
    {
      "duty": "Reviewing product designs for cost and manufacturing, preparing project justifications, and managing spend."
    },
    {
      "duty": "Soliciting quotations, qualifying suppliers, and selecting equipment vendors, reviewing process equipment progress, and managing delivery schedule."
    },
    {
      "duty": "Implementing automated processes to reduce labor dependency, acting as liaison between Design, Manufacturing, and Distribution."
    },
    {
      "duty": "Piloting and debugging distribution processes for production-based environments and recommending physical changes to support equipment installation."
    },
    {
      "duty": "Serving as the site champion for Newell Brands equipment introduction process and adhering to Newell PEAK procedures."
    },
    {
      "duty": "Providing support to other distribution centers in the network for automation deployment and operation, with travel not to exceed 20% of the time."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in engineering (electrical, mechanical, manufacturing, or industrial) specializing in robotics/automation. Minimum 5 years of relevant work experience with hands-on experience with robots."
    }
  ]
}