{
  "meta": [
    {
      "job_title": "Certified Ophthalmic Assistant",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 32000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Ophthalmology",
      "experience": 2
    },
    {
      "skill": "Healthcare",
      "experience": 2
    },
    {
      "skill": "Clinical Competency Testing",
      "experience": 2
    },
    {
      "skill": "Medical Terminology",
      "experience": 2
    },
    {
      "skill": "Patient Care",
      "experience": 2
    },
    {
      "skill": "Medical Records Management",
      "experience": 2
    },
    {
      "skill": "Equipment Knowledge",
      "experience": 2
    },
    {
      "skill": "AHA Basic Life Support",
      "experience": 2
    },
    {
      "skill": "Clinical Procedures",
      "experience": 2
    },
    {
      "skill": "Emergency Response",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist Ophthalmologist with patient care and maintain patient flow."
    },
    {
      "duty": "Take patient history and perform high-level diagnostic testing to initiate the examination."
    },
    {
      "duty": "Coordinate surgical procedures."
    },
    {
      "duty": "Demonstrate clinical knowledge and skill in assigned area and within scope of practice."
    },
    {
      "duty": "Administer medications safely and accurately per guidelines."
    },
    {
      "duty": "Prepare patients for eye examination and assist with office surgeries and routine exams."
    },
    {
      "duty": "Respond to urgent and emergent situations in a calm and capable manner."
    },
    {
      "duty": "Ensure readiness of reports and information to maximize patient visit."
    },
    {
      "duty": "Maintain appropriate supply levels and participate in site inspections and inventories."
    },
    {
      "duty": "Complete Quality Assurance assignments and ensure overall department compliance with requirements."
    },
    {
      "duty": "Demonstrate knowledge of equipment and Information Systems applications."
    },
    {
      "duty": "Document patient care events in a thorough and accurate manner."
    },
    {
      "duty": "Manage and complete AEHR tasks per prescribed time lines."
    },
    {
      "duty": "Support and knowledge of new applications and policies such as AEHR, Abbreviations, etc."
    },
    {
      "duty": "Demonstrate typing skills proficiency and knowledge of insurance, utilization review, and scheduling requirements."
    },
    {
      "duty": "Operate and maintain department equipment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "2 years of experience in Ophthalmology at an Assistant level."
    },
    {
      "credential": "AHA Basic Life Support for Healthcare Professional (AHA BLS Healthcare) - American Heart Association -REQUIRED"
    },
    {
      "credential": "Certified Ophthalmic Assistant (COA) - Joint Commission on Allied Health Professional in Ophthalmology (JCAHPO) -PREFERRED"
    },
    {
      "credential": "Certified Ophthalmic Assistant (COA) certification due within 12 months from hire date."
    }
  ]
}