{
  "meta": [
    {
      "job_title": "Client Services Manager",
      "job_category": "Client Services",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintains and enhances client relationships by executing proactive contact initiatives, providing strategic planning and consulting advice, and reviewing investment options, services, fees, and goals."
    },
    {
      "duty": "Consults with clients to review large claims, abnormal utilization results, and monthly claims experience."
    },
    {
      "duty": "Issues profitability assists on all fee-at-risk proposals and coordinates market selection for new and renewal business on designated accounts."
    },
    {
      "duty": "Generates new business opportunities through cross-selling and negotiates program terms and costs."
    },
    {
      "duty": "Helps coordinate day-to-day administrative activities among those servicing the client’s account and provides information and techniques to department associates to improve working knowledge."
    },
    {
      "duty": "Mentors and trains junior-level staff and researches industry trends, product development, and government regulations."
    },
    {
      "duty": "Performs other responsibilities and duties as needed."
    }
  ],
  "skills": [
    {
      "skill": "Client Services",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Consulting",
      "experience": 7
    },
    {
      "skill": "Business Administration",
      "experience": 7
    },
    {
      "skill": "Market Analysis",
      "experience": 7
    },
    {
      "skill": "Negotiation",
      "experience": 7
    },
    {
      "skill": "Mentoring",
      "experience": 7
    },
    {
      "skill": "Research",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Business Administration or related field and/or years of experience equivalent (Master's preferred)"
    }
  ]
}