{
  "meta": [
    {
      "job_title": "Retail Sales Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Sales Support",
      "experience": 1
    },
    {
      "skill": "Merchandise Organization",
      "experience": 1
    },
    {
      "skill": "Update Pricing and Signage",
      "experience": 1
    },
    {
      "skill": "Resourcefulness",
      "experience": 1
    },
    {
      "skill": "Electronic Device Handling",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Master store products, services, loyalty programs, and sales systems and use knowledge to help customers find what they need and suggest additional items."
    },
    {
      "duty": "Develop customer relationships to grow business and expand client base. Respond to customer requests for additional merchandise or other assistance, including sharing how to use an electronic device to shop and compare. Assist in locating and pulling merchandise to fulfill digital customer orders."
    },
    {
      "duty": "Maintain department recovery standards, including selling floor and fitting rooms."
    },
    {
      "duty": "Update merchandise presentation, ensure accurate merchandise pricing, and process markdowns in a timely and accurate manner."
    },
    {
      "duty": "Uphold dedication to fulfilling ideals of diversity, inclusion, and respect. Have flexible availability, including days, evenings, weekends, and holidays."
    },
    {
      "duty": "Prolonged periods of standing/walking around the store or department. Reach with hands and arms, use hands to press, handle, and feel. Occasionally required to lift and/or move up to 25 lbs., climb ladders, stoop, kneel, crouch, and crawl. Requires close vision, color vision, and ability to adjust focus."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 20,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "No Education or Experience Required"
    }
  ]
}