{
  "meta": [
    {
      "job_title": "Banquet Manager",
      "job_category": "Hospitality",
      "job_class": "Manager",
      "sector": "Hospitality",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Hospitality Management",
      "experience": 5
    },
    {
      "skill": "Staff Supervision",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Loss Prevention",
      "experience": 5
    },
    {
      "skill": "Food and Beverage Operations",
      "experience": 5
    },
    {
      "skill": "Sanitation Regulations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee all aspects of the daily operation of the hotel’s banquet operation."
    },
    {
      "duty": "Supervise all banquet personnel."
    },
    {
      "duty": "Respond to guest complaints in a timely manner."
    },
    {
      "duty": "Coordination and monitoring of all phases of Loss Prevention in the banquet operation."
    },
    {
      "duty": "Ensure preparation of required reports, including (but not limited to) Wage Progress, payroll, revenue, employee Schedules, quarterly actions plans."
    },
    {
      "duty": "Monitor quality of service in banquet operations."
    },
    {
      "duty": "Conduct staff performance reviews in accordance with standards."
    },
    {
      "duty": "Coordinate all banquet related food and beverage requirements with the appropriate departments."
    },
    {
      "duty": "Maintain up-to-date details on banquet functions and communicate to supervisors."
    },
    {
      "duty": "Supervise proper tabulation of all banquet checks and ensure that all checks are presented to guests for signature."
    },
    {
      "duty": "Ensure safety, sanitation, and cleanliness of service areas."
    },
    {
      "duty": "Conduct menu classes and line-ups for all functions."
    },
    {
      "duty": "Supervise the work of banquet management and captains, and observe the performance of hourly service personnel."
    },
    {
      "duty": "Control and maintain all service equipment. Write service requests as necessary."
    },
    {
      "duty": "Ensure overall guest satisfaction."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 60,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "At least 1 year of progressive experience in a luxury hotel. High school diploma required. Previous supervisory responsibility required."
    }
  ]
}