{
  "meta": [
    {
      "job_title": "Project Coordinator",
      "job_category": "Project Management",
      "job_class": "Coordinator",
      "sector": "Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    },
    {
      "skill": "Continuous Improvement Methodologies",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Time Management",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "MS Office",
      "experience": 3
    },
    {
      "skill": "Visio",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build and maintain project organizational structure for both process improvement projects and quality initiatives."
    },
    {
      "duty": "Coordinate internal and external meetings to maintain communication between stakeholders, clients, vendors, and other involved participants."
    },
    {
      "duty": "Coordinate day-to-day aspects of projects including status reporting, document generation, and task management."
    },
    {
      "duty": "Report on progress to project leadership and agency management."
    },
    {
      "duty": "Ensure that project labor hours are tracked for use in future quoting and resource planning."
    },
    {
      "duty": "Maintain complete understanding of cross disciplinary requirements and project roles to ensure project deadlines are met or improved."
    },
    {
      "duty": "Manage multiple concurrent projects and maintain highly organized logistical control."
    },
    {
      "duty": "Work with business owner, IT/Tech, and vendors to install, test, and measure success of any implemented systems."
    },
    {
      "duty": "Establish and maintain business relationships with appropriate business partners, both internal and external."
    },
    {
      "duty": "Keep informed of new developments, methods, and techniques in quality management."
    },
    {
      "duty": "Participate in internal learning and development sessions."
    },
    {
      "duty": "Maintain confidentiality of client and company information and adhere to all personal and financial data privacy protocols."
    },
    {
      "duty": "Follow department and company defined processes, procedures, and workflows, within specified timelines, to drive consistency and efficiency, with a focus on client experience."
    },
    {
      "duty": "Support and demonstrate the core values of the agency: trust, respect, creativity, and fun."
    },
    {
      "duty": "Support and live our Be Sure Service Standards, Helping Others Culture, and Quality Program."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Three years of experience in process improvement, analysis, project management; or an equivalent combination of education and experience. Project Management or Process Improvement certification strongly preferred. Project Management and/or business experience of insurance agency marketplace preferred."
    }
  ]
}