{
  "meta": [
    {
      "job_title": "Clinical Intake Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Experience",
      "experience": 6
    },
    {
      "skill": "Care/Case Management",
      "experience": 5
    },
    {
      "skill": "Utilization Review",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Discharge Planning",
      "experience": 5
    },
    {
      "skill": "NYSDOH Medicaid Program",
      "experience": 5
    },
    {
      "skill": "Long Term Care",
      "experience": 5
    },
    {
      "skill": "Managed Long Term Care",
      "experience": 5
    },
    {
      "skill": "Utilization Management",
      "experience": 5
    },
    {
      "skill": "Long-term Services and Supports (LTSS)",
      "experience": 5
    },
    {
      "skill": "Managed Long Term Care (MLTC)",
      "experience": 5
    },
    {
      "skill": "MS Office",
      "experience": 5
    },
    {
      "skill": "Bilingual Communication",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Decision-making",
      "experience": 5
    },
    {
      "skill": "Flexible Schedule",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate intake functions with New York Independent Assessor (NYIA) clinical program for members who are requesting LTSS program enrollment."
    },
    {
      "duty": "Complete Time Tasking Tool (TTT) for members who have a NYIA)/Maximus finalized assessment in the Uniform Assessment System (UAS)"
    },
    {
      "duty": "Facilitate the Expedited Assessment & TOC Immediate Need Form process with member and Operational Support Unit (OSU)"
    },
    {
      "duty": "Submit the plan of care to the IA for members who meet criteria for more than 12 hours per day/24 hours in a 7-day week for new program members."
    },
    {
      "duty": "Complete the Community Health Assessment (CHA) Variance Resolution (clinical dispute process) between NYIA and EmblemHealth via the CHA Variance Form."
    },
    {
      "duty": "Support clinical intake review of program members in relation to the UAS assessment process for reassessments, change of condition, care transitions and new program members."
    },
    {
      "duty": "Coordinate and facilitate determinations and outliers with EH Medical Directors based on outcome of UAS assessments and program eligibility."
    },
    {
      "duty": "Conduct quality assurance review of completed UAS assessments in care management database for EmblemHealth managed LTSS members."
    },
    {
      "duty": "Coordinate the Independent Review Panel (IRP) process for members who task 12+ hours of care, reconciles and processes determinations received back from the (IRP) in relation to scope/type and durations of services."
    },
    {
      "duty": "Collaborate with member, caregiver, Maximus, and the plan to ensure three-way calls are completed within six days of request for initial assessments and expedited assessments."
    },
    {
      "duty": "Submit completed forms timely to the NYIA via a secure weblink; complete member and provider correspondence including verbal outreach in accordance with departmental and DOH guidelines."
    },
    {
      "duty": "Maintain knowledge of all applicable NYSDOH/CMS guidelines and relevant organizational and departmental policies and procedures."
    },
    {
      "duty": "Escalate questions or concerns during the program assessment and enrollment process to the leadership team and or NYIA to ensure proper completion of UAS-NY and handling of issues that may require intervention."
    },
    {
      "duty": "Support an integrated care model tapping into appropriate resources both internally and external to the organization."
    },
    {
      "duty": "Enter and maintain documentation in the Electronic Medical Records System (EMR), meeting defined timeframes and performance standards."
    },
    {
      "duty": "Maintain an understanding of Care Management principles, program objectives and design, implementation, management, monitoring, and reporting."
    },
    {
      "duty": "Actively participate on assigned committees and meetings to support LTSS program functions."
    },
    {
      "duty": "Attend and complete all department-mandated training as well as satisfy educational in-service requirements."
    },
    {
      "duty": "Perform other related projects and duties as assigned."
    },
    {
      "duty": "Act as the member’s advocate and liaison by completing or facilitating interventions with providers and/or private, non-profit, and governmental agencies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degreeRN required, with current active RN licenseCCM certification preferred"
    }
  ]
}