{
  "meta": [
    {
      "job_title": "GENERAL SUPERINTENDENT",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 12
    },
    {
      "skill": "Field Supervision",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Lean Principles",
      "experience": 8
    },
    {
      "skill": "Relationship Building",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Microsoft Office",
      "experience": 6
    },
    {
      "skill": "Scheduling Software",
      "experience": 6
    },
    {
      "skill": "Document Management",
      "experience": 6
    },
    {
      "skill": "Layout Skill",
      "experience": 8
    },
    {
      "skill": "Crane Flagging and Rigging",
      "experience": 8
    },
    {
      "skill": "Labor Productivity",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others. Investigates safety incidents and retrains staff and needed."
    },
    {
      "duty": "Manages and oversees company staff, subcontractors, suppliers and programs such as Safety, Quality and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Develops work plans for subcontractors and self-performed work.Coordinates and manages the care, custody and control of the project site."
    },
    {
      "duty": "Creates, manages, changes and implements the project’s schedule as needed, in conjunction with the Project Manager."
    },
    {
      "duty": "Communicates key project information to owners, design team, governing authorities, subcontractors, suppliers and other departments."
    },
    {
      "duty": "Supports the MOC (Material and Other Costs) and DLSC (Dunn Logistics Service Center) procurement and approval processes."
    },
    {
      "duty": "Identifies and recruits top talent."
    },
    {
      "duty": "Understands and applies the terms and conditions of the owner and subcontractor contracts for the project."
    },
    {
      "duty": "Participates in the project buy out meetings with subcontractors and vendors."
    },
    {
      "duty": "Understands JE Dunn’s policy of non-discrimination and ensures positive, proactive implementation throughout the organization."
    },
    {
      "duty": "Manages the largest, most complex stand-alone and/or multiple complex projects from initial planning to completion."
    },
    {
      "duty": "Provides input, leads and executes company and regional key strategic initiatives."
    },
    {
      "duty": "Participates in the development of relevant company training content. Responsible for the selection and development of internal subject matter experts."
    },
    {
      "duty": "Effectively delivers leadership messages to multiple audiences both internally and externally."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering or related field (Preferred).In lieu of the above requirements, equivalent relevant experience will be considered."
    }
  ]
}