{
  "meta": [
    {
      "job_title": "Reservoir Simulation Engineer",
      "job_category": "Engineering",
      "job_class": "Senior",
      "sector": "Energy",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Lead and participate in integrated reservoir simulation studies, which include data analysis, model construction, history matching, calibration and prediction"
    },
    {
      "duty": "Act as technical advisor to management regarding best practices for reservoir simulation and modeling topics particularly for unconventional resources simulation challenges"
    },
    {
      "duty": "Work closely with Petroleum and Operations Engineers to generate, monitor, and ensure execution of short-term and long-term data gathering plans for their field (well tests, production logging tests, formation pressure data, etc.)"
    },
    {
      "duty": "Utilize petroleum engineering software pertaining to well test analysis, material balance, production logging, nodal analysis"
    },
    {
      "duty": "Apply special simulation modeling techniques such as fracture modeling, compositional, PVT modeling, coupling surface and sub-surface modeling, and complex well and smart completions"
    },
    {
      "duty": "Study and propose alternatives to optimize field development and maximize hydrocarbon recovery from new and mature fields"
    },
    {
      "duty": "Provide expert mentoring, training and teach in-house technical courses to develop young engineers"
    },
    {
      "duty": "Represent Saudi Aramco in external technical contacts with consultants and vendors, and participate in technical societies and groups"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in engineering, geology, geophysics or physics. MSc or PhD is desirable. A training history of appropriate specialized courses and seminars is expected. Technical publications are valued but in-depth practical experience is paramount. Extensive working knowledge of standard vendor applications for pre and post processing of simulation data."
    }
  ]
}