{
  "meta": [
    {
      "job_title": "Service Technician",
      "job_category": "Property Management",
      "job_class": "Technician",
      "sector": "Property Management",
      "salary": 45000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Carrying out maintenance processes of the property, including corrective, preventative, routine, emergency, and cosmetic maintenance."
    },
    {
      "duty": "Assisting in the make-ready process in a manner consistent with the property’s operational objectives under the supervision of the Service Supervisor and Community Manager."
    },
    {
      "duty": "Responding to resident/management requests and work orders for community common areas, buildings, and units in a timely manner."
    },
    {
      "duty": "Inspecting grounds, buildings, and other community features daily to identify, minimize and correct hazardous property conditions or liability concerns."
    },
    {
      "duty": "Maintaining preventative maintenance program that extends the life of the community while minimizing future repairs."
    },
    {
      "duty": "Assisting with the general upkeep, maintenance, and cleaning of office, common areas, and model unit."
    },
    {
      "duty": "Enforcing policies of the community that the immediate supervisor delegates."
    },
    {
      "duty": "Utilizing property resources, equipment, and supplies economically."
    },
    {
      "duty": "Performing additional tasks and responsibilities requested by Maintenance Supervisor and Community Manager."
    },
    {
      "duty": "Participating in on-call emergency at the community."
    },
    {
      "duty": "Managing excellent customer service and monitoring service request turnaround and responsiveness."
    },
    {
      "duty": "Projecting a favorable image of the community to achieve property objectives and public recognition."
    },
    {
      "duty": "Ensuring consistency in dealing with residents on all matters."
    },
    {
      "duty": "Reporting any observed violations of community rules and regulations to the Maintenance Supervisor and/or Community Manager."
    },
    {
      "duty": "Participating in unit inspections as requested."
    },
    {
      "duty": "Maintaining the hazard communications program; teaching and promoting safe work practices."
    },
    {
      "duty": "Maintaining accurate records regarding service requests, EPA/OSHA standards, preventative maintenance, apartment make-ready status, work in progress, etc."
    }
  ],
  "skills": [
    {
      "skill": "Maintenance Processes",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Property Management",
      "experience": 4
    },
    {
      "skill": "Preventative Maintenance",
      "experience": 3
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 3
    },
    {
      "skill": "Workplace Safety",
      "experience": 3
    },
    {
      "skill": "Record Keeping",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent (Trade School certification preferred)"
    }
  ]
}