{
  "meta": [
    {
      "job_title": "Operations Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Team Leader - Leads a multi-faceted team to exemplary performance through consistent coaching, encouragement, and performance feedback. Provides immediate guidance and reestablishes priorities when commitments are missed. Manages RbA operations to ensure successful project outcomes. Successfully holds teams accountable to established performance standards. Hires, develops, recognizes, and rewards high performing individuals and teams. Fosters a culture of service excellence. Works through the team to resolve customer issues and ensures communication is crisp and timely. De-escalates conflict and ensures resolutions align with company norms, standards, and core values."
    },
    {
      "duty": "Project Management - Ensure installations and customer satisfaction are of the highest quality. Ensures all projects are completed in accordance with RbA standards. Accountable to exceed monthly planned revenue and gross margin commitments. Plans, evaluates, monitors, forecasts, and reports the cost of operations. Manages installation and installation support labor to maintain capacity and maximize output while minimizing OT and expenses. Monitors and scrutinizes material and supply expenses and eliminates waste. Reviews, analyzes, and evaluates business procedures and makes recommendations to improve efficiency and experience. Ensures project roadblocks are identified, communicated, and rapidly resolved."
    },
    {
      "duty": "Safety - Oversees compliance with OSHA and site safety standards."
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 7
    },
    {
      "skill": "Conflict Resolution",
      "experience": 7
    },
    {
      "skill": "Customer Service Excellence",
      "experience": 7
    },
    {
      "skill": "Cost Analysis",
      "experience": 7
    },
    {
      "skill": "Efficiency Improvement",
      "experience": 7
    },
    {
      "skill": "Safety Compliance",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 135,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business or related field."
    }
  ]
}