{
  "meta": [
    {
      "job_title": "Research Assistant",
      "job_category": "Biomedical Research",
      "job_class": "Research Assistant",
      "sector": "Biomedical",
      "salary": 45000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Research",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Neuropsychiatric Assessments",
      "experience": 2
    },
    {
      "skill": "Psychology",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Recruitment",
      "experience": 2
    },
    {
      "skill": "Clinical Trials",
      "experience": 2
    },
    {
      "skill": "Quality Control",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in carrying out research studies in a team setting."
    },
    {
      "duty": "Administer computerized brain training exercises to older adults."
    },
    {
      "duty": "Maintain communication to monitor participant progress in their training exercises."
    },
    {
      "duty": "Obtain informed consent and administer neuropsychiatric assessments."
    },
    {
      "duty": "Collect, analyze, and enter data for clinical trials and ensure quality control."
    },
    {
      "duty": "Establish rapport with study participants and maintain contact with participants enrolled in the study."
    },
    {
      "duty": "Facilitate, support, and motivate older adult study participants during their study participation."
    },
    {
      "duty": "Communicate by email and phone with study participants to ensure adherence to intervention."
    },
    {
      "duty": "Participate in the mandatory lab meetings and implement study participant recruiting and screening protocols."
    },
    {
      "duty": "Meet recruitment and enrollment goals and determine if older adult participants meet study eligibility requirements."
    },
    {
      "duty": "Devote at least 5 hours weekly to telephone recruitment and interviewing."
    },
    {
      "duty": "Complete data forms with high accuracy and attention to detail."
    },
    {
      "duty": "Travel to and attend community events to assist with recruitment and facilitate meeting enrollment goals."
    },
    {
      "duty": "Disseminate information on studies to study participants and the general public."
    },
    {
      "duty": "Train any assistants and volunteers who gather and enter data."
    },
    {
      "duty": "Monitor compliance of study procedures with regulations and perform data quality control procedures."
    },
    {
      "duty": "Work with minimal supervision, plan, organize, and coordinate multiple work assignments and establish and maintain effective working relationships with others."
    },
    {
      "duty": "Effectively and professionally communicate sensitive information and maintain confidentiality."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "B.S or B.A. degree in biological or clinical sciences preferred."
    },
    {
      "credential": "Prior research experience"
    }
  ]
}