{
  "meta": [
    {
      "job_title": "Employee Relations Specialist",
      "job_category": "HR",
      "job_class": "Specialist",
      "sector": "Management",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Human Resources Investigation",
      "experience": 2
    },
    {
      "skill": "Employee Relations",
      "experience": 2
    },
    {
      "skill": "Workplace Compliance",
      "experience": 2
    },
    {
      "skill": "Workday",
      "experience": 2
    },
    {
      "skill": "Employee Law Knowledge",
      "experience": 2
    },
    {
      "skill": "Conflict Resolution",
      "experience": 2
    },
    {
      "skill": "Database Management",
      "experience": 2
    },
    {
      "skill": "Spanish Communication",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "HR Policy Management",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Efficiently enter and maintain employee data into Human Resources Information System (HRIS) with a high degree of accuracy and meeting all deadlines."
    },
    {
      "duty": "Manage employee relations workflow, including investigations, documentation, communication with candidates and management team, and follow-up."
    },
    {
      "duty": "Serve as the HR Business Partner for employees and managers, resolving employee relations issues, identifying training needs, and supporting development planning."
    },
    {
      "duty": "Lead workplace investigations, policy creation and interpretation, performance management, medical accommodations, workplace training, organizational change assessment, case data analytics, and other workplace projects impacting employee experience."
    },
    {
      "duty": "Handle a wide range of complex and highly sensitive employment situations and demonstrate strong emotional intelligence when interacting with employees at all levels of the organization."
    },
    {
      "duty": "Conduct complex and sensitive workplace investigations with little supervision, including determining appropriate investigation strategies, leading witness interviews and document review, and determining findings and recommendations for resolution."
    },
    {
      "duty": "Ensure compliance with company policies, procedures, and federal, state, and local laws and regulations related to Human Resources."
    },
    {
      "duty": "Respond to phone calls and emails regarding employee data and general human resources inquiries."
    },
    {
      "duty": "Assist with inquiries and issues related to benefits and other administrative HR processes."
    },
    {
      "duty": "Identify opportunities to improve HR programs and propose solutions to increase efficiencies across the team."
    },
    {
      "duty": "Partner with other department Managers to assess, respond, and escalate employee issues as needed to ensure appropriate resolution."
    },
    {
      "duty": "Manage monthly projects and reports and handle confidential information and matters of discretion in a professional manner."
    },
    {
      "duty": "Knowledge of workers' compensation processes, ADA accommodations, FMLA, and other LOA."
    },
    {
      "duty": "Escalate issues as necessary to HR Leadership and perform other duties as assigned by manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 30,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Employee Relations, Human Resources, or related field required, or three years of human resource experience, three years in employee relations, preferred. OR its equivalent through training, education, and other experience."
    }
  ]
}