{
  "meta": [
    {
      "job_title": "Fine Jewelry Associate",
      "job_category": "Sales",
      "job_class": "Associate",
      "sector": "Retail",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive store sales and metrics by outfitting each client with uniquely special jewelry pieces that symbolize intimate moments and create memories for years to come."
    },
    {
      "duty": "Develop customer relationships that span generations of family through excellent customer service and in-depth product knowledge."
    },
    {
      "duty": "Meet/exceed personal weekly, monthly, and annual sales goals."
    },
    {
      "duty": "Develop client base by asking each customer to complete a client profile card and using customer cards to drive Fine Jewelry sales and special events."
    },
    {
      "duty": "Assist customers in the selection of Fine Jewelry merchandise and offer complimentary items with each customer purchase."
    },
    {
      "duty": "Complete minor repairs on Fine Jewelry to include removing watch links, changing watch batteries, and maintain Fine Jewelry merchandising and visual standards."
    },
    {
      "duty": "Check-in and replenish merchandise inside case lines, prepare merchandise transfers and repairs, and complete customer repair envelopes."
    },
    {
      "duty": "Follow all procedures for inventory counts, move to Clearance projects, and maintain Belk professional standards for dress attire and appearance."
    },
    {
      "duty": "Cooperate and collaborate with fellow associates, management, and business partners."
    },
    {
      "duty": "Complete all required Fine Jewelry Training and pass quizzes with a minimum score of 80."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma. Fine Jewelry experience preferred, retail or sales experience required."
    }
  ]
}