{
  "meta": [
    {
      "job_title": "Hospitalist",
      "job_category": "Healthcare",
      "job_class": "Physician",
      "sector": "Healthcare",
      "salary": 200000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medical Care Services",
      "experience": 5
    },
    {
      "skill": "Inpatient Care Coordination",
      "experience": 5
    },
    {
      "skill": "Medical Documentation",
      "experience": 5
    },
    {
      "skill": "Emergency Response",
      "experience": 5
    },
    {
      "skill": "Patient Care Coordination",
      "experience": 5
    },
    {
      "skill": "Medical Record Keeping",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Medical Staff Privileges",
      "experience": 5
    },
    {
      "skill": "Board Certification",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide medical care services to the inpatient population including admission, inpatient care coordination, and discharge."
    },
    {
      "duty": "Collaborate with various medical disciplines across the organization while providing excellent patient care and completing care documentation and other administrative functions required of the physician."
    },
    {
      "duty": "Engage in hospital care improvement processes and respond to CODE BLUE and acute emergencies as required."
    },
    {
      "duty": "Arrange and conduct family meetings where appropriate and coordinate care with all members of the health care team to assure quality and efficiency."
    },
    {
      "duty": "Prepare medical records and patient progress notes in a timely and accurate fashion, in compliance with applicable facility and governmental guidelines."
    },
    {
      "duty": "Participate in patient satisfaction, utilization management, and other quality improvement activities and comply with applicable Rules and Regulations of the facility and abide by all requirements of the facility’s Medical Staff Bylaws."
    },
    {
      "duty": "Perform all services, acts, and duties connected with the position in accordance with the mission, vision, and values of the organization."
    },
    {
      "duty": "Complete other administrative duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of an AMA approved school of medicine or osteopathy (ECFMG candidate if foreign medical school graduate). Licensed to practice medicine in the State of Virginia required. Active DEA License required. AHA BLS Provider CPR required. Must be eligible for participation in Medicare, Medicaid, and third party insurances. Must complete Board Certification in Family Medicine or Internal Medicine or Board Eligible within 5 years of completion of residency training. Authorized to work in the United States. Prior Hospitalist experience preferred."
    }
  ]
}