{
  "meta": [
    {
      "job_title": "Life and Health Underwriter",
      "job_category": "Underwriting",
      "job_class": "Entry Level",
      "sector": "Insurance",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Interpersonal Skills",
      "experience": 0
    },
    {
      "skill": "Underwriting",
      "experience": 0
    },
    {
      "skill": "Fantaculative Life Risk Selection",
      "experience": 0
    },
    {
      "skill": "Insurance Concepts",
      "experience": 0
    },
    {
      "skill": "Project Management",
      "experience": 0
    },
    {
      "skill": "Social Media Management",
      "experience": 0
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and maintain profitable relationships with key clients, underwriting U.S. Life and Health business, and working with clients and internal cross-functional teams as needed."
    },
    {
      "duty": "Gain and maintain knowledge of basic insurance products and concepts, as well as changes in both industry initiatives and principles of risk selection."
    },
    {
      "duty": "Assess data, medical, and financial documents to provide accurate and competitive facultative life risk selection while meeting communicated time service standards and production goals."
    },
    {
      "duty": "Contribute to testing activities, providing training and documentation to the wider underwriting department."
    },
    {
      "duty": "Support continuing education by regularly attending external and internal training programs, forums, meetings, and webinars."
    },
    {
      "duty": "Provide strategic support and handle projects and other responsibilities as determined."
    },
    {
      "duty": "Interact positively and effectively with staff, clients, and other divisions to allow efficient underwriting departmental operation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 100,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor, Master, or PhD degree with up to 3 years professional experience"
    }
  ]
}