{
  "meta": [
    {
      "job_title": "Control Systems Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 95000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs complex activities related to the continued design, development, implementation and acceptance tests of Mechanical, Electrical, Show and / or Ride control systems and software systems modification projects for increased reliability and operational improvements."
    },
    {
      "duty": "Modifies and/or renovates hardware and/or software of complex electrical and control systems to improve safety, reliability, throughput, cost of ownership, and operational readiness."
    },
    {
      "duty": "Produces scopes of work and manage progress from design through installation for assigned projects."
    },
    {
      "duty": "Coordinates assigned engineering activities between vendors, ride supervisors, ride managers and technicians."
    },
    {
      "duty": "Prepares and reviews equipment specifications and performs technical evaluation of vendor products/services."
    },
    {
      "duty": "Develops and conducts Acceptance Test Procedures on control systems."
    },
    {
      "duty": "Maintains configuration management of hardware and software documentation in accordance with Engineering’s guidelines for proper archiving and security."
    },
    {
      "duty": "Required to develop and present technical project overviews, detailed and specific engineering issues to various levels of management."
    },
    {
      "duty": "Understands and actively participates in Environmental, Health & Safety responsibilities by following established UO policy, procedures, training and team member involvement activities."
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Engineering",
      "experience": 8
    },
    {
      "skill": "Electrical Engineering",
      "experience": 8
    },
    {
      "skill": "Control System Design",
      "experience": 8
    },
    {
      "skill": "PLCs Programming",
      "experience": 8
    },
    {
      "skill": "Fault Analysis",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Vendor Management",
      "experience": 8
    },
    {
      "skill": "Technical Presentation",
      "experience": 8
    },
    {
      "skill": "Health & Safety Compliance",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from a four-year college or university in Mechanical Engineering, Electrical Engineering, Computer Engineering, or related field is required. Master’s degree from a four-year college or university in Electrical Engineering, Electrical Engineering Technology, Computer Engineering, or related field preferred."
    }
  ]
}