{
  "meta": [
    {
      "job_title": "Shop Supervisor",
      "job_category": "Maintenance",
      "job_class": "Supervisor",
      "sector": "Maintenance",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Truck-Trailer Repair",
      "experience": 4
    },
    {
      "skill": "Commercial Driver’s License (CDL) Class A",
      "experience": 4
    },
    {
      "skill": "Safety Compliance",
      "experience": 4
    },
    {
      "skill": "DOT and CVSA Rules",
      "experience": 4
    },
    {
      "skill": "Parts Ordering and Inventory Management",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage maintenance schedule and ensure high-quality work is performed while adhering to delivery schedules."
    },
    {
      "duty": "Communicate with service vendors as appropriate, when outsourcing of work is necessary."
    },
    {
      "duty": "Make the appropriate recommendations for the outsourcing of work to ensure the optimization of service efficiency while minimizing overall costs."
    },
    {
      "duty": "Responsible for performing diagnostic inspections on general truck-tractor systems utilizing mechanical and design software diagnostics."
    },
    {
      "duty": "Ability to complete preventative maintenance inspection of truck-tractor components."
    },
    {
      "duty": "Responsible for making repairs to truck-tractor components."
    },
    {
      "duty": "Complete the required paperwork to reflect hours, parts, and lube, utilized within each job function."
    },
    {
      "duty": "Make road calls when component failure is in a remote location."
    },
    {
      "duty": "Ability to coordinate truck arrival and departures including receipt of proper documentation and lot parking assignments."
    },
    {
      "duty": "Ability to work in a team-based environment and work with little to no supervision."
    },
    {
      "duty": "Provide superior customer service to clients."
    },
    {
      "duty": "Order parts for trucks and stock."
    },
    {
      "duty": "Perform inventory management audits for all parts."
    },
    {
      "duty": "Support Used Truck Center Manager with responsibilities as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED required."
    }
  ]
}