{
  "meta": [
    {
      "job_title": "Project Controls Specialist",
      "job_category": "Project Management",
      "job_class": "Specialist",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leading the project controls processes with the internal project management team to execute project deliverables within budget and schedule."
    },
    {
      "duty": "Developing, implementing, and maintaining external and internal cost reports, cash flows, and forecasts."
    },
    {
      "duty": "Developing and maintaining schedules in Oracle Primavera P6 ranging from 20 to 200 activities."
    },
    {
      "duty": "Working with 5-6 project managers concurrently to support projects in various phases of design and construction."
    },
    {
      "duty": "Loading and maintaining resources within the schedule."
    },
    {
      "duty": "Ensuring quality checks and inspections on project controls deliverables."
    },
    {
      "duty": "Comparing schedules to financial data to ensure consistency of project timeline."
    },
    {
      "duty": "Ensuring project set-up in Oracle Financial MIS/PPS Accounting Module or Oracle Primavera Contracts Manager Program."
    },
    {
      "duty": "Communicating and understanding the technical progress of electric utility transmission lines, substations, and/or telecommunication projects."
    },
    {
      "duty": "Integrating schedule data and other data sources in Excel via formulas, pivot tables, macros, etc."
    },
    {
      "duty": "Analyzing data, reviewing logs, and running reports in Oracle Primavera Contracts Manager software and/or the Oracle Financials MIS/PPS Accounting software."
    },
    {
      "duty": "Setting up Work Breakdown Structure (WBS) for tracking a detailed breakdown of purchase orders or subcontracts."
    },
    {
      "duty": "Ensuring budget tracking against Purchase Orders or Subcontracts."
    },
    {
      "duty": "Managing the internal Change Management System."
    },
    {
      "duty": "Reviewing upstream (prime contract) / downstream (PO & subcontract) change orders."
    },
    {
      "duty": "Setting up Work Breakdown Structure (WBS) in Oracle Primavera 6 or Microsoft Project scheduling software."
    },
    {
      "duty": "Entering logic ties within the schedules."
    },
    {
      "duty": "Creating various schedule reports and determining the appropriate reporting formats."
    },
    {
      "duty": "Consulting with the project controls team on schedule progress."
    },
    {
      "duty": "Monitoring resource loading of a schedule."
    },
    {
      "duty": "Analyzing and reporting on data from Oracle Primavera P6."
    },
    {
      "duty": "Developing pre-programmed project scheduling reports in P6 and reviewing and analyzing backup documentation for accuracy."
    }
  ],
  "skills": [
    {
      "skill": "Project Scheduling",
      "experience": 5
    },
    {
      "skill": "Resource Loading",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Oracle Primavera",
      "experience": 5
    },
    {
      "skill": "Excel Data Integration",
      "experience": 5
    },
    {
      "skill": "Cost Control",
      "experience": 5
    },
    {
      "skill": "Project Progress Monitoring",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Budget Tracking",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering, Construction Management, or a related field. Applicable experience may be substituted for the degree requirement."
    }
  ]
}