{
  "meta": [
    {
      "job_title": "Real Estate Financial Analyst",
      "job_category": "Financial Analysis",
      "job_class": "Analyst",
      "sector": "Real Estate",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Financial Modeling",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Due Diligence",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct financial analysis of development opportunities, including the creation of detailed pro-forma and financial models."
    },
    {
      "duty": "Gather, compile, investigate, and analyze market data to identify potential development opportunities, and prepare investment committee memos, detailed reports, and market summaries."
    },
    {
      "duty": "Identify, investigate, and refer potential acquisitions and other real estate transactions to appropriate leaders, and assist in preparing financial, market, and other documents for new business pitches and RFPs."
    },
    {
      "duty": "Organize, lead, and/or participate in the due diligence on properties under contract, and develop documentation and recommendations on key findings that may affect the return and financial performance of the proposed deal."
    },
    {
      "duty": "Conduct market research through internal and external sources, engage with local junior brokers, and participate in industry organizations to build relationships with local real estate professionals and other key stakeholders."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, or a related field (Master's preferred)"
    }
  ]
}