{
  "meta": [
    {
      "job_title": "Crane Automation Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sensors",
      "experience": 4
    },
    {
      "skill": "Database Management",
      "experience": 4
    },
    {
      "skill": "Automation Systems",
      "experience": 4
    },
    {
      "skill": "Communication Methods Standardization",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Technical Leadership",
      "experience": 4
    },
    {
      "skill": "Problem-Solving",
      "experience": 4
    },
    {
      "skill": "Team Development",
      "experience": 4
    },
    {
      "skill": "Decision-Making",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Travel Management",
      "experience": 4
    },
    {
      "skill": "Technical Report Writing",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and program the ASRS (Automatic Storage and Retrieval System) for the production environment."
    },
    {
      "duty": "Embrace safety principles to build a zero-injury culture and recognize and prevent safety issues early in the project cycle."
    },
    {
      "duty": "Engage in broader regional or global EHS initiatives and participate in the development of standards for EHS initiatives."
    },
    {
      "duty": "Partner with site, regional, and global teams to ensure project requirements and feedback are translated to project team actions."
    },
    {
      "duty": "Lead project teams to tackle customer and/or operational problems and report the findings to stakeholders."
    },
    {
      "duty": "Influence Site decision-making by preparing and communicating technical information on matters related to Automation Level 2 Systems."
    },
    {
      "duty": "Assess the viability of technologies, processes, or methods and make recommendations as to the best application for broadly implemented solutions."
    },
    {
      "duty": "Present technical information to peers or business leaders and influence technical decisions."
    },
    {
      "duty": "Support the introduction of Industry 4.0 within the molten metal and rolling manufacturing environment."
    },
    {
      "duty": "Innovate and develop new techniques, processes, and develop standard methodologies and initiatives."
    },
    {
      "duty": "Participate in multidisciplinary groups to work through problems from multiple dimensions and drive them towards customer centric solutions."
    },
    {
      "duty": "Systematically analyze the business value and viability of ideas generated by self or project teams to arrive at solutions to routine manufacturing issues."
    },
    {
      "duty": "Maintain a network of technical contacts within and outside of the organization and facilitate translation of sophisticated data interdependencies to the Automation teams, MES teams, data engineers."
    },
    {
      "duty": "Compile results and prepare technical reports and documentation of outcomes to ensure knowledge capture."
    },
    {
      "duty": "Identify the need for training classes for technical and non-technical stakeholders and assist with the development of curriculum."
    },
    {
      "duty": "Design, develop, and implement knowledge transfer initiatives to make effective utilization of both implicit and explicit knowhow in the organization."
    },
    {
      "duty": "Manage the interpersonal dynamics in the project team in order to achieve a constructive outcome at individual, team, and organizational levels."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS in Computer Science, Engineering, or a related technical field (STEM)."
    }
  ]
}