{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for overall management of assigned projects, including field coordination, surveyors, and technicians."
    },
    {
      "duty": "Manage day-to-day operations, proposals/estimates, workload distribution, and invoicing."
    },
    {
      "duty": "Work closely with project team to transition projects seamlessly from one phase to the next."
    },
    {
      "duty": "Perform all duties and responsibilities of a field surveyor."
    },
    {
      "duty": "Maintain clear and timely communications, professionalism, and morale throughout the internal and external project team."
    },
    {
      "duty": "Provide leadership to staff and project team members, establish clear performance standards, and motivate team members."
    },
    {
      "duty": "Contribute to financial growth through cost-effective operations of projects."
    },
    {
      "duty": "Allocate manpower and resources for timely and budget-compliant project completion."
    },
    {
      "duty": "Facilitate the development of technical, management, and communication skills for project team."
    },
    {
      "duty": "Prepare and review proposals, contracts, and project schedules for maximum profitability."
    },
    {
      "duty": "Maintain client relationships and aid in the development of prospective clients in the geographic market."
    },
    {
      "duty": "Enhance the corporate image through active participation in appropriate organizations and significant client contact."
    },
    {
      "duty": "Maintain a working knowledge of AutoCAD, word processing, and spreadsheet programs."
    },
    {
      "duty": "Contribute to overall team efforts by completing other assigned duties."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "AutoCAD",
      "experience": 5
    },
    {
      "skill": "Technical Skills Development",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Professional land surveyor's license or equivalent project management experience."
    }
  ]
}