{
  "meta": [
    {
      "job_title": "Blaster",
      "job_category": "Engineering",
      "job_class": "Specialist",
      "sector": "Engineering",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Explosives Handling",
      "experience": 5
    },
    {
      "skill": "Blast Design",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Safety Procedures",
      "experience": 5
    },
    {
      "skill": "Technical Report Writing",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Regulatory Knowledge",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, layout, prepare, and detonate planned explosive related blasts with correct products, measured quantities, safe application, and effective use of explosives in alignment with Service operations Manual to meet customer's requirements."
    },
    {
      "duty": "Lead the blast crew and provide on-the-job training to blasters in-training positions."
    },
    {
      "duty": "Knowledgeable and use practices consistent with company policies and procedures from applicable technical modules, DNA Surface Blasting SOP, worksite task training, regulatory and safety policies and procedures."
    },
    {
      "duty": "Thorough knowledge of Dyno Nobel products, Dyno Nobel product applications, competitor’s products, blasting practices, and mining\\quarry industry principles."
    },
    {
      "duty": "General knowledge and understanding of explosives technology, basic geology, and seismology."
    },
    {
      "duty": "Ability to competently complete the Electronic Blasting Report, inventory records, and other appropriate documentation."
    },
    {
      "duty": "Ability to use LAZER system."
    },
    {
      "duty": "Design the appropriate use of explosives to properly meet customers' requirements."
    },
    {
      "duty": "Investigate all product complaints and poor performing blasts and report these to the proper plants, regional management and the Technical Service Resource."
    },
    {
      "duty": "Support DynoConsult to develop expert capability in Value-In-Use products and applications, including electronic detonators, Titan emulsions, and blasting improvement technology."
    },
    {
      "duty": "Support region and DynoConsult management to increase market position and revenue from customers including DEDA/JV members, independent distribution, and direct sales to support EBIT objectives."
    },
    {
      "duty": "Work with the Industry Sales Team on technical sales and marketing support for targeted national / major accounts."
    },
    {
      "duty": "Develop professional relationships with both internal and external customers to successfully meet objectives and add value for customers, joint ventures, manufacturing sites, and distribution."
    },
    {
      "duty": "Respond professionally and timely to address problems and business requests."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Blaster license required. Minimum of one year of related explosives industry work (i.e. bulk truck operator, de-watering truck operator). Must be willing to undergo and pass an ATF background check as required to be a possessor of explosives. Must be at least 21 years of age. Positive attitude, friendly demeanor, and a team player."
    }
  ]
}