{
  "meta": [
    {
      "job_title": "Office Manager",
      "job_category": "Administration",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Office Management",
      "experience": 5
    },
    {
      "skill": "Bookkeeping",
      "experience": 5
    },
    {
      "skill": "Office Software",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Email Management",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide ongoing bookkeeping and administrative support to the office, driving organizational success through the management of daily operations and special projects."
    },
    {
      "duty": "Coordinates vehicle maintenance and associated invoicing of TWC’s fleet."
    },
    {
      "duty": "Provides backup as needed of human resource tasks for the organization including new employee office set-ups and on-boarding."
    },
    {
      "duty": "Provides assistance to the Finance department including receipt matching."
    },
    {
      "duty": "Handles matters expeditiously, proactively, and follows-through on projects to successful completion, often with deadline pressures."
    },
    {
      "duty": "Monitor, manage and maintain office equipment and supplies; request repair or restocking when necessary."
    },
    {
      "duty": "Manages PO box, picks up mail and distributes to necessary departments, while also overseeing the general info email inbox for the company."
    },
    {
      "duty": "Conducts research, compiles data and prepares reports for the Executive team, as needed."
    },
    {
      "duty": "Manages file archives and retrieval"
    },
    {
      "duty": "Front door reception and answering incoming internal and external calls and provides exceptional customer service by using critical thinking, problem solving and/or forwarding the call to the appropriate department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Associates degree in office administration or related field preferred."
    }
  ]
}