{
  "meta": [
    {
      "job_title": "Safety Manager",
      "job_category": "Safety",
      "job_class": "Manager",
      "sector": "Safety",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee all Safety Committees and conduct frequent audits of the workplace."
    },
    {
      "duty": "Identify potential hazards and recommend corrective actions and ensure resolution of hazards."
    },
    {
      "duty": "Prepare, monitor, and distribute an Open Safety Items Log."
    },
    {
      "duty": "Administer the company's procedures related to safety and health, and environmental compliance (ISO 14001)."
    },
    {
      "duty": "Conduct training and retraining of the procedures in accordance with each procedure."
    },
    {
      "duty": "Investigate accidents and injuries, and assist supervisors in the completion of accident investigation reports and problem-solving activities."
    },
    {
      "duty": "Provide insight and input to appropriate engineering personnel to identify solutions to repetitive injuries and/or develop solutions to workplace ergonomic improvements."
    },
    {
      "duty": "Supervise the company's Emergency Response Plan and schedule unannounced annual drills (Evacuation/Emergency Shelter/Spill Drills)."
    },
    {
      "duty": "Conduct routine Job Safety Analysis (JSA) for new and existing work stations to identify and eliminate hazards, and to provide training and re-training to supervisors and employees."
    },
    {
      "duty": "Oversee the monthly visits of contractors providing safety and health services, i.e., fire extinguishers, first aid kits and OTC medication vending machines."
    },
    {
      "duty": "Oversee Forklift Safety Programs to ensure employees are qualified and well-trained."
    },
    {
      "duty": "Analyze monthly and annual injury statistics to determine why employees are injured and recommend corrective actions when appropriate."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in safety or related area, or equivalent work experience. CSP preferred. Working knowledge of OSHA and Ohio Workers’ Compensation regulations. Working knowledge of TS 16949 and ISO 14001. Familiarity with ergonomic philosophy and working knowledge of safety and health issues in a heavy industrial environment."
    }
  ]
}