{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 52000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the management and supervision of all areas assigned by the Store Manager and follows policies in regard to Customers, Associates and merchandising."
    },
    {
      "duty": "Leads all Company Best Practices and maximizes productivity by minimizing steps and touches while working."
    },
    {
      "duty": "Assists in the analysis of Store reports to evaluate controllable expenses and overall Store performance."
    },
    {
      "duty": "Assists in recruiting, hiring, training and developing non-exempt Associates."
    },
    {
      "duty": "Ensures compliance of Ross personnel policies and procedures."
    },
    {
      "duty": "Assists with training Associates on Loss Prevention awareness and Store shortage goals."
    },
    {
      "duty": "Maintains and models a professional appearance, in accordance with the Company Dress Code."
    },
    {
      "duty": "Ensures recovery, sizing and markdowns are completed to Company standards through teaching, assigning tasks, and following up per Company best practice."
    },
    {
      "duty": "Urgently manages merchandise processing to the sales floor within the expected Company timeframe."
    },
    {
      "duty": "Understands that safety is the number one priority and practices safe behaviors in everything they do."
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 4
    },
    {
      "skill": "Loss Prevention",
      "experience": 3
    },
    {
      "skill": "Training and Development",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Two or more years of Store or Assistant Store Manager experience in a retail environment."
    },
    {
      "credential": "Fluency in English."
    }
  ]
}