{
  "meta": [
    {
      "job_title": "Medicare Enrollment Lead",
      "job_category": "Enrollment",
      "job_class": "Manager",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Medicare Advantage Enrollment",
      "experience": 6
    },
    {
      "skill": "Supervisory Responsibilities",
      "experience": 3
    },
    {
      "skill": "MS Office Applications",
      "experience": 6
    },
    {
      "skill": "Communication Skills",
      "experience": 6
    },
    {
      "skill": "Training and Development",
      "experience": 3
    },
    {
      "skill": "Process Improvement",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Accurate and timely processing of Medicare enrollment transactions using payer-specific policies and procedures"
    },
    {
      "duty": "Managing the Enrollment Analyst staff and assisting in managing high-priority enrollment issues"
    },
    {
      "duty": "Interacting with client organizations to help run a high-quality Enrollment operation"
    },
    {
      "duty": "Advising on complex flagged or other TRCs based on approved desk-level procedures and resolving pended enrollment records"
    },
    {
      "duty": "Collaborating on special projects as assigned by the Medicare Enrollment and Billing Director"
    },
    {
      "duty": "Developing knowledge of CMS Manual, Chapter 2, Enrollment and Disenrollment Sections 30 and 40 terms, terminology, and concepts of election periods, enrollment, and disenrollment"
    },
    {
      "duty": "Reviewing enrollment audit findings and implementing process improvement initiatives and skills enhancement training"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree required with 6+ years of relevant professional Medicare Advantage Enrollment operations for an insurance company or healthcare payor, with 3 years of progressive supervisory responsibilities. Willingness to learn new skills and succeed in a new career."
    }
  ]
}