{
  "meta": [
    {
      "job_title": "Senior Analyst, NA Marketing Technology",
      "job_category": "Technology",
      "job_class": "Analyst",
      "sector": "Business Solutions",
      "salary": 100000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Requirement Gathering",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    },
    {
      "skill": "MarTech Ecosystem",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Agile Project Management",
      "experience": 5
    },
    {
      "skill": "Visualization Tools",
      "experience": 5
    },
    {
      "skill": "IT Knowledge",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Research and Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Analyzing business requirements, developing solutions, testing, and validating solutions, and documenting and training materials."
    },
    {
      "duty": "Identifying gaps, pain points, and inefficiencies in the existing process and turning the requirements into user stories for the technical product owner to review/sign-off on."
    },
    {
      "duty": "Supporting fast prototyping and proof of concept with emerging technologies like Artificial Intelligence and Intelligent Automation."
    },
    {
      "duty": "Analyzing data to identify trends, patterns, and insights that can help improve business processes."
    },
    {
      "duty": "Testing and validating the solutions that the team configures and creating documentation and training materials for user understanding."
    },
    {
      "duty": "Supporting the technical product owner with managing stakeholders and ensuring that their needs are being met, and tracking through KPIs."
    },
    {
      "duty": "Supporting the delivery and ongoing operations of multi-year product roadmaps, including critical marketing centric initiatives."
    },
    {
      "duty": "Supporting the execution of individual initiatives through the development and application of standard scope, schedule, budget, resource, and risk/issue management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree required, preferably in computer information systems, information technology, or computer science. Master's degree preferred."
    }
  ]
}