{
  "meta": [
    {
      "job_title": "LVN Nurse",
      "job_category": "Nursing",
      "job_class": "Licensed Vocational Nurse",
      "sector": "Healthcare",
      "salary": 62749,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Nursing Care",
      "experience": 5
    },
    {
      "skill": "Patient Advocacy",
      "experience": 5
    },
    {
      "skill": "Clinical Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Documenting Patient Care",
      "experience": 5
    },
    {
      "skill": "Assessment Data Collection",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform individualized nursing care for patients/families under the direction of an RN."
    },
    {
      "duty": "Use and practice basic assessment data collection, participate in planning, and execute interventions in accordance with the Plan Of Care."
    },
    {
      "duty": "Contribute to the evaluation of outcomes and communicate to ensure patient/family educated Plan Of Care and planned treatments."
    },
    {
      "duty": "Collect assessment data per department guidelines of care, including age/cultural specific considerations and document data collected."
    },
    {
      "duty": "Communicate with other healthcare team members to coordinate patient care activities, workflow, and patient progress."
    },
    {
      "duty": "Implement plan of care per department guidelines, refer practices outside of scope to RN and seek out resources when appropriate in new situations."
    },
    {
      "duty": "Give constructive feedback to peers regarding work performance and notify supervisors of suspected performance issues."
    },
    {
      "duty": "Encourage patient and family participation in decision making and act to uphold individual/family rights."
    },
    {
      "duty": "Identify learning needs including barriers/readiness, recognize barriers to communication with patient and family and seek interdisciplinary expertise to establish a therapeutic relationship."
    },
    {
      "duty": "Demonstrate understanding of patient/family goals and make recommendations to the multidisciplinary team in development of the patient's plan of care."
    },
    {
      "duty": "Collect data indicative of patient/family response to care per department guidelines and contribute observations and data to patient care conferences."
    },
    {
      "duty": "Document patient and family care needs through documentation per department/entity guideline of care and policies and procedures."
    },
    {
      "duty": "Evaluate patient and family learning through use of adult-learning theory and revise plan as appropriate."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "1 Year LVN experience in an acute care setting or related area. AHA Basic Life Support for Healthcare Professional (AHA BLS Healthcare) - American Heart Association -REQUIRED. California Licensed Vocational Nurse (LVN) - CA Board of Vocational Nursing & Psychiatric Technicians -REQUIRED. Vocational Nurse IV Therapy/Blood Withdrawal Certification - Various-Employee provides certificate -PREFERRED"
    }
  ]
}