{
  "meta": [
    {
      "job_title": "Directeur adjoint de succursale",
      "job_category": "Management",
      "job_class": "Assistant Manager",
      "sector": "Sales",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Gestion du marché",
      "experience": 3
    },
    {
      "skill": "Service à la clientèle",
      "experience": 3
    },
    {
      "skill": "Gestion des stocks",
      "experience": 3
    },
    {
      "skill": "Gestion des opérations",
      "experience": 3
    },
    {
      "skill": "Gestion financière",
      "experience": 3
    },
    {
      "skill": "Recrutement et planification du personnel",
      "experience": 3
    },
    {
      "skill": "Compétences en communication",
      "experience": 3
    },
    {
      "skill": "Leadership d'équipe",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Contribuer à l’élaboration et à la mise en œuvre du plan de marché de la succursale en fonction des conditions du marché, de la mission de la succursale et des objectifs financiers/budgétaires."
    },
    {
      "duty": "Vérifier que toutes les transactions sont traitées correctement par le système d’exploitation informatique de la succursale."
    },
    {
      "duty": "S’assurer que les clients sont servis de manière appropriée et professionnelle en répondant à leurs questions et à leurs plaintes. "
    },
    {
      "duty": "S’assurer que toutes les commandes des clients sont préparées avec précision et que les dossiers sont conservés."
    },
    {
      "duty": "Maintenir les niveaux d’inventaire de la succursale pour maximiser les ventes et la rotation des stocks."
    },
    {
      "duty": "Respecter les normes de sécurité de l’entreprise, les pratiques de prévention des pertes et de sécurité; confirmer qu’elles sont suivies par tous les employés de la succursale conformément à la politique; corriger ou signaler les cas de non-conformité."
    },
    {
      "duty": "Aider à effectuer les dépôts bancaires quotidiens."
    },
    {
      "duty": "Examiner fréquemment les rapports de gestion/financiers afin d’optimiser les performances financières de la succursale."
    },
    {
      "duty": "Déterminer les besoins en personnel, recruter les employés de la succursale en conséquence avec l’approbation appropriée, et établir les horaires de travail correspondants."
    },
    {
      "duty": "Effectuer des calculs mathématiques de base et des ratios financiers relatifs aux profits et pertes."
    },
    {
      "duty": "Prendre des décisions de manière autonome."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Diplôme d’études secondaires ou l’équivalent."
    }
  ]
}