{
  "meta": [
    {
      "job_title": "Appointment Setter",
      "job_category": "Sales",
      "job_class": "Specialist",
      "sector": "Sales",
      "salary": 38000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Strategically initiate outbound calls, emails, or other communication methods to connect with potential clients from designated leads or lists."
    },
    {
      "duty": "Present company's comprehensive offerings with depth and precision, showcasing key benefits and value propositions tailored to potential clients."
    },
    {
      "duty": "Skillfully engage potential clients in conversations to discern their needs, challenges, and specific requirements, accurately assessing their alignment with our services."
    },
    {
      "duty": "Execute seamless appointment scheduling by coordinating potential clients' availability with the complex schedules of our sales representatives."
    },
    {
      "duty": "Maintain an impeccably organized CRM system by consistently updating interaction details, appointments, and critical client information."
    },
    {
      "duty": "Employ expertise to deliver timely follow-ups to nurture potential clients who display interest but haven't yet committed to an appointment."
    },
    {
      "duty": "Collaborate closely with the sales team, providing comprehensive insights and context ahead of their scheduled appointments."
    },
    {
      "duty": "Consistently surpass weekly and monthly targets, achieving outstanding appointment setting and lead conversion results."
    },
    {
      "duty": "Continuously update knowledge of company's offerings, industry trends, and competitors to provide informed responses to potential client queries."
    }
  ],
  "skills": [
    {
      "skill": "Sales Communication",
      "experience": 3
    },
    {
      "skill": "CRM Management",
      "experience": 3
    },
    {
      "skill": "Email Communication",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Target Achievement",
      "experience": 3
    },
    {
      "skill": "Product Knowledge",
      "experience": 3
    },
    {
      "skill": "Lead Generation",
      "experience": 3
    },
    {
      "skill": "Client Follow-up",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or Equivalent"
    }
  ]
}