{
  "meta": [
    {
      "job_title": "Forklift Operator",
      "job_category": "Logistics",
      "job_class": "Operator",
      "sector": "Supply Chain",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Forklift Operation",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Safety Procedures",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Safely operate forklift to pick up, move, place, and position merchandise pallets."
    },
    {
      "duty": "Receive, stock, and organize merchandise and supplies from distribution centers and suppliers throughout the facility."
    },
    {
      "duty": "Provide member service by acknowledging member needs, assisting with purchasing decisions, and resolving member issues and concerns."
    },
    {
      "duty": "Maintain safety of the facility by conducting safety sweeps, following safety procedures, and reporting unsafe situations to management."
    },
    {
      "duty": "Maintain sales floor and merchandising presentation in accordance with company policies."
    },
    {
      "duty": "Ensure club pick up orders are filled by picking club pick up orders throughout the day and staging products according to company policy."
    },
    {
      "duty": "Handle, move, and display goods in safe and correct ways while tracking goods, maintaining in-stock levels, and controlling shrinkage."
    },
    {
      "duty": "Operate and maintain forklifts in safe and correct ways, and report poor or unsafe conditions or practices."
    },
    {
      "duty": "Proactively identify customers who need help, engage them, and assist them with technology services and items. Identify shrink opportunities and problems with products and services, and takes steps to fix the problem."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "90 days of prior experience with forklift certification. Ability to safely utilize pallet jacks. Must be 18 years of age or older."
    }
  ]
}