{
  "meta": [
    {
      "job_title": "Radiology Aide",
      "job_category": "Healthcare",
      "job_class": "Radiology Aide",
      "sector": "Healthcare",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Anatomical Orientation",
      "experience": 2
    },
    {
      "skill": "Universal Precautions",
      "experience": 2
    },
    {
      "skill": "Aseptic Techniques",
      "experience": 2
    },
    {
      "skill": "Basic Life Support",
      "experience": 2
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 3
    },
    {
      "skill": "Patient Care",
      "experience": 3
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 3
    },
    {
      "skill": "Confidentiality",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist radiologists and technologists with patient care and maintenance of departmental inventory and equipment."
    },
    {
      "duty": "Administer oral contrast material to outpatients and walk them to the patient changing area."
    },
    {
      "duty": "Practice aseptic techniques and strictly obey isolation and infection control procedures."
    },
    {
      "duty": "Assist in utilization of PACS, RIS, and HIS systems."
    },
    {
      "duty": "Take part in in-service programs for the staff and report any changes in patient's condition or behavior to technical or nursing personnel."
    },
    {
      "duty": "Provide direction to families, visitors, and patients in a courteous and positive manner and maintain and respect confidentiality."
    },
    {
      "duty": "Incorporate physiological and developmental age of patients into the overall plan for the delivery of care."
    },
    {
      "duty": "Work effectively as a member of a multidisciplinary team and perform the physical requirements of the job, including standing, walking, reaching, climbing, balancing, stooping, kneeling, and/or crouching."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent. Successful completion of one year of an Associate's of Science in Radiography program. American Heart Association Basic Life Support Certification."
    }
  ]
}