{
  "meta": [
    {
      "job_title": "JDE Transportation Consultant",
      "job_category": "Technology",
      "job_class": "Consultant",
      "sector": "Technology",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "JD Edwards EnterpriseOne",
      "experience": 10
    },
    {
      "skill": "Transportation Management System (TMS)",
      "experience": 10
    },
    {
      "skill": "Warehouse Management systems (WMS)",
      "experience": 10
    },
    {
      "skill": "Business Requirements Analysis",
      "experience": 10
    },
    {
      "skill": "Data Migration",
      "experience": 10
    },
    {
      "skill": "Integration Processes",
      "experience": 10
    },
    {
      "skill": "System Analysis",
      "experience": 10
    },
    {
      "skill": "Problem-solving",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Certifications in JD Edwards or transportation management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leverage expertise in JD Edwards EnterpriseOne to analyze, configure, and implement transportation solutions that optimize logistical processes."
    },
    {
      "duty": "Collaborate with business stakeholders to gather transportation requirements and translate them into effective JDE solutions."
    },
    {
      "duty": "Configure and customize JDE Transportation Management System (TMS) & Warehouse Management systems (WMS) modules to align with business needs and optimize transportation operations."
    },
    {
      "duty": "Participate in all phases of the project lifecycle, including requirements gathering, design, development, testing, and deployment."
    },
    {
      "duty": "Conduct system analysis to identify gaps and recommend solutions for transportation-related challenges."
    },
    {
      "duty": "Collaborate with technical teams to ensure seamless integration between JDE TMS/WMS and other systems."
    },
    {
      "duty": "Provide expertise in configuring transportation-related master data, including carriers, routes, shipping rules, and tariffs."
    },
    {
      "duty": "Assist in data migration and validation to ensure accurate and reliable transportation data within the JDE system."
    },
    {
      "duty": "Develop documentation, including functional specifications, test plans, and user training materials."
    },
    {
      "duty": "Conduct user training sessions to ensure effective utilization of the JDE TMS/WMS solution."
    },
    {
      "duty": "Provide post-implementation support and troubleshooting assistance to resolve any issues or concerns."
    },
    {
      "duty": "Stay updated on industry best practices and emerging trends in transportation management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Technology, Supply Chain Management, or related field (Master's preferred)"
    },
    {
      "credential": "Relevant certifications in JD Edwards or transportation management are a plus"
    }
  ]
}