{
  "meta": [
    {
      "job_title": "Executive Producer",
      "job_category": "Media",
      "job_class": "Producer",
      "sector": "Media",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "News Production",
      "experience": 5
    },
    {
      "skill": "Content Creation",
      "experience": 5
    },
    {
      "skill": "Social Media Management",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Broadcast Journalism",
      "experience": 5
    },
    {
      "skill": "News Judgment",
      "experience": 5
    },
    {
      "skill": "Copy Editing",
      "experience": 5
    },
    {
      "skill": "Creative Thinking",
      "experience": 5
    },
    {
      "skill": "Independent Work",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and manage news personnel; assignment editors, writers, producers, editors, anchors, reporters, digital."
    },
    {
      "duty": "Lead in the editorial process and occasionally produce content/newscasts in the newsroom, in the field and for news specials."
    },
    {
      "duty": "Ensure staff is producing visually dynamic content across all platforms and collaborate effectively with the newsroom."
    },
    {
      "duty": "Develop and assemble content on multiple platforms, incorporating and showcasing content from multiple platforms into newscasts."
    },
    {
      "duty": "Continually evolve the newscasts by working closely with news management and challenging the staff to perform at their highest levels every night."
    },
    {
      "duty": "Supervise the work of others and work in a fast-paced environment under specific time constraints."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Journalism or Communications and minimum four years recent experience in a newsroom as a senior news producer or executive producer."
    },
    {
      "credential": "Exceptional news judgment, strong writing, and copy editing abilities."
    },
    {
      "credential": "Demonstrated ability to think out of the box and find new ways to present information."
    },
    {
      "credential": "Must be self-motivated, effectively work independently and on a team, and supervise the work of others."
    },
    {
      "credential": "Weekends, holidays, and varied hours required."
    }
  ]
}