{
  "meta": [
    {
      "job_title": "Product Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Be In-charge of defining, validating, and delivering on the Americas trading solutions roadmap across Low Touch, High Touch, and Principal Trading workflows."
    },
    {
      "duty": "Work closely with Sales and Customers on defining the strategic unlocks, target customers, deal scoping and commitments, tracking and governance of the roadmap."
    },
    {
      "duty": "Work with Engineering and Solutions Delivery on defining and committing the functional requirements, managing backlog estimation and prioritization, managing the overall delivery of the roadmap."
    },
    {
      "duty": "Collaborate with Customer Success on keeping clients up to date on latest developments and strategy via regular business review meetings, understanding and prioritizing enhancement requests, and incorporate customer needs and feedback into the roadmap."
    },
    {
      "duty": "Work with product managers in other regions on creating globally consistent workflows and reporting, and unified user experience with an aim of providing global trading capabilities for our customers."
    },
    {
      "duty": "Understand in-depth the Americas market structure and regulations, act as thought leader in the region, innovate by coming up with new product ideas, focus on creating differentiators via automation and analytics."
    }
  ],
  "skills": [
    {
      "skill": "Product Development",
      "experience": 10
    },
    {
      "skill": "Product Strategy",
      "experience": 10
    },
    {
      "skill": "Sales Enablement",
      "experience": 10
    },
    {
      "skill": "Market Positioning",
      "experience": 10
    },
    {
      "skill": "Partnerships",
      "experience": 10
    },
    {
      "skill": "Go-to-Market Strategy",
      "experience": 10
    },
    {
      "skill": "Customer Success",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Regulatory Knowledge",
      "experience": 10
    },
    {
      "skill": "Innovation",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree 10+ years of relevant experience in financial industry"
    }
  ]
}