{
  "meta": [
    {
      "job_title": "General Manager",
      "job_category": "Management",
      "job_class": "General Manager",
      "sector": "Management",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Financial Management",
      "experience": 10
    },
    {
      "skill": "Property Management",
      "experience": 10
    },
    {
      "skill": "Community Engagement",
      "experience": 10
    },
    {
      "skill": "Customer Service",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Operations Management",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Negotiation Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide overall direction and leadership for all departments in the property, ensuring exceptional services for residents and guests."
    },
    {
      "duty": "Collaborate with accounting to complete monthly financial reports and manage the annual budgeted expenses."
    },
    {
      "duty": "Manage routine, preventative, and emergency maintenance and repairs of the common area facility, systems, and equipment."
    },
    {
      "duty": "Ensure safety, security, cleanliness, and maintenance of the property."
    },
    {
      "duty": "Effectively manage a team, including recruiting, training, scheduling, and performance management."
    },
    {
      "duty": "Serve as a direct liaison to community organizations, city officials, industry associations, and public relations entities."
    },
    {
      "duty": "Participate in the preparation of the annual operating budget and financial plans, and create and monitor annual operating goals."
    },
    {
      "duty": "Review and approve operating expenses, develop strategies to enhance profitability and revenue generation, and protect the value of property assets."
    },
    {
      "duty": "Analyze resident feedback, promote the property, and provide formal assessment of individual team members."
    },
    {
      "duty": "Lead and inspire employees to meet and exceed standards, and perform multiple tasks in stressful situations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Hospitality, Business, or related field (Master's preferred)"
    }
  ]
}