{
  "meta": [
    {
      "job_title": "VDC Engineer",
      "job_category": "Construction",
      "job_class": "Engineer",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage, evaluate, and assess model-based information from design team, trade subcontractors, and others necessary to construct the project as specified by the contract documents."
    },
    {
      "duty": "Supervise VDC Coordinators, and Interns and responsible for building the overall project 'digitally first.'"
    },
    {
      "duty": "Resolve issues related to plans and specifications, especially as it relates to the organization, use, management, and BIM model [updation], by interacting with architects, subcontractors, consultants, suppliers, inspectors, other Turner job staff, and owner's representatives."
    },
    {
      "duty": "Manage coordination models and model-based submittals and shop drawings, assess conformance to contract specifications, and resolve any conflicts in interpretation."
    },
    {
      "duty": "Schedule and manage subcontractor 3D virtual trade coordination meetings, preconstruction meetings, and submittal review meetings."
    },
    {
      "duty": "Oversee the BIM related close-out process, prepare final records such as as-built models, produce the turnover model file with associated documents for the Owner if required for the project."
    },
    {
      "duty": "Supervise VDC Coordinators, and VDC Interns, including providing input on performance appraisals, preparing scope of work documents for trades producing and using BIM models, and developing reports including reports/assessments on coordination meeting records, constraint logs, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree plus a minimum of four years' related experience or an equivalent combination of education, training, and/or experience. Proven written and verbal communication abilities; proficiency with computer applications, including Microsoft Office suite. Utilizes leading-edge technologies such as BIM and Lean. Ability to read, understand, and interpret contract documents, drawings, specifications, scopes of work, and project schedule. Demonstrated leadership and interpersonal skills. Should specifically be proficient with BIM-based computer applications such as Navisworks Manage, Trimble SketchUp, and Autodesk Revit."
    }
  ]
}