{
  "meta": [
    {
      "job_title": "Content Programs Lead",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 175000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Content Development",
      "experience": 7
    },
    {
      "skill": "Marketing Strategy",
      "experience": 7
    },
    {
      "skill": "Event Management",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    },
    {
      "skill": "Online Presence Management",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Budget Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop a strategic framework for assessing and implementing content and programs that grow loyal audiences, Cash App brand awareness, and cultural equity."
    },
    {
      "duty": "Lead and manage the program calendar across all content streams, leveraging existing plans, cultural moments, and audience data and analytics to maximize value."
    },
    {
      "duty": "Project manage across diverse creative, editorial, and partnerships organizations to create new business concepts."
    },
    {
      "duty": "Leverage cross-functional opportunities to amplify plans from individual lines of business by programming to audiences across multiple platforms."
    },
    {
      "duty": "Define and track relevant KPIs and targets, aligned to longer-term plans across the business."
    },
    {
      "duty": "Partner with the creative team to direct editorial standards across all editorial touchpoints, ensuring a consistent voice, tone, and level of quality."
    },
    {
      "duty": "Identify gaps and opportunities in content programming and work across the organization to develop strategies that deliver shared goals."
    },
    {
      "duty": "Represent editorial strategy, rationale, and decisions to external partners and internal collaborators."
    },
    {
      "duty": "Develop editorial policy and implement a robust system of content optimization, internal controls, and risk management processes."
    },
    {
      "duty": "Partner closely with brand, marketing, and communications teams to build support plans for top business priorities/initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "7+ years in editorial, content development, event management, or role equivalent fields, with an emphasis on content strategy."
    },
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}