{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the management and supervision of all areas assigned by the Store Manager and follows policies in regard to Customers, Associates and merchandising."
    },
    {
      "duty": "In the absence of the Store Manager, the Assistant Manager is responsible for leading the entire operation of the Store to ensure that Company standards and best practices are consistently met."
    },
    {
      "duty": "Assists in the analysis of Store reports to evaluate controllable expenses and overall Store performance."
    },
    {
      "duty": "Ensures proper scheduling of Associates to meet business objectives."
    },
    {
      "duty": "Assists with recruiting, hiring, training and developing non-exempt Associates."
    },
    {
      "duty": "Controls payroll hours to plan, as the primary controllable expense, as well as adjusting to current business trends."
    },
    {
      "duty": "Understands that safety is the number one priority and practices safe behaviors in everything they do."
    },
    {
      "duty": "Maintains adherence to Company safety policies and ensures the safety of Associates and Customers."
    },
    {
      "duty": "Executes Customer service programs and Merchandise Presentation programs through Associate training and program supervision."
    },
    {
      "duty": "Represents and supports the Company brand at all times."
    },
    {
      "duty": "Urgently manages merchandise processing to the sales floor within the expected Company timeframe."
    },
    {
      "duty": "Assists with training Associates on Loss Prevention awareness and Store shortage goals."
    },
    {
      "duty": "Understands and complies with the Loss Prevention Awareness Program and is responsible for Store Loss Prevention."
    },
    {
      "duty": "Direct supervision of all non-exempt Associates."
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 2
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 2
    },
    {
      "skill": "Retail Operations Management",
      "experience": 2
    },
    {
      "skill": "Loss Prevention",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Recruiting",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Retail Management, or related field"
    }
  ]
}