{
  "meta": [
    {
      "job_title": "HR Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "HRIS Software",
      "experience": 5
    },
    {
      "skill": "Legal Compliance",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Benefits Administration",
      "experience": 5
    },
    {
      "skill": "Payroll Management",
      "experience": 5
    },
    {
      "skill": "Recruiting and Retention",
      "experience": 5
    },
    {
      "skill": "Organizational Design",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive core HR processes and tools including labor requirements, training needs, and strategies to reduce employee turnover."
    },
    {
      "duty": "Assist with the development, implementation, and maintenance of effective business solutions to support current and future HR needs."
    },
    {
      "duty": "Provide advice and counsel to managers and employees on employee relations matters; supporting management with the disciplinary process and all terminations."
    },
    {
      "duty": "Facilitate development and monitoring of employee performance improvement plans."
    },
    {
      "duty": "Ensure the people perspective is represented in business decisions and provide solutions to optimize opportunities and mitigate any downsides."
    },
    {
      "duty": "Investigate and resolve employee relations issues; including the investigation of harassment, discrimination, and other charges."
    },
    {
      "duty": "Respond to inquiries regarding personnel issues and insurance benefits."
    },
    {
      "duty": "Maintain a working knowledge of benefits, including health and welfare, pension; holiday and PTO pay; and salary continuation plans."
    },
    {
      "duty": "Perform open enrollment functions as required by Corporate HR."
    },
    {
      "duty": "Ensure local payroll activities and compliance with state & government regulations."
    },
    {
      "duty": "Perform other duties or special projects as required by the HR Director."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Human Resource Management, Industrial Relations, Psychology, or Business Administration or a related field preferred (or advanced certificates in Human Resources Management)"
    }
  ]
}