{
  "meta": [
    {
      "job_title": "Scrum Master",
      "job_category": "Project Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Agile Development",
      "experience": 5
    },
    {
      "skill": "Scrum Methodology",
      "experience": 5
    },
    {
      "skill": "Program Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Agile Coaching",
      "experience": 5
    },
    {
      "skill": "Agile Ceremonies Facilitation",
      "experience": 5
    },
    {
      "skill": "Scaled Agile Framework (SAFe)",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and manage detailed project plans, milestone schedules, project estimates, and resource plans."
    },
    {
      "duty": "Identify, track and help remove impediments."
    },
    {
      "duty": "Lead the organization and act as a change agent for Lean-Agile techniques, processes, and principles."
    },
    {
      "duty": "Facilitate all team meetings, including, when applicable, the Daily Stand-up, Iteration Planning, Iteration Review and Iteration Retrospective."
    },
    {
      "duty": "Ensure deliverables are aligned to stakeholder expectations."
    },
    {
      "duty": "Identify risks in project schedules and communicate them to stakeholders."
    },
    {
      "duty": "Set deadlines, assign responsibilities, monitor and develop detailed project schedules, and compile statistics and reports to summarize progress of project."
    },
    {
      "duty": "Manage parallel work streams to make sure projects stay in scope, are delivered on time and within budget."
    },
    {
      "duty": "Coach and mentor, the organization to facilitate adoption of Agile principles as needed."
    },
    {
      "duty": "Help the team improve and take responsibility for their actions; facilitate the team retrospective."
    },
    {
      "duty": "Teach problem solving techniques and help the team become better at problem solving for themselves."
    },
    {
      "duty": "Interact closely with key stakeholders to ensure vision and strategy serve as the teams’ guideposts for backlog priority; support Product Owners and Business Owners in creating, refreshing, and grooming the backlog."
    },
    {
      "duty": "Facilitate key Agile ceremonies and ensure their efficiency, to include stand-up, sprint planning, sprint demo, retrospective."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "5+ years minimum of formal project management work experience."
    },
    {
      "credential": "Applied experience with, and “fluency” in multiple system development life-cycle methodologies, such as Agile, Waterfall, and Hybrid."
    },
    {
      "credential": "History of running Agile projects or working within an Agile project team."
    },
    {
      "credential": "Strong analytical skills with the ability to actively listen and proactively question."
    },
    {
      "credential": "Demonstrated ability to manage multiple projects of differing sizes and complexity."
    },
    {
      "credential": "Experience leading scaled Agile (SAFe) IT initiatives is highly desired."
    }
  ]
}