{
  "meta": [
    {
      "job_title": "Mental Health Provider",
      "job_category": "Healthcare",
      "job_class": "Counselor",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mental Health Counseling",
      "experience": 5
    },
    {
      "skill": "Diagnosis and Assessment",
      "experience": 5
    },
    {
      "skill": "Group Counseling",
      "experience": 5
    },
    {
      "skill": "Community Resource Utilization",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assess, diagnose, treat and counsel individuals and families affected by mental illness and emotional issues."
    },
    {
      "duty": "Develop and provide individual, family and group education, counseling and/or workshops on issues/topics related to mental health problems."
    },
    {
      "duty": "Coordinate intake/assessment/counseling and referral of clients."
    },
    {
      "duty": "Work as member of team to effectively coordinate services, using case managers, alcohol & drug counselors and community resources as needed."
    },
    {
      "duty": "Monitor client progress and adherence to treatment plan; maintain client files and case documentation in accordance with related policies."
    },
    {
      "duty": "Establish and maintain working relationships with community resources and agencies. Utilize/make referrals to assist client in plans for education, vocational training, employment, housing, etc."
    },
    {
      "duty": "Prepare and submit required forms and reports related to programs and activities."
    },
    {
      "duty": "Share in after hours on-call rotation."
    },
    {
      "duty": "Follow all safety rules and procedures for work areas. Maintain a clean and organized work area."
    },
    {
      "duty": "Have regular attendance. Punctuality is essential, must be ready to work at start of work day."
    },
    {
      "duty": "Duties as assigned"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree in a behavioral, social, health science, special education, or human service area; and (1) one year experience in mental health programs."
    }
  ]
}