{
  "meta": [
    {
      "job_title": "Cancer Support and Outreach Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cancer Education",
      "experience": 2
    },
    {
      "skill": "Microsoft Word",
      "experience": 2
    },
    {
      "skill": "Online Research",
      "experience": 2
    },
    {
      "skill": "Public Speaking",
      "experience": 2
    },
    {
      "skill": "Research and Analysis",
      "experience": 2
    },
    {
      "skill": "Budget Management",
      "experience": 2
    },
    {
      "skill": "Program Development",
      "experience": 2
    },
    {
      "skill": "Grant Evaluation",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensuring the delivery of appropriate cancer support and outreach services to customers/patients in accordance with established policies and objectives."
    },
    {
      "duty": "Assisting patients, families, and healthcare providers in accessing cancer care services, resources, and information at Rex."
    },
    {
      "duty": "Maintaining accurate information/materials and responding to educational and support needs based on professional and community assessments."
    },
    {
      "duty": "Monitoring needs for new and existing programs and working closely with other staff, departments, physicians, and service line teams to maintain quality."
    },
    {
      "duty": "Coordinating work assignments, monitoring performance of co-workers and volunteers, and assisting with annual evaluations as needed."
    },
    {
      "duty": "Developing and coordinating oncology support and outreach programs across Rex and the community, in alignment with evidence-based guidelines and in response to community needs."
    },
    {
      "duty": "Conducting presentations related to cancer care and topics to Rex employees and the community at large."
    },
    {
      "duty": "Establishing relationships with internal departments, external practices, and community groups/organizations to coordinate joint efforts that maximize Rex's mission and vision."
    },
    {
      "duty": "Maintaining accurate account of the budget and ordering necessary supplies/materials and special products in accordance with the budget."
    },
    {
      "duty": "Developing and conducting program and grant evaluation and maintaining evaluation documents."
    },
    {
      "duty": "Maintaining knowledge and skills to identify and deliver services/resources for cancer patients, their families, and the community to address informational needs or aid in accessing cancer care services."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in health related field required (Master's preferred)"
    }
  ]
}