{
  "meta": [
    {
      "job_title": "Field Support Technician",
      "job_category": "IT",
      "job_class": "Technician",
      "sector": "Software Engineering",
      "salary": 50000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Communication to a personal computing Device (e.g., iPhone, iPad, pager) enabled to receive real-time dispatch notices from the Service Desk."
    },
    {
      "duty": "Monitoring of a Service Desk Ticket queue for dispatched Tickets, checking the queue at least every ten (10) minutes."
    },
    {
      "duty": "Acknowledging the receipt of the dispatch Ticket to the Service Desk within ten (10) minutes after reviewing the dispatch Ticket queue."
    },
    {
      "duty": "Reviewing the troubleshooting information embedded in the dispatched Ticket for familiarization with the end-user issue and to arrive at the end-user’s location with the most appropriate tools and End-User CI replacement parts."
    },
    {
      "duty": "Notifying the Service Desk through an established process of the anticipated time of arrival at the end-user’s location."
    },
    {
      "duty": "Perform remote diagnostics with the end-user."
    },
    {
      "duty": "Provide all necessary labor to repair or Restore End User CI to Normal Operations."
    },
    {
      "duty": "Provide all necessary Support for the Maintenance and repair of local Backup and Restore capabilities for End-User CIs."
    },
    {
      "duty": "Perform BIOS update, if required and approved by Client."
    },
    {
      "duty": "Conduct asset validation, including end-user profile updates, End-User CI Asset Tag check, model and serial number check, Location etc."
    },
    {
      "duty": "Provide onsite Support for Conference End-User CIs that reside in conference rooms at Service Locations during team meetings and major events such as conferences and leadership meetings, including: Connectivity to Local Area Networks (including wireless access points), Connectivity to projectors and Support of projector functionality (including bulb replacements when necessary), Assistance with obtaining sufficient power strips, Configuration of audio-visual Systems, and Resolution of all Incidents related to the performance of End-User CIs residing in conference rooms."
    }
  ],
  "education_certification": [],
  "skills": [],
  "subjective_elements": []
}