{
  "meta": [
    {
      "job_title": "Senior Wastewater Treatment Project Manager",
      "job_category": "Project Management",
      "job_class": "Project Manager",
      "sector": "Water & Wastewater Treatment",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Role of a seller-doer, taking a project from proposal development through design and construction"
    },
    {
      "duty": "Establish project budgets, schedules, and contracts"
    },
    {
      "duty": "Assist practice leader with project revenue forecasting"
    },
    {
      "duty": "Design water and wastewater projects for municipal and industrial clients including treatment and process design"
    },
    {
      "duty": "Prepare and review contract documents including technical specifications and construction drawings"
    },
    {
      "duty": "Prepare and review detailed studies and reports"
    },
    {
      "duty": "Plan, schedule and perform/coordinate all phases of the design process."
    },
    {
      "duty": "Provide quality control and peer review of work products"
    },
    {
      "duty": "Help identify, develop and secure project opportunities"
    },
    {
      "duty": "Assist with proposal writing/preparation"
    },
    {
      "duty": "Supervise and mentor staff within the group"
    },
    {
      "duty": "Promote collaboration and teamwork"
    },
    {
      "duty": "Attend meetings with municipal officials, engineers, and contractors."
    },
    {
      "duty": "A self-starter with the ability to work independently but also works well in a team environment"
    },
    {
      "duty": "Excellent organizational skills."
    },
    {
      "duty": "Professional written and oral communication"
    },
    {
      "duty": "Takes accountability for commitments while maintaining quality and meeting budgets and deadlines"
    },
    {
      "duty": "Strong knowledge of water and wastewater industry standards"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. Civil Engineering, Environmental Engineering, or other related engineering field and 15+ years of experience in water and wastewater including design, analyses, and studies"
    },
    {
      "credential": "Professional Engineer license in Ohio"
    }
  ]
}