{
  "meta": [
    {
      "job_title": "Forklift Operator",
      "job_category": "Logistics",
      "job_class": "Operator",
      "sector": "Logistics",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Forklift Operation",
      "experience": 4
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Asset Tracking",
      "experience": 3
    },
    {
      "skill": "Warehouse Operations",
      "experience": 3
    },
    {
      "skill": "Safety Compliance",
      "experience": 3
    },
    {
      "skill": "Record Keeping",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Operate the forklift to load and unload containers from local delivery and inter-franchise drivers, new container inventory, repositioning and customer access; load trucks for first route & stage IF and access."
    },
    {
      "duty": "Assist Market Manager with routing and ensure that all full containers staged outside during the day are returned to the warehouse each night."
    },
    {
      "duty": "Maintain PODHUNTER, fuel forklift, complete daily forklift inspection reports, and maintain those records onsite; notify manager of needed repairs."
    },
    {
      "duty": "Assist with ensuring a safe and clean working environment, inside and out, for assigned facility."
    },
    {
      "duty": "Print and time-stamp all waybills; may scan and upload contracts, addendums, and other documents. When required, repair damaged containers."
    },
    {
      "duty": "Maintain contact with drivers as needed, assisting them with their daily routes. May perform other duties and responsibilities as assigned."
    },
    {
      "duty": "Typically reports to Management. Job is NOT directly responsible for managing other employees (e.g., hiring/termination and/or pay decisions, performance management)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent. 4-6 years storage center experience preferred. Previous forklift experience required. Ability to obtain Forklift Driver Certification. Basic computer skills i.e. data entry and knowledge of Microsoft Office. Math skills sufficient to perform required duties. Or an equivalent combination of education, training, or experience."
    }
  ]
}