{
  "meta": [
    {
      "job_title": "Information Security Engineer",
      "job_category": "Information Security",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Information Security Analysis",
      "experience": 5
    },
    {
      "skill": "Security Incident Response",
      "experience": 5
    },
    {
      "skill": "NIST or HITRUST Control Review",
      "experience": 5
    },
    {
      "skill": "Identity and Access Management (IAM)",
      "experience": 5
    },
    {
      "skill": "Security Assessment and Testing",
      "experience": 5
    },
    {
      "skill": "Scripting Languages and Process Automation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Linux, MacOS, Windows Server/Client, and Cloud Architecture",
      "experience": 5
    },
    {
      "skill": "Fast-paced, high-growth, rapidly changing work environments",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Participate in daily incident response stand ups and provide ongoing operational support."
    },
    {
      "duty": "Apply analytical and creative skills while consuming the output of the security tools and logs generated by systems throughout the enterprise."
    },
    {
      "duty": "Lead multiple tasks related to annual security initiatives and investigations."
    },
    {
      "duty": "Monitor developments within the field of penetration testing, continually assess the environment, validate findings, and work with stakeholders to drive remediation to completion."
    },
    {
      "duty": "Document and review operational procedures and lead incident response investigations."
    },
    {
      "duty": "Design and implement workflows that cover multiple services and technology stacks."
    },
    {
      "duty": "Develop an understanding of system relationships and dependencies and relay this knowledge to junior team members."
    },
    {
      "duty": "Implement security measures across multiple layers to maintain an overall secure environment."
    },
    {
      "duty": "Make recommendations for improving advanced security controls within the environment."
    },
    {
      "duty": "Independently hunt and remediate behavioral anomalies, unauthorized access, misconfigurations, or reconnaissance activity."
    },
    {
      "duty": "Partner with engineering teams to coordinate and prioritize work."
    },
    {
      "duty": "Perform advanced web application security testing utilizing automated and manual methods."
    },
    {
      "duty": "Review security scan results, determine the risk and impact of vulnerabilities, and perform advanced vulnerability analysis and mitigation planning/operations."
    },
    {
      "duty": "Perform advanced cloud container testing, threat modeling, and analysis."
    },
    {
      "duty": "Describe the organization layout in detail and identify key stakeholders."
    },
    {
      "duty": "Understand and be able to describe the function of all products and services."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Security, Computer Science, or a related field (Master's preferred)"
    }
  ]
}