{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety Management",
      "experience": 12
    },
    {
      "skill": "Subcontractor Management",
      "experience": 12
    },
    {
      "skill": "Project Management",
      "experience": 12
    },
    {
      "skill": "Quality Assurance/Quality Control",
      "experience": 12
    },
    {
      "skill": "Budget Management",
      "experience": 12
    },
    {
      "skill": "Construction Scheduling",
      "experience": 12
    },
    {
      "skill": "Team Leadership",
      "experience": 12
    },
    {
      "skill": "Relationship Building",
      "experience": 12
    },
    {
      "skill": "Lean Principles",
      "experience": 12
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and demonstrate commitment to the company’s safety culture, ensuring an injury-free environment through individual actions and mentoring."
    },
    {
      "duty": "Manage subcontractors and oversee the organization of the overall job and workflow, including staff, subcontractors, suppliers, and programs such as Safety, Quality, and EEOC."
    },
    {
      "duty": "Develop work plans for subcontractors and self-performed work, and manage the care, custody, and control of the project site."
    },
    {
      "duty": "Lead various meetings, attend essential progress and project meetings, and implement and manage the project’s schedule as needed."
    },
    {
      "duty": "Track and monitor project budget and costs, communicate key project information to stakeholders, and ensure compliance with project filing and documentation."
    },
    {
      "duty": "Manage material and equipment needs for the project, support procurement and approval processes, and assist in selecting tools and equipment necessary for self-perform operations."
    },
    {
      "duty": "Participate in project review meetings, negotiation processes, and project buyout meetings with stakeholders and subcontractors."
    },
    {
      "duty": "Identify and recruit top talent, promote a culture of diversity and inclusion, and understand and apply non-discrimination policies throughout the organization."
    },
    {
      "duty": "Manage the largest, most complex stand-alone and/or multiple complex projects from initial planning to completion, providing management and/or oversight to multiple projects and project teams."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering or related field (Preferred)"
    }
  ]
}