{
  "meta": [
    {
      "job_title": "Lease Administration Supervisor",
      "job_category": "Real Estate",
      "job_class": "Supervisor",
      "sector": "Real Estate",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Lease Administration",
      "experience": 5
    },
    {
      "skill": "Finance",
      "experience": 5
    },
    {
      "skill": "Real Estate",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Reporting",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise the Lease Administration for the company's real estate portfolio, ensuring timely and accurate rent payments and collection of tenant rent."
    },
    {
      "duty": "Review and provide guidance on complicated agreements and legal documents escalated by the team, as well as any account issues or disputes."
    },
    {
      "duty": "Act as the subject matter expert of the lease module and lease administration’s tests of controls."
    },
    {
      "duty": "Drive continuous improvement of work efficiency and performance through a culture of innovation."
    },
    {
      "duty": "Manage and track lease inventory and billings to support the lease administration team, and review monthly rent and receivables for the portfolio."
    },
    {
      "duty": "Effectively communicate trends, outcomes, and complex management reports using business acumen and analytical ability."
    },
    {
      "duty": "Train others on lease administration and financial systems, manage key interfaces and interdependencies, and make recommendations for enhancements to lease administration and financial systems."
    },
    {
      "duty": "Assess the business value and efficiency of the work performed, identifying and implementing improvements, and initiating or leading increasingly complex department projects and continuous improvement activities."
    },
    {
      "duty": "Foster the development of direct reports through effective coaching, development planning, and shaping of assignments."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree required, minimum of 5 years of finance or real estate experience"
    }
  ]
}