{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Program Oversight, RAID Tracking, and Implementation Tracking."
    },
    {
      "duty": "Dependency Management and weekly project status reporting."
    },
    {
      "duty": "Executive updates to Sr Director for Digital Delivery."
    },
    {
      "duty": "Collaborating with multiple teams to drive successful outcomes."
    },
    {
      "duty": "Coordinating with application managers to document development roadmaps."
    },
    {
      "duty": "Collaborating with business implementation leads to layer in the operating model changes and deployment plan."
    },
    {
      "duty": "Tracking, escalating, and driving accountability for the implementation of Client Security efforts."
    },
    {
      "duty": "Managing all phases of a project and overseeing project documentation."
    },
    {
      "duty": "Setting up the structure of the project and performing detailed planning."
    },
    {
      "duty": "Managing project execution, completion of moderate or large projects, defining phase deliverables, tracking milestones and resources, evaluating risks, and recommending contingency plans."
    },
    {
      "duty": "Ensuring quality assurance engagement, resolution of issues, status reviews, development of standards, change control, and compliance with all policies and procedures."
    },
    {
      "duty": "Managing transition and handover to Support Teams."
    },
    {
      "duty": "Developing project plans, overseeing budgets, and determining best methods to meet project objectives."
    },
    {
      "duty": "Reporting changes in project timelines, resources, or budget, and reporting risks and issues during the life of projects."
    },
    {
      "duty": "Auditing documentations of peers and providing coaching to Jr. Project or Project Coordinators."
    },
    {
      "duty": "Strategic development, implementation, and administration of IT programs within functional areas."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 100,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Project Management, Business Administration, or a related field (Master's preferred)"
    }
  ]
}