{
  "meta": [
    {
      "job_title": "Psychologist",
      "job_category": "Healthcare",
      "job_class": "Professional",
      "sector": "Healthcare",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Psychological Evaluation",
      "experience": 5
    },
    {
      "skill": "Intervention",
      "experience": 5
    },
    {
      "skill": "Therapeutic Environment Creation",
      "experience": 5
    },
    {
      "skill": "Motivational Interviewing",
      "experience": 5
    },
    {
      "skill": "Clinical Documentation",
      "experience": 5
    },
    {
      "skill": "Psychological Testing",
      "experience": 5
    },
    {
      "skill": "Supervision and Training",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide psychological evaluation, intervention, and support to patients enrolled in the medical weight loss program."
    },
    {
      "duty": "Address psychological issues, body image, self-esteem, social support, and quality of life."
    },
    {
      "duty": "Screen for and provide treatment and referrals for eating disorders."
    },
    {
      "duty": "Create a safe, therapeutic environment for patients with obesity."
    },
    {
      "duty": "Utilize motivational interviewing and evidence-based techniques to support lifestyle change."
    },
    {
      "duty": "Participate in the development of treatment plans in coordination with medical providers and registered dietitians."
    },
    {
      "duty": "Develop differential diagnoses for patients and ensure proper referrals to other team members as needed."
    },
    {
      "duty": "Coordinate with psychiatrists and primary care physicians when needed to manage patient’s overall care."
    },
    {
      "duty": "Participate and lead various group interventions, including support, emotional eating, and body image groups."
    },
    {
      "duty": "Provide documentation of clinical services as per departmental guidelines."
    },
    {
      "duty": "Make referrals for case management services for a complex population that faces many barriers in the community."
    },
    {
      "duty": "Participate in continuing education and other appropriate activities to maintain current licensure."
    },
    {
      "duty": "Keep up to date on emerging advances in weight management treatment approaches."
    },
    {
      "duty": "Conduct evidence-based psychological testing as necessary."
    },
    {
      "duty": "Supervise and train psychology interns and externs."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 110,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Doctoral Degree in clinical Psychology, Counseling Psychology, School Psychology, Forensic Psychology, Clinical Health Psychology, or Neuro-Psychology. Valid license as a Psychologist issued by the New York State Department of Education."
    }
  ]
}