{
  "meta": [
    {
      "job_title": "People Services (Human Resources) Manager",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the daily administration of the People Services functions with a heavy focus on recruitment, benefit administration, team member events, training, and legal compliance."
    },
    {
      "duty": "Complies and maintains complete knowledge of all company policies & procedures."
    },
    {
      "duty": "Leads the recruitment process including posting open positions on job site boards, using applicant tracking system and arranges/participates in career fairs, conducts background and reference checks."
    },
    {
      "duty": "Handles the onboarding of new hires and is responsible for the daily administration of team member files in the HRIS."
    },
    {
      "duty": "Maintains data entry of new hires, terminations, transfers, and promotions with appropriate personnel file maintenance."
    },
    {
      "duty": "Assists to monitor and maintain Leave of Absence programs to include leave entitlement and FMLA administration."
    },
    {
      "duty": "Offers guidance on all benefit programs to include 401K plan, vacation, and other ancillary benefits."
    },
    {
      "duty": "Assists with team member room rate program & premise pass requests."
    },
    {
      "duty": "Responsible for benefits administration including monthly billing reconciliation of PPR, assist with enrollment process and plan revisions."
    },
    {
      "duty": "Assists with performance management and ensures evaluations are completed on time and tracked accordingly."
    },
    {
      "duty": "Partners with area director to organize/execute team member functions including NHO, required trainings, quarterly meetings, recognition events, annual engagement surveys, open enrollment, etc."
    },
    {
      "duty": "Assists to provide guidance to department managers in coaching, counseling, and disciplinary actions."
    },
    {
      "duty": "Performs periodic audits of employee files and records to ensure that all required documents are collected and filed appropriately."
    },
    {
      "duty": "Prepares required documents for annual internal/external audits."
    },
    {
      "duty": "Ensures compliance with all people services legal requirements."
    },
    {
      "duty": "Maintains the integrity and confidentiality of people services files and records."
    },
    {
      "duty": "Responds to unemployment claims."
    },
    {
      "duty": "Active member of the hotel's Safety Committee."
    },
    {
      "duty": "Attends all hotel required meetings and trainings."
    },
    {
      "duty": "Maintains high standards of personal appearance and grooming."
    },
    {
      "duty": "Assist with special projects and other duties as assigned."
    }
  ],
  "skills": [
    {
      "skill": "Recruitment",
      "experience": 7
    },
    {
      "skill": "Employee Relations",
      "experience": 7
    },
    {
      "skill": "Benefit Administration",
      "experience": 7
    },
    {
      "skill": "Legal Compliance",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    },
    {
      "skill": "Performance Management",
      "experience": 7
    },
    {
      "skill": "HRIS Administration",
      "experience": 7
    },
    {
      "skill": "Leave of Absence Administration",
      "experience": 7
    },
    {
      "skill": "401K Administration",
      "experience": 7
    },
    {
      "skill": "Employee Onboarding",
      "experience": 7
    },
    {
      "skill": "Team Member Functions Coordination",
      "experience": 7
    },
    {
      "skill": "Audit Preparation",
      "experience": 7
    },
    {
      "skill": "Unemployment Claim Management",
      "experience": 7
    },
    {
      "skill": "Safety Committee Participation",
      "experience": 7
    },
    {
      "skill": "Training and Development",
      "experience": 7
    },
    {
      "skill": "Conflict Resolution",
      "experience": 7
    },
    {
      "skill": "Policy Administration",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 200
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from a four-year college or university in Human Resource, Psychology or Management required. Degree in Human Resources preferred."
    },
    {
      "credential": "PHR or SPHR certification is a plus."
    },
    {
      "credential": "Experience and working knowledge of hotel business is a must."
    },
    {
      "credential": "Independent luxury boutique hotel experience is desirable."
    },
    {
      "credential": "Computer competency with Microsoft Office products to include experience with ATS & HRIS. iCIMS and UKG knowledge is a plus."
    },
    {
      "credential": "Ability to speak, read, and write Spanish required."
    }
  ]
}