{
  "meta": [
    {
      "job_title": "Senior Business Analyst",
      "job_category": "Business Analysis",
      "job_class": "Senior",
      "sector": "Product Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Agile Scrum",
      "experience": 5
    },
    {
      "skill": "Product Development",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Data Analytics",
      "experience": 5
    },
    {
      "skill": "Software Delivery",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead requirements elicitation and documentation for the development and maintenance of the Ignite data analytics product."
    },
    {
      "duty": "Collaborate with Product Owner, stakeholders, and development teams to understand business goals and objectives."
    },
    {
      "duty": "Perform analysis of large-scale epics and features, and work closely with Program Leadership and teams for accurate scoping and feasibility assessment."
    },
    {
      "duty": "Lead backlog management and refinement activities assisting in prioritizing and sequencing work items based on business value and technical complexity."
    },
    {
      "duty": "Collaborate within the Scrum team and Program Leadership on progress updates and risk identification during development."
    },
    {
      "duty": "Develop and conduct product presentations and/or demonstrations for various stakeholders and development team members."
    },
    {
      "duty": "Perform as a change agent on identified Agile process improvements for the development team."
    },
    {
      "duty": "Collaborate with the QA Lead to ensure effective coordination and execution of User Acceptance Testing efforts."
    },
    {
      "duty": "Work with the development team to demonstrate work to the Product Manager and ensure compliance with the Definition of Done (DoD)."
    },
    {
      "duty": "Collaborate to promptly identify and prioritize issues reported in a production environment to ensure timely resolution and minimize impacts on users."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Computer Science, or a related field (Master's preferred)"
    }
  ]
}