{
  "meta": [
    {
      "job_title": "Program Director",
      "job_category": "Social Work",
      "job_class": "Director",
      "sector": "Non-Profit",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Social Work",
      "experience": 8
    },
    {
      "skill": "Program Management",
      "experience": 8
    },
    {
      "skill": "Case Management",
      "experience": 8
    },
    {
      "skill": "Supervision",
      "experience": 8
    },
    {
      "skill": "Community Outreach",
      "experience": 8
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Crisis Intervention",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee the day-to-day operation of the Program in Baltimore City and Baltimore County, ensuring the highest quantity and quality standards are met."
    },
    {
      "duty": "Provide direct supervision to Case Managers, guiding the development of Individual Service Plans (ISP) for each participant."
    },
    {
      "duty": "Track family progress and ensure adherence to ISP and Participant Agreement."
    },
    {
      "duty": "Collaborate with employment service providers, integrate workforce development into case management, and provide access to navigation services."
    },
    {
      "duty": "Ensure staff adherence to the principles of Trauma-Informed Care and Crisis Prevention and Mediation."
    },
    {
      "duty": "Develop and provide ongoing training for program staff, conduct regular supervision, and develop programs for staff incentives and retention."
    },
    {
      "duty": "Create an outreach plan, coordinate outreach activities, and maintain documentation of program statistics."
    },
    {
      "duty": "Maintain an active database for referrals and community partners, coordinate on-site services, and create a welcoming environment for volunteers."
    },
    {
      "duty": "Attend necessary meetings, events, and uphold the vision, mission, and values of the organization."
    },
    {
      "duty": "Perform other duties as assigned within the scope of the position."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Social Work or related field, required."
    }
  ]
}