{
  "meta": [
    {
      "job_title": "Manager, Digital Content Producer",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 85000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Project Management: Spearhead creation and implementation of new digital content creation for highly visible editorial and product content for NA sites working seamlessly with senior brand stakeholders and partners."
    },
    {
      "duty": "Maintain and update content for NA sites on an ongoing basis, collaborating closely with Digital Marketing and Creative partners for new launches and programs."
    },
    {
      "duty": "Oversee new product launch process and setup ensuring accuracy and timeliness of all relevant ecommerce and brand content working with internal stakeholders."
    },
    {
      "duty": "Create and communicate creative and technical requirements to appropriate internal and external resources."
    },
    {
      "duty": "Proof and review of all creative deliverables to ensure functional specifications and requirements are met prior to release for site development."
    },
    {
      "duty": "Manage product imagery process with creative operations working within stringent deadlines; oversee the subsequent organization and upload of imagery maintaining organization within image management platform."
    },
    {
      "duty": "Maintain and oversee internal digital creative delivery and launch calendar."
    },
    {
      "duty": "Diligently track and monitor live site content ensuring quality, standards and optimization guidelines are met."
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}