{
  "meta": [
    {
      "job_title": "Community Engagement Manager",
      "job_category": "Marketing",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 172650,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Community Engagement",
      "experience": 8
    },
    {
      "skill": "Policy Advocacy",
      "experience": 8
    },
    {
      "skill": "Government Relations",
      "experience": 8
    },
    {
      "skill": "Campaign Management",
      "experience": 8
    },
    {
      "skill": "Presentation Skills",
      "experience": 8
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 8
    },
    {
      "skill": "Public Affairs",
      "experience": 8
    },
    {
      "skill": "Event Representation",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design state and local community engagement strategies in assigned markets, with a focus on developing and activating advocates and shaping favorable regulatory and legislative outcomes."
    },
    {
      "duty": "Coordinate across a wide array of internal stakeholders to run sophisticated policy campaigns that engage a variety of tactics including paid media, grassroots outreach, earned media and grasstops engagement."
    },
    {
      "duty": "Supervise a contract grassroots organizer and develop clear metrics and goals for the organizer to achieve."
    },
    {
      "duty": "Identify strategic local and state partner engagement opportunities and/or partnerships to ensure a strong corporate reputation while also advancing priority policy objectives."
    },
    {
      "duty": "Represent Cruise in associations, panels, meetings, and events with community partners, in order to help advance the company’s public policy agenda."
    },
    {
      "duty": "Develop collateral, including presentations and localized one-pagers to help educate and raise awareness among key audiences about Cruise’s operations and public policy priorities."
    },
    {
      "duty": "Supervise local consultants and external resources to carry out policy priorities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS required 6-10 years of demonstrated experience in government, government affairs, public affairs, transportation or a related industry. Experience in building strong and sustained relationships with a diverse range of community partners, including nonprofits, governmental agencies, think tanks and advocacy groups, as well as internal collaborators. Track record of excellent, results-driven people management. Demonstrated success designing and implementing tailored community advocacy programs and strategies at the state and city levels. Expertise in understanding corporate operational priorities and synthesizing internal information for external audiences. Ability to maintain the highest personal levels of ethical conduct, confidentiality, and integrity. Excellent oral and written communication and presentation skills, with the ability to excel in one-on-one, group, and town hall settings. Frequent travel within the US should be expected to support local engagement efforts in the regional markets, along with occasional travel to our global headquarters in San Francisco."
    }
  ]
}