{
  "meta": [
    {
      "job_title": "Senior IT Project Manager",
      "job_category": "IT",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 112000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Craft and execute comprehensive project communication plans that ensure timely dissemination of project goals, responsibilities, risks, and feedback to all stakeholders."
    },
    {
      "duty": "Communicate project direction, priorities, and status to project resources and business sponsors, fostering transparency and alignment across all parties involved."
    },
    {
      "duty": "Establish strong working relationships with team members, vendors, and cross-functional departments, facilitating collaboration and coordination for successful project outcomes."
    },
    {
      "duty": "Collaborate with key stakeholders, sponsors, and senior management to drive decision-making, secure acceptance, and gain approval of project deliverables, leveraging your expertise to influence positive outcomes."
    },
    {
      "duty": "Analyze and select appropriate project management methodologies, enhancing existing approaches to develop detailed plans, assign roles, manage tasks, and oversee project deliverables."
    },
    {
      "duty": "Manage projects resulting in the implementation of new services."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 6
    },
    {
      "skill": "ITIL Framework",
      "experience": 6
    },
    {
      "skill": "Agile Methodologies",
      "experience": 6
    },
    {
      "skill": "Stakeholder Management",
      "experience": 6
    },
    {
      "skill": "Strategic Planning",
      "experience": 6
    },
    {
      "skill": "Relationship Building",
      "experience": 6
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree plus 6 years leading IT Projects with specific experience planning and implementing large-scale complex network infrastructures. PMP or MPM certification."
    }
  ]
}