{
  "meta": [
    {
      "job_title": "Mechanical Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Naval Power Systems",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for driving technology, design, development and test activities to meet the schedule, cost and reliability."
    },
    {
      "duty": "Leads and supports Engineering to design, develop, package and test of advanced power electronic converter designs (5 kW-400 kW) according to established procedures, customer requirements and government regulations & policies."
    },
    {
      "duty": "Develops and recommends solutions to a variety of complex engineering requirements to ensure that the mechanical design objectives are met."
    },
    {
      "duty": "Ability to lead and manage small group of engineers with different expertise."
    },
    {
      "duty": "Interpreting mechanical design specifications, system requirement specifications, and identifying major risk factors."
    },
    {
      "duty": "Lead all mechanical, thermal and heat transfer aspects of power electronics packaging."
    },
    {
      "duty": "Documents design during the development process, including but not limited to high level design, design specifications, design verification and test specifications."
    },
    {
      "duty": "Participates in preparation of proposals and review customer specifications and requirements, and develops designs to best support them, including cost and reliability as key design variables."
    },
    {
      "duty": "Ability to work closely with the electrical engineers in the power conversion team by providing the technical knowledge and assistance as required."
    },
    {
      "duty": "Supports, communicates, reinforces and defends the mission, values and culture of the organization."
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Engineering",
      "experience": 10
    },
    {
      "skill": "Thermal Analysis",
      "experience": 8
    },
    {
      "skill": "3D CAD Modeling",
      "experience": 8
    },
    {
      "skill": "Design Optimization",
      "experience": 6
    },
    {
      "skill": "Structural FEA",
      "experience": 6
    },
    {
      "skill": "Team Leadership",
      "experience": 6
    },
    {
      "skill": "Manufacturing",
      "experience": 6
    },
    {
      "skill": "Budgeting",
      "experience": 6
    },
    {
      "skill": "Proposal Preparation",
      "experience": 6
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 6
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Mechanical Engineering or related technical field or equivalent education and experience. MSME desired. Structural FEA experience. Thermal FEA experience. Design experience with metal-enclosed switchgear and electronic power conversion products."
    }
  ]
}