{
  "meta": [
    {
      "job_title": "Assistant Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Account Management",
      "experience": 3
    },
    {
      "skill": "Business Development",
      "experience": 3
    },
    {
      "skill": "Performance Management",
      "experience": 3
    },
    {
      "skill": "Compliance Management",
      "experience": 3
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 3
    },
    {
      "skill": "Retail Sales",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide exceptional customer service and educate consumers throughout the loan or pawn process."
    },
    {
      "duty": "Assist in customer account management, including payments, monitoring, and managing appointments."
    },
    {
      "duty": "Work to meet performance standards by leveraging business opportunities, obtaining referrals, and participating in events."
    },
    {
      "duty": "Develop customer relationships to build new business, maintain store profitability, and further brand loyalty."
    },
    {
      "duty": "Provide support, coaching, and development to Customer Service Representatives to improve the team’s potential."
    },
    {
      "duty": "Maintain customer information in the Point of Sale system with accuracy and integrity."
    },
    {
      "duty": "Help ensure compliance with Company policies and local, state, and federal laws and regulations."
    },
    {
      "duty": "Utilize personal vehicle to complete bank deposits and other Company business throughout the workday."
    },
    {
      "duty": "Work efficiently in a fast-paced environment and handle multiple challenging tasks to meet performance standards."
    },
    {
      "duty": "Utilize strong interpersonal skills to communicate with customers and Team Members at all levels."
    },
    {
      "duty": "Maintain a full-time work schedule with regular in-person attendance, including limited Saturday hours."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent (Associate degree preferred)"
    }
  ]
}