{
  "meta": [
    {
      "job_title": "Residence Director",
      "job_category": "Administrative",
      "job_class": "Director",
      "sector": "Education",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Overall administration and supervision of one to four residence halls."
    },
    {
      "duty": "Supervise, train, and evaluate undergraduate and graduate Resident Assistants."
    },
    {
      "duty": "Plan and conduct weekly resident hall staff meetings and individual staff member meetings."
    },
    {
      "duty": "Manage Residence Hall budget, administer staff programming funding, and administer Resident Assistant programming."
    },
    {
      "duty": "Advise Residence Hall Councils and act as an Administrative Hearing Officer for the Bentley conduct system."
    },
    {
      "duty": "Mediate roommate conflicts and provide academic and personal counseling to students."
    },
    {
      "duty": "Oversee the operational management of the building(s) and facilitate opening and closing of the residence halls."
    },
    {
      "duty": "Coordinate regular health and safety inspections and work with the Assistant Director of Housing to ensure proper occupancy records and reports."
    },
    {
      "duty": "Serve on departmental and institutional committees, attend meetings, and act as a liaison with faculty and appropriate offices."
    },
    {
      "duty": "Assist with the implementation of institutional and departmental goals and objectives."
    },
    {
      "duty": "Coordinate specific summer projects as assigned by the Director of the Residential Center and/or Assistant Directors of the Residential Center."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Master’s degree in Higher Education Administration or related field required (graduate residence life experience preferred) or a Bachelor’s degree with 1-2 years professional residence life experience."
    }
  ]
}