{
  "meta": [
    {
      "job_title": "Continuous Improvement Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Continuous Improvement Methodologies",
      "experience": 7
    },
    {
      "skill": "Change Leadership",
      "experience": 7
    },
    {
      "skill": "Lean Six Sigma",
      "experience": 7
    },
    {
      "skill": "Project Coordination",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Communication & Presentation",
      "experience": 7
    },
    {
      "skill": "Process Mapping",
      "experience": 7
    },
    {
      "skill": "Resource Management",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Define and drive business transformation linked to company and site long term strategic objectives, near term business targets, and continuous improvement needs of existing processes."
    },
    {
      "duty": "Serve as the subject matter expert in continuous improvement methodologies, providing oversight and support for Center of Excellence (COE) Project Managers."
    },
    {
      "duty": "Establish disciplined continuous improvement approaches that will drive efficiencies across all areas of the organization and design specific process improvement projects."
    },
    {
      "duty": "Support the deployment of the Operational Excellence program through coaching, mentoring, and full engagement across all functions."
    },
    {
      "duty": "Identify and implement the necessary tools to support the site transformation and support the roll-out of effective coaching programs for site leadership roles."
    },
    {
      "duty": "Lead the completion of complex process improvement projects across all functions of the organization and coordinate smaller scale quick win events."
    },
    {
      "duty": "Responsible for coordination of resource needs and deployment to support the continuous improvement efforts across the organization."
    },
    {
      "duty": "Establish measurable standards and compare actual results against these, regularly generating detailed update reports for the executive team."
    },
    {
      "duty": "Mentor and direct teams to demonstrate proper application and interpretation of Operational Excellence criteria."
    },
    {
      "duty": "Monitoring progress to check if changes yield desirable results."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in a field of business, engineering, science or operations research required, with 7+ years related experience, or equivalent combination of education and experience."
    },
    {
      "credential": "Certification in continuous improvement methodologies such as Six Sigma/Lean/Agile or comparable continuous improvement operating systems."
    }
  ]
}