{
  "meta": [
    {
      "job_title": "Manufacturing Supervisor",
      "job_category": "Manufacturing",
      "job_class": "Supervisor",
      "sector": "Manufacturing",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise hourly employees and allocate accordingly to support saw and assembly workload."
    },
    {
      "duty": "Train employees in accordance with company policies."
    },
    {
      "duty": "Coordinate orders to ensure on-time delivery to customers."
    },
    {
      "duty": "Lead paperwork processing to ensure accuracy in material usage and waste management at the workstations."
    },
    {
      "duty": "Complete scheduling and reporting in the ERP system to support order processing."
    },
    {
      "duty": "Ensure equipment is maintained and support maintenance and changeovers."
    },
    {
      "duty": "Coach employees and continually support a positive work environment."
    },
    {
      "duty": "Oversee and conduct training on proper operation of equipment and lead safety efforts."
    },
    {
      "duty": "Participate in projects and lean efforts to drive continual improvement."
    },
    {
      "duty": "Be a visible leader, leading by example with work ethic and attitude."
    },
    {
      "duty": "Maintain an acceptable attendance record."
    },
    {
      "duty": "Must be able to work in a team environment."
    },
    {
      "duty": "Perform other duties that may be assigned."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of 5 years of manufacturing experience. Lumber related field preferred."
    },
    {
      "credential": "Minimum of 3 years of supervision experience in a manufacturing environment."
    },
    {
      "credential": "Experience with inventory management and material processing; forklift certification a plus."
    },
    {
      "credential": "Mechanically inclined; experience with wood cutting and manufacturing facility infrastructures."
    },
    {
      "credential": "Past work in a continuous improvement culture, Lean Six Sigma Greenbelt training is a plus."
    },
    {
      "credential": "Strong computer skills with experience in the Microsoft Office Suite."
    },
    {
      "credential": "Prior experience in ERP or other business and production scheduling systems."
    },
    {
      "credential": "Great communicator and experience building / working in a team environment."
    },
    {
      "credential": "Demonstrated problem solving skills and analytical thinking."
    }
  ]
}