{
  "meta": [
    {
      "job_title": "Associate Audio-Visual Specialist",
      "job_category": "Technology",
      "job_class": "Support",
      "sector": "Technology Services",
      "salary": 45000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Technical Support",
      "experience": 3
    },
    {
      "skill": "Instructional Technologies",
      "experience": 2
    },
    {
      "skill": "Technology Training",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Collaboration",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direct hands-on assistance to campus faculty, instructors, and staff to enhance instructional efficiency and learning outcomes of course curriculum."
    },
    {
      "duty": "Incorporate instructional pedagogy and technology best practices in general assignment classrooms."
    },
    {
      "duty": "Work with other units on campus to ensure faculty and instructor needs are fully supported in the classroom."
    },
    {
      "duty": "Develop and maintain Classroom Technologies documentation."
    },
    {
      "duty": "Set and manage the expectations of customers; act as an advocate for Technology Services clients in service planning and deployment; resolve customer satisfaction issues."
    },
    {
      "duty": "Provide timely support and troubleshooting to faculty and campus staff in response to academic technology issues and resolve issues to customer satisfaction."
    },
    {
      "duty": "Conduct one-on-one and small group classroom technology orientations and training for instructors in their specific general assignment classroom."
    },
    {
      "duty": "Develop, deliver, and assist with various methods of assessment and feedback, including surveys, interviews, focus groups, observations, and data gathering."
    },
    {
      "duty": "Assist with design, development, implementation, and facilitation of workshops and presentations on the use of teaching and learning with technology."
    },
    {
      "duty": "Evaluate new instructional technologies for possible application to University of Illinois courses and programs."
    },
    {
      "duty": "Remain current in training best practices as applied to faculty, instructors, and staff with respect to technology-based learning and teaching methods."
    },
    {
      "duty": "Perform other related duties as assigned, including may supervise other staff or act as team leaders on designated projects. Monitor the progress and direction of assigned tasks and make corrections as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent. Any one or any combination totaling one (1) year (12 months) from college coursework which includes Information Technology (IT) and work experience in IT-related functions such as hardware/software support, programming, network design, network engineering, or closely related field. Demonstrated experience providing customer service or technical support."
    }
  ]
}