{
  "meta": [
    {
      "job_title": "Program Coordinator",
      "job_category": "Operations",
      "job_class": "Coordinator",
      "sector": "Manufacturing",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Reorganization/clean up of SSWI cards and Skills Matrix to ensure up-to-date records."
    },
    {
      "duty": "Check and ensure employees are compliant with SSWI and provide necessary training and assistance."
    },
    {
      "duty": "Work with C&F leadership to update journeyman, apprentices, and craftsmen lists aligning with skill levels/pay grade and employee knowledge."
    },
    {
      "duty": "Oversee the organization and completion of OJT paperwork, ensuring proper filing and documentation."
    },
    {
      "duty": "Perform internal safety audits and ensure compliance with safety procedures, including hoist reports, forklift sheets, and baghouse reports."
    },
    {
      "duty": "Conduct daily visual board audits, ensuring proper completion and reporting deficiencies to supervisors."
    },
    {
      "duty": "Assist with improvement projects and 5S enforcement in the plant, including feedback collection and problem area resolution."
    },
    {
      "duty": "Assist in the preparation of reports, maintain a filing system, and communicate with the team to address deficiencies."
    },
    {
      "duty": "Contribute to the research, collection, and implementation of new programs, procedures, and systems."
    },
    {
      "duty": "Demonstrate flexibility for off-shift work and adaptability to work across different working conditions and environments."
    },
    {
      "duty": "Participate in safety activities, follow safety rules and procedures, and contribute to safety committees and initiatives."
    },
    {
      "duty": "Take responsibility for activating potential, caring for customers, optimizing operations, and integrating sustainability into daily practices, promoting a results-driven culture aligned with long-term value creation."
    }
  ],
  "skills": [
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Safety Compliance",
      "experience": 5
    },
    {
      "skill": "Report Preparation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Research and Analysis",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Flexibility",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Operations Management, Business Administration, or a related field (Master's preferred)"
    }
  ]
}