{
  "meta": [
    {
      "job_title": "Veterinary Client Service Representative/Receptionist",
      "job_category": "Client Service",
      "job_class": "Representative",
      "sector": "Medical",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Clerical Procedures",
      "experience": 2
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Appointment Scheduling",
      "experience": 3
    },
    {
      "skill": "Medical Terminology",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate the flow of pets and owners in the lobby and into exam rooms; placate owners distressed by long waits, scheduling glitches, and other problems."
    },
    {
      "duty": "Identify potential emergencies in person, and over the phone, and schedule those appointments appropriately."
    },
    {
      "duty": "Organize and process all payment plans, billing statements, and collections."
    },
    {
      "duty": "Perform cashiering duties; process refunds, returns and credits as needed."
    },
    {
      "duty": "Respond to inquiries about the range of services the practice provides and the species it treats; refer to appropriate department/staff member as needed."
    },
    {
      "duty": "Input data to practice management software to check pets in; make simple postings to accounts; compile data for various reports."
    },
    {
      "duty": "Receive and distribute incoming mail; and process outgoing mail."
    },
    {
      "duty": "Coordinate and schedule appointments; provide clients with appointment reminders and any special instructions; call clients whose pets have overdue treatments."
    },
    {
      "duty": "Respond to client emails; type and edit a variety of correspondence, and process faxes."
    },
    {
      "duty": "Able to learn basic veterinary medicine terminology."
    },
    {
      "duty": "Become familiar with retail products, medications, vaccinations, routine testing, and heartworm and flea preventatives and be able to confidently discuss with clients."
    },
    {
      "duty": "Use Windows based computer systems, word processing, email, web search and other skills needed to effectively use software."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma, GED, or equivalent combination of education and/or experience."
    }
  ]
}