{
  "meta": [
    {
      "job_title": "Baker",
      "job_category": "Food Service",
      "job_class": "Entry Level",
      "sector": "Food Service",
      "salary": 18000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Food Preparation",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Sanitation Procedures",
      "experience": 1
    },
    {
      "skill": "Teamwork",
      "experience": 1
    },
    {
      "skill": "Product Knowledge",
      "experience": 1
    },
    {
      "skill": "Math Skills",
      "experience": 1
    },
    {
      "skill": "Point of Sale Systems",
      "experience": 1
    },
    {
      "skill": "Physical Strength",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Measuring, mixing, and preparing raw materials according to company specifications and recipes."
    },
    {
      "duty": "Forming, cutting, molding, shaping, and baking dough."
    },
    {
      "duty": "Monitoring cooking completion times and setting heat and humidity temperatures for proof box."
    },
    {
      "duty": "Checking product to ensure it meets quality standards."
    },
    {
      "duty": "Ensuring temp, sweep, and sanitation logs are completed."
    },
    {
      "duty": "Providing excellent customer service, addressing needs of customers in a timely and effective manner and modeling suggestive selling techniques."
    },
    {
      "duty": "Maximizing sales potential through effective and proper procedures for prepping, storing, rotating, stocking, and merchandising product."
    },
    {
      "duty": "Following and complying with established procedures, including Weights and Measures, health and sanitation, and safe work practices."
    },
    {
      "duty": "Maintaining a clean and sanitary working and shopping environment; maintaining equipment in accordance with cleanliness and safety standards."
    },
    {
      "duty": "Performing opening, mid, and closing duties as assigned; ensuring accuracy of signs and pricing."
    },
    {
      "duty": "Immediately reporting safety hazards and violations."
    },
    {
      "duty": "Performing other duties as assigned by store, regional, or national leadership."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "6-12 months retail experience."
    }
  ]
}