{
  "meta": [
    {
      "job_title": "Application Analyst III",
      "job_category": "Technology",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Application Solutions",
      "experience": 10
    },
    {
      "skill": "Technical Judgement",
      "experience": 10
    },
    {
      "skill": "Application Architecture",
      "experience": 10
    },
    {
      "skill": "Software and Systems Design Principles",
      "experience": 10
    },
    {
      "skill": "Business Analysis",
      "experience": 10
    },
    {
      "skill": "MS SQL Server and T-SQL",
      "experience": 10
    },
    {
      "skill": "Applications Performance Monitoring",
      "experience": 10
    },
    {
      "skill": "Project Leadership",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Evaluate and propose application solutions considering firm-wide needs and impact."
    },
    {
      "duty": "Define applications solutions based on user/client needs, cost, and required integrations."
    },
    {
      "duty": "Assimilate information from disparate sources, perform analysis, and implement solutions based on data across multiple departments."
    },
    {
      "duty": "Establish and document technology integration and migration strategies for the firm."
    },
    {
      "duty": "Work with consultants and internal teams to execute strategic decisions, integrations, and upgrades for applications."
    },
    {
      "duty": "Work with vendors to escalate and resolve critical applications issues."
    },
    {
      "duty": "Assume the role of IT project leader on small to medium size initiatives."
    },
    {
      "duty": "Provide guidance, support, and mentorship to other team members."
    },
    {
      "duty": "Prioritize work/projects and execute tasks in a high-pressure environment."
    },
    {
      "duty": "Participate in the development and review of technical designs within their expertise."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s in Information Technology or relevant field; Or high school diploma with four years IT experience with hardware and business applications."
    },
    {
      "credential": "Minimum 12+ years of IT experience focused on software application analysis or support."
    },
    {
      "credential": "Minimum 8+ years working at an AmLaw 200 firm or other professional services partnership is preferred."
    },
    {
      "credential": "Hands-on experience with Aderant Expert, Aderant Elite, Relativity, e-Discovery, Intapp Open, Intapp Walls, iManage DeskSite, iManager FileSite, iManage Work."
    },
    {
      "credential": "Expert understanding of typical software and systems design principles."
    },
    {
      "credential": "Proficiency with MS SQL Server and the T-SQL language."
    }
  ]
}