{
  "meta": [
    {
      "job_title": "Fitness Trainer",
      "job_category": "Fitness",
      "job_class": "Trainer",
      "sector": "Fitness",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Fitness Training",
      "experience": 1
    },
    {
      "skill": "CPR/AED Certification",
      "experience": 1
    },
    {
      "skill": "High School Diploma",
      "experience": 1
    },
    {
      "skill": "College Degree in health, fitness, or recreation related field",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide a safe and effective exercise environment for club Members/Guests through supervision of exercise programs and education in exercise."
    },
    {
      "duty": "Establish personalized exercise programs for each Member/Guest, based on their fitness needs."
    },
    {
      "duty": "Promote the facility and the club, providing excellent service to Members and guests."
    },
    {
      "duty": "Conduct new Member FitStart appointments and track accordingly."
    },
    {
      "duty": "Maintain fitness-related certifications, actively seek new education opportunities, and update programming as needed."
    },
    {
      "duty": "Maintain a schedule of availability, ensure completion of daily assignments, and participate as a member of the team."
    },
    {
      "duty": "Notify supervisor of Member/Guest complaints and rectify any complaints as soon as possible."
    },
    {
      "duty": "Adhere to all company, club, and department written mandatory standards of operations, policies, and procedures."
    },
    {
      "duty": "Communicate effectively, work well under pressure, and focus attention on detail."
    },
    {
      "duty": "Maintain good conduct and safe working habits, ensuring all exercise areas and equipment are in safe and effective working condition."
    },
    {
      "duty": "Attendance at team and individual meetings, daily line-up, and club events as requested. Wearing a clean and neat uniform daily."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 20,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma, GED, or equivalent required. College Degree in health, fitness, or recreation related field preferred."
    }
  ]
}