{
  "meta": [
    {
      "job_title": "Senior Accountant",
      "job_category": "Accounting",
      "job_class": "Senior",
      "sector": "Finance",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Accounting",
      "experience": 5
    },
    {
      "skill": "GAAP",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Accounting Software",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Slack",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate and participate in the design, testing, implementation, and review of complex manual or automated financial and accounting systems."
    },
    {
      "duty": "Prepare monthly balance sheet, income statements, and profit and loss statements."
    },
    {
      "duty": "Maintain a series of financial controls and procedures for the Accounting department."
    },
    {
      "duty": "Provide assistance to outside auditors; gather necessary account information and documents to perform annual audit."
    },
    {
      "duty": "Review internal controls and security of all automated accounting applications to ensure conformity with auditing standards."
    },
    {
      "duty": "Gather and compile information on processes, organizational structure, computer technology, policies, and procedures."
    },
    {
      "duty": "Analyze and review proposals for any system related to financial accounting methods, policies, and procedures; recommend improvements."
    },
    {
      "duty": "Collaborate with appropriate staff to gather input and feedback concerning system needs."
    },
    {
      "duty": "Maintain or assist with maintenance of accounting information systems."
    },
    {
      "duty": "Prepare and deliver comprehensive evaluations, proposals, and recommendations to executive leadership, committees, and other stakeholders."
    },
    {
      "duty": "Assist in the preparation of specifications and technical documentation for new and revised computerized accounting systems."
    },
    {
      "duty": "Perform other duties as assigned by management."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Accounting, Finance, or related field (Certified Public Accountant preferred)"
    }
  ]
}