{
  "meta": [
    {
      "job_title": "Merchandiser",
      "job_category": "Sales",
      "job_class": "Entry Level",
      "sector": "Sales",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Support",
      "experience": 2
    },
    {
      "skill": "Merchandising",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Time Management",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Basic Math Skills",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Merchandise products for display and placement to attract sales at customer stores and secondary and perimeter locations."
    },
    {
      "duty": "Provide sales support to Sales Associate - Field and assist with merchandise resets at customer locations."
    },
    {
      "duty": "Break down orders in receiving area, move product onto customer shelves or displays, and maintain product quality and quantity by rotating products and checking code dates."
    },
    {
      "duty": "Verify accuracy of load deliveries, follow store-specific receiving procedures, and maintain fixture cleanliness to enhance sales."
    },
    {
      "duty": "Plan and carry out daily schedules according to assigned customer locations and manage timelines to ensure completion of assigned customer requirements."
    },
    {
      "duty": "Communicate product merchandising needs and customer requirements with sales and support teams."
    },
    {
      "duty": "Operate office- and field-based electronic equipment for communications with team members and operate a motor vehicle to travel to customer locations throughout the assigned territory."
    },
    {
      "duty": "Maintain a clean work environment and attend store inventories to verify accuracy of product counts, reporting results to the District Manager."
    },
    {
      "duty": "Fulfill other duties as assigned to meet company objectives."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent, with access to reliable transportation and a valid driver’s license."
    }
  ]
}