{
  "meta": [
    {
      "job_title": "Configuration Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "ERP Software Development",
      "experience": 10
    },
    {
      "skill": "BOM Structure Creation",
      "experience": 10
    },
    {
      "skill": "Technical Support",
      "experience": 10
    },
    {
      "skill": "Code Development",
      "experience": 10
    },
    {
      "skill": "Regression Testing",
      "experience": 10
    },
    {
      "skill": "Excel Skills",
      "experience": 10
    },
    {
      "skill": "Engineering Drawing Practices",
      "experience": 10
    },
    {
      "skill": "Manufacturing ERP Systems",
      "experience": 10
    },
    {
      "skill": "Collaborative Team Experience",
      "experience": 10
    },
    {
      "skill": "Fenestration Industry Knowledge",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create and maintain functional, responsive, accurate ERP product configuration software applications."
    },
    {
      "duty": "Serve as SME in multiple systems - Sales Portal, Manufacturing Rules/Oracle, legacy - for internal team members & external contacts."
    },
    {
      "duty": "Function as Configuration Lead for major NPD or ERP projects."
    },
    {
      "duty": "Create and develop Config Engineering SOP’s and systems."
    },
    {
      "duty": "Collaborate with NPD, Product Management, Process Engineering, Supply Chain, Location personnel, Release Manager and Configuration Engineering Manager to understand, design and develop ERP product configuration code."
    },
    {
      "duty": "Document code development using Config Engineering SOP’s and systems."
    },
    {
      "duty": "Perform and document unit and regression tests as directed by Release Manager."
    },
    {
      "duty": "Monitor task assignments to support release readiness per Release Manager’s schedule."
    },
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote freight and logistics services."
    },
    {
      "duty": "Lead a team of marketing specialists, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's online presence, optimizing the website and social media channels for maximum engagement and conversions."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 0,
      "introvert_extrovert": 75
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS in applicable major, or equivalent combination of education and directly applicable experience. Advanced Excel skills, knowledge of Engineering drawing practices, knowledge of manufacturing ERP systems & practices, and knowledge of structured BOM’s required."
    }
  ]
}