{
  "meta": [
    {
      "job_title": "Field Clinical Specialist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Clinical Experience",
      "experience": 3
    },
    {
      "skill": "Sales Management",
      "experience": 3
    },
    {
      "skill": "Clinical Education",
      "experience": 3
    },
    {
      "skill": "Cardiology",
      "experience": 3
    },
    {
      "skill": "Operating Room Management",
      "experience": 3
    },
    {
      "skill": "Travel Management",
      "experience": 3
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Attend cases within a territory and assist clinicians in the development of THV procedural skills."
    },
    {
      "duty": "Provide guidance on the use of the device, enabling physicians and staff to reach expert proficiency and deliver positive patient outcomes."
    },
    {
      "duty": "Collaborate with multiple departments including Sales, Clinical Affairs, Marketing, Quality, Regulatory, and Education."
    },
    {
      "duty": "Plan and implement growth strategies within focused accounts in partnership with Sales Management."
    },
    {
      "duty": "Develop clinical champions among current and potential customers for the advocacy of THV products."
    },
    {
      "duty": "Utilize acquired knowledge to educate physicians and staff to reach expert proficiency in the THV procedure to deliver positive patient outcomes."
    },
    {
      "duty": "Partner with Territory Managers to develop the proper selection criteria for sites."
    },
    {
      "duty": "Plan and implement physician and support staff trainings."
    },
    {
      "duty": "Assist in the development of the THV procedure in both Cardiology and Surgery."
    },
    {
      "duty": "Support cases outside of assigned region, on an as needed basis."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "An associate’s or equivalent two (2) year clinical degree in Life Sciences or related field or equivalent work experience is required. A minimum of three (3) years of experience working in the sterile environment of a cath lab or operating room required."
    }
  ]
}