{
  "meta": [
    {
      "job_title": "Financial Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in design, development, and preparation of reports in NetSuite."
    },
    {
      "duty": "Provide ongoing and ad hoc financial analysis to meet leadership needs."
    },
    {
      "duty": "Prepare journal entries, general ledger account reconciliations, record of assets/liabilities and works with accounts payable other financial transactions."
    },
    {
      "duty": "Fulfills cross-functional duties throughout the Finance Division as needed, including special projects."
    },
    {
      "duty": "Prepare assigned monthly closing entries and reconciliations for a variety of accounts required for proper financial reporting."
    },
    {
      "duty": "Monitor and record daily bank transactions, upload files, monitor approvals, and create/edit templates."
    },
    {
      "duty": "Assist in preparation of cash flow reporting."
    },
    {
      "duty": "Prepare financial statements and other reports."
    },
    {
      "duty": "Responsible for representing assigned Divisions for ongoing budget support and monthly expense analysis."
    },
    {
      "duty": "Monitor annual report filing for Zone LLC’s in all States."
    },
    {
      "duty": "Prepare reconciliations and documentation as requested for the annual audit."
    },
    {
      "duty": "Assist with annual filing of 1099 Tax forms."
    },
    {
      "duty": "Prepare and process payment requests in a timely and accurate manner."
    },
    {
      "duty": "Process electronic expense reports for payment in accordance with Travel & Expense policies."
    },
    {
      "duty": "Process electronic payments through ACH and Wires."
    },
    {
      "duty": "Manage and record foreign currency payments and account for exchange rate differences."
    },
    {
      "duty": "Record payments for salaries, scripture procurement, and expenses."
    },
    {
      "duty": "Offer analysis to determine and prioritize workflow improvements."
    },
    {
      "duty": "Manage and lead various projects from time to time."
    },
    {
      "duty": "Handle confidential data."
    },
    {
      "duty": "Participate in daily morning staff devotions; on a rotating basis serve by praying and reading Scripture in support of devotion leader."
    },
    {
      "duty": "Perform related and unrelated duties as required."
    }
  ],
  "skills": [
    {
      "skill": "NetSuite Experience",
      "experience": 3
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Account Reconciliation",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 3
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 70,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Accounting, Finance, or related field. CPA preferred."
    }
  ]
}