{
  "meta": [
    {
      "job_title": "ICAM Enterprise Architect",
      "job_category": "Software Engineering",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for ICAM technical leadership, solution architecture, and engineering."
    },
    {
      "duty": "Analyze all Government-identified identity and credential stores to include all types, attributes, processes, along with internal and external feeds."
    },
    {
      "duty": "Analyze ICAM trends and latest requirements, assesses the impact of emerging security threats on the enterprise risk level, recommends technology direction and/or adjustments to incorporate in Federal Agency strategy, solutions, and business plans."
    },
    {
      "duty": "Support the Federal Agency ICAM strategy by defining and updating the agency's ICAM architecture."
    },
    {
      "duty": "Implement ICAM initiatives across the Federal Agency and provide use cases for incorporating new ICAM solutions within the agency's existing eco-system."
    },
    {
      "duty": "Define a repeatable set of standards and integration support as needed for onboarding applications or components onto the new ICAM solution."
    },
    {
      "duty": "Lead technical reviews and gain required agency consensus/approval of assigned ICAM initiatives."
    },
    {
      "duty": "Provide hands-on senior-level leadership across a large enterprise program."
    },
    {
      "duty": "Lead architecture through hands-on evaluations, defining standards, designing solution and reference architectures that solve stated business objectives."
    },
    {
      "duty": "Support the development of architectural frameworks and integrate them with coherent and consistent architectural views."
    },
    {
      "duty": "Develop project scoping and estimating for solutions."
    },
    {
      "duty": "Develop and share best practices for solutions."
    },
    {
      "duty": "Manage quality of delivery across projects through risk mitigation strategies."
    },
    {
      "duty": "Participate in the development of conceptual and logical architectures."
    },
    {
      "duty": "Resolve integration and interfacing issues between various back-end systems."
    },
    {
      "duty": "Optimize application performance and scalability."
    }
  ],
  "skills": [
    {
      "skill": "ICAM Technical Leadership",
      "experience": 7
    },
    {
      "skill": "Solution Architecture",
      "experience": 7
    },
    {
      "skill": "Infrastructure Architecture",
      "experience": 7
    },
    {
      "skill": "Application Architecture",
      "experience": 7
    },
    {
      "skill": "Data Architecture",
      "experience": 7
    },
    {
      "skill": "Security Architecture",
      "experience": 7
    },
    {
      "skill": "Web Technologies",
      "experience": 7
    },
    {
      "skill": "Service-Oriented Architecture",
      "experience": 7
    },
    {
      "skill": "Microservices",
      "experience": 7
    },
    {
      "skill": "API Patterns",
      "experience": 7
    },
    {
      "skill": "Integration/Middleware",
      "experience": 7
    },
    {
      "skill": "DevOps",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Consulting",
      "experience": 5
    },
    {
      "skill": "Architectural Standards",
      "experience": 5
    },
    {
      "skill": "Java Concepts and Patterns",
      "experience": 5
    },
    {
      "skill": "Cloud Architecture",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's or master’s degree in computer science, engineering, MIS, or related field"
    }
  ]
}