{
  "meta": [
    {
      "job_title": "Laboratory Assistant",
      "job_category": "Healthcare",
      "job_class": "Assistant",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs a variety of basic laboratory functions including specimen processing, blood collection, customer service, and data entry procedures in support of the hospital's mission of patient care."
    },
    {
      "duty": "Follows standard operating procedures to process all specimen types to produce accurate results."
    },
    {
      "duty": "Operates laboratory equipment (e.g., centrifuges, timers, computer system, tube transport system), consistent with standard operating procedures."
    },
    {
      "duty": "Restocks the work area with needed supplies, logs in and stores specimens, and delivers specimens into laboratories."
    },
    {
      "duty": "Collects blood and urine specimens from all patients regardless of diagnosis or age, examines and accepts only properly collected and labeled specimens for testing."
    },
    {
      "duty": "Utilizes time, materials, and resources in an economical manner, minimizing waste and promptly processing patient specimens."
    },
    {
      "duty": "Completes computer entry of all requested laboratory tests and sorts and prepares patient reports for distribution."
    },
    {
      "duty": "Participates in educational endeavors of the institution to meet the needs of the specimen processing, laboratory, hospital, and phlebotomy service, and the university."
    },
    {
      "duty": "Displays initiative and responsibility for self-development by attending in services and impromptu consultations, and participates in the training and evaluation of new employees as established by laboratory policies."
    }
  ],
  "skills": [
    {
      "skill": "Specimen Processing",
      "experience": 2
    },
    {
      "skill": "Blood Collection",
      "experience": 2
    },
    {
      "skill": "Laboratory Equipment Operation",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Time Management",
      "experience": 2
    },
    {
      "skill": "Quality Control",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Education and Training",
      "experience": 2
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or Equivalent"
    }
  ]
}