{
  "meta": [
    {
      "job_title": "EOC/Life Safety Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate, monitor, and maintain critical elements of the Environment of Care/Life Safety program to ensure regulatory compliance and a safe environment for patients, staff, and visitors across all OGHS facilities."
    },
    {
      "duty": "Identify and recommend strategies to ensure compliance with The Joint Commission, Federal, State, Local codes/regulations related to Environment of Care/Life Safety standards."
    },
    {
      "duty": "Assist with Emergency Management and Disaster Preparedness programs across the health system."
    },
    {
      "duty": "Perform inspections and assessments necessary to maintain a safe environment such as environmental tours, hazardous materials & waste audits, and Environment of Care tracers, etc."
    },
    {
      "duty": "Participate in the development and update of EOC/Life Safety Policies to maintain compliance with appropriate accreditation and regulatory requirements."
    },
    {
      "duty": "Perform Preventative Maintenance checks on select Fire/Life Safety equipment, as assigned."
    },
    {
      "duty": "Coordinate and conduct Fire Drills across the health system while maintaining required documentation."
    },
    {
      "duty": "Accompany outside agency representatives/vendors during fire & life safety inspections, hazardous materials and environmental inspections, and/or accreditation & licensure surveys."
    },
    {
      "duty": "Assist with emergency preparedness planning and response when needed."
    },
    {
      "duty": "Maintain all data and documentation related to the EOC/Life Safety program at OGH."
    },
    {
      "duty": "Ensure that the appropriate Environment of Care program managers report findings, recommendations, actions taken, and results of measurements to the OGHS Environment of Care Committee."
    },
    {
      "duty": "Take a proactive approach in identifying EOC/Life Safety hazards and work with the Plant Operations Manager to develop mitigation strategies and monitor mitigation implementation outcomes."
    },
    {
      "duty": "Perform other related work as required or requested in support of the Safety Department and EOC/Life Safety programs as assigned by the Plant Operations Manager."
    },
    {
      "duty": "Maintain confidentiality of sensitive information."
    }
  ],
  "skills": [
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Emergency Management",
      "experience": 5
    },
    {
      "skill": "Healthcare Compliance",
      "experience": 5
    },
    {
      "skill": "Environmental Safety",
      "experience": 5
    },
    {
      "skill": "Documentation Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Healthcare, Business or Engineering/Fire Science preferred. Associates degree in Healthcare, Business or Engineering/Fire Science required."
    }
  ]
}