{
  "meta": [
    {
      "job_title": "Senior Internal Communications Manager",
      "job_category": "Communications",
      "job_class": "Manager",
      "sector": "Marketing",
      "salary": 140000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Internal Communications",
      "experience": 5
    },
    {
      "skill": "Executive Communication",
      "experience": 5
    },
    {
      "skill": "B2B Tech Experience",
      "experience": 5
    },
    {
      "skill": "Content Development",
      "experience": 5
    },
    {
      "skill": "Performance Measurement",
      "experience": 5
    },
    {
      "skill": "Employee Engagement",
      "experience": 5
    },
    {
      "skill": "External Communications",
      "experience": 5
    },
    {
      "skill": "Marketing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the global strategic and day-to-day internal communications plans and activities for the Revenue and Operations organizations."
    },
    {
      "duty": "Serve as an executive-level communicator to partner with the Chief Revenue Officer and Chief Operating Officer for their internal companywide and departmental communications."
    },
    {
      "duty": "Write and develop communications materials (email, presentations, video, etc) in partnership with functional teams and in review with communications leadership."
    },
    {
      "duty": "Partner with external communications to ensure consistency of voice when leaders are speaking or engaged in external communications activities."
    },
    {
      "duty": "Collaborate with other members of the communications team for companywide communications."
    },
    {
      "duty": "Contribute to ongoing Communications calendars, trackers and newsletters."
    },
    {
      "duty": "Partner with colleagues across Communications and Marketing for consistent content, messaging and external brand presence."
    },
    {
      "duty": "Partner with Communications colleagues to create performance dashboards across all communications functions to measure success on a monthly and quarterly, including operational metrics, employee engagement and more."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s/bachelor’s degree in communication, Business, Marketing, Psychology, Sociology, Statistics, or other quantitative field or equivalent practical experience."
    }
  ]
}