{
  "meta": [
    {
      "job_title": "Product Technical Support Representative",
      "job_category": "Technical Support",
      "job_class": "Representative",
      "sector": "Biopharma",
      "salary": 80000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Scientific Background",
      "experience": 5
    },
    {
      "skill": "Internet and Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Adaptability",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supporting the customer and commercial team members in selecting the right product for customer applications and troubleshooting existing equipment."
    },
    {
      "duty": "Identifying customer product needs, while increasing sales revenue by recommending appropriate products, equipment, and solutions."
    },
    {
      "duty": "Providing technical pre-sale and post-sale support to global sales channels and international customer networks."
    },
    {
      "duty": "Participating in root cause analysis, process improvement, and attending vendor and department meetings for continued learning including product training."
    },
    {
      "duty": "Responsible for providing product documentation support as needed and performing sales support activities such as entering orders, providing quotes and pricing, expediting orders."
    },
    {
      "duty": "Ensuring national security requirements and export compliance of all transactions, including end-user screening and use of products to adhere to technology restrictions."
    },
    {
      "duty": "Measuring and reporting on the performance of sales activities and technical support, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from an accredited higher learning institution in science (Physics, Chemistry, Biology, or a related scientific/engineering major) or a combination of education and experience is required."
    }
  ]
}