{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 82500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Retail Management",
      "experience": 5
    },
    {
      "skill": "Staff Training",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Loss Prevention",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Merchandising",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for all aspects of the Stores' operations and leading the entire operation of the Store."
    },
    {
      "duty": "Recruits, trains and develops Associates and leadership team to deliver the desired sales and profit results."
    },
    {
      "duty": "Manages the operations of the Stockroom, Front End, and Sales Floor to ensure new merchandise gets to the sales floor in a timely manner."
    },
    {
      "duty": "Controls payroll hours to plan, as the primary controllable expense, as well as adjusting to current business trends."
    },
    {
      "duty": "Maintains adherence to Company safety policies and ensures the safety of Associates and Customers."
    },
    {
      "duty": "Leads all Store Associates in, and models, a professional appearance, in accordance with the Company Dress Code."
    },
    {
      "duty": "Ensures recovery, sizing, and markdowns are completed to Company standards."
    },
    {
      "duty": "Responsible for training Associates on Loss Prevention programs to achieve Store shortage goals."
    },
    {
      "duty": "Leads the annual inventory process including preparation and execution of inventory guidelines."
    },
    {
      "duty": "Ensures compliance with all State, Local and Federal regulations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Five or more years of Store management experience in a retail environment."
    }
  ]
}