{
  "meta": [
    {
      "job_title": "Reconstruction Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Planning",
      "experience": 5
    },
    {
      "skill": "Construction Project Management",
      "experience": 5
    },
    {
      "skill": "Budgeting",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Client Communication",
      "experience": 5
    },
    {
      "skill": "Supervision",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage all aspects of the reconstruction process, from planning and coordinating to overseeing the execution and completion of projects."
    },
    {
      "duty": "Develop and implement comprehensive project plans that include scope of work, budgeting, scheduling, and risk management strategies."
    },
    {
      "duty": "Collaborate closely with our remediation team to understand the extent of damage and necessary repairs, and to ensure a seamless transition from remediation to reconstruction."
    },
    {
      "duty": "Supervise on-site crews and subcontractors, ensuring work is carried out according to plan, on schedule, and in compliance with safety standards."
    },
    {
      "duty": "Maintain ongoing communication with clients, keeping them informed of progress and addressing any concerns promptly and professionally."
    },
    {
      "duty": "Negotiate contracts with subcontractors and suppliers, balancing cost considerations with the need for high-quality materials and workmanship."
    },
    {
      "duty": "Regularly inspect completed work to ensure it meets company standards, building codes, and client expectations."
    },
    {
      "duty": "Proven experience in a construction/reconstruction management role; restoration/remediation sector experience is preferred."
    },
    {
      "duty": "Demonstrated expertise in delivering quality estimates for commercial, residential, and multifamily projects, and executing said projects based on those estimates."
    },
    {
      "duty": "Strong understanding of construction methods, materials, and regulations."
    },
    {
      "duty": "Excellent communication and leadership skills, with demonstrated experience in building and leading a team."
    },
    {
      "duty": "Commitment to customer satisfaction and quality workmanship."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 100,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Construction Management or relevant field (Master's preferred)"
    }
  ]
}