{
  "meta": [
    {
      "job_title": "Facilities Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Mechanical Engineering",
      "experience": 10
    },
    {
      "skill": "Chemical Engineering",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Oil and Gas Facility Management",
      "experience": 10
    },
    {
      "skill": "Problem-Solving",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Hydraulic Modeling",
      "experience": 10
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify, develop, fund, and track all required surface facilities to maintain current and future production levels at Saudi Aramco UR fields."
    },
    {
      "duty": "Oversee and organize the planning, implementing, and maintaining the infrastructure and oil and gas facilities."
    },
    {
      "duty": "Optimize the surface oil, gas, and water production facility performance including developing/implementing engineered solutions for issues that may be limiting production, productivity, and efficiency."
    },
    {
      "duty": "Troubleshooting problems with existing facilities."
    },
    {
      "duty": "Close coordination and follow-up with all related organizations to ensure the required surface facilities are installed on time."
    },
    {
      "duty": "Provide a continuous update on projects budget and perform a project cost optimizations economic analysis to identify the most cost-effective alternative for upstream facilities development."
    },
    {
      "duty": "Facilities design package reviews where applicable."
    },
    {
      "duty": "Designing pipeline network (oil, gas, and water) and building hydraulic models using approved software such as PIPESIM and OLGA."
    },
    {
      "duty": "Participation and support design of processing facilities such as GOSP, GSP, GCP, MPP, and Early Production Facilities."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 40,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor degree in mechanical and chemical engineering from a recognized and approved program. MSc or PhD is desirable, but not required."
    }
  ]
}