{
  "meta": [
    {
      "job_title": "Purchasing Manager",
      "job_category": "Procurement",
      "job_class": "Manager",
      "sector": "Procurement",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Vendor Relationship Management",
      "experience": 5
    },
    {
      "skill": "Market Forecasting",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Product Quality Management",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Negotiating Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and maintain 3rd party contracts in an efficient and cost-conscious manner."
    },
    {
      "duty": "Establish new, as well as develop and maintain existing relationships with growers and brokers."
    },
    {
      "duty": "Ensure weather conditions are reviewed, complete market forecasting, and report to appropriate staff."
    },
    {
      "duty": "Stay up to date on Market conditions and buy accordingly."
    },
    {
      "duty": "Reporting responsibility ensuring accuracy and timeliness."
    },
    {
      "duty": "Update pricing to ensure accuracy and any/all adjustments are accounted for; assist with quotes."
    },
    {
      "duty": "Ensure specialty pre-orders and orders are taken care of."
    },
    {
      "duty": "Continuously source and evaluate new potential vendors/suppliers/growers."
    },
    {
      "duty": "Research and investigate inquiries on unusual or specialty items."
    },
    {
      "duty": "Assist with follow-up on orders."
    },
    {
      "duty": "Gather information for newsletter and other updates."
    },
    {
      "duty": "Assist with researching billing discrepancies."
    },
    {
      "duty": "Communicate price and product updates."
    },
    {
      "duty": "Identify and lead special projects as required."
    },
    {
      "duty": "Physically check the quality and quantity of all products purchased."
    },
    {
      "duty": "Analyze and monitor sales records, trends, weather/seasons, and economic conditions to anticipate consumer-buying patterns and determine what the company will sell and how much inventory is needed."
    },
    {
      "duty": "Produce specific information such as growing seasons, inflation/deflation cycles, inventory experience, and knowledge of pricing."
    },
    {
      "duty": "Establish and adjust selling prices by monitoring costs, competitive factors, and supply and demand while also working with sales staff to obtain information about customer specific needs and preferences."
    },
    {
      "duty": "Examine, select, order, and purchase products at the most favorable price consistent with quality, quantity, specification requirements, and other established factors."
    },
    {
      "duty": "Responsible for the management of perishable inventory purchased by daily review of item usage, sales, inventory adjustments, and the creation of purchase orders to replenish inventory."
    },
    {
      "duty": "Oversee negotiation of contract pricing and structured FOBs by commodity weekly within given timetables to ensure value, quality, availability, and food safety."
    },
    {
      "duty": "Prepare and keep a record of required Contract, Food Safety documentation."
    },
    {
      "duty": "Maintain, initiate, and continually develop relationships with suppliers."
    },
    {
      "duty": "Tactical management of the produce procurement and inbound transportation supply chains."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 40,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "College degree or requisite industry experience required. 3rd Party Contract experience is a plus. FOB experience is a plus."
    }
  ]
}