{
  "meta": [
    {
      "job_title": "HR Generalist",
      "job_category": "Human Resources",
      "job_class": "Generalist",
      "sector": "HR",
      "salary": 70000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the consistent application of Human Resources activities (i.e. employment, compensation, staffing targets/strategies, benefits, training, payroll, employee relations, investigations, etc.)"
    },
    {
      "duty": "Conduct training for team leads, supervisors and managers on a wide variety of topics to help increase their leadership effectiveness."
    },
    {
      "duty": "Partner with the Talent Acquisition Team to streamline the talent acquisition and onboarding processes for hourly team members; participate with production managers in the interview and selection process; manage the onboarding process and conduct new hire orientation."
    },
    {
      "duty": "Partner with production and talent acquisition teams for efficient staffing and placement to reduce overtime and achieve high operational efficiency and employee retention."
    },
    {
      "duty": "Responds to inquiries regarding policies, procedures, and programs."
    },
    {
      "duty": "Experience working with HRIS systems and timekeeping."
    },
    {
      "duty": "Track training programs, hiring, overtime, turnover & retention reports for KPIs."
    },
    {
      "duty": "Prepare and process necessary documentation for all HR functions. Investigate team member concerns and assist and support supervisors and managers with addressing performance, misconduct, and attendance issues."
    },
    {
      "duty": "Provide support to the location’s safety program, including workers’ compensation administration."
    },
    {
      "duty": "Manage leaves of absence, including working knowledge of leave types and applicable regulations."
    },
    {
      "duty": "Other duties, as assigned."
    }
  ],
  "skills": [
    {
      "skill": "HR Generalist Experience",
      "experience": 5
    },
    {
      "skill": "Training and Development",
      "experience": 5
    },
    {
      "skill": "Talent Acquisition",
      "experience": 5
    },
    {
      "skill": "Employee Relations",
      "experience": 5
    },
    {
      "skill": "HRIS Systems",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Employment Law",
      "experience": 5
    },
    {
      "skill": "Bilingual (Spanish)",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Safety Program Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred in HR, business or equivalent work experience. Spanish bilingual a plus."
    }
  ]
}