{
  "meta": [
    {
      "job_title": "Integrated Producer",
      "job_category": "Marketing",
      "job_class": "Producer",
      "sector": "Marketing",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technology-driven Projects",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Digital Production",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Strategic Thinking",
      "experience": 5
    },
    {
      "skill": "Problem-solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for production of technology-driven projects, including web sites, promotional web sites, online media, local/mobile applications, digital out of home, motion graphics, interactive projections, interactive installations, mobile technology, platform configuration, and emerging technology applications."
    },
    {
      "duty": "Work with account leads, strategists, and creatives to define Project Scopes: goals, research, deliverables, budget, and schedule."
    },
    {
      "duty": "Ensure that production runs smoothly during all program phases, including conception, pre-production, discovery, production, installation, on-site supervision at live activations, and post-production."
    },
    {
      "duty": "Guide stakeholders through the production process with strong communication between all parties both internal and external to the agency."
    },
    {
      "duty": "Manage numerous programs at one time, prioritize, track, and meet key deadlines."
    },
    {
      "duty": "Build and manage timelines, budgets, and contracts for numerous programs."
    },
    {
      "duty": "Provide guidance to project teams on technical, timing, and budget feasibility while also working with them to provide solutions."
    },
    {
      "duty": "Stay abreast of the best vendors/partners, their strengths and skills, and maintain relations with them."
    },
    {
      "duty": "Conduct contract negotiations for production elements, adhering to scale and all necessary insurance requirements."
    },
    {
      "duty": "Travel periodically for various client events, on-location, providing training, support, and oversight as needed for vendor testing and installation."
    },
    {
      "duty": "Manage risk and troubleshoot/resolve conflict with all stakeholders."
    },
    {
      "duty": "Be the primary point of contact for Account Services, and the Creative team during a project."
    },
    {
      "duty": "Integrate with other producers on events, physical build, and content and be knowledgeable about all mediums."
    },
    {
      "duty": "Be passionate about delivering the best, most talked about creative work, on time and in budget."
    },
    {
      "duty": "Work with senior leadership to deliver best in class technical projects."
    },
    {
      "duty": "Support Momentum’s values."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree"
    },
    {
      "credential": "4+ years digital production experience or 4+ years in production."
    },
    {
      "credential": "Familiarity with effective user experience models and practices."
    }
  ]
}