{
  "meta": [
    {
      "job_title": "Analyst, FP&A",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 87000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Financial Forecasting",
      "experience": 5
    },
    {
      "skill": "Report Creation",
      "experience": 5
    },
    {
      "skill": "Business Intelligence Systems",
      "experience": 3
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Cognos",
      "experience": 3
    },
    {
      "skill": "Accounting Processes",
      "experience": 3
    },
    {
      "skill": "Microsoft Word",
      "experience": 5
    },
    {
      "skill": "Microsoft Powerpoint",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create, develop, and modify reporting or analyses to support leadership and internal D&H teams with data gathering and analyses on financial metrics and strategic initiatives."
    },
    {
      "duty": "Manage and maintain various Cognos dashboards used to track and forecast KPI’s for the Vendor Management team, the Trade Management team, and other departments as required."
    },
    {
      "duty": "Support the day-to-day analytical requests of the Vendor Management, Trade Management, and Finance departments; provide and measure status for strategic Initiatives."
    },
    {
      "duty": "Seek out potential expense savings opportunities and work with the business to implement solutions that allow the company to achieve the savings."
    },
    {
      "duty": "Identify trends in financial performance and provide recommendations for improvement."
    },
    {
      "duty": "Develop financial models and provide financial forecasts."
    },
    {
      "duty": "Collaborate effectively with various departments throughout D&H to establish partnerships and bridge the gap between Finance and Operations."
    },
    {
      "duty": "Understand and interpret accounting processes and terminology to guide interactions between departments."
    },
    {
      "duty": "Utilize Cognos and Excel to provide relevant data points on projects and maintain or develop departmental dashboards."
    },
    {
      "duty": "Work with large data sets and convert data sets into the appropriate reports so that the resulting information is actionable by the business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree (B.A./B.S.) from a four-year college or university; a Major in Business, Finance, Mathematics/Quantitative Business Analysis, or Supply Chain is recommended but not required."
    },
    {
      "credential": "Strong Microsoft Excel, Word, & Power Point is required."
    },
    {
      "credential": "Prior experience or knowledge in business intelligence systems (Cognos, Tableau, Hyperion, etc.) a plus."
    }
  ]
}