{
  "meta": [
    {
      "job_title": "Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 65000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Techniques",
      "experience": 3
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 3
    },
    {
      "skill": "Market Knowledge",
      "experience": 3
    },
    {
      "skill": "Lead Follow-up",
      "experience": 3
    },
    {
      "skill": "Sales Reporting",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the company's sales goals through professional sales techniques and good customer service."
    },
    {
      "duty": "Maintain good quality relations with existing accounts, and provide sales and marketing coverage."
    },
    {
      "duty": "Develop maximum sales potential out of assigned territory through competitive sales techniques and knowledge of the company's products and services as well as the competition's strengths/weaknesses."
    },
    {
      "duty": "Build and maintain quality relations with existing assigned accounts, and increase account base and volume of sales on a consistent basis."
    },
    {
      "duty": "Contact customers via telephone, correspondence, or in person by traveling as frequently as necessary to meet and surpass profitable sales goals for the company."
    },
    {
      "duty": "Reevaluate work on an ongoing basis to increase market share."
    },
    {
      "duty": "Assess quality of offerings and develop opinion reports on strategies to increase the company's market share."
    },
    {
      "duty": "Stay abreast of market conditions regarding products, product updates, service offerings, and new technologies through available resources."
    },
    {
      "duty": "Utilize company leads to expand current customer base and follow up all leads promptly."
    },
    {
      "duty": "Maintain updated, organized files on all accounts in assigned territory."
    },
    {
      "duty": "Complete and submit sales reports daily on account activity, outstanding proposals, proposals secured, and proposals lost with complete documentation."
    },
    {
      "duty": "Provide information and/or follow up on customer as requested."
    },
    {
      "duty": "Perform other related duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Sales, Business, or related field"
    }
  ]
}