{
  "meta": [
    {
      "job_title": "Accounting Analyst",
      "job_category": "Accounting",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 50000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "General Accounting",
      "experience": 4
    },
    {
      "skill": "Accounts Payable",
      "experience": 4
    },
    {
      "skill": "Reconciliation",
      "experience": 4
    },
    {
      "skill": "Oracle",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs a variety of routine and some non-routine analysis functions in accordance with standard procedures in general accounting, accounts payable or accounts receivable or other financial department. Responsible for process improvements, standardizing and streamlining procedures, creating written desktop procedures, training, metrics for business units, research and correction of reconciliation discrepancies and special projects."
    },
    {
      "duty": "Partner with business owners, customers and suppliers to understand underlying business processes to ensure that appropriate system and internal controls are in place."
    },
    {
      "duty": "Research and resolve discrepancies on general ledger accounts related to area of responsibility."
    },
    {
      "duty": "Communicate and train business process for assigned areas as needed."
    },
    {
      "duty": "Participate and/or lead team for process improvement, cost reduction and issue resolution."
    },
    {
      "duty": "Self-directed and able to work well and communicate effectively in a cross-functional team environment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent combination of education and experience, with 4-5 years of Accounting experience. Experience with GL coding required. Experience facilitating meetings with high level cross functional teams. Experience with mainframe system, Oracle preferred."
    }
  ]
}