{
  "meta": [
    {
      "job_title": "Pharmacy Specialist",
      "job_category": "Pharmacy",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 48000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensures confidentiality of information, documentation, and assigned records as required by Company policies, and local, State, and Federal guidelines."
    },
    {
      "duty": "Provides Pharmacy products and services to Customers in accordance with local, state, and federal laws and Company policies and procedures."
    },
    {
      "duty": "Provides customer service by acknowledging the customer, identifying customer needs, assisting with purchasing decisions, locating merchandise, resolving customer issues and concerns, and promoting products and services, while maintaining a safe shopping environment."
    },
    {
      "duty": "Operates equipment, such as cash registers and related tools, to process customer purchases using appropriate procedures for different payment types and items sold."
    },
    {
      "duty": "Receives and stocks merchandise/supplies from distribution centers and suppliers and organizes and maintains the Pharmacy area by following Company procedures, utilizing equipment appropriately, merchandising, and completing and retaining required paperwork, logs, and other documentation."
    },
    {
      "duty": "Maintains the Pharmacy area in accordance with Company policies and procedures by properly handling claims and returns, zoning the area, arranging and organizing merchandise/supplies, identifying shrink and damages, and ensuring a safe work environment."
    },
    {
      "duty": "Maintains merchandise presentation in the Pharmacy by stocking and rotating merchandise, removing damaged or out-of-date goods, setting up, cleaning, and organizing product displays, signing and pricing merchandise appropriately, and securing fragile and high-shrink merchandise."
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Cash Handling",
      "experience": 3
    },
    {
      "skill": "Merchandising",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Enrolled in an accredited Pharmacy school"
    },
    {
      "credential": "Pharmacy-Based Immunization Delivery Certification"
    }
  ]
}