{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Relationship Management",
      "experience": 2
    },
    {
      "skill": "Team Leadership",
      "experience": 2
    },
    {
      "skill": "Sales Techniques",
      "experience": 2
    },
    {
      "skill": "Business-to-Business Partnership",
      "experience": 2
    },
    {
      "skill": "Financial Management",
      "experience": 2
    },
    {
      "skill": "Operations Management",
      "experience": 2
    },
    {
      "skill": "Security Management",
      "experience": 2
    },
    {
      "skill": "Compliance Management",
      "experience": 2
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop customer relationships to build new business, maintain store profitability, and further brand loyalty and recognition."
    },
    {
      "duty": "Coach and develop Team Members and assist with employee management and training to maximize the team's potential."
    },
    {
      "duty": "Assist in managing overall store performance by meeting Key Performance Indicators (KPIs) and tracking, analyzing, and training Team Members on various performance reports."
    },
    {
      "duty": "Maintain office security and conduct proper opening and closing procedures, including management of vault, cash drawer, and bank deposits."
    },
    {
      "duty": "Oversee account management and recovery processes while maintaining a focus on customer service to prevent loss and charge off accounts."
    },
    {
      "duty": "Ensure a work environment that upholds compliance with Company policies and procedures, as well as local, state, and federal laws and regulations."
    },
    {
      "duty": "Assist in running the store and day-to-day operations in the absence of the General Manager."
    },
    {
      "duty": "Utilize personal vehicle to complete bank deposits and other Company business throughout the workday."
    },
    {
      "duty": "Work efficiently in a rapidly changing and fast-paced environment and handle multiple challenging tasks with ease to meet individual and team performance standards."
    },
    {
      "duty": "Utilize strong interpersonal skills to communicate and interact with customers and Team Members at all levels."
    },
    {
      "duty": "Maintain a full-time work schedule with regular in-person attendance, including limited Saturday hours, is required for this position."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 80,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent required"
    },
    {
      "credential": "Associate degree or higher preferred"
    },
    {
      "credential": "Valid driver's license, auto insurance, and personal vehicle to use throughout the workday (mileage compensated)"
    }
  ]
}