{
  "meta": [
    {
      "job_title": "Web Press Operator",
      "job_category": "Manufacturing",
      "job_class": "Operator",
      "sector": "Manufacturing",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Meet with supervisor daily for schedule, job progress, tasks. Read job tickets and properly document both counts of product and times that job was produced into the shop floor data system."
    },
    {
      "duty": "Machine setup and operation: Set and monitor machine calipers to insure the quality of the finished product. Inspect working parts and be able to recognize those that need replacement. Setup, monitor, and maintain inkjet systems when applicable."
    },
    {
      "duty": "Constantly monitor the quality of the finished product. Be responsible for general maintenance and lubrication of the machine. Assist with housekeeping in the sorting area."
    },
    {
      "duty": "Be thoroughly familiar with all areas of the job finishing sheet. Follow all required safety procedures such as PPEs, Ergonomics, Chemical Hazards, etc. Performs job in a manner that protects the health and safety of all employees. Maintain production charts and records."
    },
    {
      "duty": "Train new employees. Give direction to machine crew through production and downtime. Provide leadership as required. Provide input to the supervisor for evaluations. Follows all company policies and procedures. Complete and demonstrate a full understanding of ongoing training concepts and applications."
    },
    {
      "duty": "Emulates the Runbeck values in daily interactions with internal and external customers. Meet company standards pertaining to quantity and quality of work performed on an ongoing basis, performing all work-related tasks in a manner that is in compliance with all Company policies and procedures. Adhering to Company policies, procedures, and directives regarding standards of workplace behavior in completing job duties and assignments while maintaining regular and timely attendance."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 50,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": []
}