{
  "meta": [
    {
      "job_title": "Warehouse Coordinator",
      "job_category": "Logistics",
      "job_class": "Coordinator",
      "sector": "Manufacturing",
      "salary": 44000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Forklift Operation",
      "experience": 2
    },
    {
      "skill": "ERP System",
      "experience": 2
    },
    {
      "skill": "Order Fulfillment",
      "experience": 2
    },
    {
      "skill": "Warehouse Organization",
      "experience": 2
    },
    {
      "skill": "Fleet Management",
      "experience": 2
    },
    {
      "skill": "Basic Computer Literacy",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Receive, store, and distribute materials and products within the warehouse and manufacturing floor."
    },
    {
      "duty": "Keep inventory highly organized and ensure all transactions in ERP system are done accurately."
    },
    {
      "duty": "Receiving and Shipping, unloading trucks, receiving products against purchase orders in ERP."
    },
    {
      "duty": "Cycle count inventory on an ongoing basis."
    },
    {
      "duty": "Issue parts to work orders in ERP system and physically bring part to the proper location on the manufacturing floor."
    },
    {
      "duty": "Use ERP to move inventory between warehouse, Work-in-process, and outside operations."
    },
    {
      "duty": "Read customer orders, work orders, shipping orders, or requisitions to determine items to be moved, gathered, or distributed, packaged and/or shipped."
    },
    {
      "duty": "Sort and place materials or items on racks, shelves, or in bins according to predetermined sequence such as Part Number, Sort Code, or Bin Location."
    },
    {
      "duty": "Ensure warehouse is clean, accessible and safe for salespeople and customer traffic."
    },
    {
      "duty": "Help put systems in place to increase warehouse organization and efficiency."
    },
    {
      "duty": "Load and transport material via company truck to and from suppliers."
    },
    {
      "duty": "Sweep, dust, and mop as needed."
    },
    {
      "duty": "Organize warehouse and work area for orderliness at all times."
    },
    {
      "duty": "Perform other tasks as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 20,
      "student_teacher": 40,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED (required)"
    },
    {
      "credential": "Valid Driver's License and must possess good DMV report (required)"
    }
  ]
}