{
  "meta": [
    {
      "job_title": "Technical Operations Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 50000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "IT & Network Knowledge",
      "experience": 3
    },
    {
      "skill": "Digital Audio Experience",
      "experience": 4
    },
    {
      "skill": "Broadcast Facilities Maintenance",
      "experience": 4
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Technical Support",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direct technical support with local market engineers and board ops when necessary."
    },
    {
      "duty": "Monitor automated and end user incidents, troubleshoot, and resolve problems remotely."
    },
    {
      "duty": "Create reports on up-time, equipment failures, backup transmission site utilization, and other key metrics."
    },
    {
      "duty": "Proactively monitor the on-air automation systems and the critical elements of technical infrastructure."
    },
    {
      "duty": "Seek out issues with a constant eye on each individual market and their technical systems, identifying potential problems before they impact the consumer product."
    },
    {
      "duty": "Monitor the operation of broadcast radio stations and streaming equipment."
    },
    {
      "duty": "Assist in the development and organization of NOC programs as they are being developed and built."
    },
    {
      "duty": "Communicate with local market engineers on a regular basis, assuring they are attuned to the NOC procedures and actions taken in their respective markets."
    },
    {
      "duty": "Work directly with the Audio Streaming department, monitoring streams and providing triage support on streaming audio delivery."
    },
    {
      "duty": "Keeps birds-eye, over watching view of the entire company’s technical operations."
    },
    {
      "duty": "Actively seek out issues with a constant eye on each individual market and their technical systems, learning the patterns and identifying potential problems before they impact the consumer product."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Two to Four years of college or technical school and/or training; or equivalent combination of education and experience."
    },
    {
      "credential": "IT & Network knowledge and experience."
    },
    {
      "credential": "Experience with digital audio and audio streaming."
    },
    {
      "credential": "Broadcast experience, technical and/or operational."
    },
    {
      "credential": "Wide Orbit Automation experience."
    },
    {
      "credential": "Broadcast Facilities knowledge and maintenance experience."
    }
  ]
}