{
  "meta": [
    {
      "job_title": "Inpatient Speech Language Pathologist",
      "job_category": "Healthcare",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Speech-Language Pathology",
      "experience": 4
    },
    {
      "skill": "Interdisciplinary Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Treatment Planning",
      "experience": 5
    },
    {
      "skill": "Patient Satisfaction",
      "experience": 5
    },
    {
      "skill": "Clinical Instruction",
      "experience": 5
    },
    {
      "skill": "Mentorship",
      "experience": 5
    },
    {
      "skill": "Healthcare Experience",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide function-based treatments and interventions to patients during their hospitalization, guiding them through the continuum of care."
    },
    {
      "duty": "Collaborate with occupational therapists, physical therapists, case management team, social workers, nursing staff, and physicians to ensure evidence-based practice for patients."
    },
    {
      "duty": "Foster interdisciplinary team approach with dynamic communication to provide well-rounded treatment to patients."
    },
    {
      "duty": "Create efficient treatment plans based on current evidence-based guidelines to help patients return to their prior level of functioning."
    },
    {
      "duty": "Build trust and communication to achieve high patient satisfaction scores."
    },
    {
      "duty": "Offer clinical instruction to incoming students and provide peer mentorship for individual growth opportunities."
    },
    {
      "duty": "Participate in monthly Inpatient Evidence Hour hosted by Inpatient leaders."
    },
    {
      "duty": "Work with a diverse patient population and provide therapies for conditions such as Neuro, Trauma, Ortho, Wound Care, and Hand Therapy."
    },
    {
      "duty": "Live through PT Solutions core values to foster a positive work environment."
    },
    {
      "duty": "Ensure compliance with state licensure and Basic Life Support Certification requirements."
    },
    {
      "duty": "Maintain local and national organization dues and license renewal fees reimbursed by PT Solutions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Graduate of a Speech-Language Pathology program, State Licensure, Certificate of Clinical Competence through the American Speech-Language-Hearing Association, Basic Life Support Certification from the American Heart Association"
    }
  ]
}