{
  "meta": [
    {
      "job_title": "Commissions Manager",
      "job_class": "Manager",
      "job_category": "Sales",
      "sector": "Sales",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Commission Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Legal Compliance",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Vendor Relationship Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Agile Mindset",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate and manage day-to-day activities of the commissions team, including monitoring workloads and ensuring compliance and standards are met."
    },
    {
      "duty": "Recommend and administer commission policies, processes, and practices for all company product lines and distributions."
    },
    {
      "duty": "Oversee field compensation administration, escalations, and difficult cases/issues, ensuring a servicing philosophy approach to sales force customer relations."
    },
    {
      "duty": "Supervise direct reports, oversee workflow, communicate company goals and policies, provide feedback, foster a positive work environment, and promote employee development."
    },
    {
      "duty": "Responsible for training, hiring, and performance management of the team."
    },
    {
      "duty": "Coordinate legal and compliance requests, establish control methods to maintain compliance with state and federal regulations, and review statistical data to validate accuracy of agent payments."
    },
    {
      "duty": "Participate in the design and development of agent compensation contracts, manage vendor relationships, and support a diverse and inclusive culture."
    },
    {
      "duty": "Manage all aspects of assigned projects to execute commission and department initiatives, evaluate potential system enhancement/change requests, and embrace the company's culture of betterment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in business analytics, computer science, management information systems, information technology, or related field. Combination of education and/or relevant work experience may be accepted in lieu of degree."
    }
  ]
}