{
  "meta": [
    {
      "job_title": "Regional Sales Director",
      "job_category": "Sales",
      "job_class": "Director",
      "sector": "Sales",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Pipeline Management",
      "experience": 5
    },
    {
      "skill": "Customer Expansion",
      "experience": 5
    },
    {
      "skill": "Sales Process Management",
      "experience": 5
    },
    {
      "skill": "Recruiting",
      "experience": 5
    },
    {
      "skill": "Sales Forecasting",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Tactical Planning",
      "experience": 5
    },
    {
      "skill": "CxO Level Selling",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Datacenter Environments",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee bookings growth and management in Texas, Arkansas, and Missouri."
    },
    {
      "duty": "Manage a team of Field AE’s to discover and develop new opportunities, manage pipeline, and execute account strategies."
    },
    {
      "duty": "Work with regional leaders in Sales Engineering, Sales Development, Channel Development, and Rubrik Partners to exceed sales objectives."
    },
    {
      "duty": "Manage all aspects of the sales process and play an integral role in the success of the overall sales team."
    },
    {
      "duty": "Develop and implement a comprehensive strategy to maximize Rubrik’s position and opportunities across the territory."
    },
    {
      "duty": "Build partner ecosystem and work closely with Focus partners to foster collaboration and opportunity."
    },
    {
      "duty": "Participate in strategic and tactical planning for the region and a key member of the Enterprise Management team."
    },
    {
      "duty": "Develop and execute a Focus plan to maximize revenue and growth across the region."
    },
    {
      "duty": "Drive accurate team forecasting practice in line with management expectations."
    },
    {
      "duty": "Conduct weekly progress meetings with sales team."
    },
    {
      "duty": "Assist in the development of short, medium, and long-term plans to achieve strategic objectives."
    },
    {
      "duty": "Regularly interact across functional areas with senior management or executives to ensure region objectives are met."
    },
    {
      "duty": "Ability to influence thinking or gain acceptance of others in sensitive situations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration or a related field (Master's preferred)"
    }
  ]
}