{
  "meta": [
    {
      "job_title": "Field Compliance Coordinator",
      "job_category": "Compliance",
      "job_class": "Coordinator",
      "sector": "Operations",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety Engineering",
      "experience": 10
    },
    {
      "skill": "Auditing",
      "experience": 10
    },
    {
      "skill": "Risk Assessment",
      "experience": 8
    },
    {
      "skill": "Incident Investigation",
      "experience": 8
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 8
    },
    {
      "skill": "HSE Technical Support",
      "experience": 8
    },
    {
      "skill": "Legislation Compliance",
      "experience": 8
    },
    {
      "skill": "HSE Strategy Development",
      "experience": 8
    },
    {
      "skill": "HSE Auditing",
      "experience": 8
    },
    {
      "skill": "Behavioral Safety Techniques",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide advice and consultation to department staff to assist them in maintaining a safe working environment in compliance with Safety & Environment regulations, standards, and practices."
    },
    {
      "duty": "Participate in risk assessment/analysis, incident investigation, and root cause analysis."
    },
    {
      "duty": "Perform various HSE duties including but not limited to HSE technical and operational support in the implementation and measuring compliance to the Safety management system and associated procedures."
    },
    {
      "duty": "Maintaining a good understanding of current international legislation and industry best practices."
    },
    {
      "duty": "Providing written reports, documentation, and statistics as needed by the Management."
    },
    {
      "duty": "Participate and exhibit in Safety Management Committee meetings."
    },
    {
      "duty": "Analyze department’s safety statistics & develop specific HSE strategies to improve department safety performance."
    },
    {
      "duty": "Lead or actively participate in incident / accident investigations and Root Cause Analysis."
    },
    {
      "duty": "Conduct HSE audits of company facilities, work locations, and contractor companies’ camps."
    },
    {
      "duty": "Act as an HSE mentor / coach to department personnel."
    },
    {
      "duty": "Promote leading behavioral based safety techniques."
    },
    {
      "duty": "Perform other HSE functions as directed by the Supervisor."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Engineering, Safety Engineering or Science from an accredited University. Minimum of 10 years of experience in engineering and related activities to safety, auditing operational experience and/or training, preferably in the oil and gas or Petrochemical industry. Understanding of Environmental legal requirement will be an added advantage."
    },
    {
      "credential": "Professional Occupational Safety accreditation with NEBOSH IGC / Oil & gas or equivalent. Accident investigations and Root Cause Analysis Certification. Possession of the Certified Safety Professional (CSP) designation will be an added advantage. ISO certification in Auditing is a plus. OHSAS certification in Auditing is a plus."
    }
  ]
}