{
  "meta": [
    {
      "job_title": "Tax Manager",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Accounting",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Tax Compliance",
      "experience": 5
    },
    {
      "skill": "Client Portfolio Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Deliver compliance and consultancy services to high-net-worth clients, their private businesses, and investment entities."
    },
    {
      "duty": "Conduct technical reviews of intricate tax returns spanning individual, partnership, S-corp, corp, and state categories."
    },
    {
      "duty": "Steer client engagements ensuring risk management, timely billing, and profitability."
    },
    {
      "duty": "Harness your entrepreneurial spirit to cultivate relationships, both internal and external."
    },
    {
      "duty": "Stay attuned to the shifting sands of the tax world, being a beacon of knowledge for the team."
    },
    {
      "duty": "Champion personal and team growth by actively participating in company-driven training, CPE courses, and mentorship initiatives."
    },
    {
      "duty": "Lead, guide, and mentor the future of the tax team, ensuring their growth aligns with our vision."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 120,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Accounting or a related field; a Master’s in taxation is a plus.CPA or EA designation is preferred.5+ years of seasoned experience in tax return review and strategic planning for affluent individuals, their kin, investment vehicles, and private enterprises. This encompasses proficiency in personal, partnership, and corporate taxation."
    }
  ]
}