{
  "meta": [
    {
      "job_title": "Corporate Strategy Manager",
      "job_category": "Strategy",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 135000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Strategic Thinking",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and refine the company's overall corporate strategy, including long-term objectives, growth initiatives, and expansion plans."
    },
    {
      "duty": "Conduct thorough analysis of the food industry landscape, competitive dynamics, and emerging trends to identify strategic opportunities and potential risks."
    },
    {
      "duty": "Collaborate closely with cross-functional teams to evaluate and prioritize strategic initiatives, ensuring alignment with the company's vision and goals."
    },
    {
      "duty": "Lead complex research projects, market studies, and financial analysis to support strategic decision-making and provide actionable insights to senior management."
    },
    {
      "duty": "Monitor and track key performance indicators (KPIs), industry benchmarks, and market intelligence to assess the effectiveness of implemented strategies and propose improvements."
    },
    {
      "duty": "Stay up-to-date with industry developments, competitor activities, and regulatory changes to proactively identify potential challenges and recommend strategic adjustments."
    },
    {
      "duty": "Prepare and present strategic recommendations, business cases, and executive-level presentations to stakeholders, including senior leadership and the board of directors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Economics, or a related field. MBA or advanced degree preferred."
    }
  ]
}