{
  "meta": [
    {
      "job_title": "Electrical Control Specialist",
      "job_category": "Engineering",
      "job_class": "Specialist",
      "sector": "Engineering",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "SAP Software",
      "experience": 3
    },
    {
      "skill": "AutoCad Software",
      "experience": 3
    },
    {
      "skill": "Critical Thinking",
      "experience": 5
    },
    {
      "skill": "Design Skills",
      "experience": 5
    },
    {
      "skill": "Technical Information Presentation",
      "experience": 5
    },
    {
      "skill": "Equipment Maintenance",
      "experience": 5
    },
    {
      "skill": "Quality Focus",
      "experience": 5
    },
    {
      "skill": "Consulting Skills",
      "experience": 5
    },
    {
      "skill": "Production Planning",
      "experience": 5
    },
    {
      "skill": "Technical Zeal",
      "experience": 5
    },
    {
      "skill": "Electrical Engineering",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and direct installation of electrical and control products or plant systems."
    },
    {
      "duty": "Analyze product or equipment specifications and performance requirements to determine designs that can be produced by existing manufacturing or processing facilities and methods."
    },
    {
      "duty": "Determine feasibility of designing new plant equipment or modifying existing facilities considering costs, available space, time limitations, company planning, and other technical and economic factors."
    },
    {
      "duty": "Provide technical information concerning manufacturing or processing techniques, materials, properties, and process advantages and limitations which affect long range plant and product engineering planning."
    },
    {
      "duty": "Direct and coordinates manufacturing or building of machine improvements and/or plant systems."
    },
    {
      "duty": "Evaluate engineering test results for possible application to developments of systems or other uses."
    },
    {
      "duty": "Work with maintenance to troubleshoot electrical/mechanical machine problems."
    },
    {
      "duty": "Lead and guide all work with electrical systems, process controls, and instrument design."
    },
    {
      "duty": "Confer with engineers and other personnel to implement operating procedures, resolve system malfunctions, and provide technical information."
    },
    {
      "duty": "Research and analyze design proposals, specifications, manuals, and other data to evaluate the feasibility, cost, and maintenance requirements of designs or applications."
    },
    {
      "duty": "Specify system components or direct modification of products to ensure conformance with engineering design and performance specifications."
    },
    {
      "duty": "Investigate equipment failures and difficulties to diagnose faulty operation, and to make recommendations to maintenance crew."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 20,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree in Electrical Engineering or Chemical Engineering (Master's preferred)"
    }
  ]
}