{
  "meta": [
    {
      "job_title": "Assistant Community Manager",
      "job_category": "Property Management",
      "job_class": "Manager",
      "sector": "Real Estate",
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Oversee the everyday operations and financial functions of the housing community under the supervision of the Community Manager."
    },
    {
      "duty": "Play a vital role in the delinquency and collection of rent to optimize the property's cash flow and financial position."
    },
    {
      "duty": "Manage all phases of the operations, including personnel, leasing, maintenance, financial, administration & risk management in the absence of the Community Manager."
    },
    {
      "duty": "Supervise all aspects of the property and staff to ensure compliance with company policies and procedures, safety and fair housing guidelines, and liability concerns."
    },
    {
      "duty": "Responsible for posting all payments and income received from all applicants, current residents, and non-current residents accurately, timely, and efficiently."
    },
    {
      "duty": "Monitor and follow up on bad debt to include preparation of late notices, resident and guarantor contact, and filing evictions."
    },
    {
      "duty": "Maintain accurate and organized records; auditing resident files to ensure accurate records."
    },
    {
      "duty": "Use consistent techniques & company directives to screen, hire, train, coach, and develop onsite staff."
    },
    {
      "duty": "Ensure effectiveness of staff through ongoing training, coaching, counseling, and guidance in compliance with Asset training benchmarks."
    },
    {
      "duty": "Promote harmony and quality job performance of staff through support and effective leadership."
    },
    {
      "duty": "Ensure staff compliance and consistency with Company policies and procedures."
    },
    {
      "duty": "Ensure staff leasing techniques are effective in obtaining closure, follow up procedures met, signing/documentation of leases, and reporting systems are accurate and up to date."
    },
    {
      "duty": "Implement marketing strategies & systems put in place by the annual marketing plan."
    },
    {
      "duty": "Deal with resident complaints, concerns, and requests to ensure resident satisfaction."
    },
    {
      "duty": "Develop and implement resident retention programs (i.e., resident functions, special promotions, monthly newsletter, etc.)."
    },
    {
      "duty": "Plan for and utilize property resources, equipment, and supplies economically (i.e., obtaining bids/pricing from vendors, suppliers, contractors, dealing with inadequate service, etc.)."
    }
  ],
  "subjective_elements": [],
  "education_certification": []
}