{
  "meta": [
    {
      "job_title": "Community Liaison/Scheduler",
      "job_category": "Community Engagement",
      "job_class": "Liaison",
      "sector": "Government",
      "salary": 52500,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Addressing and resolving constituent problems, interacting with government agencies, organizations and elective offices."
    },
    {
      "duty": "Attending community meetings, including community boards and block associations to speak on behalf of the Assemblymember."
    },
    {
      "duty": "Preparing and presenting testimony on behalf of the Assemblymember at governmental hearings. Drafting letters on behalf of constituents, reports and other correspondence as needed."
    },
    {
      "duty": "Identifying community issues."
    },
    {
      "duty": "Maintaining the Assemblymember’s calendar and coordinating scheduling."
    },
    {
      "duty": "Maintaining a comprehensive database of constituent cases."
    },
    {
      "duty": "Building and maintaining strong relationships with community leaders, constituents, agency officials and elected official staffers."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 20,
      "student_teacher": 90,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "College degree preferred."
    },
    {
      "credential": "Experience in a state, local, or federal government office or campaign setting is preferred, but not required."
    },
    {
      "credential": "Exceptional writing skills with the ability to write with precision and accuracy under tight deadlines."
    },
    {
      "credential": "Strong interpersonal skills, ability to speak before large groups and interact with constituents, government agencies, and elected official offices with sensitivity."
    },
    {
      "credential": "Highly self-motivated, able to set and meet internal and external deadlines and work in a fast-paced government office."
    },
    {
      "credential": "Willingness to work long hours and some weekends."
    },
    {
      "credential": "Located in New York City, with minimal travel required."
    }
  ]
}