{
  "meta": [
    {
      "job_title": "Field Compliance Coordinator",
      "job_category": "Health and Safety",
      "job_class": "Coordinator",
      "sector": "Oil and Gas",
      "salary": 100000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assess and report contractor compliance with contract Occupational Health, Safety, and Environmental requirements."
    },
    {
      "duty": "Conduct preconstruction job explanation and kick-off meetings to explain construction execution safety requirements per contract scope."
    },
    {
      "duty": "Track and analyze Key Performance Indicators for performance improvement opportunities."
    },
    {
      "duty": "Develop and conduct safety training."
    },
    {
      "duty": "Provide advice and consultation to department staff to assist them in maintaining a safe working environment in compliance with environmental/safety regulations, standards, and practices."
    },
    {
      "duty": "Identify and evaluate hazardous conditions and practices in the workplace."
    },
    {
      "duty": "Undertake surveys to identify and evaluate occupational health, safety, and environmental conditions."
    },
    {
      "duty": "Conduct and coordinate on-site inspections to audit physical conditions and safe work practices."
    },
    {
      "duty": "Provide advice and counsel concerning compliance with corporate safety regulations and procedures."
    },
    {
      "duty": "Perform construction site and/or area safety inspections of department facilities and operations."
    },
    {
      "duty": "Perform job site safety compliance inspections, including hazard analyses and safe work procedures, and prepare written reports and recommendations."
    },
    {
      "duty": "Develop controls for identified hazards."
    },
    {
      "duty": "Coordinate the implementation of controls from results of hazard analyses."
    },
    {
      "duty": "Measure and evaluate the effectiveness of the hazard control system, policies, and procedures and recommend changes that reflect improved opportunities to eliminate workplace incidents and injuries."
    },
    {
      "duty": "Prepare safety orientations, safety training, and job site inspection procedures."
    },
    {
      "duty": "Direct or assist in the development of specialized education and training materials."
    },
    {
      "duty": "Conduct specialized safety and environmental training programs to communicate hazard control information."
    },
    {
      "duty": "Assist local management in new employee occupational health, safety, and environmental orientation."
    },
    {
      "duty": "Participate in Safe Operations Committee meetings."
    },
    {
      "duty": "Review and analyze injury, property damage, and statistical loss data and work with management to prepare comprehensive recommendations for corrective action to eliminate or minimize potential hazards."
    },
    {
      "duty": "Incorporate essential safety requirements in all purchasing and contracting actions."
    },
    {
      "duty": "Recommend the purchase of safety equipment, related supplies, and personal protective equipment (PPE) in accordance with established company requirements."
    },
    {
      "duty": "Maintain awareness of corporate safety and environmental requirements and make recommendations for their implementation."
    },
    {
      "duty": "Assist management with monitoring adherence to department safety and environmental programs by employees and contractors."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in BS degree in engineering, safety engineering, industrial hygiene, or environmental science, or in a related field from a recognized and approved program. An advanced degree is preferred."
    }
  ]
}