{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Management",
      "job_class": "Project Manager",
      "sector": "Industrial Manufacturing",
      "salary": 110000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages the overall project direction, completion, and financial outcome, and administers both the owner and subcontractor relationships for assigned projects."
    },
    {
      "duty": "Responsible for directing and mentoring on-site staff and demonstrating strong leadership, organizational and time management skills, as well as strong communication and client service skills."
    },
    {
      "duty": "Creates documentation such as RFIs, and client correspondence on issues related to the notification provisions in contracts."
    },
    {
      "duty": "Reads and understands construction plans and drawings and the technical specifications associated with drawings. Outlines specifications required for submission to the client and ensures submittals are approved."
    },
    {
      "duty": "Builds relationships with individuals within client organizations to coordinate work and make decisions at the appropriate level for the short-term project and long-term partnership."
    },
    {
      "duty": "Identifies potential risks related to operations, contracts, or project execution. Develops mitigation plans and strategies to control the impact of negative situations or to maximize opportunities throughout the life cycle of a project."
    },
    {
      "duty": "Negotiates and manages the development and execution of the client's prime contract as well as subcontracts and vendor agreements. Develops, monitors, tracks, and negotiates project costs to ensure projects are successful and profitable. Ensures the financial interests of the company are protected while maintaining positive client relationships."
    },
    {
      "duty": "Analyzes client needs and applies market knowledge to determine business growth opportunities. Develops and oversees the implementation of strategies and action plans to target and pursue additional business with existing clients and new business opportunities."
    },
    {
      "duty": "Manages design process and relationships between design and construction to ensure the designer delivers quality, budget-conscious, and complete documents on schedule."
    },
    {
      "duty": "Creates and validates financial forecasts of costs for upcoming activities and projects."
    },
    {
      "duty": "Partners with preconstruction group to plan the project for success (e.g., procurement, logistics planning, scope reviews, budgeting, and costing)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree – Construction Management, Engineering, or equivalent or equivalent experience and minimum 7 years prior relevant experience."
    }
  ]
}