{
  "meta": [
    {
      "job_title": "Systems Project Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Project Management",
      "salary": 125000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Construction Methods",
      "experience": 5
    },
    {
      "skill": "Cost Analysis",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Subcontractor Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plan, direct, and coordinate construction operations, purchases, financial reporting, and project controls activities for an assigned portfolio of concurrent electrical projects."
    },
    {
      "duty": "Review project contracts, negotiate revisions, changes, and additions to contractual agreements with owners, architects, consultants, clients, suppliers, and subcontractors."
    },
    {
      "duty": "Prepare project controls, budget setup, schedules of values/billing mechanisms, and maintain each in collaboration with operational subordinates."
    },
    {
      "duty": "Execute major project purchases in collaboration with the operations team and regional leadership."
    },
    {
      "duty": "Manage project profitability for each project in his/her portfolio of work. This includes predictive analysis and revenue, cost, and profit forecasting."
    },
    {
      "duty": "Evaluate construction methods and determine cost-effectiveness of plans and actual work."
    },
    {
      "duty": "Develop and implement quality control programs on projects."
    },
    {
      "duty": "Regularly visit projects to assess performance, progress, and quality and to ensure connectivity with the field and clients."
    },
    {
      "duty": "Produce a schedule of values or similar method for all projects to ensure positive cash flow on projects."
    },
    {
      "duty": "Execute and manage all billing for all assigned projects."
    },
    {
      "duty": "Prepare budgets for construction activities, oversee progress, and cost reports."
    },
    {
      "duty": "Ensure proper administration of payroll, material/subcontractor payments, and owner progress and final payments in conjunction with corporate support functions."
    },
    {
      "duty": "Develop and maintain relationships with peers at clients, architectural and engineering firms, and trade partners to ensure successful outcomes of projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BS in Construction Management, Electrical Engineering or equivalent work experience"
    }
  ]
}