{
  "meta": [
    {
      "job_title": "Senior Safety and Health Consultant",
      "job_category": "Safety",
      "job_class": "Consultant",
      "sector": "Safety",
      "salary": 62000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Industrial Hygiene Calculations",
      "experience": 5
    },
    {
      "skill": "Sound Level Meters",
      "experience": 5
    },
    {
      "skill": "Identifying Safety and Health Hazards",
      "experience": 5
    },
    {
      "skill": "OSHA Standards (1910 and 1926)",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Computer Skills (MS Office)",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide on-site safety and health consultation services to small businesses within the state of Idaho."
    },
    {
      "duty": "Monitor chemical and biological contaminants in the workplace through the use of direct-reading instruments, or by air sampling, with subsequent laboratory analysis to evaluate hazards and make recommendations for preventing or controlling them."
    },
    {
      "duty": "Inspect private workplaces with respect to compliance with OSHA standards and other recognized safety standards."
    },
    {
      "duty": "Review employers’ specific written safety and health programs, plans, and records for consistency with OSHA requirements and for practical application."
    },
    {
      "duty": "Develop comprehensive reports to employers that discuss the results of consultation visits by using the OSHA Information System."
    },
    {
      "duty": "Access, retrieve, and interpret technical data from various OSHA, NIOSH, ANSI, NFPA and private sources for application to consultation projects."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor Degree with at least 5 years experience. (Preferred: Masters Degree in a related field such as Safety, Engineering, Environmental Health, Ergonomics, Health Physics, Toxicology, Chemistry, Fire Protection, or Construction Safety)"
    }
  ]
}