{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Executing the successful opening and remodels projects within the National Portfolio to maintain branding standards."
    },
    {
      "duty": "Establishing utilities accounts and ensuring timely connections as needed."
    },
    {
      "duty": "Preparing, reviewing and confirming comprehensive requests and bids for general contractors and vendors"
    },
    {
      "duty": "Coordination with consultants and providing support for permit plans, status tracking, processing, and completion to ensure compliance with jurisdictional agencies"
    },
    {
      "duty": "Assessing lead times of materials for management of timely issuance of orders, scheduling and deliveries to ensure equipment delivery dates and grand openings and completion dates are met"
    },
    {
      "duty": "Coordinate the installation of the exterior signage in compliance, landlord and municipal requirements"
    },
    {
      "duty": "Obtaining licenses and required permits for business operations, presales, tanning, food sales, etc. as required in each jurisdiction"
    },
    {
      "duty": "Continuously communicating, tracking and maintaining project documents and budgets for both the field contractors, architects, engineers and internal management"
    },
    {
      "duty": "Performing regular field visits to ensure quality, schedules and objectives are being met"
    },
    {
      "duty": "Reviewing and approving invoices and maintaining receipts for credit card payments"
    },
    {
      "duty": "Building relationships with vendors to ensure quality and timely performance"
    },
    {
      "duty": "Maintaining concise and accurate communication, documentation and coordination between contractors and vendors to ensure proper communication with operations teams"
    },
    {
      "duty": "Performing punch list reviews, ensuring quality workmanship through final sign offs and release of final payments"
    },
    {
      "duty": "Misc. other construction related duties as delegated from time to time"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree and minimum of five years experience as commercial construction/project manager is preferred"
    }
  ]
}