{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 135000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety Culture Management",
      "experience": 10
    },
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Quality Assurance",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Team Building",
      "experience": 10
    },
    {
      "skill": "Documentation Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead all aspects of safety culture and injury-free environment commitment, mentor others on safety awareness, and manage subcontractors and workflow."
    },
    {
      "duty": "Provide management and oversight of staff, subcontractors, suppliers, safety, quality, and EEOC for projects."
    },
    {
      "duty": "Develop work plans for subcontractors, coordinate and manage the project site, lead various meetings, and attend project meetings."
    },
    {
      "duty": "Create, manage, and implement project schedules, monitor project budget, and communicate project information to stakeholders."
    },
    {
      "duty": "Support project closeouts, collaboration with the project team, establish field staffing, and participate in negotiation processes."
    },
    {
      "duty": "Identify and recruit top talent, promote diversity and inclusion, and implement non-discrimination policies."
    },
    {
      "duty": "Manage the largest and most complex stand-alone projects, provide oversight to multiple projects, and lead strategic initiatives."
    },
    {
      "duty": "Deliver leadership messages, present training content, and build relationships internally and externally."
    },
    {
      "duty": "Apply construction management fundamentals, project processes, lean process and philosophy, and specific trades and scopes of work knowledge."
    },
    {
      "duty": "Manage budgets, maximize profitability, build relationships, and collaborate within a team."
    },
    {
      "duty": "Understand and apply document changes, layout skill, crane flagging and rigging, productivity rates, and cost management skills."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering, or related field (Preferred). In lieu of the above requirements, equivalent relevant experience will be considered."
    }
  ]
}