{
  "meta": [
    {
      "job_title": "Food Service Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Food Service",
      "salary": 27000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Food Preparation",
      "experience": 2
    },
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Food Safety",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Inventory Management",
      "experience": 2
    },
    {
      "skill": "Computer Systems",
      "experience": 2
    },
    {
      "skill": "Retail Environment",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide superior customer service and take orders from customers by telephone or in person."
    },
    {
      "duty": "Prepare, package, and merchandise fresh product on a daily basis while maintaining all department and food safety/sanitation standards."
    },
    {
      "duty": "Use suggestive selling techniques and basic product knowledge to meet customer needs and build department sales."
    },
    {
      "duty": "Clean and sanitize display cases, operate/maintain equipment properly, and comply with H-E-B food safety and sanitation standards."
    },
    {
      "duty": "Perform additional department-specific responsibilities such as recording production and shrink, inventory management, and ensuring catering orders are prepared and ready for customer pickup."
    },
    {
      "duty": "Educate customers on preparation/reheating instructions of prepared foods, prepackage condiments, and perform food preparation tasks."
    },
    {
      "duty": "Function in a fast-paced retail environment, in detailed and precise tasks, and work with customers staying attentive to their needs."
    },
    {
      "duty": "Demonstrate the ability to lift and manage heavy weights as required for the specific department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 80,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma, or equivalent, and completion of Company Orientation, and food safety and sanitation training upon hire"
    }
  ]
}