{
  "meta": [
    {
      "job_title": "Sanitation Technician",
      "job_category": "Bakery Operations",
      "job_class": "Technician",
      "sector": "Manufacturing",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sanitation",
      "experience": 2
    },
    {
      "skill": "Quality Control",
      "experience": 2
    },
    {
      "skill": "Food Safety",
      "experience": 2
    },
    {
      "skill": "HACCP",
      "experience": 2
    },
    {
      "skill": "Basic Math",
      "experience": 2
    },
    {
      "skill": "Equipment Safety",
      "experience": 2
    },
    {
      "skill": "GMP",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Pre-rinse, wash, and sanitize equipment per company standards."
    },
    {
      "duty": "Visually inspect other equipment sanitor’s work and complete sanitation checklist following each wash."
    },
    {
      "duty": "Work directly with the sanitation manager and quality control technician to correct cleaning deficiencies that may exist after the inspection."
    },
    {
      "duty": "Keep the area clean and organized."
    },
    {
      "duty": "Understanding and use of cleaning chemicals. Aspects include safety, measurements, and applications of the chemical."
    },
    {
      "duty": "Set up line and all equipment to company standards prior to a production run."
    },
    {
      "duty": "Responsible for establishing priorities and working independently without direct supervision."
    },
    {
      "duty": "Follow AIB (American Institute of Baking) guidelines."
    },
    {
      "duty": "Understand and follow hazard analysis and critical control points, (HACCP) and good manufacturing practices (GMP)."
    },
    {
      "duty": "Apply basic math principles as they relate to product usage and dilution rates."
    },
    {
      "duty": "Follow safety rules as it relates to Personal protective equipment (PPE)."
    },
    {
      "duty": "Follow all safety and food safety policies and procedures."
    },
    {
      "duty": "Clean and Sanitize Baking /batching/ingredient prep equipment which includes but is not limited to: Pots and pans."
    },
    {
      "duty": "Clean all types of surfaces, from many different positions and angles."
    },
    {
      "duty": "Understand and Perform tasks that require equipment safety, lockout/ tag-out, and properly covering moisture-sensitive equipment tightly."
    },
    {
      "duty": "Properly Clean and Sanitize all equipment and surfaces in designated production areas."
    },
    {
      "duty": "Any other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100
    },
    {
      "student_teacher": 50
    },
    {
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or GED"
    }
  ]
}