{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Construction",
      "job_class": "Management",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Manages and oversees company staff, subcontractors, suppliers, and programs such as Safety, Quality, and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Develops work plans for subcontractors and self-performed work."
    },
    {
      "duty": "Coordinates and manages the care, custody, and control of the project site."
    },
    {
      "duty": "Approves and/or records unit cost information for weekly reports and completes daily reports, logs, and tracking reports."
    },
    {
      "duty": "Supports the project closeouts by supervising pre-punch activities and coordinating activities with the owner, architect, and governing authorities."
    },
    {
      "duty": "Manages the largest, most complex stand-alone and/or multiple complex projects from initial planning to completion."
    },
    {
      "duty": "Provides input, leads, and executes company and regional key strategic initiatives."
    },
    {
      "duty": "Participates in the development of relevant company training content. Responsible for the selection and development of internal subject matter experts."
    },
    {
      "duty": "Effectively delivers leadership messages to multiple audiences both internally and externally."
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "Risk Management",
      "experience": 10
    },
    {
      "skill": "Construction Technology Proficiency",
      "experience": 10
    },
    {
      "skill": "Quality Assurance/Quality Control",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    },
    {
      "skill": "Lean Process Application",
      "experience": 8
    },
    {
      "skill": "Knowledge of Trades and Scopes of Work",
      "experience": 8
    },
    {
      "skill": "Organizational Skills",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering or related field (Preferred). In lieu of the above requirements, equivalent relevant experience will be considered."
    }
  ]
}