{
  "meta": [
    {
      "job_title": "Corporate Safety & Environmental Leader",
      "job_category": "Human Resources",
      "job_class": "Leader",
      "sector": "Environmental Safety",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Health and Safety Management",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Safety Program Development",
      "experience": 5
    },
    {
      "skill": "Facilitation of Safety Programs",
      "experience": 5
    },
    {
      "skill": "OSHA & EPA Regulations",
      "experience": 5
    },
    {
      "skill": "Environmental Management Systems",
      "experience": 5
    },
    {
      "skill": "Occupational Health & Safety Management",
      "experience": 5
    },
    {
      "skill": "Workers' Compensation",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    },
    {
      "skill": "Organizational & Time Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develops, implements, and monitors environmental, safety and security plans, including development of written programs; training; business reporting; recordkeeping; assessments; and regulatory tracking and knowledge."
    },
    {
      "duty": "Ensures compliance with environmental, safety and security codes and acts as the liaison with law enforcement agencies and public health officials."
    },
    {
      "duty": "Leads the corporate safety committee and actively participates in departmental committees for manufacturing and distribution safety teams."
    },
    {
      "duty": "Leads the Emergency Response Team (ERT) by conducting emergency response training to ensure emergency preparedness."
    },
    {
      "duty": "Identifies company exposures and needs; then develops, implements and maintains environmental, safety and security programs and corporate policies as a means of reducing company risks and losses."
    },
    {
      "duty": "Participants in both IS0 14001 and ISO 45001 programs to ensure EHSMS requirements are established, implemented, and maintained in accordance with both ISO standards. Responsible for creating and maintaining documentation."
    },
    {
      "duty": "Maintains on-going communication and positive working relationships with associates, customers (internal and external) and vendors (internal and external)."
    },
    {
      "duty": "Enforces and supports all company policies and procedures. Fully supports the company's commitment to safety and the environment and strives to maintain a clean, healthy and safe workplace."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 110,
      "introvert_extrovert": 85
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in an Industrial Safety or related field"
    }
  ]
}