{
  "meta": [
    {
      "job_title": "Quality Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Manufacturing",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Statistical Analysis",
      "experience": 5
    },
    {
      "skill": "Process Flow Charting",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Root Cause Analysis",
      "experience": 5
    },
    {
      "skill": "ISO 9001",
      "experience": 5
    },
    {
      "skill": "MS Office 365",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Follow safe work practices, comply with policies and procedures, proper and safe use of equipment and tools, and identify and report unsafe working conditions."
    },
    {
      "duty": "Perform statistical evaluation to validate and improve quality control measures for production."
    },
    {
      "duty": "Develop and maintain process flow charts, control plans, FMEA, and MSA throughout the manufacturing process and audit to ensure effectiveness."
    },
    {
      "duty": "Proactively evaluate and develop quality processes, measure quality activities, review and coordinate quality assurance and quality control activities, and recommend and implement measures to improve operations efficiency, reduce costs, and increase customer satisfaction."
    },
    {
      "duty": "Lead and participate in root cause investigations and analysis, determine and implement corrective and preventive actions to avoid recurrence. Ensure adherence to and drive improvement in conformance to ISO 9001, standards and ASME, ASTM, IEC, IEEE product specifications."
    },
    {
      "duty": "Contribute to change control, document control, design reviews and design documentation."
    },
    {
      "duty": "Audit products for compliance to specifications and verify testing/records are completed."
    },
    {
      "duty": "Participate in supplier qualification, as necessary."
    },
    {
      "duty": "Develop and deliver training material to improve and control product quality. Review customer orders for quality contract requirements, as necessary."
    },
    {
      "duty": "Living Hitachi Energy’s core values of safety and integrity, which means taking responsibility for your own actions while caring for your colleagues and the business."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in electrical, Mechanical, or Industrial Engineering or related field with 5+ years of experience as a Quality Engineer, or alternatively, a special combination of education and experience and/or demonstrated accomplishments."
    }
  ]
}