{
  "meta": [
    {
      "job_title": "Product Owner",
      "job_category": "Technology",
      "job_class": "Product Owner",
      "sector": "Technology",
      "salary": 130000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Business Technology Leadership",
      "experience": 5
    },
    {
      "skill": "Strategic Planning",
      "experience": 5
    },
    {
      "skill": "Business Case Development",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Technology Strategy",
      "experience": 5
    },
    {
      "skill": "Stakeholder Management",
      "experience": 5
    },
    {
      "skill": "Change Management",
      "experience": 5
    },
    {
      "skill": "Research and Analysis",
      "experience": 5
    },
    {
      "skill": "Standardization",
      "experience": 5
    },
    {
      "skill": "Vendor Evaluation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with senior leadership to identify opportunities and technology solutions, develop business cases, and gain alignment for technology investment and project decisions."
    },
    {
      "duty": "Lead the Retail Execution and Category Management technology strategy, roadmap, and execution."
    },
    {
      "duty": "Manage overall IT demand, continuously manage business partner expectations, and prepare/deliver regular updates and communications to the Business and IT Sr. Leadership teams."
    },
    {
      "duty": "Conduct research on current/future technologies, processes, and best practices, and determine the application of new technologies."
    },
    {
      "duty": "Lead projects of medium and large complexity, act as liaison between various IT organizations, and champion the change management efforts of IT initiatives."
    },
    {
      "duty": "Interface with suppliers and vendors to evaluate software, hardware, or services and make recommendations."
    },
    {
      "duty": "Ensure Service Level Agreements are established and meet expectations of the business partners."
    },
    {
      "duty": "Champion the change management efforts of IT initiatives with the business partner community."
    },
    {
      "duty": "Participate in the business planning activities by identifying future business demand and gaining alignment for appropriate funding."
    },
    {
      "duty": "Provide coaching/guidance to peers, junior team members, co-ops, and/or consultants."
    },
    {
      "duty": "Ensure Kenvue information assets are appropriately identified, valued, and protected by complying with and enforcing all local and worldwide security policies."
    },
    {
      "duty": "Consider and emphasize security in all Kenvue plans and actions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in IT, Computer Science, or a related field (Master's preferred)"
    }
  ]
}