{
  "meta": [
    {
      "job_title": "Nurse Practitioner or Physician Assistant",
      "job_category": "Healthcare",
      "job_class": "Practitioner",
      "sector": "Healthcare",
      "salary": 105000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Pediatric Care",
      "experience": 2
    },
    {
      "skill": "Family Medicine",
      "experience": 2
    },
    {
      "skill": "Healthcare Administration",
      "experience": 3
    },
    {
      "skill": "Patient Education",
      "experience": 3
    },
    {
      "skill": "Clinical Documentation",
      "experience": 3
    },
    {
      "skill": "Medical Diagnosis",
      "experience": 3
    },
    {
      "skill": "Electronic Medical Records",
      "experience": 3
    },
    {
      "skill": "Bilingual (Spanish)",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Administer routine pediatric care in a school-based community clinic setting, including medical procedures and drug treatments according to procedures and protocols."
    },
    {
      "duty": "Assist in ongoing assessment of client services and report any need for improvement."
    },
    {
      "duty": "Document all client care as appropriate in a timely manner."
    },
    {
      "duty": "Consult with clients by telephone, triaging, and referring these clients to services as appropriate."
    },
    {
      "duty": "Participate in on-call duties as directed if needed."
    },
    {
      "duty": "Ensure evaluation of lab results and other testing results with follow-up of abnormal values as appropriate."
    },
    {
      "duty": "Assist in patient education, preventative health care, as well as health maintenance concepts."
    },
    {
      "duty": "Participate in IDT and Performance Improvement Program."
    },
    {
      "duty": "Initiate an appropriate assessment of the patient's health status and obtain patients’ health history from interviews of patients and others."
    },
    {
      "duty": "Perform physical examinations and consult with colleagues, supervising Physicians, specialists, and other health professionals as appropriate."
    },
    {
      "duty": "Order pertinent diagnostic tests and procedures, perform diagnostic tests and procedures, and therapeutic procedures within the scope of practice."
    },
    {
      "duty": "Educate and inform patients regarding the nature of the illness and the progress of evaluation and treatment."
    },
    {
      "duty": "Analyze accumulated health information and collect additional observational, interview, historical, physical examination, and diagnostic data, modifying treatment as appropriate."
    },
    {
      "duty": "Make health record entries that are legible, concise, and timely."
    },
    {
      "duty": "Provide primary clinical therapy and treatment of individuals and groups of the patient(s) and demonstrate respect and regard for the dignity of all patients, families, visitors, and fellow employees."
    },
    {
      "duty": "Promote effective working relations and work effectively as part of a team to facilitate the department’s ability to meet its goals and objectives."
    },
    {
      "duty": "Attends all required safety training programs and operates assigned equipment in a safe manner."
    },
    {
      "duty": "Demonstrates proper body mechanics in all functions and checks on the patient’s environment and equipment to ensure safety."
    },
    {
      "duty": "Follows Legacy’s exposure control plans and demonstrates knowledge of techniques, procedures, and correct use of protective barrier equipment (Universal Precautions)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Current license from the Texas Board of Nursing or Texas Physician Assistant Board and completion of program at an accredited school. Provider to obtain, maintain and participate in the Medicare and Medicaid Programs, worker's compensation, other federal and state reimbursement programs, and the payment plan of any commercial insurer, health maintenance organization, preferred provider organization, accountable health plan, and other health benefit program requested by Legacy."
    },
    {
      "credential": "Bilingual in Spanish is a plus."
    }
  ]
}