{
  "meta": [
    {
      "job_title": "Phlebotomist",
      "job_category": "Healthcare",
      "job_class": "Phlebotomist",
      "sector": "Healthcare",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the collection of blood and other specimens from all patient populations using prescribed procedures with accuracy, skill, professionalism, and superb customer service."
    },
    {
      "duty": "Other specialized duties including patient registration, patient lab order management, processing specimens for testing, blood study kit handling, lab order entry and acting as a first responder to COM STARs, MTP, and various emergency condition codes."
    },
    {
      "duty": "Maintains a clean and orderly work environment to include regular cleaning of phlebotomy tray or carts."
    },
    {
      "duty": "Follows proper policy and procedure for specimen transport and specimen processing, including the transport/shipping of samples, receipt of samples, entering of workload comments, documentation of draws and processing to including centrifugation and separation."
    },
    {
      "duty": "Keeps up to date with knowledge of patient identification, patient preparation, collecting sites and apparatus, anticoagulants and preservatives, specimen transport, processing technique and storage."
    },
    {
      "duty": "Examines all specimens submitted (blood, urine, and other body fluids) for proper labeling and necessary information prior to final acceptance."
    },
    {
      "duty": "Verifies correct computer orders, specimen requirements and drawing supplies prior to proceeding to procure samples."
    },
    {
      "duty": "Obtains blood specimens from infants to adults as skillfully as possible using proper technique under specified aseptic conditions."
    },
    {
      "duty": "Effectively handles children, difficult patients, and unconscious patients. This includes proper care post invasive phlebotomy procedure."
    },
    {
      "duty": "Immediately, accurately, and completely labels and documents all specimens with required information per SOP including in the presence of the patient."
    },
    {
      "duty": "Observes proper safety practices in performance of job duties."
    },
    {
      "duty": "Acts to resolve problems via unit meetings and other appropriate channels."
    },
    {
      "duty": "Participates in performance improvement activities to improve service and care."
    },
    {
      "duty": "Maintains a professional, mature, positive attitude while on the job."
    },
    {
      "duty": "Verifies patient identification according to SOP (Standard Operating Procedures), always ensuring the correct identification of patients/ specimen with orders."
    },
    {
      "duty": "Maintains an adequate supply of all materials and notifies the appropriate person (supervisor) of status of supplies and assists in the unpacking and orderly arranging of supplies delivered."
    },
    {
      "duty": "Provides patients and other customers with necessary collection instructions, per department standards and helps ensure the proper execution of these instructions."
    },
    {
      "duty": "Assists in training by demonstrating techniques or methods to students/ new staff, when requested."
    },
    {
      "duty": "Observes emergency situations and initiates proper plan of action or consults supervisor if help is needed."
    },
    {
      "duty": "Represents the Organization in a professional, courteous manner to patients, families, and health care team while being sensitive to how others perceive both verbal and non‐verbal communication."
    },
    {
      "duty": "Performs other clerical and technical duties as instructed or requested."
    },
    {
      "duty": "Performs other duties as assigned, to include but not limited to typing, filing, answering telephones, and other duties as assigned."
    },
    {
      "duty": "Handles the primary customer service for the laboratory, patient registration, order entry/transcription, and Point of Care testing."
    },
    {
      "duty": "Maintains a clean and orderly work environment, follows proper specimen transport and processing procedures, and ensures cost effective patient care through proper use of equipment and resources."
    },
    {
      "duty": "Supports the organization and participates in performance improvement activities."
    },
    {
      "duty": "Demonstrates and integrates age‐specific care and follows established policies and procedures."
    },
    {
      "duty": "Maintains computer proficiency for navigating through information systems and performing other clerical and technical duties as needed."
    },
    {
      "duty": "Rotates evening, night, weekend, or holiday duty with coworkers, attends in‐service classes or workshops relevant to the job, and may travel to draw nursing home and/or homebound patients when required."
    }
  ],
  "skills": [
    {
      "skill": "Phlebotomy",
      "experience": 3
    },
    {
      "skill": "Clinical Laboratory",
      "experience": 3
    },
    {
      "skill": "Patient Registration",
      "experience": 3
    },
    {
      "skill": "Specimen Processing",
      "experience": 3
    },
    {
      "skill": "Emergency Response",
      "experience": 3
    },
    {
      "skill": "Computer Literacy",
      "experience": 3
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 3
    },
    {
      "skill": "Patient Care",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Quality Assurance",
      "experience": 3
    },
    {
      "skill": "First Aid/CPR",
      "experience": 3
    },
    {
      "skill": "Organizational Skills",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High school graduate or equivalent required. Completion of phlebotomy training program or equivalent experience is preferred."
    }
  ]
}