{
  "meta": [
    {
      "job_title": "Patient Care Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 58000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Teamwork",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Patient Care",
      "experience": 2
    },
    {
      "skill": "Medical Record Management",
      "experience": 3
    },
    {
      "skill": "Admission and Discharge Procedures",
      "experience": 3
    },
    {
      "skill": "Safety Protocols",
      "experience": 2
    },
    {
      "skill": "Information Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with the interprofessional team to deliver quality patient care under the direction of a licensed nurse."
    },
    {
      "duty": "Function as the coordinator of communication for the unit and assume primary responsibility for medical record management."
    },
    {
      "duty": "Facilitate patient data management through transcription, order entry, and documentation."
    },
    {
      "duty": "Support best use of resources in management of equipment, supplies, and other department resources."
    },
    {
      "duty": "Ensure complete room set up for new admission and conduct orientation for the patient and family members."
    },
    {
      "duty": "Communicate changes in patient's condition and take rapid action in life-threatening situations."
    },
    {
      "duty": "Comply with hospital infection control policies and safety procedures for equipment use."
    },
    {
      "duty": "Obtain, organize, and maintain patient charts and electronic medical records."
    },
    {
      "duty": "Ensure timely teletracking updates/requests and accurate disposition of patient requiring admission, transfer, or discharge."
    },
    {
      "duty": "Retrieve diagnostic study, lab results, and other relevant patient information supportive of patient assessment."
    },
    {
      "duty": "Prepare and stock downtime packets."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "AHA Basic Life Support for Healthcare Professional (AHA BLS Healthcare) - American Heart Association -REQUIRED"
    },
    {
      "credential": "H.S. Diploma or Equivalent"
    },
    {
      "credential": "Certification Comparable to certified nursing assistant course."
    },
    {
      "credential": "1 Year recent experience in geriatric setting or recent experience in an acute care hospital."
    },
    {
      "credential": "1 Year experience as unit clerk/secretary."
    }
  ]
}