{
  "meta": [
    {
      "job_title": "Business Development Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 90000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management (CRM)",
      "experience": 5
    },
    {
      "skill": "Lead Generation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Networking",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Marketing",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Source and hunt for new sales opportunities using various lead generation techniques including but not limited to web crawls for RFP’s, cold calling, email marketing, networking, and LinkedIn/social media."
    },
    {
      "duty": "Qualify prospective clients by having in-depth conversations with lead contacts to determine if the prospect has a business challenge or need that HWL can address through technology and/or managed services."
    },
    {
      "duty": "Set up meetings/demos with qualified prospect contact leads for our sales teams."
    },
    {
      "duty": "Identify RFP opportunities and reach out to institutions that publicly publish RFP’s to ensure our HWL suite of services is on the list to receive and respond to all appropriate bids."
    },
    {
      "duty": "Create, organize, and track activity, leads, meetings, and opportunities using selected CRM. Maintain high volume of activity and generate weekly reports for management on activity and leads generated."
    },
    {
      "duty": "Develop and maintain customer relationships, overcoming objections, and getting through the gatekeeper."
    },
    {
      "duty": "Meet/exceed monthly and quarterly activity and lead generation goals."
    },
    {
      "duty": "Meet weekly with the Sales teams to identify key target accounts and develop sales strategies and account plans that result in demos/meetings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "B.S. degree required."
    }
  ]
}