{
  "meta": [
    {
      "job_title": "Construction Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 106375,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Scheduling",
      "experience": 5
    },
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Subcontractor Management",
      "experience": 5
    },
    {
      "skill": "Cost Estimation",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Equipment Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Act as a representative and advocate of the company's culture and guiding principles."
    },
    {
      "duty": "Responsible for quality, schedule, and performance for assigned trades/section of the project."
    },
    {
      "duty": "Perform Material Manager duties, including conducting inspections and preparing punch lists."
    },
    {
      "duty": "Coordinate deliveries of direct purchased materials and inventory management."
    },
    {
      "duty": "Schedule and inventory deliveries of direct purchased materials such as lumber, trusses, rough hardware, windows, etc."
    },
    {
      "duty": "Assess the status of construction to determine the order in which to complete the project."
    },
    {
      "duty": "Prepare agenda and minutes of safety/production meetings as assigned by supervisor."
    },
    {
      "duty": "Inspect subcontractors’ work for compliance with Quality Control and ADA/FHA checklists."
    },
    {
      "duty": "Coordinate temporary laborers and dumpster hauling."
    },
    {
      "duty": "Review approved submittals and schedule pre-con meetings with subcontractors."
    },
    {
      "duty": "Conduct rough frame walks and coordinate readiness for an inspection."
    },
    {
      "duty": "Coordinate the mock-ups and schedule and coordinate the elevator construction."
    },
    {
      "duty": "Work with the punch carpenter for accuracy and completeness and maintain storage/laydown areas, temporary toilets, handwash stations, parking, and clean-up labor."
    },
    {
      "duty": "Lock up and close down the job site and assist in the resolution of on-site subcontractor issues."
    },
    {
      "duty": "Compile information on subcontractor employee head counts for the Daily Report."
    },
    {
      "duty": "Conduct COVID temperature checks and other safety walks with the safety inspector."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum of five years of construction experience with at least three years multi-family construction experience required."
    },
    {
      "credential": "Must be familiar with multifamily construction procedures."
    },
    {
      "credential": "Must have good working knowledge of construction scheduling practices."
    },
    {
      "credential": "Must be PC proficient."
    }
  ]
}