{
  "meta": [
    {
      "job_title": "Manufacturing Process Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Plans, designs, and improves manufacturing processes. Leads projects and initiatives related to product changes and continuous improvement in the manufacturing area. Also provides innovative solutions for process design in support of new product introduction."
    },
    {
      "duty": "Maximizes productivity, whether equipment, work force utilization, workstation optimization, administrative systems, and internal supply chains."
    },
    {
      "duty": "Leads customer-driven initiatives to reduce cost or to provide input on design for manufacturing principles for product design changes."
    },
    {
      "duty": "Leads internal initiatives for continuous improvement, such as implementation of Lean Manufacturing principles."
    },
    {
      "duty": "Leads projects to support product development, such as introduction of new product line, changes to existing product line, process improvements, or changes to line design."
    },
    {
      "duty": "Performs financial functions associated with projects, such as revenue recognition, forecasts, capital expense requests, and purchasing of major tooling/equipment."
    },
    {
      "duty": "Performs functions related to administrative side of projects, such as setting team vision, establishing project timelines, determining priorities, and directing activities for team members across various functional areas."
    },
    {
      "duty": "Provides on-demand support on manufacturing floor for issues that may require timely resolution and executes on plans to reduce recurrence."
    },
    {
      "duty": "Able to identify and implement process changes and systems that need improvement."
    },
    {
      "duty": "Key contributor to Kaizen events identified for immediate impact on product lines and specific manufacturing processes or systems."
    },
    {
      "duty": "Organizes validation efforts by scoping master validation plan and executing validation protocols and reports."
    },
    {
      "duty": "Addresses major issues found through exception events (such as non-conformances, temporary deviations, etc.) through the identification of root cause and corrective action."
    },
    {
      "duty": "Supports request for quotes by specifying required manufacturing processes and identifying necessary project activities to complete production transfer."
    },
    {
      "duty": "Gains mastery of support systems (change control, validation, corrections, costing, etc.) using them to maximum efficiency."
    },
    {
      "duty": "Continuously improves tools and systems used in own area of work."
    },
    {
      "duty": "Coordinates with other operational departments to ensure projects are completed on task."
    },
    {
      "duty": "Communicates with customers and vendors as needed."
    },
    {
      "duty": "Performs a variety of complex tasks using experience and judgment."
    },
    {
      "duty": "Upholds Spectrum Plastics Group vision and core values."
    },
    {
      "duty": "Follows all safety guidelines and adheres to safety absolutes."
    }
  ],
  "skills": [],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 70,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in engineering or equivalent experience in a related field (Master's preferred)"
    }
  ]
}