{
  "meta": [
    {
      "job_title": "Assistant Manager, Operations",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 30000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Operations Management",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 4
    },
    {
      "skill": "Budget Management",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 4
    },
    {
      "skill": "Retail Floor Leadership",
      "experience": 5
    },
    {
      "skill": "People Management",
      "experience": 4
    },
    {
      "skill": "Guest Experience Management",
      "experience": 4
    },
    {
      "skill": "Business Acumen",
      "experience": 4
    },
    {
      "skill": "Interactive Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Implement the Store Manager’s Operations vision for the store and cascade to team members."
    },
    {
      "duty": "Plan and prepare weekly team member schedule according to labor requirements, availability, and budget considerations."
    },
    {
      "duty": "Move dynamically on the retail floor to assess and fulfill the needs of the business, team, and guests."
    },
    {
      "duty": "Review, monitor, and partner with Store Manager to manage the budget and other business data and metrics (e.g., P&L statement, expenses) and inform planning processes (e.g., quarterly business review and sales planning)."
    },
    {
      "duty": "Provide retail floor leadership to team members, including planning retail floor coverage and making decisions to maintain efficiency and effectiveness of retail floor operations."
    },
    {
      "duty": "Support sell-through management by ensuring accuracy of inventory counts and coordinating labor hours to efficiently receive product deliveries."
    },
    {
      "duty": "Execute company-level operations-focused directives, projects, and initiatives (e.g., from the SSC)."
    },
    {
      "duty": "Understand and adhere to people safety policies and procedures to maintain a safe work environment."
    },
    {
      "duty": "Create and foster a respectful and inclusive team environment by welcoming and celebrating differences to ensure a supportive, productive, and fun experience for all team members."
    },
    {
      "duty": "Facilitate a seamless end-to-end guest experience by monitoring the incorporation of omnichannel programs (e.g., in-store guest transactions, buy online pickup in store, phone sales, and ship from store)."
    },
    {
      "duty": "Collaborate with team members to ensure an optimal guest experience that values guests’ time and supports store operations."
    },
    {
      "duty": "Resolve guest feedback and address issues, including guest escalations and urgent requests, helping to “make it right” for guests."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or equivalent"
    }
  ]
}