{
  "meta": [
    {
      "job_title": "HR Director",
      "job_category": "Human Resources",
      "job_class": "Director",
      "sector": "HR",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "HR Operations",
      "experience": 7
    },
    {
      "skill": "Performance Management",
      "experience": 7
    },
    {
      "skill": "Talent Management",
      "experience": 7
    },
    {
      "skill": "Benefits Administration",
      "experience": 7
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "HRIS",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design, develop, and implement effective people strategies and tactics to improve service, employee engagement, and profitability."
    },
    {
      "duty": "Administer Human Resources functions including performance management, benefits and leave administration, and enforcement of company policies."
    },
    {
      "duty": "Develop initiatives, policies, and programs to complement existing practices and create consistency across the organization."
    },
    {
      "duty": "Lead and develop an HR Professional team, providing strategic direction and focus, and motivating and supporting current staff."
    },
    {
      "duty": "Works effectively as a team member with other members of management."
    },
    {
      "duty": "Maintain knowledge of best practices, regulatory changes, and new technologies in human resources and talent management; communicate changes in policy, practice, and resources to upper management."
    },
    {
      "duty": "Ensure organizational communications are maintained to ensure employees have knowledge of HR events and resources."
    },
    {
      "duty": "Support employee relations and leave issues as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Human Resources, Business Administration, or related field (Master's preferred)"
    },
    {
      "credential": "SHRM Certified Professional (SHRM-CP) or SHRM Senior Certified Professional (SHRM-SCP) credential preferred"
    }
  ]
}