{
  "meta": [
    {
      "job_title": "Regional Technical Sales Representative",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 70000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Technical Sales",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Field Measurement",
      "experience": 5
    },
    {
      "skill": "Product Demonstration",
      "experience": 5
    },
    {
      "skill": "Sales Appointment Coordination",
      "experience": 5
    },
    {
      "skill": "Conflict Resolution",
      "experience": 5
    },
    {
      "skill": "Blueprint Interpretation",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build customer loyalty and strong relationships by providing an exceptional level of service to partners and external customers."
    },
    {
      "duty": "Properly and accurately use standard and proprietary measurement tools and methods to perform accurate onsite, field measurement services for roofing or roofing edge products."
    },
    {
      "duty": "Coordinate and effectively manage schedule for onsite field visits, measure appointments, sales appointments, and service meeting with customers."
    },
    {
      "duty": "Conduct dynamic and informative product demonstrations to increase awareness of, and encourage the purchase and use of, products."
    },
    {
      "duty": "Submit in a timely, legible, and error-free manner, all measurement-related documents and/or blueprints required for internal quote processing."
    },
    {
      "duty": "Troubleshoot, diagnose, and provide recommendations as needed, onsite or via remote solutions, for all assigned customers experiencing problems or difficulties with products."
    },
    {
      "duty": "Conduct outside sales and business development activities to secure and close new customers."
    },
    {
      "duty": "Adhere to all company policies, procedures, and practices of Metal-Era; as well as adhere to all policies, procedures and practices of the customers’ sites you visit."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalent; plus 2+ years’ successful experience in a customer-facing position, preferably in an outside or B2B environment."
    },
    {
      "credential": "Proficiency in using PLAN SWIFT Architectural Take-Off software is preferred but will train the right candidate."
    },
    {
      "credential": "Above-average computing and technical skills, including high level of proficiency in Microsoft Outlook, Word, and Excel."
    },
    {
      "credential": "Excellent written, verbal, and interpersonal communication skills."
    },
    {
      "credential": "Strong customer service, consultative sales, and conflict resolutions skills."
    },
    {
      "credential": "Strong mathematical skills, including the proven ability to properly and accurately take, document, and aggregate measurements."
    },
    {
      "credential": "Demonstrated ability to read and interpret blueprints and construction documents."
    },
    {
      "credential": "Ability to safely and regularly climb ladders to conduct inspections, demonstrations, and measurements of commercial roofing components."
    },
    {
      "credential": "Current valid driver’s license, a clean driving record, access to your own reliable transportation, and ability to spend significant time driving a vehicle to appointments each workday."
    },
    {
      "credential": "Preferred qualifications are not required for the role; however, will assist the candidate in performing in the role more quickly."
    },
    {
      "credential": "Some experience working in construction or the roofing industry; with commercial experience or experience with metal roofing components in a low-slope or flat roofing environment is preferred. Or, some experience using or manufacturing sheet metal roofing and/or roofing edging is preferred."
    },
    {
      "credential": "Prefer candidates with some level of education in construction, construction management, or trades (e.g.: technical certificate, technical diploma, or degree)"
    },
    {
      "credential": "Prefer 2+ years’ successful experience conducting some level of “field service” or outside “sales and consultation” activities in a business-to-business environment."
    },
    {
      "credential": "This role requires frequent day and/or overnight travel to clients’ construction worksites and locations. This travel is most often by automobile but may also include public transportation methods such as air travel, bus, subway, or train."
    },
    {
      "credential": "Once onsite, the RTS must be comfortable and able to safely work on commercial building roofs in variable weather conditions, often with the use of a free-standing ladder."
    },
    {
      "credential": "Candidates must have the ability to regularly lift up-to 75-pounds without assistance."
    },
    {
      "credential": "The position is primarily a remote and field service role, with regular exposure to driving conditions, construction sites, vendor sites, distributor sites, variable year-round weather conditions, and working at heights. Regular donning of PPE is required, based on the specific job site(s) for the workday. Often, RTS Reps complete administrative work and follow-up tasks from a mobile office, hotel, or home office."
    }
  ]
}