{
  "meta": [
    {
      "job_title": "Production Associate",
      "job_category": "Manufacturing",
      "job_class": "Associate",
      "sector": "Manufacturing",
      "salary": 32000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "General Labor",
      "experience": 2
    },
    {
      "skill": "Safety Compliance",
      "experience": 3
    },
    {
      "skill": "Material Handling",
      "experience": 2
    },
    {
      "skill": "Quality Control",
      "experience": 2
    },
    {
      "skill": "Machine Operation",
      "experience": 2
    },
    {
      "skill": "Teamwork",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Moving raw materials, components, and finished goods within the manufacturing plant."
    },
    {
      "duty": "Performing general housekeeping of floors, machinery, and facility."
    },
    {
      "duty": "Assisting with manual labor under the direct supervision of an Operations Supervisor."
    },
    {
      "duty": "Assisting in the manufacturing process of finished goods when needed."
    },
    {
      "duty": "Feeding items into machinery, assembling boxes, and stacking goods on pallets."
    },
    {
      "duty": "Inspecting products for defects and facilitating reprocessing and repair."
    },
    {
      "duty": "Providing labor support as needed and backfilling other positions at the line."
    },
    {
      "duty": "Safety restraints compliance and identification of hazards for cleanup tasks."
    },
    {
      "duty": "Directing and assisting new employees to ensure workplace safety."
    },
    {
      "duty": "Maintaining cleanliness by wiping down machines, equipment, and products."
    },
    {
      "duty": "Lifting materials, final products, and packed items for shipment."
    },
    {
      "duty": "Opening and closing rolls of product during processing."
    },
    {
      "duty": "Separating products according to size, grade, and composition of material used."
    },
    {
      "duty": "Examining products to verify conformance to company standards."
    },
    {
      "duty": "Recording production information and counting finished products for distribution."
    },
    {
      "duty": "Applying stickers, plastics, or tags to products and bundling products for shipment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 20,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent"
    },
    {
      "credential": "Warehouse experience"
    }
  ]
}