{
  "meta": [
    {
      "job_title": "Retail Team Leader",
      "job_category": "Retail",
      "job_class": "Team Leader",
      "sector": "Retail",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 1
    },
    {
      "skill": "Sales Analysis",
      "experience": 1
    },
    {
      "skill": "Merchandising",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Vendor Relationship Management",
      "experience": 1
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 1
    },
    {
      "skill": "Retail Execution",
      "experience": 1
    },
    {
      "skill": "Training and Development",
      "experience": 1
    },
    {
      "skill": "Performance Evaluation",
      "experience": 1
    },
    {
      "skill": "Microsoft Office",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Team Leader in all aspects of daily operations including profitability, expense control, buying, merchandising, labor, regulatory compliance, and special projects as assigned."
    },
    {
      "duty": "Lead and develop Team Members, ensuring a positive company image by providing courteous, friendly, and efficient service to customers and Team Members at all times."
    },
    {
      "duty": "Develop and maintain creative store layout and product merchandising. Achieve sales, purchasing, and labor targets. Analyze sales, reports, and labor."
    },
    {
      "duty": "Demonstrate advanced product knowledge and awareness of new products. Maintain good vendor relationships, develop new vendor relations, and ensure all paperwork is properly submitted for vendor processing."
    },
    {
      "duty": "Resolve team concerns or issues. Function as point person and departmental person in charge in the absence of Team Leader. Set and achieve the highest standards of retail execution."
    },
    {
      "duty": "Foster and encourage a positive environment of outstanding teamwork, mutual respect, and exceptional morale. Maintain awareness of customer flows and needs and direct Team Members as necessary to satisfy and delight customers. Select, train, develop, mentor, motivate, and counsel Team Members. Provide timely, thorough, and thoughtful performance evaluations. Communicate and model WFM vision and goals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Retail Management, Business Administration, or a related field (Master's preferred)"
    }
  ]
}