{
  "meta": [
    {
      "job_title": "Project Engineering Manager",
      "job_category": "Engineering",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Capex project management",
      "experience": 3
    },
    {
      "skill": "Scheduling software knowledge (P6 or MS Project)",
      "experience": 3
    },
    {
      "skill": "Cost reporting and trending through project management tools and Microsoft Excel",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage small, minor, and major capital projects from end to end, including concept, scope, cost, resources, funding, etc."
    },
    {
      "duty": "Maintain visibility to the design process and assure adherence to all established key components and project deliverables."
    },
    {
      "duty": "Directly manage overall project execution including construction and commissioning."
    },
    {
      "duty": "Coordinate with the client and various other groups inside and outside of the organization."
    },
    {
      "duty": "Assist in the development of pre-project approval documents including project charter, project management plan, project kick start, estimate, and milestone schedule creation."
    },
    {
      "duty": "Monitor design progress and ensure deliverables are met in adherence to established project key components."
    },
    {
      "duty": "Receive design details from the design team with a full understanding of project deliverables to coordinate bid package development and release for construction bidding and field execution."
    },
    {
      "duty": "Select contractors and contracting methods based on engineering ways of working methodology."
    },
    {
      "duty": "Manage adherence to project scope and secure approvals for all changes in projects based on engineering ways of working methodology."
    },
    {
      "duty": "Manage and control project budget providing cost forecasts and cash flow projections through development of project cost and status reports on at least a monthly basis or as requested by project stakeholders."
    },
    {
      "duty": "Manage and maintain project milestone schedules with integrated detailed scheduling as agreed upon in the project charter."
    },
    {
      "duty": "Provide construction management and plant startup assistance as needed to ensure successful project execution."
    },
    {
      "duty": "Evaluate, select, and issue contracts for construction firms through bidding and prequalification vetting processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science degree in engineering from an accredited University"
    }
  ]
}