{
  "meta": [
    {
      "job_title": "Assistant Contracts Administrator",
      "job_category": "Contracts Administration",
      "job_class": "Administrator",
      "sector": "Management",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Administer contracts, subcontracts, grants, and NDAs throughout their entire lifecycle, including preparation, negotiation, execution, and closeout."
    },
    {
      "duty": "Draft, review, and modify various contracts and modifications in collaboration with clients, ensuring accuracy and compliance."
    },
    {
      "duty": "Maintain accurate and up-to-date contract records and documentation, utilizing electronic systems and databases."
    },
    {
      "duty": "Conduct meetings with VP of Finance and Administration to address legal and business aspects of contracts, ensuring mutual understanding and satisfaction."
    },
    {
      "duty": "Collaborate with cross-functional teams to provide guidance on award implementation, ensuring adherence to terms and conditions."
    },
    {
      "duty": "Foster and nurture strong relationships with clients, acting as a point of contact to address inquiries and concerns."
    },
    {
      "duty": "Assist VP to prepare, review, and negotiate contracts, contributing to successful business outcomes by balancing legal considerations and strategic goals."
    },
    {
      "duty": "Manage subcontract closeout documentation, ensuring all contractual requirements are met."
    },
    {
      "duty": "Support proposal management activities, participating in the development of compelling proposals for potential clients."
    },
    {
      "duty": "Stay current with industry trends, legal developments, and best practices related to contract management."
    },
    {
      "duty": "Collaborate with legal and finance teams to ensure contracts adhere to organizational policies and regulatory requirements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting, Finance, Business Administration, or related field."
    }
  ]
}