{
  "meta": [
    {
      "job_title": "Sr. Loan Accounting Specialist",
      "job_category": "Accounting",
      "job_class": "Specialist",
      "sector": "Finance",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure accurate portfolio administration by maintaining accurate records and files for third-party investors who have retained client's servicing services."
    },
    {
      "duty": "Perform tasks in accordance with contractual, compliance, and investor requirements."
    },
    {
      "duty": "Research and resolve all variances."
    },
    {
      "duty": "Ensure timely remittance of funds due to new servicers."
    },
    {
      "duty": "Update rates, terms, and dates in systems for ARMS, ensuring that system audit data is accurately reflected."
    },
    {
      "duty": "Generates letters notifying borrowers of changes to loans based on Index Rate changes."
    },
    {
      "duty": "Research payments made by Loan Servicing department."
    },
    {
      "duty": "Provide files and documents related to external and internal audits."
    },
    {
      "duty": "Participate in assigned special projects, such as system enhancement and testing."
    },
    {
      "duty": "Respond to investor inquiries."
    },
    {
      "duty": "Work to increase efficiencies by providing recommendations for system and process improvements."
    },
    {
      "duty": "Use expertise to answer questions from less experienced teammates."
    },
    {
      "duty": "Respond to escalated inquiries and problems that cannot be resolved by more junior teammates."
    },
    {
      "duty": "Support new hire training and work closely with less experienced employees."
    },
    {
      "duty": "Participate in creation of training materials and job aids, as well as any new rollouts or updates."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "High school diploma or equivalent required; a Bachelor’s degree in Business, Accounting, Finance, etc. or equivalent relevant work experience is preferred, along with a minimum of three years total work experience in Investor Reporting Accounting position(s) in Mortgage Loan Servicing Operations."
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 3
    },
    {
      "skill": "Financial Reporting",
      "experience": 3
    },
    {
      "skill": "Mortgage Loan Servicing",
      "experience": 3
    },
    {
      "skill": "GSA Knowledge (FHLMC, GNMA, FNMA)",
      "experience": 3
    },
    {
      "skill": "Excel Skills",
      "experience": 3
    },
    {
      "skill": "10-Key by Touch",
      "experience": 3
    }
  ]
}