{
  "meta": [
    {
      "job_title": "MS Search Specialist",
      "job_category": "Software Engineering",
      "job_class": "Specialist",
      "sector": "Software Engineering",
      "salary": 115000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "MS Search Configuration",
      "experience": 5
    },
    {
      "skill": "Power Platform",
      "experience": 5
    },
    {
      "skill": "API Integration",
      "experience": 5
    },
    {
      "skill": "Power BI",
      "experience": 5
    },
    {
      "skill": "Technical Standards",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Agile Methodology",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Configure MS Search following best practices recommended by Microsoft"
    },
    {
      "duty": "Provide self-service offering for MS Search features including Bookmarks, Q&A’s and Acronyms"
    },
    {
      "duty": "Deploy MS Search Graph connector/Agents to crawl external content"
    },
    {
      "duty": "Set up MS Search Graph connector/agents HA/DR as per requirements"
    },
    {
      "duty": "Action on the MS Search analytics to measure and drive the adoption"
    },
    {
      "duty": "Experience with Power Platform governance and best practices"
    },
    {
      "duty": "Experience with API or REST Services Integrations"
    },
    {
      "duty": "Develop, maintain, and support solutions built on the Power Platform: Power Apps and Power Automate"
    },
    {
      "duty": "Build and configure Power BI, Power Apps, Automatic Process Workflows with Power Automate and necessary connectors."
    },
    {
      "duty": "Responsible for governance and implementation of the Power Platform tools."
    },
    {
      "duty": "Leverage Metadata and Content types to ensure consistency across all Power Platform solutions"
    },
    {
      "duty": "Adhere to and help construct technical standards, security, and IT best practices."
    },
    {
      "duty": "Develop a training and knowledge transfer plan to IT staff"
    },
    {
      "duty": "Develop and maintain a product backlog and features list"
    },
    {
      "duty": "Experience using any agile tool for scrum/sprints"
    },
    {
      "duty": "Utilize problem solving skills to understand client pain points and troubleshoot as challenges arise"
    },
    {
      "duty": "Work with business and IT Teams to design end-to-end solutions that improve collaboration, productivity, and knowledge sharing"
    },
    {
      "duty": "Interface with business users in a professional manner to understand their requirements and analyze requirements to plan and develop solutions"
    },
    {
      "duty": "Microsoft Search, Azure Search, Enterprise Search Domain Knowledge, Power Platform, Graph API"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Computer Science, Information Technology, or related field (Master's preferred)"
    }
  ]
}