{
  "meta": [
    {
      "job_title": "Executive Assistant to the CEO",
      "job_category": "Administration",
      "job_class": "Assistant",
      "sector": "Management",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Calendar Management",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Project Coordination",
      "experience": 5
    },
    {
      "skill": "Travel Arrangements",
      "experience": 5
    },
    {
      "skill": "Correspondence",
      "experience": 5
    },
    {
      "skill": "Confidentiality",
      "experience": 5
    },
    {
      "skill": "Expense Management",
      "experience": 5
    },
    {
      "skill": "KPI Management",
      "experience": 5
    },
    {
      "skill": "Meeting Support",
      "experience": 5
    },
    {
      "skill": "Prioritization",
      "experience": 5
    },
    {
      "skill": "Administrative Support",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Bachelor's Degree",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Proactively manage the CEO's complex calendar, scheduling meetings, appointments, and travel arrangements to optimize time and prioritize commitments."
    },
    {
      "duty": "Serve as the primary point of contact between the CEO and internal/external partners, filtering and responding to inquiries, emails, and calls with professionalism and discretion."
    },
    {
      "duty": "Coordinate and prepare materials for executive meetings, ensuring that the CEO is well-informed and equipped for discussions."
    },
    {
      "duty": "Assist in the planning and execution of key projects, collaborating with cross-functional teams to drive successful outcomes."
    },
    {
      "duty": "Manage travel logistics, including booking flights, accommodations, transportation, and itineraries, while adhering to company policies."
    },
    {
      "duty": "Handle sensitive information with the highest level of discretion and confidentiality, maintaining a strong sense of professionalism at all times."
    },
    {
      "duty": "Monitor and manage expense reports, reimbursements, and invoices, ensuring accurate and timely processing."
    },
    {
      "duty": "Monitor and manage KPI’s and KPI reports, prepare, print and distribute reports for daily and monthly meetings."
    },
    {
      "duty": "Identify and anticipate priorities, proactively addressing potential challenges and proposing solutions to streamline operations."
    },
    {
      "duty": "Handle personal tasks such as running errands, scheduling personal appointments, and managing personal matters as requested by the CEO."
    },
    {
      "duty": "Draft, edit, and proofread various forms of communication, including emails, reports, presentations, and other documents on behalf of the CEO."
    },
    {
      "duty": "Bachelor's degree in Business Administration, Management, or a related field preferred."
    },
    {
      "duty": "Experience in project management and an understanding of business operations is a plus."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Management, or a related field preferred."
    }
  ]
}