{
  "meta": [
    {
      "job_title": "Automotive Repair and Machinist",
      "job_category": "Automotive",
      "job_class": "Skilled Worker",
      "sector": "Automotive",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Performs skilled repairs on gasoline and diesel motor equipment including automobiles, trucks, and construction equipment."
    },
    {
      "duty": "Runs computerized diagnostic tests on vehicles and compares results with specifications for vehicle make to determine servicing and repair needs."
    },
    {
      "duty": "Performs and directs routine preventive maintenance servicing and inspections."
    },
    {
      "duty": "Grinds valves and fits new bearings, pistons, and rings."
    },
    {
      "duty": "Assembles and times engines."
    },
    {
      "duty": "Performs field repairs on equipment and operates the same."
    },
    {
      "duty": "Repairs or overhauls brake systems, differentials, transmissions, front and rear axles, and clutches."
    },
    {
      "duty": "Adjusts steering mechanisms and aligns wheels."
    },
    {
      "duty": "Occasionally operates machine shop equipment, including grinders, drill presses, and other metalworking machines to make and repair parts for automotive equipment."
    },
    {
      "duty": "Makes estimates and prepares requisitions for materials."
    },
    {
      "duty": "Inspects, repairs, and replaces automotive electrical system components."
    },
    {
      "duty": "Participates in snow and ice control activities."
    },
    {
      "duty": "May perform body repair and body painting tasks."
    },
    {
      "duty": "May supervise the repair and maintenance work of the second shift."
    },
    {
      "duty": "May drive heavy equipment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 70,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Associate’s degree in Automotive Mechanics, Automotive Technology, or related field (or equivalent experience)"
    }
  ]
}