{
  "meta": [
    {
      "job_title": "Sales Associate",
      "job_category": "Retail",
      "job_class": "Associate",
      "sector": "Sales",
      "salary": 35000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Retail Sales",
      "experience": 1
    },
    {
      "skill": "Selling Techniques",
      "experience": 1
    },
    {
      "skill": "Inventory Management",
      "experience": 1
    },
    {
      "skill": "Digital Technology",
      "experience": 1
    },
    {
      "skill": "Mobile Devices",
      "experience": 1
    },
    {
      "skill": "Clienteling",
      "experience": 1
    },
    {
      "skill": "Marketing",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Team Collaboration",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide outstanding customer service and retail sales support to meet or exceed customer service goals."
    },
    {
      "duty": "Use suggestive selling techniques and meet solicitation goals for the Belk credit Rewards program."
    },
    {
      "duty": "Stay informed about store assortment, digital technology, and inventory available at other stores and on belk.com."
    },
    {
      "duty": "Utilize digital technology such as mobile devices and computer-based Point-of-Sale to enhance the customer shopping experience."
    },
    {
      "duty": "Meet or exceed personal sales goals, increase units sold per transaction, and reduce shrinkage in the area."
    },
    {
      "duty": "Maintain store standards, professional dress, and appearance, including floor and stock areas."
    },
    {
      "duty": "Support operations and assist with non-sell duties as assigned by the Sales Team Manager."
    },
    {
      "duty": "No education requirement. Experience in retail preferred. Ability to use and learn industry technology preferred."
    },
    {
      "duty": "Physical requirements include using business equipment, hand manipulation, and lifting 25-50 pound boxes."
    },
    {
      "duty": "For reasonable accommodation information, refer to the Belk Associate Handbook for policy and procedures."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "No education requirement. Experience in retail preferred"
    }
  ]
}