{
  "meta": [
    {
      "job_title": "Manufacturing Manager",
      "job_category": "Manufacturing",
      "job_class": "Manager",
      "sector": "Manufacturing",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Production Scheduling",
      "experience": 5
    },
    {
      "skill": "Lean Material Management",
      "experience": 5
    },
    {
      "skill": "SAP / ERP",
      "experience": 5
    },
    {
      "skill": "APICS Certification",
      "experience": 5
    },
    {
      "skill": "Windows Environment Computer Skills",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Inventory or Production Control",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and oversee the execution of manufacturing schedules and assure the application of all production, test, development, documentation, and safety standards."
    },
    {
      "duty": "Utilize Lean concepts to reduce and manage WIP and inventory and improve material flow."
    },
    {
      "duty": "Assist in formulation of business plan including capital improvements and projection of plant production capabilities."
    },
    {
      "duty": "Prepare reports and analysis of various cost control, production, labor, quality, facility usage, and other reports."
    },
    {
      "duty": "Conduct studies to ensure the plant continues to operate in a cost-efficient manner as technology, legal, regulatory policy, and product changes are implemented."
    },
    {
      "duty": "Perform those administrative activities necessary for the effective management of the department, including selection and development of employees, budget administration, employee counseling, and motivation, and organization goals and objectives."
    },
    {
      "duty": "Plan, organize, integrate, and measure the work performed within the department."
    },
    {
      "duty": "Perform other duties as required."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Business Administration or a related field is required. Master’s degree preferred."
    },
    {
      "credential": "3 to 5 years of materials focus experience in a manufacturing environment using SAP"
    },
    {
      "credential": "5 or more years of experience in inventory or production control"
    }
  ]
}