{
  "meta": [
    {
      "job_title": "Sanitation and Processing Manager",
      "job_category": "Operations",
      "job_class": "Manager",
      "sector": "Food Production",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Food Safety Management",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "HACCP Principles",
      "experience": 5
    },
    {
      "skill": "Document Control",
      "experience": 5
    },
    {
      "skill": "Statistical Analysis",
      "experience": 5
    },
    {
      "skill": "Supply Chain Inspection",
      "experience": 5
    },
    {
      "skill": "GMP Compliance",
      "experience": 5
    },
    {
      "skill": "Process Efficiency Improvement",
      "experience": 5
    },
    {
      "skill": "Bilingual (English/Spanish)",
      "experience": 3
    },
    {
      "skill": "Product Quality Reporting",
      "experience": 5
    },
    {
      "skill": "Facility Sanitation Compliance",
      "experience": 5
    },
    {
      "skill": "Product Formulation",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee daily operations of sanitation and processing crews, as well as QA for processing."
    },
    {
      "duty": "Develop and maintain systems to ensure compliance to all Food Safety Standards."
    },
    {
      "duty": "Responsible for all Document Control and Records."
    },
    {
      "duty": "Provide technical leadership with an emphasis on continuous process improvement and product quality."
    },
    {
      "duty": "Monitor and update existing HACCP, SOP, and QA programs, procedures, and document control programs."
    },
    {
      "duty": "Record and analyze statistical data and recommend modifications, or suggest new standards, methods, and procedures."
    },
    {
      "duty": "Implement quality assurance programs that effectively monitor product manufacturing in compliance with GMP’s, SOP’s, and HACCP."
    },
    {
      "duty": "Perform analytical tests, inspections, and monitoring of incoming raw materials/packaging and finished goods for specification compliance."
    },
    {
      "duty": "Assist with supply chain inspection, approval, and audit programs."
    },
    {
      "duty": "Implement and manage Random Microbiological testing on equipment and product."
    },
    {
      "duty": "Prepare product and process quality reports by collecting, analyzing, and summarizing information and trends."
    },
    {
      "duty": "Maintain a 'floor presence' as an auditor of quality throughout the processing facility."
    },
    {
      "duty": "Ensure maintenance and sanitation of the facility is in compliance with food safety requirements."
    },
    {
      "duty": "Collaborate with colleagues in Supply Chain, Operations, and Quality functions to continually improve capability and process efficiency."
    },
    {
      "duty": "Make decisions concerning product quality, including shutting down the line when processes do not conform to specifications."
    },
    {
      "duty": "Develop product formulation sheets for new products."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "HACCP Certification"
    },
    {
      "credential": "PCQI Certification"
    },
    {
      "credential": "Bachelor's degree in Food Science, Engineering, or related field (Master's preferred)"
    }
  ]
}