{
  "meta": [
    {
      "job_title": "Senior Financial Analyst",
      "job_category": "Finance",
      "job_class": "Senior Analyst",
      "sector": "Financial Planning & Analysis",
      "salary": 110000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Planning",
      "experience": 4
    },
    {
      "skill": "Financial Analysis",
      "experience": 4
    },
    {
      "skill": "Budgeting",
      "experience": 4
    },
    {
      "skill": "Financial Modeling",
      "experience": 4
    },
    {
      "skill": "Data Analysis",
      "experience": 4
    },
    {
      "skill": "Microsoft Excel",
      "experience": 4
    },
    {
      "skill": "Financial Management Systems",
      "experience": 4
    },
    {
      "skill": "Data Visualization Tools",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and conduct financial planning processes, budgeting, forecasting, and variance analysis to provide accurate and insightful reports to senior management."
    },
    {
      "duty": "Develop and maintain sophisticated financial models to assess performance, identify trends, and forecast future financial outcomes."
    },
    {
      "duty": "Provide comprehensive financial analyses, highlighting opportunities, risks, and areas for improvement, to support strategic decision-making and business growth initiatives."
    },
    {
      "duty": "Implement key performance indicators (KPIs) and track financial and operational metrics to measure business performance and monitor achievements against targets."
    },
    {
      "duty": "Analyze cost structures, pricing strategies, and profitability to optimize resource allocation and support cost-saving initiatives."
    },
    {
      "duty": "Prepare and present financial reports, dashboards, and presentations to various stakeholders, including executives and department heads."
    },
    {
      "duty": "Conduct market research and competitor analysis to gain insights into industry trends and identify potential growth opportunities."
    },
    {
      "duty": "Ensure compliance with relevant financial regulations, accounting standards, and internal policies."
    },
    {
      "duty": "Collaborate with other departments, such as Sales, Marketing, and Operations, to support cross-functional projects and align financial objectives with overall business strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Accounting, Economics, or a related field; Master's degree preferred."
    }
  ]
}