{
  "meta": [
    {
      "job_title": "Sales Executive",
      "job_category": "Sales",
      "job_class": "Executive",
      "sector": "Sales",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Prospecting",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Lead Generation",
      "experience": 5
    },
    {
      "skill": "CRM Management",
      "experience": 5
    },
    {
      "skill": "Public Speaking",
      "experience": 5
    },
    {
      "skill": "Business Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Build and maintain a network of sources to identify new sales leads."
    },
    {
      "duty": "Communicate with prospects to understand their needs and suggest products/services to meet those needs."
    },
    {
      "duty": "Demonstrate the functions and utility of products/services to various channel prospects and customers."
    },
    {
      "duty": "Ensure customer satisfaction through ongoing communication and relationship management."
    },
    {
      "duty": "Maintain detailed reports of sales activities, including calls, orders, and sales forecasts."
    },
    {
      "duty": "Identify and analyze customer preferences, provide feedback loops to improve the offering and market position."
    },
    {
      "duty": "Prospect for new business through personal lead generation across the U.S."
    },
    {
      "duty": "Develop relationships, secure new contracts, and meet/exceed established quotas."
    },
    {
      "duty": "Maintain updates in the CRM (HubSpot) system and report on pipeline status/goal adherence monthly."
    },
    {
      "duty": "Pitch the platform to appropriate stakeholders in organizations, primarily with self-funded health plans and related entities."
    },
    {
      "duty": "Attend networking functions, meetings, and conferences and participate in speaking engagements."
    },
    {
      "duty": "Create a seamless hand-off of the customer to the Customer Success Team once the contract is finalized."
    },
    {
      "duty": "Maintain relevant industry and technical knowledge by participating in development activities."
    },
    {
      "duty": "Contribute to the team effort and execute related results as needed."
    },
    {
      "duty": "Own the sales process from prospecting to contract negotiation."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Marketing, Sales, Business, or related field (Master's preferred)"
    }
  ]
}