{
  "meta": [
    {
      "job_title": "Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 125000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Manages and oversees company staff, subcontractors, suppliers, and programs such as Safety, Quality, and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Coordinates and manages the care, custody, and control of the project site."
    },
    {
      "duty": "Communicates key project information to owners, design team, governing authorities, subcontractors, suppliers, and other departments."
    },
    {
      "duty": "Participates in the negotiation process with the owner and architect to gain agreement for project changes."
    },
    {
      "duty": "Supports the project closeouts by supervising pre-punch activities and coordinating activities with the owner, architect, and governing authorities."
    },
    {
      "duty": "Partners with project management to identify schedule and costs associated with project changes."
    },
    {
      "duty": "Responsible for identifying and recruiting top talent."
    },
    {
      "duty": "Leads, supports, and promotes a culture of diversity and inclusion within JE Dunn."
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 12
    },
    {
      "skill": "Project Management",
      "experience": 12
    },
    {
      "skill": "Safety Management",
      "experience": 12
    },
    {
      "skill": "Quality Control",
      "experience": 12
    },
    {
      "skill": "Negotiation",
      "experience": 12
    },
    {
      "skill": "Recruitment",
      "experience": 12
    },
    {
      "skill": "Leadership",
      "experience": 12
    },
    {
      "skill": "Team Collaboration",
      "experience": 12
    },
    {
      "skill": "Budget Management",
      "experience": 12
    },
    {
      "skill": "Diversity and Inclusion",
      "experience": 12
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in construction management, engineering, or related field (Preferred). In lieu of the above requirements, equivalent relevant experience will be considered."
    }
  ]
}