{
  "meta": [
    {
      "job_title": "Supervisor, Victim Services",
      "job_category": "Victim Services",
      "job_class": "Supervisor",
      "sector": "Nonprofit",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 3
    },
    {
      "skill": "Crisis Intervention",
      "experience": 4
    },
    {
      "skill": "Community Engagement",
      "experience": 4
    },
    {
      "skill": "Case Management",
      "experience": 4
    },
    {
      "skill": "Conflict Resolution",
      "experience": 4
    },
    {
      "skill": "Program Management",
      "experience": 4
    },
    {
      "skill": "Outreach Coordination",
      "experience": 4
    },
    {
      "skill": "Recruitment",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supervise assigned staff and ensure quality services for participants."
    },
    {
      "duty": "Lead the Victim Advocate team and coordinate with Case Management and Outreach teams."
    },
    {
      "duty": "Appraise performance, reward, and address performance deficiencies through coaching and corrective action."
    },
    {
      "duty": "Provide leadership in the recruitment and enrollment of participants and conduct individual interviews and assessments."
    },
    {
      "duty": "Oversee crisis response to shootings and homicides, notify victim advocates of the need for a response, and be available to provide guidance."
    },
    {
      "duty": "Maintain a caseload of participants and monitor cases by verifying attendance, observing and evaluating activities and responses, advocating for needed services, intervening in crises, and providing personal support."
    },
    {
      "duty": "Prepare participants' exit strategy by reviewing goals and individualized plans, coordinating discharge and post-discharge requirements, and providing resources."
    },
    {
      "duty": "Develop partnerships with resources that will strengthen support for participants and hold partners accountable as needed."
    },
    {
      "duty": "Coordinate with Outreach Program Manager and Outreach Supervisor around cases and community activities."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "BS in a Human Services field (i.e.: Sociology, Urban Studies, Social Work) or equivalent experience"
    }
  ]
}