{
  "meta": [
    {
      "job_title": "Material Handler",
      "job_category": "Logistics",
      "job_class": "Handler",
      "sector": "Logistics",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Follow all safety and quality requirements including but not limited to the maintenance of a safe, clean and orderly work area."
    },
    {
      "duty": "Participate in daily safety audits of work area."
    },
    {
      "duty": "Routine processes include: navigating and printing pick lists, pulling and placing parts on sequence carts from supermarket areas, replenishing KAN BAN pans, detecting quality concerns in parts, position of parts on carts, racks, bins and communication of parts shortages if applicable."
    },
    {
      "duty": "Reclassify any new rack locations for parts ensuring FIFO, correct pan size, pan type, etc."
    },
    {
      "duty": "Delivery of sequenced parts, set in order to: fabrication areas as required per job position."
    },
    {
      "duty": "Computer transactions must be completed in software system immediately to ensure inventory accuracy."
    },
    {
      "duty": "Complete safety checklist on forklifts on a daily basis."
    },
    {
      "duty": "Responsible for equipment (forklift and racking) and all materials picked including purchased and manufactured parts."
    },
    {
      "duty": "Operate fork truck, have valid fork truck operators license."
    },
    {
      "duty": "Prefer general knowledge of equipment and parts."
    },
    {
      "duty": "Requires the basic use of charts, assembly schedules, drawings and scanners in area to ensure parts are delivered before or on scheduled TAKT time."
    },
    {
      "duty": "Use of addition, multiplication, subtraction and judgment to comply with processes and methods, Basic use of computer menus, computer printers required."
    },
    {
      "duty": "Experience in a warehouse or similar setting of over 3 months or related similar experience in: store keeping methods and procedures, compilation of reports, data entry: ability to recognize and identify a variety of product parts and sub-assemblies by appearance, read receiving slips, shop orders; sales orders, rework orders; accuracy in checking, counting, identifying, recording, reporting, and verifying."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Valid forklift operator's license and experience in a warehouse or similar setting of over 3 months"
    }
  ]
}