{
  "meta": [
    {
      "job_title": "Product Analyst",
      "job_category": "Data Analysis",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "SQL",
      "experience": 7
    },
    {
      "skill": "Data Visualization",
      "experience": 7
    },
    {
      "skill": "Product Management",
      "experience": 7
    },
    {
      "skill": "Business Analysis",
      "experience": 7
    },
    {
      "skill": "Technical Expertise",
      "experience": 7
    },
    {
      "skill": "Market Analysis",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "Problem-Solving",
      "experience": 7
    },
    {
      "skill": "Healthcare Industry Expertise",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Translate product business requirements into technical features by creating user stories to bridge the gap between the product and technical teams enabling developers to build functionality."
    },
    {
      "duty": "Work directly with product, business, and engineering teams to influence the creation of new product experiences and improve existing ones that meet customer needs."
    },
    {
      "duty": "Lead in identifying problems to solve, gathering user research and input, and outlining proposed solutions, supported with data."
    },
    {
      "duty": "Develop data visualizations, including reports, dashboards, and analyses to distribute data insights in an easily digestible manner to all relevant stakeholders."
    },
    {
      "duty": "Utilize user analytics tools to gain a deep understanding of how end users behave through data, then use that understanding to define and track KPIs across our product portfolio."
    },
    {
      "duty": "Conduct competitive and market landscape analysis that also considers customer trends and buying behaviors."
    },
    {
      "duty": "Collaborating with stakeholders, design, and developers to define features and user acceptance criteria."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BS in Computer Science, Engineering, Economics, Mathematics, Business or a related fieldMinimum of 7 years healthcare industry expertise with extensive technical experience along with the execution of a refined data roadmap and democratizing data. Risk Adjustment ACA and MA domain knowledge and experiences are highly preferredProficient knowledge of SQL (incl. aggregate functions, joins, etc.) and data visualization tools (Tableau preferred)Minimum of 7 years in a technical product or analytics role 7+ years of data/business analysis or equivalent experience in an API-driven SAAS companyStrong problem-solving skills. Able to make sense and use out of incomplete or ambiguous inputs and passionate about analyzing data and designing innovative data solutions.Previous experience in software product management, business analysis, and/or competitive market intelligenceExperience designing and implementing highly visible, complex, and innovative analytical solutions that drive business decision makingExcellent verbal and written communication skillsExperience driving complex analysis using unique or disparate data sources and manipulating large amounts of structured and unstructured dataCuriosity in nature; Comfort with ambiguity; the ability to independently layout and test clear hypotheses, and solve problems without well-defined directionIs familiar with SOC 2 compliance and its impact on company policies and processesUnderstands importance of adhering to SOC 2 requirements and maintains an effort to do so"
    }
  ]
}