{
  "meta": [
    {
      "job_title": "Project Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Software Engineering",
      "salary": 137500,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Project Management",
      "experience": 15
    },
    {
      "skill": "Client Management",
      "experience": 15
    },
    {
      "skill": "Risk Management",
      "experience": 15
    },
    {
      "skill": "Agile Development",
      "experience": 15
    },
    {
      "skill": "Strategic Planning",
      "experience": 15
    },
    {
      "skill": "IT Release Management",
      "experience": 15
    },
    {
      "skill": "Scrum Master",
      "experience": 15
    },
    {
      "skill": "Vendor Management",
      "experience": 15
    },
    {
      "skill": "Data Analysis",
      "experience": 15
    },
    {
      "skill": "Problem-solving",
      "experience": 15
    },
    {
      "skill": "Team Communication",
      "experience": 15
    },
    {
      "skill": "Process Improvement",
      "experience": 15
    },
    {
      "skill": "DevOps",
      "experience": 15
    },
    {
      "skill": "Product Lifecycle Deployment",
      "experience": 15
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create integrated project plans for contract deliverables and new products in development projects."
    },
    {
      "duty": "Manage a project team and review, manage, and control project status and budgets."
    },
    {
      "duty": "Assess project issues and develop resolutions to meet productivity, quality, and client-satisfaction goals."
    },
    {
      "duty": "Manage Jira epics and product backlog, plan sprint cycles, and ensure timely delivery."
    },
    {
      "duty": "Develop various project deliverables in support of the Product Line and assist in reviews of researcher requests."
    },
    {
      "duty": "Manage team-wide communications and provide status report updates to VA Leadership and Business Owners."
    },
    {
      "duty": "Supervise professional and technical support personnel, schedule tasks, and coordinate with various team members."
    },
    {
      "duty": "Manage the direction of a project through design, implementation, and testing in accordance with project objectives."
    },
    {
      "duty": "Define requirements, plans project lifecycle deployment, and integrate vendor tasks and track deliverables."
    },
    {
      "duty": "Ensure adherence to quality standards, conduct project meetings, and track project progress and reporting."
    },
    {
      "duty": "Identify and manage risks, issues, and blockers impacting the progress and outcome of the sub-product line."
    },
    {
      "duty": "Serve as a Scrum Master on an as-needed basis, develop and maintain scheduled project sprints and backlog."
    },
    {
      "duty": "Support fast turnaround requests for data, understand the ask and request data from the appropriate team member."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Engineering, Computer Science, Systems, Business or related technical discipline (Master's preferred)"
    }
  ]
}