{
  "meta": [
    {
      "job_title": "Coordinator for Library Infrastructure Services",
      "job_category": "Library",
      "job_class": "Coordinator",
      "sector": "Library",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Business Analysis",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Facilitation",
      "experience": 3
    },
    {
      "skill": "Community Organizing",
      "experience": 3
    },
    {
      "skill": "Contract Management",
      "experience": 3
    },
    {
      "skill": "Budgeting",
      "experience": 3
    },
    {
      "skill": "Communication",
      "experience": 3
    },
    {
      "skill": "Program Coordination",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provides business analysis and active management for the core portfolio of services that the BTAA runs at scale on behalf of the member libraries."
    },
    {
      "duty": "Coordinates and administers licenses and contracts for services."
    },
    {
      "duty": "Designs discussion templates and communication plans for campus engagement on services run out of the core portfolio."
    },
    {
      "duty": "Coordinates and facilitates online and in-person programming and conversations around Big Collection services, including workshops, meetings, and online forums."
    },
    {
      "duty": "Manages programmatic multi-year budgeting for the services portfolio with the BTAA Operations team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree. Three (3) years of experience working with services coordination, portfolio or program management, or equivalent. Advanced degree or equivalent years of experience. Experience working with services management in a community context, including large-scale complex systems. Experience with facilitation, group dynamics, and community organizing. Two years additional experience with leadership of collaborative projects, programs, and/or services. Experience with coordinating or administering contracts or licenses for services (such as technology licenses for cloud-based or SaaS services). Experience with collaborative software such as Microsoft Teams, Monday.com, Miro, and Google Docs. Related higher education work experience. Preferably familiarity with, or experience in large-scale research or academic libraries."
    }
  ]
}