{
  "meta": [
    {
      "job_title": "Production Planner",
      "job_category": "Manufacturing",
      "job_class": "Planner",
      "sector": "Manufacturing",
      "salary": 65000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Analyzing Information, Reporting Research Results, Documentation Skills, ability to settle process related customer issues."
    },
    {
      "duty": "Maintain highest quality through continuous process improvement and lean activities."
    },
    {
      "duty": "Support manufacturing by resolving engineering, equipment, process, and component issues. Monitor daily process actions, NSR and quality activities."
    },
    {
      "duty": "Design, specify, replace, and improve SMT, wave solder, and general manufacturing tooling."
    },
    {
      "duty": "Perform all process engineering functions associated with NPI, ECO and print release, including requirements and process sheets."
    },
    {
      "duty": "Participate in prototype and first article assembly. Provide feedback to teams on design for manufacturing."
    },
    {
      "duty": "Develop machine setup, operation, and maintenance work instructions. Assist manufacturing with equipment setups and maintenance."
    },
    {
      "duty": "Lead, assist and train engineers, technicians, and programmers in process engineering duties. Lead, assist and train assemblers in manufacturing processes."
    }
  ],
  "skills": [
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 5
    },
    {
      "skill": "Process Engineering",
      "experience": 5
    },
    {
      "skill": "NPI and ECO Processes",
      "experience": 5
    },
    {
      "skill": "CAD Data Analysis",
      "experience": 5
    },
    {
      "skill": "SMT/Through Hole Circuit Board Assembly",
      "experience": 5
    },
    {
      "skill": "Machine Setup & Maintenance",
      "experience": 5
    },
    {
      "skill": "Training and Leadership",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Degree in Mechanical or Electrical Engineering."
    },
    {
      "credential": "Experience with SMT First Articles."
    },
    {
      "credential": "Experience in SMT/Through Hole circuit board assembly."
    },
    {
      "credential": "Experience working with CAD data, CircuitCAM software."
    },
    {
      "credential": "Experience in a manufacturing environment."
    },
    {
      "credential": "Ability to read, analyze, and interpret production and quality documents, drawings, and related industry materials."
    },
    {
      "credential": "Ability to respond to common inquiries or complaints from customers, regulatory agencies, and members of the business community."
    },
    {
      "credential": "Interpersonal skills, working with other engineers and managers."
    },
    {
      "credential": "Ability to speak, read and understand English."
    }
  ]
}