{
  "meta": [
    {
      "job_title": "Financial Planning Specialist",
      "job_category": "Financial Services",
      "job_class": "Specialist",
      "sector": "Finance",
      "salary": 82500,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Planning",
      "experience": 4
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 4
    },
    {
      "skill": "Insurance and Investment",
      "experience": 3
    },
    {
      "skill": "Retirement Planning",
      "experience": 3
    },
    {
      "skill": "Tax Planning",
      "experience": 3
    },
    {
      "skill": "Estate Planning",
      "experience": 3
    },
    {
      "skill": "CRM Software",
      "experience": 3
    },
    {
      "skill": "Presentation Skills",
      "experience": 4
    },
    {
      "skill": "Research and Analysis",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in executing a seamless financial planning process, covering a wide range of planning areas including Investments, Cash Flow Planning, Insurance Planning, Retirement Planning, Education Funding, Executive Compensation, Major Purchases, Tax and Estate Concepts."
    },
    {
      "duty": "Utilize information gathered by financial advisors during client meetings to create comprehensive financial plans and ensure data is updated in the CRM system."
    },
    {
      "duty": "Develop expertise in planning software and tools, and collaborate with the advisor and team to update plans for annual reviews."
    },
    {
      "duty": "Maintain client confidence and trust through meticulous attention to detail and preparation of client presentations and recommendations."
    },
    {
      "duty": "Drive research and make proactive recommendations for complex planning cases and unique scenarios."
    },
    {
      "duty": "Potentially participate in client meetings as the planning expert."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 70,
      "introvert_extrovert": 110
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Finance, Economics, or a related field. CFP designation (or actively pursuing) and Insurance and Investment Licenses (or willingness to obtain within the first year)"
    }
  ]
}