{
  "meta": [
    {
      "job_title": "Learning Technology Specialist",
      "job_category": "Human Resources",
      "job_class": "Specialist",
      "sector": "Talent Development",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Learning Technology Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Performance Consulting",
      "experience": 5
    },
    {
      "skill": "Continuous Improvement",
      "experience": 5
    },
    {
      "skill": "Talent Development Design",
      "experience": 5
    },
    {
      "skill": "Technology Resource Management",
      "experience": 5
    },
    {
      "skill": "Vendor Relationship Management",
      "experience": 5
    },
    {
      "skill": "Needs Assessment",
      "experience": 5
    },
    {
      "skill": "Instructional Design",
      "experience": 5
    },
    {
      "skill": "Training Program Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drive the recommendations, implementation, and management of all talent development technology systems and resources."
    },
    {
      "duty": "Manage projects for key talent development initiatives, including new tools and processes, as well as existing learning systems."
    },
    {
      "duty": "Interact and consult with leaders and employees from all parts of the business to ensure seamless and timely development and delivery of talent development tools and systems."
    },
    {
      "duty": "Manage learning technology processes and systems, including LMS, SharePoint, authoring and graphics tools, and performance/goals systems."
    },
    {
      "duty": "Manage vendor relationships associated with talent development technology, including Bridge, viaPeople, etc."
    },
    {
      "duty": "Partner with HR Systems, IT, and functional training teams on talent system RFPs and implementation."
    },
    {
      "duty": "Execute the employee engagement survey, including project management, partnership with the vendor, timelines and communication, and alignment of stakeholders."
    },
    {
      "duty": "Recommend and implement talent development reporting metrics and stay updated on the latest advancements and best practices in learning technology."
    },
    {
      "duty": "Create and manage training resources, including manuals, guides, videos, and online resources for ease of access."
    },
    {
      "duty": "Establish and maintain collaborative partnerships with business unit leaders and HR Business Partners to identify business needs and relevant solutions."
    },
    {
      "duty": "Lead and/or contribute to the continuous process improvement within talent development, specifically related to technology and development of instructional materials."
    },
    {
      "duty": "Serve as project manager for assigned projects, plan project tasks and time estimates, and consult with subject matter experts (SMEs) to draft learning objectives and content outlines."
    },
    {
      "duty": "Design and develop training, simulations, and assessment activities, including testing and quality assurance of deliverables."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree or higher in a relevant field like Business Administration, Human Resources, Computer Science, Engineering, or Information Technology, or 5+ years professional work experience"
    }
  ]
}