{
  "meta": [
    {
      "job_title": "Claims Associate",
      "job_category": "Insurance",
      "job_class": "Associate",
      "sector": "Insurance",
      "salary": 49000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Insurance Verification",
      "experience": 3
    },
    {
      "skill": "Claims Processing",
      "experience": 3
    },
    {
      "skill": "Patient Billing",
      "experience": 3
    },
    {
      "skill": "Healthcare Reimbursement",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Interpret and verify coverage for patients and maintain correct insurance information on patient accounts."
    },
    {
      "duty": "Conduct outbound calls to insurance companies and patients regarding insurance information."
    },
    {
      "duty": "Test claims to determine copayments and verify preferred products."
    },
    {
      "duty": "Pursue prior authorizations as determined by health plan or medical group requirements."
    },
    {
      "duty": "Maintain detailed records in the company database and ensure patient primary insurance is accurate."
    },
    {
      "duty": "Handle all inbound calls from patients and insurance companies."
    },
    {
      "duty": "Resolve denials and process appeals for private insurance and some Medicare patients."
    },
    {
      "duty": "Submit required documentation to insurance providers and handle billing orders corresponding to denials or changes."
    },
    {
      "duty": "Achieve maximum reimbursement for services provided and adapt to frequent process changes."
    },
    {
      "duty": "Attend all department, team, and company meetings as required."
    },
    {
      "duty": "Embrace and exemplify company's core values and may perform additional responsibilities or special projects as required."
    },
    {
      "duty": "Duties and responsibilities may be subject to change based on the needs of the department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 130,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED (Associate's degree in a related field preferred)"
    }
  ]
}