{
  "meta": [
    {
      "job_title": "People & Culture Manager of Operational Strategy",
      "job_category": "Human Resources",
      "job_class": "Manager",
      "sector": "Human Resources",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruiting",
      "experience": 8
    },
    {
      "skill": "Training & Development",
      "experience": 8
    },
    {
      "skill": "Change Management",
      "experience": 8
    },
    {
      "skill": "Talent Acquisition",
      "experience": 8
    },
    {
      "skill": "Employee Relations",
      "experience": 8
    },
    {
      "skill": "Project Management",
      "experience": 8
    },
    {
      "skill": "Employer Branding",
      "experience": 8
    },
    {
      "skill": "MS Office",
      "experience": 8
    },
    {
      "skill": "Advanced Excel",
      "experience": 8
    },
    {
      "skill": "Communication",
      "experience": 8
    },
    {
      "skill": "Employee Engagement",
      "experience": 8
    },
    {
      "skill": "Strategic Thinking",
      "experience": 8
    },
    {
      "skill": "Human Resources Management",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and deploy fundamental standard processes to improve retention and decrease turnover, leveraging systems and technology."
    },
    {
      "duty": "Lead training and development initiatives for People and Culture and Supervisors in Operations, including identification and facilitation of education and training sessions."
    },
    {
      "duty": "Collaborate with corporate communication and talent acquisition teams to develop a world-class employer branding program."
    },
    {
      "duty": "Implement and support people and culture strategies, initiatives, and programs that effectively support the vision, values, and corporate objectives of the organization."
    },
    {
      "duty": "Establish change management based on site-specific retention strategies and introduce optimal flexible shift schedules and other labor strategies."
    },
    {
      "duty": "Continuous improvement of talent identification, attraction, onboarding, and retention by working closely with sites and finding the best solutions for targeted improvements."
    },
    {
      "duty": "Ensure continuous improvement of talent identification, attraction, onboarding, and retention by working closely with sites, identifying possible improvements, managing the associated roadmap, and testing various avenues."
    },
    {
      "duty": "Collaborate with the corporate communication and talent acquisition teams to develop a world-class employer branding program that includes positioning, messaging, and branding."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 80,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Human Resources Management, Organizational Development (PHR/SPHR preferred)"
    }
  ]
}