{
  "meta": [
    {
      "job_title": "Patient Care Representative",
      "job_category": "Medical",
      "job_class": "Representative",
      "sector": "Healthcare",
      "salary": 36000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Administrative Skills",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Insurance Verification",
      "experience": 3
    },
    {
      "skill": "Medical Terminology",
      "experience": 3
    },
    {
      "skill": "HIPAA Compliance",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    },
    {
      "skill": "Appointment Scheduling",
      "experience": 3
    },
    {
      "skill": "Front Desk Management",
      "experience": 3
    },
    {
      "skill": "Data Entry",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide patient care services by obtaining detailed patient information, verifying necessary demographics, insurance coverage, and other vital information."
    },
    {
      "duty": "Process incoming calls for multiple offices in an efficient and courteous manner."
    },
    {
      "duty": "Responsible for scheduling patient appointments for multiple practitioners and office locations."
    },
    {
      "duty": "Deliver quality customer service to patients while meeting or exceeding quality assurance scores and other metrics as determined by management."
    },
    {
      "duty": "Assist practitioners with checking out patients at completion of their appointment."
    },
    {
      "duty": "Complete insurance verifications online and via phone."
    },
    {
      "duty": "Answer incoming phone calls for multiple office locations while displaying compassion and professionalism."
    },
    {
      "duty": "Assist patients with getting in and out of the building when needed."
    },
    {
      "duty": "Monitor voicemail, e-mail, and practice based software messages and respond accordingly."
    },
    {
      "duty": "Communicate effectively with management and other team members."
    },
    {
      "duty": "Actively participate in required trainings, team meetings, and monthly meetings with supervisor."
    },
    {
      "duty": "Greet patients and visitors upon arrival to the office."
    },
    {
      "duty": "Obtain detailed information from patients to include completed paperwork, signatures, insurance cards, photo ID, etc."
    },
    {
      "duty": "Scan all documentation and attach to patient electronic medical record."
    },
    {
      "duty": "Call patients to confirm scheduled appointments."
    },
    {
      "duty": "Maintain tidiness of front desk and waiting room areas."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma (Medical office experience and/or call center experience preferred)"
    }
  ]
}