{
  "meta": [
    {
      "job_title": "Senior Direct Material Technical Buyer",
      "job_category": "Purchasing",
      "job_class": "Senior Buyer",
      "sector": "Purchasing",
      "salary": 92000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Lead Purchasing Projects that could impact multiple corporate facilities."
    },
    {
      "duty": "Develop \\"
    },
    {
      "duty": "Evaluate Supplier Quotation Cost Breakdown Details – develop negotiation strategy."
    },
    {
      "duty": "Become familiar with the main cost drivers of his/her commodities and communicate internally within JTEKT/Koyo this information to ensure optimum designs are released at the time of sourcing decision."
    },
    {
      "duty": "Research and understand market trends, create a Benchmark on assigned commodities, create a Make –vs- Buy analysis, evaluation of Localization/LCC/Mexico sourcing and understand the impact of technology on the product – create and maintain a Global Qualified Supplier Panel."
    },
    {
      "duty": "Create the Commodity Strategy for their Key Commodities (format will be provided)."
    },
    {
      "duty": "Evaluate commodity and suppliers to determine what type of agreement is required with each supplier and then to draft, negotiate, and implement the decided level of the contract."
    },
    {
      "duty": "Identify cost reduction activities from the beginning of the product design stage, through the production life of the product purchased."
    },
    {
      "duty": "Lead negotiations with suppliers to accomplish the Should Be/Target pricing he or she has determined to be market competitive for component piece price, tooling cost, etc."
    },
    {
      "duty": "Support the Supplier Advancement Engineer in VA/VE and Kaizen supplier workshops by defining cost reduction targets and negotiating cost sharing rules with suppliers."
    },
    {
      "duty": "Provide management of Supplier Risk as well as Quarterly reporting of KPIs to each Key Supplier and will be responsible for the overall performance of his/her suppliers and their Quality, Cost and Delivery performance."
    },
    {
      "duty": "Frequent travel to suppliers (international travel a possibility)."
    },
    {
      "duty": "Generate a map of Supplier Processes including Bekido and Chokko rates at time of quotation as well a follow up later to confirm quoted rates are occurring."
    },
    {
      "duty": "Work overtime as required and occasional Saturdays and/or Sundays when directed by immediate supervisor, as necessary, to complete essential job duties."
    },
    {
      "duty": "This position requires a high level of professional competency and skills sufficient to perform activities associated with Direct Material Purchasing."
    },
    {
      "duty": "This position will require thorough understanding and usage of JNA Purchasing Policies and Procedures."
    },
    {
      "duty": "Perform other duties as assigned by Purchasing Manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 100,
      "introvert_extrovert": 30
    }
  ],
  "education_certification": [
    {
      "credential": "4 Year College Degree with Focus in Business Administration, Accounting, Mechanical Engineering"
    }
  ]
}