{
  "meta": [
    {
      "job_title": "Research Assistant",
      "job_category": "Administrative",
      "job_class": "Assistant",
      "sector": "Finance",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 2
    },
    {
      "skill": "Data Analysis",
      "experience": 2
    },
    {
      "skill": "Microsoft Office",
      "experience": 2
    },
    {
      "skill": "Investment Analysis",
      "experience": 2
    },
    {
      "skill": "Research",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform various administrative tasks such as managing calendars, scheduling meetings, and coordinating travel arrangements for the research team."
    },
    {
      "duty": "Organize and maintain research-related files, documents, and databases to ensure efficient workflow and easy retrieval of information."
    },
    {
      "duty": "Prepare and format reports, presentations, and other materials for internal and external stakeholders."
    },
    {
      "duty": "Gain visibility into the fund's profit and loss statements, analyzing financial data to identify trends, patterns, and areas of improvement."
    },
    {
      "duty": "Collaborate with the research team and other relevant departments to gather necessary data for P&L analysis and reporting."
    },
    {
      "duty": "Assist in the preparation of regular performance reports, highlighting key metrics and providing insights to support strategic decision-making."
    },
    {
      "duty": "Work closely with the research team to review and evaluate new investment theses and proposals."
    },
    {
      "duty": "Conduct comprehensive research and analysis on potential investments, including industry analysis, financial modeling, and risk assessment."
    },
    {
      "duty": "Collaborate with portfolio managers and analysts to assess the viability and potential returns of proposed investments."
    },
    {
      "duty": "Prepare investment memos, presentations, and other materials summarizing the findings and recommendations for internal discussions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 30,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in finance, economics, or a related field"
    }
  ]
}