{
  "meta": [
    {
      "job_title": "Branch Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Operations Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Staff Development",
      "experience": 5
    },
    {
      "skill": "Retail Business Partnership",
      "experience": 5
    },
    {
      "skill": "Loan Portfolio Management",
      "experience": 5
    },
    {
      "skill": "Financial Counseling",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Conflict Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and inspire team members to drive branch profitability and accomplish set goals."
    },
    {
      "duty": "Exercise judgment in decision-making within company policy guidelines and oversight."
    },
    {
      "duty": "Serve as a subject matter expert on personal loan products, providing solutions to customers' financial needs."
    },
    {
      "duty": "Maintain branch operations solvency by controlling assets, credit extension, and counseling past-due customers."
    },
    {
      "duty": "Develop and maintain customer relationships, deliver exceptional service, and manage complaints."
    },
    {
      "duty": "Oversee various branch duties including loan approval, collection activities, insurance claims processing, reporting, and expense management."
    },
    {
      "duty": "Address branch staffing needs in partnership with recruiting and district supervisors."
    },
    {
      "duty": "Cultivate and maintain relationships with local retail businesses, handling complaints and providing training on company policies and procedures."
    },
    {
      "duty": "Complete other assigned duties by leadership."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or Equivalent and 2 years of management experience or completion of required Management Trainee program. Valid Driver’s License and access to a dependable automobile with liability insurance coverage."
    },
    {
      "credential": "Preferred: 1+ years of Consumer Finance experience and willingness to relocate for career advancement."
    }
  ]
}