{
  "meta": [
    {
      "job_title": "Area Supervisor",
      "job_category": "Operations",
      "job_class": "Supervisor",
      "sector": "Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the associates in your area through coaching, engagement, communication, morale building and teaming. Be the Leader and coach not the boss."
    },
    {
      "duty": "Team with support groups such as EHS, Quality Assurance, Engineering and Planning to escalate and improve urgent issues as well as drive continuous improvement"
    },
    {
      "duty": "Measure report and improve Safety, Quality, Delivery and cost within assigned areas and across the whole plant"
    },
    {
      "duty": "Provides all subordinates with constant communication, guidance, coaching and support necessary to perform their jobs effectively and accurately."
    },
    {
      "duty": "Works with the Safety Manager to monitor safety compliance and to review and plan for special requirements on incoming jobs."
    },
    {
      "duty": "Uses progressive discipline to correct and manage major violations of company policies, and the Collective Bargaining Agreement (e.g., fighting, sabotage, etc.)"
    },
    {
      "duty": "Investigates incidences of, and initiates corrective actions to, improper conduct on the floor or major violations of company policies or the CBA."
    },
    {
      "duty": "Accountable for factory housekeeping and organization by driving 5S deployment across the factory. Accountable for improving and maintaining visual management across the factory"
    },
    {
      "duty": "Responsible for communicating metrics and ensuring understanding and ownership at the production team level."
    },
    {
      "duty": "Responsible for driving continuous improvement in labor efficiency, cost, quality, and factory processes"
    },
    {
      "duty": "Prioritize production schedules based on product introduction, equipment efficiency and materials supply"
    },
    {
      "duty": "Assure the proper training and of all department personnel"
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Coaching",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Quality Assurance",
      "experience": 5
    },
    {
      "skill": "Continuous Improvement",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Operations Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor of Science degree in Logistics, Manufacturing, Operations, Engineering or a related field or equivalent experience that relates to the position. Minimum 5 years of management experience in a fast-paced, manufacturing environment"
    }
  ]
}