{
  "meta": [
    {
      "job_title": "Assistant Community Manager",
      "job_category": "Property Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 50000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for overseeing the everyday operations and financial functions of the housing community under the supervision of the Community Manager."
    },
    {
      "duty": "Play a vital role in the delinquency and collection of rent to optimize the property's cash flow and financial position."
    },
    {
      "duty": "Manage all phases of the operations, including personnel, leasing, maintenance, financial, administration & risk management, in the absence of the Community Manager."
    },
    {
      "duty": "Supervise all aspects of the property and staff to ensure compliance with the company's policies and procedures, safety and fair housing guidelines, and liability concerns."
    },
    {
      "duty": "Screen, hire, train, coach, and develop onsite staff to ensure effectiveness and compliance with company policies and procedures."
    },
    {
      "duty": "Implement effective leasing techniques, marketing strategies, and systems to obtain closure, follow up procedures, signing/documentation of leases, and accurate reporting systems."
    },
    {
      "duty": "Deal with resident complaints, concerns, and requests to ensure resident satisfaction and implement resident retention programs."
    },
    {
      "duty": "Maintain excellent customer service, monitor service request turnaround, and supervise all business functions related to operations."
    },
    {
      "duty": "Plan for and utilize property resources, equipment, and supplies economically, including obtaining bids/pricing from vendors, suppliers, contractors, and dealing with inadequate service."
    }
  ],
  "skills": [
    {
      "skill": "Property Management",
      "experience": 5
    },
    {
      "skill": "Financial Management",
      "experience": 5
    },
    {
      "skill": "Personnel Management",
      "experience": 5
    },
    {
      "skill": "Strategic Leasing Management",
      "experience": 5
    },
    {
      "skill": "Administrative Management",
      "experience": 5
    },
    {
      "skill": "Resident Relations",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Real Estate, Management, or a related field (Master's preferred)"
    }
  ]
}