{
  "meta": [
    {
      "job_title": "Member Advisor",
      "job_category": "Banking",
      "job_class": "Advisor",
      "sector": "Finance",
      "salary": 40000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Teller Transactions",
      "experience": 1
    },
    {
      "skill": "Consumer Loan Applications",
      "experience": 1
    },
    {
      "skill": "Financial Product Knowledge",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Cash Handling",
      "experience": 1
    },
    {
      "skill": "Arithmetic Calculations",
      "experience": 1
    },
    {
      "skill": "Account Maintenance",
      "experience": 1
    },
    {
      "skill": "Compliance Guidelines",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Process teller transactions, open new membership accounts, complete consumer loan applications, and provide general account information."
    },
    {
      "duty": "Identify members' financial needs and offer appropriate products and services."
    },
    {
      "duty": "Cross-sell and up-sell credit union products and services to meet identified needs and maximize retention."
    },
    {
      "duty": "Provide exemplary member experience and ensure transactions are processed accurately and professionally."
    },
    {
      "duty": "Establish value-added relationships with members and offer tailored solutions for their financial needs."
    },
    {
      "duty": "Process financial transactions including deposits, payments, cashing checks, transfers, loan advances, counting coins, wire transfers, and redeeming bonds."
    },
    {
      "duty": "Open and maintain accounts, including share, checking, money market, and certificates of deposit."
    },
    {
      "duty": "Provide general account information regarding account balances and transactions performed."
    },
    {
      "duty": "Maintain a balanced cash drawer and observe and report suspicious behavior."
    },
    {
      "duty": "Remain calm and follow procedures in the event of a robbery and provide backup to other employees as needed."
    },
    {
      "duty": "Perform all other required duties as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or equivalency (6 months cash handling experience preferred)"
    },
    {
      "credential": "Must know 10 key by touch"
    },
    {
      "credential": "Must be bondable"
    }
  ]
}