{
  "meta": [
    {
      "job_title": "Project Specialist",
      "job_category": "Project Management",
      "job_class": "Specialist",
      "sector": "Construction",
      "salary": 75000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Planning and executing multiple technical projects from start to completion, including, design coordination, resource scheduling, managing installations and commissioning, and material planning."
    },
    {
      "duty": "Monitoring project budgets throughout construction to ensure completion within budget constraints. Identifying projects trending over-budget. This includes developing cost estimates, monitoring expenses and implementing cost control measures where necessary."
    },
    {
      "duty": "Communicating project status, issues, and risks to internal and external stakeholders. Conducting project meetings and managing project documentation. Including frequent site visits to support necessary project progress."
    },
    {
      "duty": "Continuously improving project management processes and practices. Includes identifying areas of improvement, developing, and implementing process improvement, and measuring and evaluating effectiveness of project manager processes."
    },
    {
      "duty": "Manage and execute commissioning for multiple electrical/mechanical installations in both new construction and retrofit environment(s). For larger projects, additional resources (internal and through external contractors) will be available to assist in commissioning activities."
    },
    {
      "duty": "Provide technical analysis of drawings and or electrical/mechanical systems to help support various contractors and internal staff on the installation."
    },
    {
      "duty": "Ensure all projects comply with industry standards and regulations."
    },
    {
      "duty": "Manage installation projects by demonstrating excellent customer service, organization, issue analysis and problem-solving skills."
    },
    {
      "duty": "Develop and deliver progress reports, project timelines that track individual project milestones and deliverables."
    },
    {
      "duty": "Provide technical evaluation for project opportunities identified by the Sales department."
    },
    {
      "duty": "Ensure all regulatory requirements are met and completed for each installation project."
    },
    {
      "duty": "Any other tasks in support of field services as necessary."
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree related to technology or construction industries (Preferred)"
    }
  ]
}