{
  "meta": [
    {
      "job_title": "Clinical Application Specialist - Neurovascular Medical Device",
      "job_category": "Clinical Application Specialist",
      "job_class": "Specialist",
      "sector": "Healthcare",
      "salary": 90000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide educational and clinical support in response to field inquiries from Sim&Cure customers to support physicians and health care professionals."
    },
    {
      "duty": "Sustain a high level of communication with the customers and Key Account Managers to ensure timely, high-quality education and training on Sim&Cure products for health care providers."
    },
    {
      "duty": "Prepare, analyze, and report the use, education/training, and support activities of the sales team to advance new users of the system and identify new opportunities."
    },
    {
      "duty": "Operate effectively within the defined territory and within the expense budget."
    },
    {
      "duty": "Maintain medical device directive compliance in all customer interactions and communications."
    },
    {
      "duty": "Assist other territories to grow and develop."
    },
    {
      "duty": "Support conferences, workshops and other marketing events as scheduled by management."
    },
    {
      "duty": "Screen and troubleshoot cases as needed."
    },
    {
      "duty": "Install Sim&Cure products within clinical environments such as hospitals and partnered Medical Device Company laptops depending upon the needs of Sim&Cure and its customers."
    },
    {
      "duty": "Professionally represent the company during customer interactions for the purpose of supporting customer sales."
    },
    {
      "duty": "Collaborate with the Key Account Managers to develop and grow business within the territories."
    },
    {
      "duty": "Work within accounts to maximize the use of Sim&Cure’s product line by ensuring customer confidence in Sim&Size technology through consistent and successful procedural performance."
    },
    {
      "duty": "Troubleshoot internal software, IT, and Hospital based systems."
    },
    {
      "duty": "Perform other duties as assigned by manager."
    }
  ],
  "skills": [
    {
      "skill": "Interventional Technologist",
      "experience": 5
    },
    {
      "skill": "3D Reconstructions",
      "experience": 5
    },
    {
      "skill": "Medical Devices for Aneurysms",
      "experience": 5
    },
    {
      "skill": "PC Literacy",
      "experience": 5
    },
    {
      "skill": "IT Operations",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Interventional Technologist - A.A.S, A.S or B.S, B.A with a minimum of 5 years of work experience in healthcare within an Interventional Lab.Equivalent work or educational experiences accepted: Biomedical Engineering or Procedural Nurse"
    }
  ]
}