{
  "meta": [
    {
      "job_title": "Sr Business Systems Analyst -FICO",
      "job_category": "Business Systems Analyst",
      "job_class": "Senior",
      "sector": "Business Analysis",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "SAP FI-CO",
      "experience": 5
    },
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "ERP System Deployment",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "SAP Solution Manager",
      "experience": 5
    },
    {
      "skill": "SAP Add-ons/Bolt-ons",
      "experience": 5
    },
    {
      "skill": "ABAP Debugging",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Obtain a deep understanding of Finance business area(s) and business processes to recommend solutions and build high-quality requirements."
    },
    {
      "duty": "Shape business requirements by making recommendations and suggesting alternatives to proposed solutions."
    },
    {
      "duty": "Participate in Application Configuration, Analysis, Management, and Maintenance in an Enterprise environment."
    },
    {
      "duty": "Provides functional consulting on complex SAP projects including rollouts."
    },
    {
      "duty": "Design and deliver solutions through system configuration and/or development that meet overall business requirements."
    },
    {
      "duty": "Interface with COE functional experts and business process owners to facilitate process improvement and develop new functionality."
    },
    {
      "duty": "Support user training activities."
    },
    {
      "duty": "Lead and/or participate in delivery of projects."
    },
    {
      "duty": "Respond, resolve, or escalate reported incidents."
    },
    {
      "duty": "Responsible for coordinating application needs from back-end platforms through user interface."
    },
    {
      "duty": "Create artifacts as appropriate, including business case documentation, scope documentation, detailed functional requirements, operational requirements, process flows, and test cases."
    },
    {
      "duty": "Understand technical options, limitations, costs, and risks."
    },
    {
      "duty": "Communicate tradeoffs to business partners and work with them to shape requirements accordingly."
    },
    {
      "duty": "Help resolve competing priorities between stakeholder groups by facilitating stakeholder discussions and escalate issues where appropriate."
    },
    {
      "duty": "Follow established methodology for the identification and documentation of business requirements."
    },
    {
      "duty": "Create and maintain application operational and instructional documentation, as necessary."
    },
    {
      "duty": "Provide Level 2 and Level 3 on-call coverage support."
    },
    {
      "duty": "Monitor, record, investigate, and diagnose system faults and errors to resolve technical issues and respond to requests for support."
    },
    {
      "duty": "Benchmark current and future processes against industry best practices."
    },
    {
      "duty": "Support the adoption of solutions by sponsoring business departments."
    },
    {
      "duty": "Manage projects with limited scope."
    },
    {
      "duty": "Mentor junior Analysts."
    },
    {
      "duty": "Analyze business process potentials for streamlining and improvements in efficiencies."
    },
    {
      "duty": "Work with IT management and Business Analysts to provide direction in large cross-functional teams."
    },
    {
      "duty": "Provide technical training assistance for users, applications programming team, and other staff."
    },
    {
      "duty": "Lead process improvements and IT projects."
    },
    {
      "duty": "Lead collaboration with business for documentation of As-Is and To-Be Processes."
    },
    {
      "duty": "Identify opportunities to innovate and differentiate the organization from its competition."
    },
    {
      "duty": "Manage projects with cross functional teams and of global scope."
    },
    {
      "duty": "Analyze requirements, design and develop solutions, coordinate testing, and implement technologies, enhancements, and incident/problem resolutions."
    },
    {
      "duty": "Viewed as a subject matter expert in the field within the organization."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree required (Computer Science or related field preferred), Master's Degree preferred."
    }
  ]
}