{
  "meta": [
    {
      "job_title": "Project Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Construction",
      "salary": 114000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Construction Management",
      "experience": 3
    },
    {
      "skill": "Estimating",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 3
    },
    {
      "skill": "Architectural Drawing Interpretation",
      "experience": 3
    },
    {
      "skill": "Vendor Management",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 5
    },
    {
      "skill": "Web-Based Applications",
      "experience": 5
    },
    {
      "skill": "Sage 300 CRE",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Supporting the entire construction project lifecycle from pre- to post-construction, including collaborating with project manager and superintendent."
    },
    {
      "duty": "Contributing to estimating efforts, coordinating sub bids, and materials pricing."
    },
    {
      "duty": "Maintaining positive relationships and clear communication with clients, partners, designers, field team, and subcontractors."
    },
    {
      "duty": "Reading and managing plans, specifications, contracts, purchase orders, shop drawings, and all other project related documents."
    },
    {
      "duty": "Issuing RFPs, distributing plans and contract documents, creating scope of work for subs and vendors, and conducting subcontractor site walk-throughs."
    },
    {
      "duty": "Assessing data from subcontractor proposals, negotiating and summarizing, writing and managing Subcontractor Agreements."
    },
    {
      "duty": "Maintaining punch list with architect and build team, receiving, reviewing, and coding applications for payment with project manager."
    },
    {
      "duty": "Maintaining owner’s manual and handling project close out requirements, working with superintendent to maintain job site quality control, and advocating for safety in action and attitude."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Construction Management degree, or similar education plus experience."
    }
  ]
}