{
  "meta": [
    {
      "job_title": "Global Alliance Director",
      "job_category": "Alliance Management",
      "job_class": "Director",
      "sector": "Sales",
      "salary": 200000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Partnership Management",
      "experience": 7
    },
    {
      "skill": "Business Development",
      "experience": 7
    },
    {
      "skill": "Sales Strategy",
      "experience": 7
    },
    {
      "skill": "Strategic Planning",
      "experience": 7
    },
    {
      "skill": "Cloud Data and Analytics",
      "experience": 7
    },
    {
      "skill": "Multi-tasking",
      "experience": 7
    },
    {
      "skill": "Negotiation",
      "experience": 7
    },
    {
      "skill": "Communication Skills",
      "experience": 7
    },
    {
      "skill": "MBA",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute the partnership strategy and goals with Salesforce and other key partnerships."
    },
    {
      "duty": "Serve as the primary point of contact from Snowflake on these relationships across internal and external touchpoints."
    },
    {
      "duty": "Coordinate the launch of integrations or joint solutions with Salesforce and other partners."
    },
    {
      "duty": "Collaborate with Marketing and Sales teams to build joint go-to-market plans, marketing engines, and sales strategies materials."
    },
    {
      "duty": "Develop joint sales plays that effectively position Salesforce and other partners in conjunction with the core benefits of Snowflake."
    },
    {
      "duty": "Drive sales enablement efforts around joint solutions across the global Snowflake sales organization."
    },
    {
      "duty": "Engage directly with strategic customers, partners, and internal stakeholders."
    },
    {
      "duty": "Collaborate with Salesforce to build a comprehensive annual joint business plan."
    },
    {
      "duty": "Coordinate joint presence at key events and related industry events."
    },
    {
      "duty": "Work collaboratively with internal teams in support of customer/partner success."
    },
    {
      "duty": "Solve complex problems and deliver growth metrics independently."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum 7 years of relevant sales, business development, or alliances experience."
    },
    {
      "credential": "MBA or advanced degree is a plus."
    }
  ]
}