{
  "meta": [
    {
      "job_title": "Retail Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Effectively manage multiple retail dining locations and service teams with a hands-on approach."
    },
    {
      "duty": "Provide leadership, driving quality and efficiency in the areas of customer service, food production, menu development, product selection, quality control, sanitation, housekeeping, merchandising, marketing, and promotions."
    },
    {
      "duty": "Manage inventory control, product forecasting and food and supplies ordering."
    },
    {
      "duty": "Handle cash appropriately and operate and troubleshoot the POS system as needed; train others to operate the system and learn how to navigate the POS system."
    },
    {
      "duty": "Ensure proper merchandising and marketing materials within each retail location."
    },
    {
      "duty": "Monitor operating procedures, supervise staff and provide training development as needed."
    },
    {
      "duty": "Ensure excellent customer service in each retail food location."
    },
    {
      "duty": "Comply with all AVI policies and procedures; maintain a safe and healthy environment for clients, customers and team members."
    },
    {
      "duty": "Background inclusive of franchised quick service restaurant operations, preferably in a multi-unit capacity."
    },
    {
      "duty": "Successful team leadership experience."
    },
    {
      "duty": "Excellent customer service and communication skills, both written and verbal."
    },
    {
      "duty": "ServSafe certification preferred."
    },
    {
      "duty": "Working knowledge of Microsoft Office: Word, Excel, and PowerPoint."
    },
    {
      "duty": "Knowledge of POS systems."
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Inventory Management",
      "experience": 5
    },
    {
      "skill": "POS System Management",
      "experience": 5
    },
    {
      "skill": "Retail Marketing",
      "experience": 5
    },
    {
      "skill": "Franchise Operations",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 50,
      "introvert_extrovert": 125
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Marketing, Sales, or related field (Master's preferred)"
    }
  ]
}