{
  "meta": [
    {
      "job_title": "Senior Principal Information Assurance Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 187000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Systems Engineering",
      "experience": 8
    },
    {
      "skill": "Cyber Security",
      "experience": 10
    },
    {
      "skill": "Risk Management Framework (RMF)",
      "experience": 10
    },
    {
      "skill": "DIACAP",
      "experience": 10
    },
    {
      "skill": "STIGs",
      "experience": 10
    },
    {
      "skill": "Written and Verbal Communication",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Project Leadership",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute cybersecurity specifications such as Risk Management Framework (RMF), DIACAP, STIGs, and other government security specifications and guidelines."
    },
    {
      "duty": "Contribute to the achievement of business objectives by recognizing and incorporating various security designs and lessons learned."
    },
    {
      "duty": "Report relevant cyber systems engineering design and communicate issues, impacts, and corrective actions that affect the cyber design and implementation."
    },
    {
      "duty": "Lead security work groups, serve as a consultant to senior management and customers on long-range security planning and security issues."
    },
    {
      "duty": "Serve as a company technical spokesperson in cyber security, and have frequent contact with project leaders, customer program leadership, and professionals within the Engineering department and project teams."
    },
    {
      "duty": "Apply basic project leadership principles including SPI/CPI, Earned Value, Cost Account Management (CAM), and Statistical Process Controls."
    },
    {
      "duty": "Obtain a Secret Clearance and recognize and apply basic project leadership principles."
    },
    {
      "duty": "Be a creative thinker and good multi-tasker."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Engineering, or a related Science or Mathematics field (Master's degree preferred)"
    }
  ]
}