{
  "meta": [
    {
      "job_title": "Shift Leader",
      "job_category": "Manufacturing",
      "job_class": "Supervisor",
      "sector": "Manufacturing",
      "salary": 76000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    },
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Word",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "PTM",
      "experience": 5
    },
    {
      "skill": "TRAX",
      "experience": 5
    },
    {
      "skill": "KRONOS",
      "experience": 5
    },
    {
      "skill": "Warehouse Management System",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leading, mentoring, supervising, coaching, and developing hourly employees utilizing the MBM® Guiding Principles and Operations Excellence tools to improve capability and performance."
    },
    {
      "duty": "Facilitating knowledge transfer to and among team members to enable them to succeed."
    },
    {
      "duty": "Facilitating crew level safety action plans and safety meetings with area Master Techs that support the mill’s safety vision and Environmental, Health & Safety excellence."
    },
    {
      "duty": "Ensuring employee’s roles, responsibilities, and expectations (RR&E’s) are aligned with plant and organizational goals and that team members know how to create maximum value for the company."
    },
    {
      "duty": "Creating an environment where the team values hazard identification and risk reduction."
    },
    {
      "duty": "Interfacing with Manufacturing Engineers, Performance Capability Leader, Skill Developer, and other team members to identify and address performance gaps."
    },
    {
      "duty": "Providing frequent performance feedback and developing annual 360 feedback summaries."
    },
    {
      "duty": "Working with the team to execute asset strategies."
    },
    {
      "duty": "Ensuring decision making and actions are consistent with the collective bargaining agreement language and intent."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "One (1) or more years of manufacturing experience OR previous supervisory/management experience"
    }
  ]
}