{
  "meta": [
    {
      "job_title": "Program Manager",
      "job_category": "Program Management",
      "job_class": "Manager",
      "sector": "Government",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "DoD and AF Program/Project analysis",
      "experience": 10
    },
    {
      "skill": "Database Administration",
      "experience": 10
    },
    {
      "skill": "Acquisition Program Management",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Microsoft Office Applications",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Apply an understanding of DoD and AF Program/Project analysis to plan, organize, complete, and present assessments of program/project activity management concepts, analyses, studies, and procedures to senior leadership."
    },
    {
      "duty": "Evaluate implications of existing or proposed projects, programs, processes, and policies/laws and recommend improvements to the government point-of-contact (POC)."
    },
    {
      "duty": "Assist in performing a wide range of activities, including gathering a variety of program information, conducting analyses, acquisition strategy planning, pre-award and post-award document preparation, and milestone planning, tracking, scheduling, briefing preparation, staff coordination, and decision documentation preparation."
    },
    {
      "duty": "Develop, report, and maintain schedules and metrics that are needed to track program status."
    },
    {
      "duty": "Interface and coordinate with lateral USG organizations, i.e., headquarters, major commands, aircraft wings/squadrons, test agencies, and USAF Centers or other external agencies as required to accomplish assigned tasks."
    },
    {
      "duty": "Assist with the resolution of programmatic issues, including but not limited to interfacing/querying Air Staff, Air Force Major Command, and Department of Defense personnel."
    },
    {
      "duty": "Assist with the proper coding and filing of directorate records within the Air Force guidelines and shall be knowledgeable in the use of the Air Force Records Information Management System (AFRIMS) and proficient with the Electronic Records Management (ERM) system per AFI 33-364 and AFMAN 33-363."
    },
    {
      "duty": "Support the acquisition program management of full life cycle requirements of systems, subsystems, and equipment throughout the case life cycles."
    },
    {
      "duty": "Supervisory responsibilities."
    },
    {
      "duty": "Other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s degree and 10+ years of experience in a respective technical/professional discipline OR Bachelor’s degree in a technical discipline and 14+ years of experience in a respective technical/professional discipline OR High school diploma or GED equivalent and 20+ years of relevant work experience. Secret clearance required"
    }
  ]
}