{
  "meta": [
    {
      "job_title": "Director of Finance",
      "job_category": "Finance",
      "job_class": "Director",
      "sector": "Finance",
      "salary": 130000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Budgeting",
      "experience": 7
    },
    {
      "skill": "Cash Flow Management",
      "experience": 7
    },
    {
      "skill": "Financial Forecasting",
      "experience": 7
    },
    {
      "skill": "GAAP Compliance",
      "experience": 7
    },
    {
      "skill": "Fund Accounting",
      "experience": 7
    },
    {
      "skill": "Process Improvement",
      "experience": 7
    },
    {
      "skill": "Financial Reporting",
      "experience": 7
    },
    {
      "skill": "YARDI Software",
      "experience": 7
    },
    {
      "skill": "Team Leadership",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead hands-on day-to-day operations in GL nonprofit accounting operations and financial forecasting."
    },
    {
      "duty": "Process improvement, developing multi-year forecasts, improving internal controls, and mentoring a dynamic team."
    },
    {
      "duty": "Manage the Finance Department and oversee fund accounting, accounts payable, accounts receivable, payroll, fixed assets, general ledger, financial statements, cost centers, chart of accounts & distribution."
    },
    {
      "duty": "Oversee cash flow management, fund accounting management, and fixed asset analysis."
    },
    {
      "duty": "Lead and coach the Finance team, establish policies, processes, and internal controls, and ensure high-level organization and timely results."
    },
    {
      "duty": "Collaborate with internal stakeholders including Directors of other departments, lead audits, and work in an environment promoting compassion, service, and social justice."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Accounting, or Finance. Certified Public Accountant designation or Master's degree in Business Administration, Accounting, Finance, or similar equivalent preferred."
    }
  ]
}