{
  "meta": [
    {
      "job_title": "Finance Analyst Strategic Deals",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Financial Analysis",
      "experience": 7
    },
    {
      "skill": "Economic Structure Analysis",
      "experience": 7
    },
    {
      "skill": "Revenue Recognition",
      "experience": 7
    },
    {
      "skill": "Deal Structuring",
      "experience": 7
    },
    {
      "skill": "Compliance Management",
      "experience": 7
    },
    {
      "skill": "Data Analysis",
      "experience": 7
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 7
    },
    {
      "skill": "Leadership",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maximize NetApp’s ability to recognize revenue and achieve margin targets while limiting economic and business risks to the Company."
    },
    {
      "duty": "Implement corporate policies and establish compliance measures."
    },
    {
      "duty": "Engage with cross functional teams to identify revenue impacting issues and provide guidance and education to enable customer facing teams to identify and resolve non-standard revenue and business impacting terms."
    },
    {
      "duty": "Act as a business partner to the Americas Business Desk, Field Finance, Sales, Sales Operations, Corporate Revenue Accounting and Legal."
    },
    {
      "duty": "Provide deal and economic structure guidance including analysis for large and complex deals."
    },
    {
      "duty": "Review historical trends, assess the impact of financing and partner arrangements, discount trends, special promotions, and growth opportunities."
    },
    {
      "duty": "Calculate the economic impact of large complex deals such as Enterprise License Agreements, Enterprise Support Agreements, as well as Volume, Subscription and Consumption Agreements."
    },
    {
      "duty": "Be a subject matter expert providing technical advice to business partners on revenue recognition to influence deal structures and optimize revenue and margin outcomes for the company."
    },
    {
      "duty": "Review non-standard sales contracts for compliance with revenue recognition policies in accordance with US GAAP and ASC 606."
    },
    {
      "duty": "Provide value to field Controllers and Sales through developing and documenting tools and business processes to streamline the deal review cycle for large non-standard deals."
    },
    {
      "duty": "Design operational procedures and processes that meet compliance and audit standards while improving efficiency."
    },
    {
      "duty": "Monitor deal status as it evolves and moves through the review and approval process. Ensure deals are well understood and documented. Review quote details for conflicts with deal structure. Ensure open items are addressed and brought to closure prior to submission for approval."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate degree in Business or Accounting. MBA/CPA with Big 4 audit experience is a plus."
    }
  ]
}