{
  "meta": [
    {
      "job_title": "Residential Program Manager",
      "job_category": "Social Services",
      "job_class": "Manager",
      "sector": "Social Services",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate scheduling to ensure service delivery in a single-family home and assist with continuous quality improvements in service management, and compliance with DHS (245D) licensing regulations."
    },
    {
      "duty": "Provide direct supervision and training to the Direct Support Professionals assigned to the home, is the first point of contact for the external stakeholders and is supervised by the Residential Program Director."
    },
    {
      "duty": "Oversight of program services delivery including mediation administration, meal planning and preparation. Additionally, contributes to successful execution of admissions and program planning processes at the direction of the Residential Program Administrator."
    },
    {
      "duty": "Assures the management and delivery of all contracted services, provides supervision and training of Direct Support Professionals, assists those living in the home to complete personal and medical cares."
    },
    {
      "duty": "Collects data and completes documentation of service delivery, functions as the representative and main point of contact for Direct Support Professionals working in the home, the individuals living in the home."
    }
  ],
  "skills": [
    {
      "skill": "Service Delivery Management",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Quality Improvement",
      "experience": 5
    },
    {
      "skill": "Supervision and Training",
      "experience": 5
    },
    {
      "skill": "Admissions and Program Planning",
      "experience": 5
    },
    {
      "skill": "Documentation",
      "experience": 5
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 5
    },
    {
      "skill": "Mediation Administration",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Social Work, Behavioral Science or a related field (Master's preferred)"
    }
  ]
}