{
  "meta": [
    {
      "job_title": "Contracts Specialist",
      "job_category": "Risk Management",
      "job_class": "Specialist",
      "sector": "Risk Management",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Document Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Business Operations",
      "experience": 5
    },
    {
      "skill": "Finance Management",
      "experience": 5
    },
    {
      "skill": "Legal Research",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Client Relationship Management",
      "experience": 5
    },
    {
      "skill": "Insurance Management",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure that contracts and proposals are properly entered into organizational databases and securely maintained."
    },
    {
      "duty": "Perform appropriate administrative and operational research to support proposal and contract development."
    },
    {
      "duty": "Identify issues and client requirements, facilitate pricing discussions, and obtain senior management input on timelines and deliverables."
    },
    {
      "duty": "Work with business partners to ensure accuracy and appropriateness of contract text and attachments."
    },
    {
      "duty": "Interface with insurance companies regarding adequacy of coverage."
    },
    {
      "duty": "Maintain deadlines on deliverables and communicate on an ongoing basis with business partners and internal clients about contractual issues."
    },
    {
      "duty": "Assist project managers and principals to review contractual performance of both parties to ensure compliance with terms and to identify conflicts or changes requiring resolution."
    },
    {
      "duty": "Engage with clients on a regular basis to foster strong working relationships."
    },
    {
      "duty": "Oversee organizational registration with Secretaries of State and business licensure with State Boards of Architecture and Landscape Architecture."
    },
    {
      "duty": "Ensure Principals' architecture registrations are maintained in states where the individuals are practicing."
    },
    {
      "duty": "Assist Principals to keep CEUs current."
    },
    {
      "duty": "Ensure that all business and architecture licenses are accurately entered into the organizational database and that records are securely maintained."
    },
    {
      "duty": "Coordinate annual business liability insurance renewals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration, Legal Studies, or a related field (Master's preferred)"
    }
  ]
}