{
  "meta": [
    {
      "job_title": "CCIP Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Care Coordination",
      "experience": 3
    },
    {
      "skill": "Transition Management",
      "experience": 3
    },
    {
      "skill": "Clinical Assessment",
      "experience": 3
    },
    {
      "skill": "Patient Education",
      "experience": 3
    },
    {
      "skill": "Quality Improvement",
      "experience": 3
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 3
    },
    {
      "skill": "Critical Thinking",
      "experience": 3
    },
    {
      "skill": "Healthcare Navigation",
      "experience": 3
    },
    {
      "skill": "Risk Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct comprehensive assessments of patients with complex medical needs to identify their physical, psychological, social, and environmental needs."
    },
    {
      "duty": "Develop individualized care plans that address the patient's health goals, preferences, and priorities, and align with evidence-based clinical guidelines and best practices."
    },
    {
      "duty": "Coordinate care across the healthcare continuum, including transitions of care between different settings and providers, and communicate with the patient, family, caregivers, and healthcare team members to ensure continuity and quality of care."
    },
    {
      "duty": "Provide patient education on self-management of chronic conditions, medication management, preventive care, and healthcare navigation."
    },
    {
      "duty": "Participate in quality improvement initiatives, evaluate the effectiveness of the care coordination and integration program, and implement changes to improve outcomes and patient satisfaction."
    },
    {
      "duty": "Maintain accurate and timely documentation of patient assessments, care plans, interventions, and outcomes, using electronic health record systems."
    },
    {
      "duty": "Engage in ongoing professional development activities, such as continuing education, certification, and participation in professional organizations, to maintain and enhance knowledge and skills related to care coordination and integration."
    },
    {
      "duty": "Collaborate with other members of the healthcare team, such as physicians, social workers, pharmacists, and case managers, to ensure that patients receive coordinated and integrated care that meets their needs and preferences."
    },
    {
      "duty": "Work closely with the health plan's utilization management team to ensure that services are authorized and reimbursed appropriately."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 150,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Nursing Degree from an accredited nursing program and be licensed as a registered nurse (RN) in the state of Florida."
    },
    {
      "credential": "Certification in care coordination and transition management, such as the Certified in Care Coordination and Transition Management (CCCTM) credential offered by the Medical-Surgical Nursing Certification Board (Preferred)"
    }
  ]
}