{
  "meta": [
    {
      "job_title": "Buyer III",
      "job_category": "Procurement",
      "job_class": "Buyer",
      "sector": "Oil & Gas",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Procurement Experience",
      "experience": 5
    },
    {
      "skill": "Stakeholder relationship building",
      "experience": 5
    },
    {
      "skill": "Transactional skills",
      "experience": 5
    },
    {
      "skill": "SAP",
      "experience": 3
    },
    {
      "skill": "Material Procurement Processes",
      "experience": 4
    },
    {
      "skill": "Strategic Sourcing",
      "experience": 5
    },
    {
      "skill": "RFX Process",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Supplier Relationship Management",
      "experience": 5
    },
    {
      "skill": "ARIBA",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Direct, execute, approve, and coordinate purchases related activities for all \"Minor\" capital projects."
    },
    {
      "duty": "Incorporate the strategic direction of the business units into contract opportunities."
    },
    {
      "duty": "Reporting value savings and procurement of materials and services for Minor Capital Projects."
    },
    {
      "duty": "Establish milestone schedules for Minor Project Procurement and ensure their execution."
    },
    {
      "duty": "Provide oversight and procurement guidance to Project Managers, contractors, and internal clients."
    },
    {
      "duty": "Manage the procurement strategies for commodities required to support Minor Plant Projects."
    },
    {
      "duty": "Promote cross-functional teams in assessing risks and developing models associated with supply and technical compliance."
    },
    {
      "duty": "Negotiate resulting in the most favorable contracts for the company with the inclusion of Legal, Risk Management, and Finance, as required."
    },
    {
      "duty": "Ensure full compliance with the company's Purchasing Policies and programs to assure that the company is in full compliance with policies, practices, and guidelines."
    },
    {
      "duty": "Participate in Project Review Meetings and be accountable for handling all work activities in a legal and ethical manner."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 50,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Undergraduate programs including Engineering, Business Administration, or Supply Chain Management."
    },
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}