{
  "meta": [
    {
      "job_title": "QA Technician",
      "job_category": "Quality Assurance",
      "job_class": "Technician",
      "sector": "Quality Assurance",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Quality Control",
      "experience": 3
    },
    {
      "skill": "Inspection",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Technical Drawing Interpretation",
      "experience": 3
    },
    {
      "skill": "Statistical Sampling",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Computer Skills",
      "experience": 3
    },
    {
      "skill": "Geometric Dimensioning & Tolerancing",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Inspect materials and products for conformance to specifications using variable, fixed, or preset measuring equipment."
    },
    {
      "duty": "Compare product with parts list, blueprints, specifications, or sample model to ensure completion and correctness of the assembly or subassemblies."
    },
    {
      "duty": "Verify specified dimensions using proper test equipment and procedures."
    },
    {
      "duty": "Identify rejected parts with prescribed methods."
    },
    {
      "duty": "Test products for structural flaws."
    },
    {
      "duty": "Maintain records on all defects and the number of parts rejected."
    },
    {
      "duty": "Use statistical sampling plans when required to conduct inspections."
    },
    {
      "duty": "Assist in training new technicians when required."
    },
    {
      "duty": "Responsible for general housekeeping of the work area."
    },
    {
      "duty": "Interact with customers as required."
    },
    {
      "duty": "Assist engineers during investigations of failures (root cause analysis) as required."
    },
    {
      "duty": "Monitor inspections to ensure compliance of processes and testing required to maintain quality and reliability of products."
    },
    {
      "duty": "Recommend improvements to Quality Assurance processes, QAS's, and manufacturing processes."
    },
    {
      "duty": "Communicate with direct supervisor and PMT groups to make necessary changes of audits/inspections."
    },
    {
      "duty": "Demonstrate independent judgment in defining problems, collecting data, establishing facts, and drawing valid conclusions."
    },
    {
      "duty": "Apply analysis and problem-solving skills to handle daily questions/issues from workers, managers, customers, etc."
    },
    {
      "duty": "Use mathematical concepts such as probability, statistical inference, and fundamentals of plane and solid geometry and trigonometry."
    },
    {
      "duty": "Troubleshoot inspection equipment/instrument interactions using reference materials available (STM, SOP, Operators Manual)."
    },
    {
      "duty": "Read and interpret simple instructions, short correspondence, and memos."
    },
    {
      "duty": "Write short correspondence."
    },
    {
      "duty": "Effectively present information in one-on-one and small group situations to customers, clients, and other employees of the organization."
    },
    {
      "duty": "Apply basic computer skills associated with traditional PC-based software such as Microsoft Office and Lotus Notes."
    },
    {
      "duty": "Comprehend and interpret basic measurement techniques including reading scales (rulers)."
    },
    {
      "duty": "Read and interpret blueprints, to include discerning specification (in tolerance / out of tolerance) and converting fractions and decimals."
    },
    {
      "duty": "Work with working knowledge of inspections/audits, standard operating procedures, and ISO standards."
    },
    {
      "duty": "Understand Geometric Dimensioning & Tolerancing and cycle counting."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High-school diploma or One-year certificate from college or technical school is preferred. 3-5 years of related experience after graduation and/or training."
    }
  ]
}