{
  "meta": [
    {
      "job_title": "Kitchen Assistant",
      "job_category": "Food and Beverage",
      "job_class": "Assistant",
      "sector": "Hospitality",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist the Executive Chef in all aspects of the main, grill, and/or banquet kitchens (ie. ordering, scheduling, sanitation, maintenance, employee development, performance reviews)."
    },
    {
      "duty": "Responsible for proper preparation, excellence of product, profit and labor cost."
    },
    {
      "duty": "Organize and help in the service of all activities concerning ala carte, employee meals and private dining rooms."
    },
    {
      "duty": "Consistent preparation and presentation based on overall standards, including portion size, of daily special, salads, entrees, etc. as applicable per work assignment and as designated by Executive Chef which are produced within Invited quality standards guidelines."
    },
    {
      "duty": "To train, supervise, direct and/or performance manage employees when needed. To enhance the overall knowledge and team spirit of the kitchen staff, providing the 3 Steps of Service."
    },
    {
      "duty": "Prepare work schedules for the kitchen crew, monitor payroll costs and Kronos reports as requested."
    },
    {
      "duty": "Menu development for the ala carte and banquet menus, and any other special request by a Member or the Executive Chef."
    },
    {
      "duty": "Responsible for the expediting at any meal period and ensuring proper quality, portioning and presentation."
    },
    {
      "duty": "Must be able to interact with Members/Guests professionally, helping them with changes and last-minute requests as needed."
    }
  ],
  "skills": [
    {
      "skill": "Ordering",
      "experience": 2
    },
    {
      "skill": "Food Preparation",
      "experience": 3
    },
    {
      "skill": "Scheduling",
      "experience": 2
    },
    {
      "skill": "Sanitation",
      "experience": 3
    },
    {
      "skill": "Employee Development",
      "experience": 3
    },
    {
      "skill": "Menu Development",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 40,
      "student_teacher": 20,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Culinary training"
    }
  ]
}