{
  "meta": [
    {
      "job_title": "Administrative Assistant",
      "job_category": "Administrative",
      "job_class": "Assistant",
      "sector": "Administration",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Stellar Customer Service",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "Event Management",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Organization",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the primary contact for incoming phone calls and emails, answering inquiries and/or forwarding to appropriate parties."
    },
    {
      "duty": "Manage the contact database and outlook email lists, producing a contact directory."
    },
    {
      "duty": "Coordinate in-house and off-site meetings, including scheduling, outreach, guest invitations, and logistical support."
    },
    {
      "duty": "Facilitate annual county visits process for executives, including scheduling and coordination."
    },
    {
      "duty": "Provide administrative support for staff, including document formatting, proof-reading, and meeting coordination."
    },
    {
      "duty": "Manage staff calendars for meetings, events, and travel, and coordinate travel arrangements."
    },
    {
      "duty": "Maintain the tidiness of common spaces and monitor/order office and meeting supplies."
    },
    {
      "duty": "Assist with physical mailings and prepare event materials as requested."
    },
    {
      "duty": "Plan and oversee participation in industry events, managing speaker confirmations, and assisting with physical mailings of invitations and brochures."
    },
    {
      "duty": "Staff on-site check-in and manage follow-up tasks as requested."
    },
    {
      "duty": "Assist with legislative tracking and coordination, planning meetings, and assisting with coordination and materials for legislative committee meetings."
    },
    {
      "duty": "Perform any other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Associates degree required, Bachelors degree preferred. Candidates with 5 years of administrative and database experience will be given special consideration."
    }
  ]
}