{
  "meta": [
    {
      "job_title": "Preconstruction Director",
      "job_category": "Construction",
      "job_class": "Director",
      "sector": "Construction",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct comprehensive research and analysis to identify project requirements, potential risks, and opportunities for cost optimization."
    },
    {
      "duty": "Collaborate with business development, architects, engineers, and other stakeholders to gather project information and specifications."
    },
    {
      "duty": "Prepare accurate and detailed cost estimates, considering materials, labor, equipment, and subcontractor services."
    },
    {
      "duty": "Utilize industry-standard software and tools to create detailed project budgets and timelines."
    },
    {
      "duty": "Assist in the preparation of bid proposals and participate in the procurement process for subcontractors and suppliers."
    },
    {
      "duty": "Evaluate and compare bids from vendors to ensure competitiveness and adherence to project requirements."
    },
    {
      "duty": "Continuously update and maintain the cost database with the latest market prices and industry trends."
    },
    {
      "duty": "Collaborate with the design team to provide value engineering suggestions without compromising quality and functionality."
    },
    {
      "duty": "Develop and present preconstruction reports to senior management, highlighting key findings and recommendations."
    },
    {
      "duty": "Monitor changes in project scope and update cost estimates accordingly."
    },
    {
      "duty": "Support the project team during the transition from preconstruction to the construction phase."
    },
    {
      "duty": "Manage all estimating positions and make assignments."
    }
  ],
  "skills": [
    {
      "skill": "Construction Estimation",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Bid Preparation",
      "experience": 5
    },
    {
      "skill": "Value Engineering",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Collaboration",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Civil Engineering, Construction Management, or related field."
    }
  ]
}