{
  "meta": [
    {
      "job_title": "Business Analyst",
      "job_category": "Analysis",
      "job_class": "Level III",
      "sector": "IT",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and participate in requirements gathering sessions, facilitating discussions to capture client-focused needs."
    },
    {
      "duty": "Analyze gathered requirements to identify key insights and prioritize system requirements for continuous integration and deployment."
    },
    {
      "duty": "Utilize your expertise to validate and document system requirements that align with best-fit technology solutions."
    },
    {
      "duty": "Manage and identify system requirements with a focus on areas such as eligibility, enrollment, case management, payment, claims, and recoupments."
    },
    {
      "duty": "Document system requirements for mainframe modernization projects across multiple complex functional domains."
    },
    {
      "duty": "Conduct thorough business process analysis and optimization within technology environments, documenting current \"As Is\" states and proposing innovative \"To Be\" states."
    },
    {
      "duty": "Develop comprehensive requirements documentation, including use cases, screen prototypes, and specifications, adhering to established templates and using tools like Blueprint Storyteller."
    },
    {
      "duty": "Facilitate meetings and workgroups to foster collaboration and ensure a comprehensive understanding of requirements."
    }
  ],
  "skills": [
    {
      "skill": "System Requirements Analysis",
      "experience": 7
    },
    {
      "skill": "Project Leadership",
      "experience": 7
    },
    {
      "skill": "Business Process Analysis",
      "experience": 7
    },
    {
      "skill": "Use Case Development",
      "experience": 7
    },
    {
      "skill": "Requirements Documentation",
      "experience": 7
    },
    {
      "skill": "Facilitation",
      "experience": 7
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 180
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, IT, or related field (Master's preferred)"
    }
  ],
  "salary": 110000
}