{
  "meta": [
    {
      "job_title": "VP of Product & Technology",
      "job_category": "Product Management",
      "job_class": "Vice President",
      "sector": "Technology",
      "salary": 200000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Product Management",
      "experience": 10
    },
    {
      "skill": "Technology Leadership",
      "experience": 10
    },
    {
      "skill": "EV Charging Infrastructure",
      "experience": 10
    },
    {
      "skill": "Data Analytics",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 10
    },
    {
      "skill": "Strategic Partnerships",
      "experience": 10
    },
    {
      "skill": "Budget Management",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Define and execute a comprehensive product strategy and roadmap for EV charging products."
    },
    {
      "duty": "Oversee end-to-end product development across hardware, firmware, mobile, in-car UI, and site design."
    },
    {
      "duty": "Stay at the forefront of EV charging technologies and identify opportunities for technology integration and advancements."
    },
    {
      "duty": "Champion a customer-centric approach to product design and deliver a seamless and intuitive user experience."
    },
    {
      "duty": "Utilize data analytics and market insights to drive informed product decisions and improve product performance."
    },
    {
      "duty": "Ensure EV charging products meet all relevant regulations and certifications."
    },
    {
      "duty": "Collaborate effectively with the Global Charging Team based in Germany to ensure alignment of product strategies."
    },
    {
      "duty": "Lead and inspire a diverse and talented team of product managers, engineers, and technology experts."
    },
    {
      "duty": "Identify strategic partnerships and collaborations with technology providers, utilities, and other stakeholders to enhance EV charging offerings."
    },
    {
      "duty": "Develop and manage budgets for product development and technology initiatives."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 30,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Technical foundation in Electrical Engineering (BSc minimum) plus product development and management experience in power electronics and embedded software. An advanced degree (MBA, MS) is a plus."
    }
  ]
}