{
  "meta": [
    {
      "job_title": "Head of Human Resources, North America",
      "job_category": "Human Resources",
      "job_class": "Head",
      "sector": "People and Culture",
      "salary": 165000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Human Resources Leadership",
      "experience": 12
    },
    {
      "skill": "Organizational Development",
      "experience": 12
    },
    {
      "skill": "Coaching",
      "experience": 12
    },
    {
      "skill": "Change Management",
      "experience": 12
    },
    {
      "skill": "Business Acumen",
      "experience": 12
    },
    {
      "skill": "Analytical Skills",
      "experience": 12
    },
    {
      "skill": "Talent Management",
      "experience": 12
    },
    {
      "skill": "Employee Relations",
      "experience": 12
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborating with business leaders to identify business priorities and ensure that people and organizational strategies are in alignment with the business needs."
    },
    {
      "duty": "Coaching, inspiring, and developing the HR team in COWI North America and creating an environment of trust, respect, and high engagement."
    },
    {
      "duty": "Recognizing and identifying improvement opportunities across people-related topics with the long-term goal of continuous improvement."
    },
    {
      "duty": "Applying knowledge of the future direction of the organization to guide talent assessment and make decisions on talent needs and solutions."
    },
    {
      "duty": "Providing expert advice to COWI group functions (e.g., Talent Management, performance management, coaching, data analysis, compensation and benefits, employee relations, learning and development, recruitment, etc.)."
    },
    {
      "duty": "Ensuring a compliant and efficient HR operation."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Human Resources or similar with 12+ years of relevant HR experience, preferably in the consulting industry. Professional HR designation, SHRM or CPHR, considered an asset."
    }
  ]
}