{
  "meta": [
    {
      "job_title": "Financial Reporting Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Reporting",
      "experience": 3
    },
    {
      "skill": "SEC Reporting",
      "experience": 3
    },
    {
      "skill": "GAAP Compliance",
      "experience": 3
    },
    {
      "skill": "XBRL",
      "experience": 2
    },
    {
      "skill": "Sarbanes-Oxley 404",
      "experience": 2
    },
    {
      "skill": "Financial Analysis",
      "experience": 3
    },
    {
      "skill": "Accounting Policies",
      "experience": 3
    },
    {
      "skill": "Microsoft Dynamics",
      "experience": 2
    },
    {
      "skill": "Workiva",
      "experience": 2
    },
    {
      "skill": "Financial Planning",
      "experience": 3
    },
    {
      "skill": "CPA Certification",
      "experience": 3
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 3
    },
    {
      "skill": "Microsoft Office",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prepare, analyze, and report on financial results, creating accounting policies and serving as a key resource to interpret and provide solutions to technical accounting and business issues."
    },
    {
      "duty": "Assist in preparation of financial statements, footnotes and MD&A for inclusion in quarterly and annual SEC filings, ensuring compliance with U.S. GAAP and SEC requirements, including XBRL."
    },
    {
      "duty": "Research technical accounting topics, write accounting position memos, and implement new accounting standards."
    },
    {
      "duty": "Work on Sarbanes-Oxley 404 processes, policies, and procedures, and assist with cross-functional projects including financial planning and analysis."
    },
    {
      "duty": "Assist with key accounting processes including stock-based compensation, leases, goodwill, intangibles, and revenue, and partner with the legal and investor relations groups to support financial communications."
    },
    {
      "duty": "Critically assess financial reporting information received from other functions and service providers, and help coordinate quarterly review processes and audit procedures with external auditors."
    },
    {
      "duty": "Interface with the finance leadership team, public accountants, attorneys, internal departments, and focus on continuous improvement initiatives for financial reporting deliverables."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Accounting or related field (Master's preferred)"
    }
  ]
}