{
  "meta": [
    {
      "job_title": "Anesthesia Veterinary Nurse",
      "job_category": "Veterinary",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Anesthesia Administration",
      "experience": 5
    },
    {
      "skill": "Medical History Review",
      "experience": 5
    },
    {
      "skill": "IV Catheter Placement",
      "experience": 5
    },
    {
      "skill": "Physical Exams",
      "experience": 5
    },
    {
      "skill": "Anesthetic Protocols",
      "experience": 5
    },
    {
      "skill": "Anesthesia Management",
      "experience": 5
    },
    {
      "skill": "Post-Anesthesia Care",
      "experience": 5
    },
    {
      "skill": "Equipment Preparation",
      "experience": 5
    },
    {
      "skill": "Collaborative Communication",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Administer general anesthesia and sedation to small animals, including critical and non-critical cases."
    },
    {
      "duty": "Thoroughly examine and review the medical history of animal patients, enabling the development of individualized anesthetic plans tailored to their specific needs."
    },
    {
      "duty": "Skillfully place intravenous (IV) catheters, ensuring the safe and efficient administration of medications and fluids during procedures."
    },
    {
      "duty": "Conduct comprehensive physical examinations to assess the health status of patients and ensure their suitability for anesthesia."
    },
    {
      "duty": "Design and implement customized anesthetic protocols for each patient, accounting for factors such as age, breed, health condition, and surgical requirements."
    },
    {
      "duty": "Safely induce, maintain, and recover animals during procedures, carefully monitoring their vitals and overall well-being throughout the process."
    },
    {
      "duty": "Oversee the recovery of animal patients, providing attentive care and making informed decisions about their readiness to return to their ward or be discharged."
    },
    {
      "duty": "Set up and prepare all necessary equipment for anesthesia cases, ensuring a seamless and efficient workflow."
    },
    {
      "duty": "Foster effective communication with the veterinary team, including clinicians, to ensure seamless coordination of inpatient cases and maintain a smooth daily schedule."
    },
    {
      "duty": "Some overnight and weekend on-call for emergent and scheduled cases requiring general anesthesia."
    },
    {
      "duty": "Nurses are generously compensated for their time and effort."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Certified Veterinary Technician, specialization in anesthesia a plus."
    }
  ]
}