{
  "meta": [
    {
      "job_title": "Senior Azure Architect",
      "job_category": "Software Engineering",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Azure Security and IAM Best Practices",
      "experience": 10
    },
    {
      "skill": "Azure Identity Repository",
      "experience": 10
    },
    {
      "skill": "DevOps Environment",
      "experience": 8
    },
    {
      "skill": "Role Based Access Control (RBAC) or Attribute Based Access Control (ABAC)",
      "experience": 10
    },
    {
      "skill": "SAML and OIDC",
      "experience": 10
    },
    {
      "skill": "Engineering Degree",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and build Azure cloud, forward-thinking, Authentication, and Authorization solutions."
    },
    {
      "duty": "Leverage a large scope of Identity-related technologies both on-premises and in the cloud."
    },
    {
      "duty": "Design, document, and help train junior resources on new processes and technical solutions relevant to the space."
    },
    {
      "duty": "Work as a tier 3 support resource for the client-facing Platform team on all identity-related tasks."
    },
    {
      "duty": "Engage with the Security and Enterprise IT teams to stay aware and aligned on their initiatives in this space."
    },
    {
      "duty": "Interface closely with stakeholders and participate as a key stakeholder with internal teams to ensure the needs of the clients' Platform are addressed during new solution deployments."
    },
    {
      "duty": "Must have - strong background in Azure security and IAM best practices."
    },
    {
      "duty": "Must have - Ten plus years of experience working with an Azure Identity repository."
    },
    {
      "duty": "Must have - Eight plus years of experience working in a DevOps environment."
    },
    {
      "duty": "Must have - Expert level knowledge of Role Based Access Control (RBAC) or Attribute Based Access Control (ABAC)."
    },
    {
      "duty": "Must have - Foundational knowledge of SAML and OIDC."
    },
    {
      "duty": "Must have - Engineering degree from accredited, 4 year university."
    }
  ],
  "subjective_elements": [
    {
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Engineering degree from accredited, 4 year university"
    }
  ]
}