{
  "meta": [
    {
      "job_title": "Contracts Manager",
      "job_category": "Legal",
      "job_class": "Manager",
      "sector": "Legal",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Government Contract Knowledge",
      "experience": 10
    },
    {
      "skill": "Negotiation",
      "experience": 10
    },
    {
      "skill": "Contracts Management",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    },
    {
      "skill": "Legal Compliance",
      "experience": 10
    },
    {
      "skill": "Business Management",
      "experience": 10
    },
    {
      "skill": "MS Office Proficiency",
      "experience": 10
    },
    {
      "skill": "Attention to Detail",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate and oversee complex Requests for Information (RFIs)/RFPs/Requests for Quotations (RFQs) with internal and external customers."
    },
    {
      "duty": "Direct the preparation of complex ERs, Statements of Work (SOWs), Specifications, and Schedules."
    },
    {
      "duty": "Lead and manage complex proposals, develop proposal/contract strategy, and lead negotiations with customers."
    },
    {
      "duty": "Function as the primary point of contact for the review, edit, composition, and interpretation of contract documents, requirements, and agreements."
    },
    {
      "duty": "Execute contracts, agreements, and certifications within authorized delegation on behalf of the company."
    },
    {
      "duty": "Coordinate and provide guidance for contracts from time of signature to closeout."
    },
    {
      "duty": "Maintain and foster close business relationships with internal and external customers, act as the primary liaison between external customers and the company for contractual matters."
    },
    {
      "duty": "Perform management activities, including recruitment, selection/hiring, performance assessments, employee recognition/discipline, and career development."
    },
    {
      "duty": "Direct, schedule and plan activities required to manage multiple concurrent proposals and contracts, ensuring self-governance and compliance with company policies and procedures."
    },
    {
      "duty": "Provide input, adapt, and improve business processes/practices to meet company goals and satisfy customer needs."
    },
    {
      "duty": "Perform significant business management tasks on behalf of Contracts or Finance."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Business Administration or a related field required; MBA preferred."
    },
    {
      "credential": "Prefer expert knowledge of FAR/DFARS, CAS disclosure statement, ITAR, FPCA, and policies and procedures."
    },
    {
      "credential": "Prefer NCMA Certified Federal Contracts Manager (CFCM), Certified Professional Contracts Manager (CPCM), and/or other professional certification in Government contracts."
    }
  ]
}