{
  "meta": [
    {
      "job_title": "HR ServiceNow Product Owner",
      "job_category": "HR Technology",
      "job_class": "Product Owner",
      "sector": "HR Technology",
      "remote": false,
      "salary": 135000
    }
  ],
  "skills": [
    {
      "skill": "ServiceNow HRSD",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Business Analysis",
      "experience": 5
    },
    {
      "skill": "Vendor Management",
      "experience": 5
    },
    {
      "skill": "System Configuration",
      "experience": 5
    },
    {
      "skill": "HR Systems",
      "experience": 5
    },
    {
      "skill": "UX Design",
      "experience": 5
    },
    {
      "skill": "Content Development",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop the ServiceNow HRSD product vision and strategy; responsible for managing the product roadmap to ensure the technical and business priorities are fully aligned."
    },
    {
      "duty": "Manage projects and enhancement backlog; regularly prioritize projects and enhancements based on business needs; collaborate with internal partners to ensure optimal design and delivery of solutions."
    },
    {
      "duty": "Lead system configuration projects including leading discovery meetings, creating user stories and workflow diagrams, gathering and documenting requirements, configurations, testing, deployment, and training."
    },
    {
      "duty": "Act as a Business Analyst to translate business requirements to system requirements. Perform vendor management activities including contract management and critical issues."
    },
    {
      "duty": "Effectively communicate with team members, partners, senior management, and contacts. Communicate project status to identified partners through routine status reports."
    },
    {
      "duty": "Support release management, review release summaries, and releases readiness documents from solution vendors. Identify enhancement solutions and impacts to downstream systems. Support ServiceNow upgrades, reviews pending updates, and leads testing for system upgrades."
    },
    {
      "duty": "Partner with technology teams and third-party consultants to develop and deploy data interfaces and systems integrations."
    },
    {
      "duty": "Manage the dynamic personalization of the HR portal for multiple employee persona to provide relevant content. Serve as lead designer for creative efforts to develop and curate visually appealing portal or web page content. Develop and manage the HR Portal content strategy and content-related priorities, including a comprehensive content framework that demonstrates the brand."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 175,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "8+ years professional experience in product management or technology configurations. Hands-on configurations experience with the ServiceNow HR Service Delivery platform required. Experience with HR systems such as Oracle, SAP, Workday, PeopleSoft preferred. Experience with various development methodologies with complex SaaS products. Education with a concentration in human resources, operations, information technology, or related discipline required."
    }
  ]
}