{
  "meta": [
    {
      "job_title": "Data Center Controls Subject Matter Expert",
      "job_category": "Engineering",
      "job_class": "Expert",
      "sector": "Software Engineering",
      "salary": 160000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Controls Programming",
      "experience": 7
    },
    {
      "skill": "Electrical Systems",
      "experience": 7
    },
    {
      "skill": "Mechanical Systems",
      "experience": 7
    },
    {
      "skill": "Data Center Operations",
      "experience": 7
    },
    {
      "skill": "Troubleshooting",
      "experience": 7
    },
    {
      "skill": "Quality Assurance",
      "experience": 7
    },
    {
      "skill": "Collaboration",
      "experience": 7
    },
    {
      "skill": "Training",
      "experience": 7
    },
    {
      "skill": "PLC",
      "experience": 5
    },
    {
      "skill": "Python Programming",
      "experience": 5
    },
    {
      "skill": "IT/Networking Certification",
      "experience": 5
    },
    {
      "skill": "Field Service Engineering",
      "experience": 5
    },
    {
      "skill": "Critical Facility Operations",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Accountable for all Building Management System (BMS) changes and enhancements at the data center as part of a global fleet."
    },
    {
      "duty": "Diagnose and repair complex control system malfunctions requiring extensive knowledge of a variety of electronic or digital controls systems and ability to test and write modifications in multiple languages of systems software."
    },
    {
      "duty": "Troubleshoot and repair controls hardware including controllers, relays, measurement devices, actuators, and associated equipment with mechanical and electrical device systems."
    },
    {
      "duty": "Review operating equipment data for efficiency improvements, monitor all building systems for abnormal operating trends, and make optimization adjustments accordingly."
    },
    {
      "duty": "Collaborate with other disciplines to make modifications to BMS settings to manage the building space."
    },
    {
      "duty": "Ensure appropriate cross-functional collaboration between local controls team and applicable local and global teams."
    },
    {
      "duty": "Manage controls vendors while supporting site operations, including direct oversight to all system configuration and component upgrades."
    },
    {
      "duty": "Provide QAQC oversight of hardware installation to provide controls scope, review proposals and review programming through commissioning process for new construction and retrofits."
    },
    {
      "duty": "Oversee all system configurations and component upgrades to ensure system integrity is maintained and that all modifications to existing systems are in compliance with best practices, including change control processes."
    },
    {
      "duty": "Provide technical controls training and support to all Facility Operations staff."
    },
    {
      "duty": "Collaborate with the global controls team to provide feedback on global controls strategies and implement global initiatives at the data center."
    },
    {
      "duty": "Communicate all issues and upcoming controls work with site management."
    },
    {
      "duty": "Travel expectations: Can be significant during first 1-3 months for initial training/onboarding and then ongoing occasional travel for factory witness tests, collaboration, etc."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in related field and 3+ years relevant Controls Engineering/Technical experience"
    }
  ]
}