{
  "meta": [
    {
      "job_title": "Assistant General Counsel",
      "job_category": "Legal",
      "job_class": "Counsel",
      "sector": "Legal",
      "salary": 222500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Legal Advice",
      "experience": 5
    },
    {
      "skill": "Legal Services",
      "experience": 5
    },
    {
      "skill": "Non-profit governance",
      "experience": 5
    },
    {
      "skill": "Contractual Agreements",
      "experience": 5
    },
    {
      "skill": "Drafting and Reviewing",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Client Service",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide legal advice and counsel to senior management on a wide range of legal matters including individual giving, sponsorships, grants, agreements, and compliance."
    },
    {
      "duty": "Serve as a legal advisor on museum and education-related matters, with broad knowledge of New York not-for-profit and education law."
    },
    {
      "duty": "Support internal departments at the Museum on contractual arrangements, gift agreements, and various contracts."
    },
    {
      "duty": "Engage with outside counsel, when needed, to address legal matters on behalf of AMNH."
    },
    {
      "duty": "Draft, review, and negotiate a wide variety of contracts, including exhibition, loan, and specimen acquisition agreements, goods and services agreements, IT licenses, and copyright agreements."
    },
    {
      "duty": "Advise on non-profit governance, organizational documents, and compliance with State not-for-profit and education law."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "J.D. (from an ABA-accredited law school) and state bar admission in New York or eligibility for immediate membership."
    },
    {
      "credential": "5+ years of experience in a law firm or combined with a complex not-for-profit institution."
    },
    {
      "credential": "Professional experience providing legal services to non-profit organizations, institutions of higher education, or cultural organizations is desirable."
    }
  ]
}