{
  "meta": [
    {
      "job_title": "Digital Banking Strategy Manager",
      "job_category": "Banking",
      "job_class": "Manager",
      "sector": "Finance",
      "salary": 110000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "The Digital Banking Strategy Manager has ownership of customer-facing digital banking platforms and functions."
    },
    {
      "duty": "This role will work closely with internal and external stakeholders, and act as the Bank’s point of contact and escalation with third-party vendor partners."
    },
    {
      "duty": "Responsible for maintaining the Bank’s customer-facing digital channel platforms (digital banking, online applications, etc.)."
    },
    {
      "duty": "Ensures digital channels are implemented, optimized, and providing efficiency across the organization."
    },
    {
      "duty": "Owns online banking products for upgrades, patches, support for updating procedures, etc."
    },
    {
      "duty": "Owns all front-end customer digital applications (LoanWriter, Global Wave, Encompass, Account Opening, etc.) and their marketing attribution conversion points."
    },
    {
      "duty": "Maintains customer journey maps through all conversion points and digital product user stories."
    },
    {
      "duty": "Maintains data flow documentation for all ancillary third parties flowing through the Digital Banking platform."
    },
    {
      "duty": "Technical project lead for the digital department."
    },
    {
      "duty": "Manages digital banking roadmap of tactical releases and availability of new features."
    },
    {
      "duty": "Develops policies and procedures for digital banking processes to ensure compliance with established standards and regulations."
    },
    {
      "duty": "Ensures all systems meet all regulatory and compliance requirements and supports Digital Banking risk assessment and risk mitigation efforts."
    },
    {
      "duty": "Leads implementation efforts for system releases, upgrades, and new products and services, ensuring project and change methodology is followed."
    },
    {
      "duty": "Works with various Bank departments to provide additional support, training, and best practices in relation to digital banking, ensuring procedures and training manuals are current."
    },
    {
      "duty": "Actively participates with solution providers and creates/maintains relationships with other solution-user financial institutions, including user groups and other best practice sharing groups."
    }
  ],
  "skills": [
    {
      "skill": "Banking Systems Administration",
      "experience": 5
    },
    {
      "skill": "Applications Analysis",
      "experience": 5
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Solution Application",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Digital Technology",
      "experience": 5
    },
    {
      "skill": "Digital Marketing",
      "experience": 5
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 5
    },
    {
      "skill": "Risk Assessment",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, or a related field (Master's preferred)"
    }
  ]
}