{
  "meta": [
    {
      "job_title": "Director of Guest Experience",
      "job_category": "Hospitality",
      "job_class": "Director",
      "sector": "Management",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Hospitality Management",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Vendor Relationship Management",
      "experience": 5
    },
    {
      "skill": "Event Planning",
      "experience": 5
    },
    {
      "skill": "Online Presence Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute strategies to ensure maximum guest satisfaction through personal recognition and prompt attention from pre-arrival to departure."
    },
    {
      "duty": "Lead and guide a highly engaged team focused on delivering exceptional service and processes for VIP guests."
    },
    {
      "duty": "Analyze customer behavior and market trends to identify growth opportunities and refine guest experience strategies."
    },
    {
      "duty": "Manage the hotel's online brand presence and optimize guest engagement on social media channels."
    },
    {
      "duty": "Plan, coordinate, and oversee participation in industry events to enhance the hotel's reputation and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of guest experience strategies using data-driven insights to continuously improve services."
    },
    {
      "duty": "Maintain and develop the highest service standards possible and deliver on the hotel’s loyalty program."
    },
    {
      "duty": "Deal with guest issues in an appropriate and thorough manner from the initial complaint to the resolution."
    },
    {
      "duty": "Develop relationships with local vendors and ensure smooth operation of associated services for VIP guests."
    },
    {
      "duty": "Foster teamwork, motivate teams to sustain exceptional levels of performance, and work well in a team environment."
    },
    {
      "duty": "Communicate effectively with coworkers, customers, and suppliers to ensure exceptional levels of service."
    },
    {
      "duty": "Consistently go the extra mile for the customer and the hotel."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "4-year college degree in Hospitality Management or a related field (Master's preferred)"
    }
  ]
}