{
  "meta": [
    {
      "job_title": "Community Manager",
      "job_category": "Real Estate",
      "job_class": "Manager",
      "sector": "Property Management",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Accounting",
      "experience": 5
    },
    {
      "skill": "Property Management Software",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Invoicing",
      "experience": 5
    },
    {
      "skill": "Payment Processing",
      "experience": 5
    },
    {
      "skill": "Bank Reconciliation",
      "experience": 5
    },
    {
      "skill": "Delinquency Collection",
      "experience": 5
    },
    {
      "skill": "Lease Management",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and manage the financial and operational facets of the community, including accounting, bookkeeping, and monthly financial reports."
    },
    {
      "duty": "Complete daily financial transactions, bank deposits, and reconcile bank accounts using property management software."
    },
    {
      "duty": "Review resident files and accounting records, communicate with residents regarding outstanding balances, and implement procedures for collecting on delinquencies."
    },
    {
      "duty": "Process invoices, obtain approvals, and manage communication between vendors, contractors, accounting, and the client/owner."
    },
    {
      "duty": "Follow established procedures related to evictions, represent the community in court hearings, and enforce the lease to maximize revenue."
    },
    {
      "duty": "Promote resident satisfaction and retention by addressing service issues and complaints in a timely manner."
    },
    {
      "duty": "Act as the on-site supervisor in the absence of the community manager, organizing and delegating daily work, coordinating maintenance tasks, and managing the operation of the community in compliance with company policies."
    },
    {
      "duty": "Assist in managing the client/owner relationship by meeting with the owners, providing updates, and responding to owner requests."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 90,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Property Management, Accounting, or related field (Master's preferred)"
    }
  ]
}