{
  "meta": [
    {
      "job_title": "Special Effects Systems Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Software Engineering",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Special Effects Systems Engineering",
      "experience": 1
    },
    {
      "skill": "Technical Theater",
      "experience": 3
    },
    {
      "skill": "Mechanical Engineering",
      "experience": 3
    },
    {
      "skill": "Ride/Show Systems Design",
      "experience": 3
    },
    {
      "skill": "Project Management",
      "experience": 2
    },
    {
      "skill": "Vendor Management",
      "experience": 2
    },
    {
      "skill": "Environmental, Health & Safety",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide engineering technical assistance to the Ride/Show teams in support of scenic scopes of work."
    },
    {
      "duty": "Review vendor-provided design review documents, including drawing review, component selection review, calculation review, test plan review, and test results review."
    },
    {
      "duty": "Edit and update Ride/Show engineering specifications as assigned by Ride/Show engineering management in support of special effects system delivery."
    },
    {
      "duty": "Assist Ride/Show team in managing vendors through the process of bidding, designing, manufacturing, testing, shipping, installation, start-up, and commissioning of special effects systems."
    },
    {
      "duty": "Review, edit, or develop test protocols, procedures, and plans. Execute witness or approve testing and test results as assigned and authorized by Engineering & Safety management."
    },
    {
      "duty": "Understand and participate in Environmental, Health & Safety responsibilities by following established UO policy, procedures, training, and team member involvement activities."
    },
    {
      "duty": "Perform other duties as assigned."
    },
    {
      "duty": "Project experience within the entertainment/theme park industry."
    },
    {
      "duty": "Interpret technical instructions in mathematical or diagram form and deal with abstract and concrete variables."
    },
    {
      "duty": "Define problems, collect data, establish facts, and draw valid conclusions."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 180,
      "student_teacher": 90,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in applicable technical field required (examples include, but are not limited to, Technical Theater, Animation, Visual Effects, Mechanical Engineering) or equivalent demonstrated skill and experience; Advanced Degree preferred."
    }
  ]
}