{
  "meta": [
    {
      "job_title": "Data Management Clerk",
      "job_category": "Administrative",
      "job_class": "Clerk",
      "sector": "Office Support",
      "salary": 38000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage Project Permanent files and perform data entry."
    },
    {
      "duty": "Run reports and perform due diligence as required."
    },
    {
      "duty": "Research relevant information to assist project Supervisor."
    },
    {
      "duty": "Compose correspondence including letters and emails as directed by Supervisor."
    },
    {
      "duty": "Maintain strict confidentiality of company information and records."
    },
    {
      "duty": "Display sense of urgency and understanding of project deadlines."
    },
    {
      "duty": "Proofread documents and reports for accuracy and completeness."
    },
    {
      "duty": "Work with office staff to ensure a healthy work environment."
    },
    {
      "duty": "Prepare preliminary landowner lists for projects from online sources."
    },
    {
      "duty": "Manage Petty Cash and transcribe minutes of all internal meetings."
    },
    {
      "duty": "Initiate landowner contacts and follow-up as directed by Supervisor."
    },
    {
      "duty": "Review agent employee timesheets."
    },
    {
      "duty": "Adapt to changes in work environment and manage competing demands."
    },
    {
      "duty": "Adhere to company values, demonstrate attention to detail, and exhibit oral and written communication skills."
    },
    {
      "duty": "Continuously improve by attending professional conferences and introducing newly gained knowledge and skills on the job."
    },
    {
      "duty": "Fulfill the needs of internal and external customers and demonstrate the ability to persuade and convince others to support ideas."
    },
    {
      "duty": "Ability to self-start and work independently, with a tolerance for stress and the ability to maintain work product quality and timeliness."
    }
  ],
  "skills": [
    {
      "skill": "Data Management",
      "experience": 2
    },
    {
      "skill": "Data Entry",
      "experience": 1
    },
    {
      "skill": "File Management",
      "experience": 2
    },
    {
      "skill": "Microsoft Office",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Problem Solving",
      "experience": 1
    },
    {
      "skill": "Team Work",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma required, College Degree is a plus."
    }
  ]
}