{
  "meta": [
    {
      "job_title": "Investment Analyst",
      "job_category": "Finance",
      "job_class": "Analyst",
      "sector": "Finance",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Investment Analysis",
      "experience": 3
    },
    {
      "skill": "Financial Modeling",
      "experience": 3
    },
    {
      "skill": "Market Research",
      "experience": 3
    },
    {
      "skill": "Deal Execution",
      "experience": 3
    },
    {
      "skill": "Portfolio Management",
      "experience": 3
    },
    {
      "skill": "Investment Monitoring",
      "experience": 3
    },
    {
      "skill": "Relationship Building",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Conduct comprehensive financial analysis and due diligence on potential investment opportunities in the infrastructure and energy sectors."
    },
    {
      "duty": "Build complex financial models to analyze investment scenarios, project cash flows, assess valuation metrics, and evaluate potential exit strategies."
    },
    {
      "duty": "Stay up-to-date with industry trends, market dynamics, and regulatory developments within the infrastructure and energy sectors."
    },
    {
      "duty": "Assist in the execution of investment transactions, including preparing investment memos, conducting negotiations, coordinating with external advisors, and supporting the due diligence process."
    },
    {
      "duty": "Monitor and assess the performance of portfolio companies within the infrastructure and energy sectors."
    },
    {
      "duty": "Track and report on the performance of investments in the portfolio, including financial metrics, operational performance, and market dynamics."
    },
    {
      "duty": "Develop and maintain relationships with industry experts, professionals, and potential deal sources within the infrastructure and energy sectors."
    },
    {
      "duty": "Collaborate effectively with senior professionals to support investment decision-making and enhance the overall investment strategy."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Finance, Business, or a related field (Master's preferred)"
    }
  ]
}