{
  "meta": [
    {
      "job_title": "Imaging Informatics, Cardiology Analyst",
      "job_category": "Information Technology",
      "job_class": "Analyst",
      "sector": "Healthcare",
      "salary": 95000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cardiology Applications Support",
      "experience": 5
    },
    {
      "skill": "Clinical Information Systems",
      "experience": 4
    },
    {
      "skill": "Cardiology Informatics",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "Change Management",
      "experience": 3
    },
    {
      "skill": "Clinical Workflow Analysis",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide direct support to end users in utilizing IS Imaging Informatics applications and the electronic medical record as it relates to imaging."
    },
    {
      "duty": "Participate in building, testing, and validating new functionality, and engaging in custom configuration activities."
    },
    {
      "duty": "Perform in-depth analysis of workflows, data collection, report details, and technical issues associated with clinical applications."
    },
    {
      "duty": "Recognize opportunities for process improvement and optimization activities for creating more knowledgeable end users."
    },
    {
      "duty": "Collaborate with senior management to plan, implement, and evaluate the effectiveness of systems and services."
    },
    {
      "duty": "Facilitate the installation and implementation of hardware equipment between IT, patient care, and business process teams."
    },
    {
      "duty": "Prepare charts and diagrams to assist in problem analysis and submit recommendations for solutions."
    },
    {
      "duty": "Manage and co-ordinate team tasks and facilitate the maintenance of issue lists, documentation, meeting minutes, agendas, and weekly status reports to appropriate Leadership."
    },
    {
      "duty": "Achieve and maintain application specific certification in accordance with vendor requirements."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 70,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree or an Associate's Degree with equivalent experience required. Preferred certification: Certified Imaging Informatics Professional (CIIP). Project Management experience preferred."
    }
  ]
}