{
  "meta": [
    {
      "job_title": "Production Supervisor",
      "job_category": "Manufacturing",
      "job_class": "Supervisor",
      "sector": "Manufacturing",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for assigned department functions and all associated personnel."
    },
    {
      "duty": "Responsible to appropriately staff and schedule departmental personnel to ensure production requirements are met while minimizing costs."
    },
    {
      "duty": "Responsible for planning departmental operations by establishing priorities and sequences for manufacturing products."
    },
    {
      "duty": "Develops or revises standard operational and working practices and observes workers to ensure compliance with standards."
    },
    {
      "duty": "Observes and coaches personnel on work related issues."
    },
    {
      "duty": "Ensures plant staff (Leads) enforces Company policies and procedures, plant wide safety rules and employee rules of conduct."
    },
    {
      "duty": "Responsible for: developing people; improving processes; reducing costs; quality monitoring and improvements; superior customer service; and on-time delivery."
    },
    {
      "duty": "Incorporates company's vision and values into day-to-day activities and behaviors; guides and motivates others to remain committed to the company's philosophy."
    },
    {
      "duty": "Responsible for interviewing, hiring, training, terminating, disciplining, and coaching employees."
    },
    {
      "duty": "Able to motivate employees to achieve results. Must be an effective communicator, capable of teaching and generating results while enhancing the work environment and supporting the Company philosophy."
    },
    {
      "duty": "Participates in the Leadership Development Program (LDP) for the location."
    },
    {
      "duty": "Creates and executes objectives, meeting commitments and working within the guidelines; reflects business values and the company philosophy in all business interactions."
    },
    {
      "duty": "Adhere to safety policies and procedures related to all facets of job. Proper usage of personal protective equipment."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma. Some college preferred"
    }
  ],
  "skills": [
    {
      "skill": "Manufacturing Operations Management",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Team Management",
      "experience": 5
    },
    {
      "skill": "Process Improvement",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Employee Development",
      "experience": 5
    },
    {
      "skill": "Performance Management",
      "experience": 5
    }
  ]
}