{
  "meta": [
    {
      "job_title": "Content Strategist",
      "job_category": "Marketing",
      "job_class": "Specialist",
      "sector": "Marketing",
      "salary": 80000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Content Strategy",
      "experience": 5
    },
    {
      "skill": "Writing",
      "experience": 5
    },
    {
      "skill": "Editing & Proofreading",
      "experience": 5
    },
    {
      "skill": "SEO",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Analytical Skills",
      "experience": 5
    },
    {
      "skill": "Financial & Investment Concepts",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute a content strategy aligned with the brand's voice, objectives, and target audience."
    },
    {
      "duty": "Create high-quality, original content for various channels, ensuring accuracy, relevance, and adherence to brand guidelines."
    },
    {
      "duty": "Conduct in-depth research on industry trends and best practices to ensure content accuracy and engagement."
    },
    {
      "duty": "Collaborate with internal stakeholders, subject matter experts, and the marketing team to gather insights and information for content creation."
    },
    {
      "duty": "Edit and proofread content for clarity, grammar, style, and brand consistency."
    },
    {
      "duty": "Optimize content for SEO and monitor content performance to drive engagement and conversions."
    },
    {
      "duty": "Stay updated with industry news and developments to identify content opportunities and trends."
    },
    {
      "duty": "Ensure compliance with regulatory changes and guidelines in the financial industry."
    },
    {
      "duty": "Update and maintain website content using the CMS."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in journalism, communications, marketing, or a related field (Master's preferred). Portfolio showcasing a range of high-quality content pieces."
    }
  ]
}