{
  "meta": [
    {
      "job_title": "Construction Superintendent",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 85000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Safety Management",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Quality Control",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Contract Negotiation",
      "experience": 5
    },
    {
      "skill": "Construction Technology",
      "experience": 5
    },
    {
      "skill": "Lean Principles",
      "experience": 5
    },
    {
      "skill": "Risk Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead all aspects of the company’s safety culture and creates awareness by demonstrating commitment to an injury-free environment through individual actions and mentoring others."
    },
    {
      "duty": "Manage and oversee company staff, subcontractors, suppliers and programs such as Safety, Quality and EEOC for a small project or a major portion of a larger project."
    },
    {
      "duty": "Develop work plans for subcontractors and self-performed work. Coordinates and manages the care, custody and control of the project site."
    },
    {
      "duty": "Create, manage, change, and implement the project’s schedule as needed, in conjunction with the Project Manager. Responsible for tracking and monitoring project budget and costs."
    },
    {
      "duty": "Communicate key project information to owners, design team, governing authorities, subcontractors, suppliers and other departments. Participate in the negotiation process with the owner and architect to gain agreement for project changes."
    },
    {
      "duty": "Supervise pre-punch activities and coordinate activities with the owner, architect and governing authorities. Lead, support and promote a culture of diversity and inclusion within JE Dunn."
    },
    {
      "duty": "Manage fairly complex stand-alone projects from start to finish. Assumes responsibility for management, scheduling, production, safety and quality on their project or their portion of the project."
    },
    {
      "duty": "Identify, understand and actively manage project risks."
    },
    {
      "duty": "Utilize awareness, experience and knowledge to identify problems and recommend solutions for review and implementation by the team. Participate with project team in project pursuits. Participate in the negotiation process with the owner and architect to gain agreement for project changes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "High School Diploma or GED. Bachelor’s degree in construction management, engineering or related field (Preferred)"
    }
  ]
}