{
  "meta": [
    {
      "job_title": "Seed Program Manager",
      "job_category": "Horticulture",
      "job_class": "Manager",
      "sector": "Environment and Planning",
      "salary": 78000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Program Development",
      "experience": 5
    },
    {
      "skill": "Supervisory and Management",
      "experience": 5
    },
    {
      "skill": "Horticulture",
      "experience": 4
    },
    {
      "skill": "Botany",
      "experience": 4
    },
    {
      "skill": "Agriculture",
      "experience": 4
    },
    {
      "skill": "Wild Seed Collection",
      "experience": 4
    },
    {
      "skill": "Seed Banking",
      "experience": 4
    },
    {
      "skill": "Microsoft Word",
      "experience": 5
    },
    {
      "skill": "Microsoft Excel",
      "experience": 5
    },
    {
      "skill": "Microsoft Access",
      "experience": 5
    },
    {
      "skill": "Inventory Control",
      "experience": 5
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 5
    },
    {
      "skill": "Problem Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Flora Knowledge",
      "experience": 4
    },
    {
      "skill": "New York State Driver License",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead, manage, and develop three sections of the nursery’s seed program: wild seed collection, seed increase, and the seed bank."
    },
    {
      "duty": "Supervise and manage staff and workload of the wild seed collection team, seed increase program, and seed bank."
    },
    {
      "duty": "Promote a strong sense of purpose and shared vision, foster a collaborative and innovative work environment, and communicate with other managers to ensure smooth production flow."
    },
    {
      "duty": "Lead the strategic development of the seed program and seed products at the nursery through market research, analysis, and development of best practices."
    },
    {
      "duty": "Oversee all aspects of seed storage, including inventory management, logistics of distribution, seed bank maintenance, quality control, seed testing, and client relationships."
    },
    {
      "duty": "Ensure the proper functioning and maintenance of seed bank, seed lab, and seed cleaning equipment."
    },
    {
      "duty": "Participate in the annual purchasing process for nursery supplies and equipment relating to the seed team."
    },
    {
      "duty": "Supervise, train, instruct, and motivate full-time and seasonal staff, as well as volunteers, interns and alternative workforce employees assigned to the nursery."
    },
    {
      "duty": "Maintain accurate inventory of supplies relating to the seed team."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 50
    }
  ],
  "education_certification": [
    {
      "credential": "Baccalaureate degree in horticulture, arboriculture or landscape architecture with four years of horticultural work experience, two of which must have been in a supervisory, administrative, consultative, managerial, or executive capacity."
    },
    {
      "credential": "High school diploma or equivalent and one year of supervisory, administrative, consultative, managerial, or executive experience"
    }
  ]
}