{
  "meta": [
    {
      "job_title": "Enterprise Risk Manager",
      "job_category": "Risk Management",
      "job_class": "Manager",
      "sector": "Management",
      "salary": 135000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Drives organizational change through the development and implementation of the Enterprise Risk Management and Operational Risk Management frameworks."
    },
    {
      "duty": "Oversees metrics, data, and reporting that enhances the identification and management of risk."
    },
    {
      "duty": "Directs the effective monitoring and enhancement of frameworks through innovative tools or processes."
    },
    {
      "duty": "Responsible for administration of technology solutions as well as the Operational Risk Event, Third Party Risk Management, and Loss Monitoring programs."
    },
    {
      "duty": "Builds influential relationships with senior management and supports management or board committees."
    },
    {
      "duty": "Provides expert consultation on risk metrics, monitoring, reporting, and technology solutions in order to improve framework capabilities."
    },
    {
      "duty": "Develops collaborative partnerships with internal departments, external auditors, regulatory agencies, and other stakeholders to enhance cross-functional risk management capabilities."
    },
    {
      "duty": "Leads the planning, execution, and ongoing review of Enterprise and Operational Risk Management programs."
    },
    {
      "duty": "Oversees all associates and processes within the programs."
    },
    {
      "duty": "Directs monitoring activities for the identification and management of risk."
    },
    {
      "duty": "Drives the implementation of program policies, standards, and procedures."
    },
    {
      "duty": "Partners with key business stakeholders to ensure compliance with program requirements."
    },
    {
      "duty": "Provides risk expertise and support for business programs, initiatives, and committees."
    },
    {
      "duty": "Serves as an advisor on risk best practices, processes, and regulatory requirements."
    },
    {
      "duty": "Manages risk education and training through partnership with business units."
    },
    {
      "duty": "Develops active relationships within professional networks to stay current on emerging issues and regulatory requirements."
    },
    {
      "duty": "Communicates risk vision and regulatory requirements to business stakeholders."
    },
    {
      "duty": "Serves as a system administrator for department technology and risk management tools."
    },
    {
      "duty": "Establishes and monitors expectations to achieve company and department goals."
    },
    {
      "duty": "Makes appropriate changes to team policies, procedures, and efficiencies in order to meet objectives."
    },
    {
      "duty": "Manages the performance, training, and evaluation of assigned staff."
    },
    {
      "duty": "Develops and implements tools or processes which enhance risk reporting capabilities."
    },
    {
      "duty": "Oversees the documentation of risk metrics and data in order to provide reports for executive leadership."
    },
    {
      "duty": "Assists audits of Bank operations through partnership with both internal and external auditors."
    },
    {
      "duty": "Works closely with regulatory agencies and assists regulatory exams."
    },
    {
      "duty": "Ensures that all auditing or exam preparatory needs are met."
    }
  ],
  "skills": [
    {
      "skill": "Knowledge of operational and enterprise risk management including identification, assessment, and escalation of risk issues",
      "experience": 10
    },
    {
      "skill": "Ability to track and coordinate large, complex processes",
      "experience": 10
    },
    {
      "skill": "Knowledge of regulatory guidance pertaining to enterprise and operational risk as well as risk control frameworks",
      "experience": 10
    },
    {
      "skill": "PC Skills including Microsoft Visio, Excel, and PowerPoint",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 90,
      "student_teacher": 120,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Enterprise Risk or Operational Risk and Project Management or Consulting (internal or external)"
    }
  ]
}