{
  "meta": [
    {
      "job_title": "Warehouse Associate",
      "job_category": "Warehouse Operations",
      "job_class": "Associate",
      "sector": "Logistics",
      "salary": 35000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Maintains and processes shipments for the Club in accordance with Company policies and procedures by developing and posting delivery schedules; compiling and organizing receiving reports; verifying merchandise counts; routing merchandise to proper locations; and paying expenses."
    },
    {
      "duty": "Receives merchandise for the Facility, and organizes and maintains the Receiving area by following Company procedures, utilizing equipment appropriately; merchandising; and completing required documentation."
    },
    {
      "duty": "Tracks and processes claims by returning damaged goods; handling liquidation merchandise; maintaining and cleaning the clearance area; and utilizing technology to capture required reporting and documentation."
    },
    {
      "duty": "Maintains safety of facility by following all safety standards, procedures, and guidelines; conducting safety sweeps; following proper forklift spotting procedures; following proper procedures for handling and disposing of hazardous materials; following company steel standard guidelines; and correcting and/or reporting unsafe situations to facility management."
    },
    {
      "duty": "Complies with company policies, procedures, and standards of ethics and integrity by implementing related action plans; using the Open Door Policy; and applying these in executing business processes and practices."
    },
    {
      "duty": "Completes work assignments and priorities by using policies, data, and resources; collaborating with managers, co-workers, customers, and other business partners; identifying priorities, deadlines, and expectations; carrying out tasks; communicating progress and information; determining and recommending ways to address improvement opportunities; and adapting to and learning from change, difficulties, and feedback."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Forklift Certification OR will obtain a Forklift Certification within 30 days of job entry date."
    },
    {
      "credential": "Must be 18 years of age or older"
    }
  ]
}