{
  "meta": [
    {
      "job_title": "SLED Account Manager",
      "job_category": "Sales",
      "job_class": "Account Manager",
      "sector": "Sales",
      "salary": 110000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Strategy",
      "experience": 5
    },
    {
      "skill": "Account Management",
      "experience": 5
    },
    {
      "skill": "Customer Relationship Management",
      "experience": 5
    },
    {
      "skill": "Strategic Sales Planning",
      "experience": 5
    },
    {
      "skill": "Forecasting",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Stakeholder Engagement",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop strategic sales plans that incorporate account insight, extend resource engagement, and goals to grow sales and profitability."
    },
    {
      "duty": "Hunt for the win and engage customers in transformative business practices."
    },
    {
      "duty": "Collaborate and seek the right resources, answers, and solutions to suit the customers’ needs."
    },
    {
      "duty": "Understand the scope and sales process for data center, enterprise software sales & cloud services/solutions."
    },
    {
      "duty": "Committed to excellence in weekly, monthly, and quarterly forecast accuracy, pipeline development, and customer satisfaction."
    },
    {
      "duty": "Grow and maintain a pipeline of quota target and build strategies to drive cross-sell / up sell and new logo pursuit."
    },
    {
      "duty": "Engage in negotiation with peers, partners, and customers using a Win/Win philosophy."
    },
    {
      "duty": "Articulate and engage end-to-end solutions and articulate Cisco strategies to senior customer executives with ease."
    },
    {
      "duty": "Develop and execute comprehensive marketing strategies to enhance brand visibility and promote freight and logistics services."
    },
    {
      "duty": "Lead a team of marketing specialists, fostering collaboration and guiding their efforts towards achieving set goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine strategies."
    },
    {
      "duty": "Manage the company's online presence, optimizing the website and social media channels for maximum engagement and conversions."
    },
    {
      "duty": "Plan and oversee participation in industry events, conferences, and trade shows to showcase services and network with potential clients."
    },
    {
      "duty": "Measure and report on the performance of marketing campaigns, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS or equivalent"
    }
  ]
}