{
  "meta": [
    {
      "job_title": "Director of Franchise Sales",
      "job_category": "Sales",
      "job_class": "Director",
      "sector": "Sales",
      "salary": 150000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruiting",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Franchise Sales",
      "experience": 10
    },
    {
      "skill": "Negotiation",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "CRM Management",
      "experience": 10
    },
    {
      "skill": "Business Acumen",
      "experience": 10
    },
    {
      "skill": "Team Leadership",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Contribute to all recruitment initiatives for Potbelly franchisees, including working with marketing department and ad agencies to design and implement recruitment campaigns."
    },
    {
      "duty": "Participate in various departments within the organization to ensure proper onboarding of new franchisee candidates."
    },
    {
      "duty": "Represent Potbelly at industry trade shows, seminars, social events, webinars, networking sessions, speaking engagements, etc."
    },
    {
      "duty": "Take the initial point on all franchisee leads and provide weekly pipeline reports to senior leadership."
    },
    {
      "duty": "Utilize CRM platform (FranConnect) to ensure proper documentation throughout the candidate qualification & onboarding process."
    },
    {
      "duty": "Conduct all in-person meetings, coordinate 'Discovery Day' activities, and provide guidance to franchisee candidates in the completion of business and marketing plans."
    },
    {
      "duty": "Lead franchisee candidates through the proper execution of all required documents and design and implement effective outreach campaigns to the franchise community."
    },
    {
      "duty": "Manage the franchise sales process to achieve quarterly and annual quotas and perform other related tasks as reasonably requested."
    },
    {
      "duty": "Analysis of specific selection and business challenges, and offer solutions based on best practices and business knowledge."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred"
    }
  ]
}