{
  "meta": [
    {
      "job_title": "Program Officer for Staff Professional Conduct",
      "job_category": "HR",
      "job_class": "Officer",
      "sector": "General Administration",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Internal Investigations",
      "experience": 7
    },
    {
      "skill": "HR Policies and Practices",
      "experience": 7
    },
    {
      "skill": "Training and Presentation",
      "experience": 7
    },
    {
      "skill": "Employment Law",
      "experience": 7
    },
    {
      "skill": "Conflict Management",
      "experience": 7
    },
    {
      "skill": "Communication",
      "experience": 7
    },
    {
      "skill": "Interpersonal Skills",
      "experience": 7
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Support the administration and implementation of policies related to professional conduct, responding to allegations and complaints of discrimination, bullying, harassment, and retaliation."
    },
    {
      "duty": "Conduct informal fact-finding and formal complaint investigations, in coordination with the central office."
    },
    {
      "duty": "Partner with school and university offices to promote relevant resources, policy training, and educational efforts focused on preventive measures."
    },
    {
      "duty": "Develop and implement new University policies and procedures for Non-Discrimination and Anti-Bullying in conjunction with internal partners and the Central Office."
    },
    {
      "duty": "Consult with internal HR partners and the University Office of General Counsel in responding to complaints and concerns raised internally and/or externally."
    },
    {
      "duty": "Conduct formal investigations and perform related duties such as case evaluation, processing administrative closures, conducting party and witness interviews, identifying evidence, communicating with parties, and issuing final written reports."
    },
    {
      "duty": "Process and manage informal resolution requests, perform necessary duties, and manage documentation."
    },
    {
      "duty": "Assist in providing interim and supportive measures to community members, as necessary."
    },
    {
      "duty": "Build upon and manage internal complaint processes, including documenting the internal investigative process; informal resolution steps; communication templates with parties, department units, and internal partners; data collection, recordkeeping, trend analysis, and methods for community outreach."
    },
    {
      "duty": "Collaborate with internal HR partners in the recommendation of local, university, and outside educational programming related to professional conduct to mitigate escalated conflict."
    },
    {
      "duty": "Develop and conduct University policy outreach, planning, and overseeing trainings."
    },
    {
      "duty": "Partnership with other offices, schools, and units to develop an effective and sustainable education program on relevant policies, procedures, and best practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 120,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree and equivalent work experience required, advanced degree (science or law) strongly preferred."
    }
  ]
}