{
  "meta": [
    {
      "job_title": "Dispute Operations Lead",
      "job_category": "Operations",
      "job_class": "Lead",
      "sector": "Financial Services",
      "salary": 106000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "People Management",
      "experience": 5
    },
    {
      "skill": "Payments Management",
      "experience": 3
    },
    {
      "skill": "Fraud Management",
      "experience": 3
    },
    {
      "skill": "SQL",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Time Management",
      "experience": 5
    },
    {
      "skill": "Customer Experience",
      "experience": 5
    },
    {
      "skill": "Communication",
      "experience": 5
    },
    {
      "skill": "Cross-functional Communication",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead and manage the dispute operations team, ensuring efficient handling of cases and providing excellent service to Square sellers and partners."
    },
    {
      "duty": "Conduct performance evaluations, QAs, and provide coaching and mentoring for team members' professional development."
    },
    {
      "duty": "Administer chargeback case queues to maximize system efficiency."
    },
    {
      "duty": "Stay updated on industry regulations, card network rules, and best practices for compliance."
    },
    {
      "duty": "Serve as the main point of contact for chargeback-related inquiries, escalations, and complaints, resolving issues promptly."
    },
    {
      "duty": "Continuously assess and improve workflows, adhere to SLAs, monitor and manage team KPIs, and achieve high customer satisfaction."
    },
    {
      "duty": "Evaluate department processes, performance, and systems to drive improvements."
    },
    {
      "duty": "Analyze data to recommend efficiency enhancements in the chargeback process."
    },
    {
      "duty": "Monitor chargeback case volumes and proactively identify staffing needs."
    },
    {
      "duty": "Manage recruiting efforts and coordinate training for new hires and current teams."
    },
    {
      "duty": "Build relationships and partner with the rest of the Risk Operations organization and cross-functional partners."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum 2 years of leadership and people management experience with a proven track record of high performanceMinimum 3 years of experience in payments, chargeback management and fraud management"
    }
  ]
}