{
  "meta": [
    {
      "job_title": "Sales Development Representative Manager",
      "job_category": "Sales",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Sales Development",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Prospecting Techniques",
      "experience": 5
    },
    {
      "skill": "Sales Tools and Technologies",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "Verbal Communication",
      "experience": 5
    },
    {
      "skill": "Written Communication",
      "experience": 5
    },
    {
      "skill": "Lead Generation",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead, coach, and motivate a team of Sales Development Representatives (SDRs) to achieve individual and team targets."
    },
    {
      "duty": "Provide ongoing training and mentorship to SDRs on effective prospecting techniques, including video, email, text, LinkedIn, and cold-calling strategies."
    },
    {
      "duty": "Assist in the development and implementation of a successful and scalable prospecting process."
    },
    {
      "duty": "Monitor SDR activities, such as calls, emails, texts, meetings booked/attended, and successful campaigns to ensure adherence to established goals and standards."
    },
    {
      "duty": "Collaborate with the VP of Sales to optimize lead generation strategies and improve the overall prospecting effectiveness."
    },
    {
      "duty": "Work closely with other departments, such as marketing and sales, to align efforts and improve lead quality and conversion rates."
    },
    {
      "duty": "Analyze data and generate reports on pipeline progression and revenue generation."
    },
    {
      "duty": "Identify areas for process improvement and implement solutions to enhance team efficiency and productivity."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree or a four-year BA or BS is required."
    },
    {
      "credential": "Exceptional prospecting and lead generation skills with a hunter's mentality."
    },
    {
      "credential": "Resilient and capable of learning from failures and adapting strategies accordingly."
    },
    {
      "credential": "Competitive nature with a strong drive to excel individually and lead a high-performing team."
    },
    {
      "credential": "High energy and enthusiasm, maintaining a positive attitude throughout the day."
    },
    {
      "credential": "Proficiency in sales tools and technologies, such as Apollo, Hippo Video, G-Suite, Hubspot, and VOIP systems."
    }
  ]
}