{
  "meta": [
    {
      "job_title": "Communications Director",
      "job_category": "Communications",
      "job_class": "Director",
      "sector": "Healthcare",
      "salary": 130000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Raise awareness of the company’s purpose, global strategic priorities and focus on helping create a healthier world."
    },
    {
      "duty": "Educate, engage, align, and motivate team members to achieve the strategic priorities of Clinical Operations North America, to serve customers and patients and drive profitable growth."
    },
    {
      "duty": "Plan and execute an industry key influencer focused social media program for the VP/GM, Clinical Operations, North America and the COLT. This includes platform strategy, editorial calendar planning, content creation and publication, monitoring, metrics, and routine reports."
    },
    {
      "duty": "Serve and support the internal communication needs of the COLT and strategic partners (marketing, medical and regulatory affairs, human resources, etc.)."
    },
    {
      "duty": "Drive brand stewardship through education and standards compliance."
    },
    {
      "duty": "Provide support for major projects, programs, and initiatives within the business, such as annual and regional sales meetings, product launches, trade shows and other customer and patient-focused events."
    },
    {
      "duty": "Contribute to the development and deployment of a comprehensive, regional communications strategy, as a member of the Corporate Communications North America team."
    }
  ],
  "skills": [
    {
      "skill": "Communication Strategy",
      "experience": 8
    },
    {
      "skill": "Team Motivation",
      "experience": 8
    },
    {
      "skill": "Social Media Management",
      "experience": 8
    },
    {
      "skill": "Internal Communication Support",
      "experience": 8
    },
    {
      "skill": "Brand Management",
      "experience": 8
    },
    {
      "skill": "Project Support",
      "experience": 8
    },
    {
      "skill": "Strategic Planning",
      "experience": 8
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Master’s or Bachelor's degree in communications, public relations, or journalism from an accredited institution."
    }
  ]
}