{
  "meta": [
    {
      "job_title": "Retail Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Leads and develops teams effectively by teaching, training, and actively listening to associates; touring stores and providing feedback (Tour-to-Teach); communicating and collaborating with all levels of associates regarding store operations, utilizing technology, business initiatives, merchandising, and company direction; introducing and leading company change efforts; providing clear expectations and guidance to implement business solutions; and communicating business objectives to teams effectively."
    },
    {
      "duty": "Models and demonstrates exceptional customer service standards to store associates by following and demonstrating the One Best Way (OBW) service model; managing and supporting customer service initiatives (for example, store of the community and community outreach programs); ensuring customer needs, complaints, and issues are successfully resolved; developing and implementing action plans to correct deficiencies; and providing process improvement leadership to ensure a high-quality customer experience."
    },
    {
      "duty": "Drives the financial performance and sales of the designated store area by reviewing and evaluating P&L (Profit & Loss) statements; managing and assisting in budgeting, forecasting and controlling expenses in designated business area to confirm they are indexed to sales; monitoring and ensuring effective merchandise presentation, seasonal transitions, inventory flow, and operational processes; and developing and implementing action plans to mitigate shrink and ensure sales and profit goals are achieved for business area."
    },
    {
      "duty": "Provides supervision and development opportunities for hourly associates by hiring, training, and mentoring of associates; assigning duties; setting clear expectations; providing associate recognition; communicating expectations consistently and effectively; ensuring diversity and inclusion awareness; and recruiting and developing qualified associates to meet staffing needs and achieve company growth potential."
    },
    {
      "duty": "Coordinates, completes, and oversees job-related activities and assignments by developing and maintaining relationships with key stakeholders; supporting plans and initiatives to meet customer and business needs; identifying and communicating goals and objectives; building accountability for and measuring progress in achieving results; identifying and addressing improvement opportunities; and demonstrating adaptability and promoting continuous learning."
    },
    {
      "duty": "Provides supervision and development opportunities for associates by hiring and training; mentoring; assigning duties; providing recognition; and ensuring diversity awareness."
    },
    {
      "duty": "Ensures compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity by implementing related action plans; utilizing and supporting the Open Door Policy; and providing direction and guidance on applying these in executing business processes and practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "2 years of college; OR 1 year's retail experience and 1 year's supervisory experience; OR 2 years' general work experience and 1 year's supervisory experience."
    }
  ]
}