{
  "meta": [
    {
      "job_title": "Staff/Registered Nurse",
      "job_category": "Healthcare",
      "job_class": "Nurse",
      "sector": "Healthcare",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Patient Care",
      "experience": 5
    },
    {
      "skill": "Nursing Diagnosis",
      "experience": 5
    },
    {
      "skill": "Medication Administration",
      "experience": 5
    },
    {
      "skill": "Electronic Medical Records",
      "experience": 5
    },
    {
      "skill": "Interpersonal Communication",
      "experience": 5
    },
    {
      "skill": "Clinical Supervision",
      "experience": 5
    },
    {
      "skill": "Emergency Response",
      "experience": 5
    },
    {
      "skill": "Patient Advocacy",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Prioritize and organize the daily care of patients."
    },
    {
      "duty": "Make patient care assignments and assist in developing treatment plans in collaboration with other clinical staff."
    },
    {
      "duty": "Provide ongoing assessment and documentation of the patients' physical and psychosocial status from admission to discharge."
    },
    {
      "duty": "Direct support staff to coordinate the workflow on the unit and communicate problems to unit supervisors."
    },
    {
      "duty": "Administer medications and treatments according to facility's policies and procedures."
    },
    {
      "duty": "Develop and implement nursing care plans for nursing diagnosis or treatment plan changes."
    },
    {
      "duty": "Complete medication administration supervision monitors and clinical observation notes for support staff."
    },
    {
      "duty": "Completes required documentation of nursing notes, transfer forms and other records."
    },
    {
      "duty": "Educate patients and family members regarding medication, procedures, and treatment goals and objectives."
    },
    {
      "duty": "Respond and intervene to emergency situations and agitated patients."
    },
    {
      "duty": "Provide orientation and support to staff to the unit."
    },
    {
      "duty": "Responsible for ensuring the proper safety and infection control standards are met for the unit."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree in Nursing from an accredited college."
    },
    {
      "credential": "License to practice nursing in the State of Indiana as a Registered Nurse."
    },
    {
      "credential": "CPR certification."
    },
    {
      "credential": "Proficiency in computer skills and ability to learn other programs used in maintaining electronic medical records."
    },
    {
      "credential": "Good interpersonal skills, good verbal, and written communication skills."
    },
    {
      "credential": "Ability to understand and apply medical and facility terminology."
    },
    {
      "credential": "Ability to use MS Office applications and electronic patient records."
    },
    {
      "credential": "Ability to serve as a patient advocate."
    },
    {
      "credential": "Knowledge of and the ability to interpret nursing and facility policies and procedures."
    },
    {
      "credential": "Additional knowledge and/or ability may be required based on the population the facility serves such as: children, adolescents, geriatrics, etc."
    }
  ]
}