{
  "meta": [
    {
      "job_title": "Dealer Sales Representative - Residential",
      "job_category": "Sales",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 65100,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Meet with current and prospective customers to build relationships, demonstrate and explain product features and benefits, present new retail program offerings, provide samples, and procure orders. Provide \n“No Equal” customer support to resolve problems, provide ongoing support and training as needed."
    },
    {
      "duty": "Build, maintain and reset customer product displays as needed, including literature and signage."
    },
    {
      "duty": "Support territory initiatives to ensure that all efforts are in alignment and support of company, branch, and territory goals. Support builder and dealer partners by reviewing processes and products on residential jobsites, analyzing industry and market needs and developing appropriate strategies."
    },
    {
      "duty": "Promote Simpson Strong-Tie as an industry partner and potential employer; participate in trade shows, association meetings and various committees and/or causes; provide educational opportunities in classroom settings throughout your territory to various audiences which could include suppliers, specifiers, building officials, contractors, and homeowners."
    },
    {
      "duty": "Other duties and responsibilities, including but not limited to, consistent CRM management and usage, scheduling, business planning, submitting expense reports in a timely manner, regular maintenance of company-owned vehicles, and other responsibilities as directed by your manager."
    }
  ],
  "skills": [
    {
      "skill": "Sales",
      "experience": 2
    },
    {
      "skill": "Customer Support",
      "experience": 3
    },
    {
      "skill": "Territory Management",
      "experience": 4
    },
    {
      "skill": "Product Presentation",
      "experience": 3
    },
    {
      "skill": "Trade Show Participation",
      "experience": 3
    },
    {
      "skill": "Business Planning",
      "experience": 3
    },
    {
      "skill": "CRM Management",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree preferred.1-2 years of industry experience and/or training. Working knowledge of residential construction practices and distribution channels preferred. Sales and account management experience with a proven track record of sales/profit growth preferred."
    }
  ]
}