{
  "meta": [
    {
      "job_title": "Buyer",
      "job_category": "Purchasing",
      "job_class": "Entry",
      "sector": "Supply Chain",
      "salary": 45500,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Purchasing",
      "experience": 2
    },
    {
      "skill": "Supply Chain Management",
      "experience": 3
    },
    {
      "skill": "Negotiation",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Analytical Skills",
      "experience": 3
    },
    {
      "skill": "MS Office",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Locate vendors of materials, equipment or supplies, and lead price negotiations, terms and conditions with vendors and suppliers."
    },
    {
      "duty": "Analyze market and delivery systems to assess present and future material availability."
    },
    {
      "duty": "Support initiatives on lead time reduction, supplier rationalization, material cost reduction, improved payment terms, quality, and delivery; prepare report on supplier performance and market conditions."
    },
    {
      "duty": "Maintain the Approved Supplier List, including surveying of suppliers as required."
    },
    {
      "duty": "Initiate and conduct searches for new and alternate vendors/suppliers."
    },
    {
      "duty": "Process daily requests for quote for multiple projects."
    },
    {
      "duty": "Place regular daily purchase orders with vendors."
    },
    {
      "duty": "Evaluate and analyze purchasing and price trends along to identify forecasting demand and minimize purchasing costs."
    },
    {
      "duty": "Review Purchase Order (PO) confirmations from vendors for quantity and pricing accuracy."
    },
    {
      "duty": "Track PO progress to make sure orders are filled and delivered correctly by monitoring open order reports, lead times, estimated ship dates and delays."
    },
    {
      "duty": "Liaise with Loyal Source staff to ensure all products arrive in good condition, and relay shipping delays to site."
    },
    {
      "duty": "Maintain an awareness of market developments and conditions, keeping appropriate departments informed."
    },
    {
      "duty": "Execute signature authority on purchase requisitions and purchase orders, covering materials and services."
    },
    {
      "duty": "Perform other duties and manage special projects as assigned by the Purchasing Manager."
    },
    {
      "duty": "Be innovative in the fast-paced course of day-to-day business, through negotiations and/or competition, to reduce the cost of materials consumed, while maintaining excellent quality and reliability."
    },
    {
      "duty": "Maintain updated records of invoices and contracts."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 85,
      "student_teacher": 20,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Associate degree (Bachelor’s Degree in supply chain or a related field is a plus)"
    }
  ]
}