{
  "meta": [
    {
      "job_title": "Civil Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Engineering",
      "salary": 124480,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Civil Engineering",
      "experience": 4
    },
    {
      "skill": "Project Management",
      "experience": 4
    },
    {
      "skill": "PE License",
      "experience": 4
    },
    {
      "skill": "Design",
      "experience": 4
    },
    {
      "skill": "Construction Management",
      "experience": 4
    },
    {
      "skill": "Building Codes",
      "experience": 4
    },
    {
      "skill": "Multi-discipline Project Management",
      "experience": 4
    },
    {
      "skill": "Matrix Organization",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead the design of individual projects including scope development, schedule, budget, plans, and both prescriptive and performance specifications."
    },
    {
      "duty": "Perform on-site requirements gathering and scope definition assessments as part of design phase initiation."
    },
    {
      "duty": "Create and lead capital program projects designs to support new initiatives, energy conservation, and state of good repair."
    },
    {
      "duty": "Lead the review of multi-discipline architectural and engineering designs prepared by outside agencies, for projects to be constructed on company property, to ensure compliance with industry standards."
    },
    {
      "duty": "Provide technical support to companies field staff as a Civil Subject Matter Expert."
    },
    {
      "duty": "Provide technical support during construction and respond to submittals, shop drawings, RFI's, and change order requests and/or coordinate with and manage associated Construction Phase Services."
    },
    {
      "duty": "Self-perform design services on small design projects with limited oversight."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's Degree in Engineering (Civil Engineering), Master's Preferred, PE License within PA or surrounding state, or ability to obtain Professional Engineering License within 3 years"
    }
  ]
}