{
  "meta": [
    {
      "job_title": "Construction Project Engineer",
      "job_category": "Engineering",
      "job_class": "Project Engineer",
      "sector": "Engineering",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Project Planning",
      "experience": 9
    },
    {
      "skill": "Construction Oversight",
      "experience": 8
    },
    {
      "skill": "Procurement",
      "experience": 7
    },
    {
      "skill": "Engineering Design Review",
      "experience": 9
    },
    {
      "skill": "Safety Culture Promotion",
      "experience": 8
    },
    {
      "skill": "Technical Writing",
      "experience": 9
    },
    {
      "skill": "Project Management",
      "experience": 9
    },
    {
      "skill": "Critical Thinking",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Engage with multi-disciplinary teams to support all aspects of technical project execution including project planning, estimate preparation, proposal development, and schedule development for assigned projects."
    },
    {
      "duty": "Coordinate with internal stakeholders and other functional departments and personnel to establish and maintain priorities, ensuring project success."
    },
    {
      "duty": "Participate in construction support activities including construction oversight, shop drawing review, submittal review, pay estimate review, change order review, RFI responses, site visits, field observation and startup and commissioning."
    },
    {
      "duty": "Assist efforts with Procurement during the Bid Phase to select contractors who complete specific portions of the project."
    },
    {
      "duty": "Track and update the integrated project schedule."
    },
    {
      "duty": "Support resolution of technical issues by identifying critical work activities, tracking long-lead items, and visiting jobsite."
    },
    {
      "duty": "Manage project logs and ensure contractors submit all required construction records, as-builts drawings and operation and maintenance manuals in accordance with project requirements."
    },
    {
      "duty": "Support change order preparation, invoicing, and progress reports, as requested."
    },
    {
      "duty": "Lead project meetings and effectively communicate engineering solutions both verbally and in writing to internal and external stakeholder management."
    },
    {
      "duty": "Conduct field verifications of construction work to verify contractors conform to project requirements."
    },
    {
      "duty": "Lead closeout activities."
    },
    {
      "duty": "Promote a culture of safety and participate in continuous improvement initiatives."
    },
    {
      "duty": "Perform other duties as assigned by manager."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 140,
      "student_teacher": 110,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree in engineering or related field is required; Professional licensure or certification is preferred."
    }
  ]
}