{
  "meta": [
    {
      "job_title": "Office Coordinator",
      "job_category": "Administration",
      "job_class": "Coordinator",
      "sector": "Administration",
      "remote": false,
      "salary": 55000
    }
  ],
  "skills": [
    {
      "skill": "Administrative Support",
      "experience": 3
    },
    {
      "skill": "Microsoft Office Suite",
      "experience": 3
    },
    {
      "skill": "Event Planning",
      "experience": 2
    },
    {
      "skill": "Budget Management",
      "experience": 2
    },
    {
      "skill": "Vendor Management",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 4
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide administrative support for executives and managers."
    },
    {
      "duty": "Manage CEO’s calendar and prepare meeting notes."
    },
    {
      "duty": "Reconcile credit card statements and prepare reconciliation spreadsheets."
    },
    {
      "duty": "Assist event planner with planning and coordinating office, company, and corporate related events."
    },
    {
      "duty": "Budget and manage all facility purchases, including office supplies."
    },
    {
      "duty": "Prepare reports and presentations, update existing company documents."
    },
    {
      "duty": "Answer main phone line, transfer calls, and take messages."
    },
    {
      "duty": "Coordinate with HR Manager to send employee welcome e-mails, take employee photos, and put together new hire swag bags."
    },
    {
      "duty": "Run errands such as picking up lunch, dropping off proposals, and shopping for office essentials."
    },
    {
      "duty": "Receive and distribute mail/parcels, prepare and send multiple bulk mailings, UPS packages, etc."
    },
    {
      "duty": "Maintain relationships with and coordinate multiple professional organization and sponsorship renewals."
    },
    {
      "duty": "Assist Security Manager with enforcing security measures and maintaining secure entry and visitor logs."
    },
    {
      "duty": "Act as a point of contact for all general office inquiries, facilities, supplies, moves, etc."
    },
    {
      "duty": "Perform other duties as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 100,
      "introvert_extrovert": 140
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business Administration or related field (Preferable)"
    }
  ]
}