{
  "meta": [
    {
      "job_title": "Food Service Director/Chef",
      "job_category": "Culinary",
      "job_class": "Director",
      "sector": "Food Service",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Food Service Management",
      "experience": 3
    },
    {
      "skill": "Client Relationship Management",
      "experience": 3
    },
    {
      "skill": "Budget Management",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Microsoft Word and Excel",
      "experience": 3
    },
    {
      "skill": "National School Lunch Program Experience",
      "experience": 3
    },
    {
      "skill": "Culinary Arts",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Serve as the main communicator and day-to-day client contact, fostering positive client relationships and ensuring excellence in service and quality of products."
    },
    {
      "duty": "Plan, organize and direct the work of team members engaged in the procurement, storage, preparation, and serving of food for this multi-operation location."
    },
    {
      "duty": "Provide leadership, support, and guidance to ensure that food quality standards, inventory levels, food safety guidelines, and customer service expectations are met."
    },
    {
      "duty": "Prepare and maintain budgets including purchasing and staffing expenditures."
    },
    {
      "duty": "Approve food orders and ensure a proper level of inventory to meet demand and minimize cost and waste."
    },
    {
      "duty": "Routinely monitor budget compliance and recommend changes as needed to maintain operational quality."
    },
    {
      "duty": "Take part in interviewing, selecting, managing, and developing team members."
    },
    {
      "duty": "Lead, conduct and participate in meetings/presentations; provide leadership and direction for timely decisions."
    },
    {
      "duty": "Foster an atmosphere of teamwork and encourage team members to collaborate."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 90,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "3 or more years of food service management experience"
    },
    {
      "credential": "A background as a chef or trained in culinary arts"
    }
  ]
}