{
  "meta": [
    {
      "job_title": "Research Team Leader",
      "job_category": "Research",
      "job_class": "Leader",
      "sector": "Research",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Team Leadership",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Research Planning",
      "experience": 5
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 5
    },
    {
      "skill": "Metallurgical Research",
      "experience": 5
    },
    {
      "skill": "Finite Element Analysis (FEA)",
      "experience": 5
    },
    {
      "skill": "Compliance Management",
      "experience": 5
    },
    {
      "skill": "Information Protection",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead research teams to realize research goals with broad technical impact."
    },
    {
      "duty": "Reach milestones and produce deliverables for technical projects."
    },
    {
      "duty": "Secure funding for self and technical project teams in a competitive funding environment."
    },
    {
      "duty": "Contribute to technical reports and archival publications with excellent verbal and written communication."
    },
    {
      "duty": "Interact with internal and external customers and management."
    },
    {
      "duty": "Hands-on experience with deep drawing, forging, rolling, wire drawing & swaging, and/or heat treating of metals and alloys and/or other fabrication techniques."
    },
    {
      "duty": "Perform Finite Element Analysis (FEA) of manufacturing systems or modeling of metallurgical phenomena."
    },
    {
      "duty": "Manage security and energy-related research projects where compliance and information protection are required."
    },
    {
      "duty": "Obtain a DOE \"Q\" security clearance, which usually requires US citizenship."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Master's Degree in Engineering from an accredited institution in the areas of mechanical, electrical, metallurgical, materials engineering, mechanical engineering technology, or a related field and 6 years of related experience; or, an equivalent combination of education and experience directly related to the occupation. Ph.D. preferred."
    }
  ]
}