{
  "meta": [
    {
      "job_title": "Events Specialist",
      "job_category": "Marketing",
      "job_class": "Specialist",
      "sector": "Marketing",
      "salary": 65000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Event Planning",
      "experience": 3
    },
    {
      "skill": "Project Coordination",
      "experience": 3
    },
    {
      "skill": "Marketing",
      "experience": 3
    },
    {
      "skill": "Communication Skills",
      "experience": 3
    },
    {
      "skill": "Negotiation",
      "experience": 3
    },
    {
      "skill": "Team Collaboration",
      "experience": 3
    },
    {
      "skill": "Budget Management",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Collaborate with internal and external teams to understand event objectives, develop event concepts, and create detailed event plans and timelines."
    },
    {
      "duty": "Partner with the Marketing Team Lead and help develop event budgets, monitor expenses, and negotiate contracts with venues, vendors, and suppliers to optimize costs without compromising quality."
    },
    {
      "duty": "Coordinate with Marketing stakeholders to understand the promotional materials needed leading up to each event."
    },
    {
      "duty": "Oversee all aspects of event execution, including setup and breakdown, AV requirements, signage, attendee check-in, and on-site problem solving."
    },
    {
      "duty": "Create event programs, agendas, and supporting documents and collaborate with speakers, panelists, and presenters to ensure they have the necessary resources and information."
    },
    {
      "duty": "Headline 2 large-scale event projects, 10 small-scale event projects, and additional events for HQ team members celebrations."
    },
    {
      "duty": "Provide updates to leadership teams on the progress and needs of upcoming events."
    },
    {
      "duty": "Conduct post-event evaluations to assess event success and gather feedback for continuous improvement."
    },
    {
      "duty": "Coordinate with external/internal parties, research phase, logistics planning, execution, day-of coordination for events."
    },
    {
      "duty": "Cultivate strong relationships with vendors, sponsors, and other event partners. Coordinate their involvement, manage expectations, and ensure deliverables are met."
    },
    {
      "duty": "Prepare detailed reports summarizing key metrics, budget adherence, attendee satisfaction, and lessons learned."
    },
    {
      "duty": "Attend industry conferences, trade shows, and networking events to expand professional knowledge and build relationships."
    },
    {
      "duty": "Support virtual events by sourcing speakers, ideating content, and planning logistics."
    },
    {
      "duty": "Proactively discover, plan, and strategize future UMortgage events, in collaboration with relevant stakeholders. Additional responsibilities related to business needs."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 160,
      "student_teacher": 50,
      "introvert_extrovert": 60
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in communications, marketing or tourism, hospitality is a plus (Master's preferred)"
    }
  ]
}