{
  "meta": [
    {
      "job_title": "Research Projects Manager",
      "job_category": "Administration",
      "job_class": "Manager",
      "sector": "Higher Education",
      "salary": 80000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage ICT’s IDOT sponsored research process of over 50 active projects, including workplan and budget reviews submitted by researchers, outsourcing to industry and university partners, requests for University accounts to ensure compliance with the research objectives, and act as a liaison between IDOT Technical Advisory Groups and Technical Review Panels as needed."
    },
    {
      "duty": "Lead Project Management team members to maintain program excellence, meet and exceed operational goals, and fulfill all requirements of the ICT grant agreement."
    },
    {
      "duty": "Assist Assistant Director for Finance and Administration with program and/or project financial administration; including budget analyses, financial status reports, requests for subaward contracts and university accounts."
    },
    {
      "duty": "Develop procedures and controls related to ICT financials issues and carefully monitor accounts to track income and expenditures."
    },
    {
      "duty": "Monitor and coordinate the activities of assigned project TRPs, including participation in technical meetings and preparing and disseminating discussion summaries."
    },
    {
      "duty": "Report program progress, including research projects, to IDOT and the Director of ICT monthly."
    },
    {
      "duty": "Develop requests for proposals based on TAG recommendations and assist with creation of project work plans and budgets as needed, with input from TRPs."
    },
    {
      "duty": "Assist in preparing tables, charts and progress reports for the quarterly ICT newsletter, the annual report, ICT Executive Committee meetings and other presentations."
    },
    {
      "duty": "Handle a variety of sensitive and confidential assignments and projects."
    },
    {
      "duty": "Travel as needed to attend meetings within the State of Illinois to perform the duties of this position."
    },
    {
      "duty": "Lead the subaward invoice review and monthly financial statement analysis and tie-out for ICT/IDOT awards."
    },
    {
      "duty": "Develop monthly reports for review by ICT management to evaluate project performance as well as the long- term performance of ICT individual research projects."
    },
    {
      "duty": "Direct and maintain the implementation of project management software and develop tools to ensure accurate and consistent project data and financial reporting."
    },
    {
      "duty": "Assume additional appropriate related research project coordinator duties to further the mission of the Center."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 50,
      "student_teacher": 70,
      "introvert_extrovert": 40
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in business administration, accounting, or a field related to the position (Master's in Business Administration preferred)"
    }
  ]
}