{
  "meta": [
    {
      "job_title": "Platform Cloud and Data Infrastructure Architect (Principal Engineer)",
      "job_category": "Software Engineering",
      "job_class": "Architect",
      "sector": "Software Engineering",
      "salary": 165000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Cyber Security",
      "experience": 10
    },
    {
      "skill": "Data Platform Design",
      "experience": 5
    },
    {
      "skill": "Cloud Platforms",
      "experience": 5
    },
    {
      "skill": "Data Governance",
      "experience": 5
    },
    {
      "skill": "Security Infrastructure",
      "experience": 5
    },
    {
      "skill": "Software Engineering",
      "experience": 5
    },
    {
      "skill": "Cloud Technologies",
      "experience": 5
    },
    {
      "skill": "Customer Data Security",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Design and implement large-scale data platforms and infrastructure for the Cisco Security Cloud services."
    },
    {
      "duty": "Architect and maintain secure, highly resilient, and highly available cloud infrastructures to host Cisco Security products."
    },
    {
      "duty": "Develop and operate similar global scale infrastructures distributed across various cloud providers and Cisco private data centers/PoPs."
    },
    {
      "duty": "Provide expertise in modern cloud platforms such as AWS, Azure, and GCP, as well as current cloud-based data platforms."
    },
    {
      "duty": "Solve cloud infrastructure challenges through innovative software engineering approaches and ensure secure-by-default infrastructure."
    },
    {
      "duty": "Collaborate with application development teams in designing cloud infrastructure and writing infrastructure-as-code."
    },
    {
      "duty": "Lead and encourage teams in a highly matrixed organization, prioritizing cross-team projects and raising the code quality of the team."
    },
    {
      "duty": "Drive the architecture of an extensive infrastructure as a senior architect, solving challenges in high-performant, cost-efficient, and secure cloud infrastructure."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s or Master’s degree or equivalent in Computer Science or related field"
    }
  ]
}