{
  "meta": [
    {
      "job_title": "Athletic Director",
      "job_category": "Sports",
      "job_class": "Director",
      "sector": "Sports",
      "salary": 75000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Recruit students and student-athletes as required"
    },
    {
      "duty": "Develop and execute recruiting plans including determining which schools/showcases/recruiting events to visit, which student-athletes to recruit and scholarship dollars to offer."
    },
    {
      "duty": "Coordinate with the Lourdes Community recruiting efforts and admissions process for new students."
    },
    {
      "duty": "Responsible for the ongoing teaching and instruction of student-athletes in the performance of their sport such as but not limited to: games, practices, individual and team workouts, and conditioning sessions."
    },
    {
      "duty": "Support the mission and values of Lourdes and respects its Franciscan Values and tradition such as community service projects."
    },
    {
      "duty": "Monitor the academic development of the student-athlete by functioning as an informal academic advisor who assists with academic problems, facilitates tutors, and oversees academic study sessions."
    },
    {
      "duty": "Remains accessible to the media, alumni, boosters, and general public to publicize and promote the athletic department in a positive manner."
    },
    {
      "duty": "Coordinate and foster relationships with local vendors and/or university partnerships support the efforts of the team."
    },
    {
      "duty": "Knowledgeable and competent with NAIA, WHAC, and any other governing body association for rules/regulations as it relates to the sport."
    },
    {
      "duty": "Prepares schedules for practices, competition, coordinates team travel within the policies and guidelines of the university and athletic department."
    },
    {
      "duty": "Responsible for all the aspects related to team budget."
    },
    {
      "duty": "Hires and supervises an assistant coach, graduate assistant, and other staff, while ensuring their compliance with the University Mission/Values, sports conference, and national office."
    },
    {
      "duty": "Supports the University's commitment to academic excellence, academic integrity, and retention and graduation of student-athletes."
    },
    {
      "duty": "Communicates effectively and courteously with others including employees, students, and the public in a spirit of teamwork, respect, and customer service."
    },
    {
      "duty": "Assists with the well-being of student-athletes in a holistic approach."
    },
    {
      "duty": "Coordinates fundraising initiatives and assists with the promotion of the team or athletic program as needed."
    },
    {
      "duty": "Maintains the inventory of all equipment, uniforms, and supplies."
    },
    {
      "duty": "Performs other duties assigned by the Athletic Director."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 60,
      "student_teacher": 180,
      "introvert_extrovert": 70
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Sports Management, Business Administration, or a related field (Master's preferred)"
    }
  ]
}