{
  "meta": [
    {
      "job_title": "Lead Engineer",
      "job_category": "Software Engineering",
      "job_class": "Lead",
      "sector": "Software Engineering",
      "salary": 140000,
      "remote": true
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Take a hands-on approach to build a web-based mobile app for women who are postpartum, lead product development, and lay the technical groundwork for the company."
    },
    {
      "duty": "Build and lead a diverse engineering team, ensuring an exceptional user experience."
    },
    {
      "duty": "Collaborate closely with co-founders, IT Advisors, and designers to define and execute the technical vision/strategy for the company."
    },
    {
      "duty": "Lead the development of the minimum viable product (MVP), including building and assessing roadmap timing and resources, and iterating based on user feedback and market needs."
    },
    {
      "duty": "Write clean, scalable, and maintainable code using JavaScript and its frameworks, setting coding standards and following best practices."
    },
    {
      "duty": "Implement robust, secure, and scalable back-end solutions using AWS services."
    },
    {
      "duty": "Tackle complex technical challenges, troubleshoot issues, and ensure product stability, reliability, and security."
    },
    {
      "duty": "Work closely with cross-functional team members, such as product managers, and designers to align on product features, priorities, and timelines."
    },
    {
      "duty": "Continuously discover and assess technologies and features for the best fit for product iteration, to maximize development efficiency and improve app performance."
    }
  ],
  "skills": [
    {
      "skill": "Software Engineering",
      "experience": 5
    },
    {
      "skill": "JavaScript",
      "experience": 5
    },
    {
      "skill": "Web Development",
      "experience": 5
    },
    {
      "skill": "Node.js",
      "experience": 5
    },
    {
      "skill": "Vue",
      "experience": 5
    },
    {
      "skill": "React",
      "experience": 5
    },
    {
      "skill": "DevOps",
      "experience": 5
    },
    {
      "skill": "AWS Services",
      "experience": 5
    },
    {
      "skill": "Agile Methodologies",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 100,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Software Engineering, Computer Science, or related field (Master’s preferred)"
    }
  ]
}