{
  "meta": [
    {
      "job_title": "Accessioning Clerk",
      "job_category": "Healthcare",
      "job_class": "Clerk",
      "sector": "Healthcare",
      "salary": 40000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Receives and clocks in specimens from couriers timely; verifies that specimens recorded on courier logs are received."
    },
    {
      "duty": "Prioritizes and sorts specimens appropriately for accessioning and processing."
    },
    {
      "duty": "Performs data entry login of patient demographics, clinical information, specimen source, and test(s) orders from specimen requisitions into computer systems and accessions specimen containers as needed or required."
    },
    {
      "duty": "Checks test(s) ordered for medical necessity requirements and ABN if applicable. Documents any orders, which are lacking appropriate documentation to supervisor."
    },
    {
      "duty": "Documents all problem cases appropriately."
    },
    {
      "duty": "Scans requisitions and all related paperwork, into the scan system, and shreds documents as needed."
    },
    {
      "duty": "Reviews specimen requisitions against data entry of requisition information, for accuracy, documents errors noted and forwards documentation to supervisor, and corrects errors found."
    },
    {
      "duty": "Answers departmental phone calls and assists clients as needed."
    },
    {
      "duty": "Contributes to a positive work climate and to the team effort of the department and company."
    },
    {
      "duty": "Exercise all laboratory safety precautions and adhere to lab procedures as stated in procedure manuals."
    },
    {
      "duty": "Perform all job responsibilities in alignment with the industry's best security practices and regulatory guidelines to protect the confidentiality, integrity, and availability of protected health information and other sensitive company data."
    },
    {
      "duty": "Must be familiar with and abide by the Corporate Compliance Program and all Corporate policies, including the Privacy and Security policies."
    }
  ],
  "skills": [],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "High School Diploma, GED, or equivalent combination of education and experience required."
    },
    {
      "credential": "One to two years of prior job-related experience is preferred."
    }
  ]
}