{
  "meta": [
    {
      "job_title": "Bakery Decorator",
      "job_category": "Food & Beverage",
      "job_class": "Decorator",
      "sector": "Food & Beverage",
      "salary": 21000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Cake Decorating",
      "experience": 1
    },
    {
      "skill": "Product Knowledge",
      "experience": 1
    },
    {
      "skill": "Customer Service",
      "experience": 1
    },
    {
      "skill": "Math Skills",
      "experience": 1
    },
    {
      "skill": "Communication Skills",
      "experience": 1
    },
    {
      "skill": "Time Management",
      "experience": 1
    },
    {
      "skill": "Passion for Natural Foods",
      "experience": 1
    },
    {
      "skill": "Work Ethic",
      "experience": 1
    },
    {
      "skill": "Physical Strength",
      "experience": 1
    },
    {
      "skill": "Flexibility",
      "experience": 1
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Creatively decorates all cakes, tarts, pastries, and special-order items."
    },
    {
      "duty": "Assists with production of all mandatory bakery products (i.e. parfaits, bars, cupcakes)."
    },
    {
      "duty": "Produces in-house products to daily par levels, as specified on production sheets."
    },
    {
      "duty": "Completes production and spoilage records, adjusting production sheets to maintain sufficient product."
    },
    {
      "duty": "Prepares, packages, weighs, and prices bakery products for sale."
    },
    {
      "duty": "Monitors product quality for freshness and ensures proper product rotation."
    },
    {
      "duty": "Provides excellent customer service, addresses needs of customers in a timely and effective manner and models suggestive selling techniques; answers phones and pages promptly and courteously."
    },
    {
      "duty": "Maximizes sales potential through effective and proper procedures for prepping, storing, rotating, stocking, and merchandising product."
    },
    {
      "duty": "Follows and complies, or ensures compliance, with established procedures, including Weights and Measures, health and sanitation, and safe work practices."
    },
    {
      "duty": "Maintains, or ensures maintenance of, a clean and sanitary working and shopping environment; maintains equipment in accordance with WFM cleanliness and safety standards."
    },
    {
      "duty": "Performs opening, mid, and closing duties as assigned; ensures accuracy of signs and pricing."
    },
    {
      "duty": "Immediately reports safety hazards and violations."
    },
    {
      "duty": "Performs other duties as assigned by store, regional, or national leadership."
    },
    {
      "duty": "Physical Requirements / Working Conditions"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 0,
      "student_teacher": 0,
      "introvert_extrovert": 0
    }
  ],
  "education_certification": [
    {
      "credential": "6-12 months retail experience."
    }
  ]
}