{
  "meta": [
    {
      "job_title": "Senior Manager Securities & Corporate Governance",
      "job_category": "Legal",
      "job_class": "Manager",
      "sector": "Legal",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Securities Law",
      "experience": 5
    },
    {
      "skill": "Corporate Governance",
      "experience": 5
    },
    {
      "skill": "Corporate Finance",
      "experience": 5
    },
    {
      "skill": "Legal Research",
      "experience": 5
    },
    {
      "skill": "Equity Plan Administration",
      "experience": 5
    },
    {
      "skill": "SOX Compliance",
      "experience": 5
    },
    {
      "skill": "Board of Directors Support",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Assist in support of SEC, NYSE and other securities filings, including current and periodic reports, Section 16 filings, registration statements, proxy statements, and other regulatory filings and reports."
    },
    {
      "duty": "Review quarterly earnings materials, company disclosures, and ensure compliance with applicable securities laws and NYSE regulations."
    },
    {
      "duty": "Review agreements, materials, and disclosure documents related to corporate financing transactions."
    },
    {
      "duty": "Prepare materials for Board of Directors, committee and shareholder meetings including resolutions, minutes, and D&O questionnaires."
    },
    {
      "duty": "Support SOX compliance matters and maintain the Company's insider trading compliance program, share ownership policy, and other governance-related policies."
    },
    {
      "duty": "Assist with equity plan administration, executive compensation matters, corporate development activities, and general corporate matters."
    },
    {
      "duty": "Perform other job-related functions as assigned."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Juris Doctorate from an ABA-accredited law school, and member in good standing of the Florida Bar or ability and willingness to register as a Florida in-house counsel."
    }
  ]
}