{
  "meta": [
    {
      "job_title": "Procurement Specialist",
      "job_category": "Purchasing",
      "job_class": "Specialist",
      "sector": "Purchasing",
      "salary": 60000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Procurement",
      "experience": 5
    },
    {
      "skill": "Contract Management",
      "experience": 5
    },
    {
      "skill": "Financial Record Keeping",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Market Analysis",
      "experience": 5
    },
    {
      "skill": "Research and Analysis",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform a variety of statutory compliance duties related to the county’s procurement processes, including the development, oversight, and monitoring of purchases, contracts, and solicitations."
    },
    {
      "duty": "Evaluates and monitors complex contract performance, compliance, and contractual obligations on a county-wide basis, with minimal supervision."
    },
    {
      "duty": "Acts as liaison between county departments, fiscal staff, project managers, management, and other county staff, as well as outside agencies, vendors, and the constituent community as required."
    },
    {
      "duty": "Continuous professional development through active participation in at least one of the available Communities of Practice."
    },
    {
      "duty": "Support disaster response efforts outside of normal business hours."
    },
    {
      "duty": "Promote efforts to advance equity and inclusion by identifying barriers and creating opportunities for a diverse business community."
    },
    {
      "duty": "Demonstrates understanding of, and supports the mission, vision, standards, policies and procedures, operating instructions, confidentiality standards, and the code of ethical behavior in alignment with our values and guiding principles of Professionalism, Innovation, and Equity (PIE)."
    },
    {
      "duty": "Utilize available procurement tools and methods, including informal solicitations, formal solicitations, and other solicitation/contracting mechanisms, to procure goods and services in accordance with all federal, state, and local regulations, as well as all applicable County policies and procedures."
    },
    {
      "duty": "Identify contract issues, process requisitions, review and request updated quotes; referring to manager for approval."
    },
    {
      "duty": "Work closely with departments to identify and resolve disputes, prepare situation summaries, and recommend and present solutions."
    },
    {
      "duty": "Maintain relationships with internal and external stakeholders to maintain customer service levels, response and meeting needs, with project managers and department heads, judges, multiple outside agencies and regulatory agencies, and other county staff, vendors, end users, SAP Support, IT team, and Auditor’s Office."
    },
    {
      "duty": "Respond to customer complaints and questions."
    },
    {
      "duty": "Research cooperative contracts and benchmarking, report findings to end-users and management to ensure cost-effectiveness."
    },
    {
      "duty": "Coordinate, planning, and development of procurements, assist in development of solicitations and contracts by identifying necessary terms, conditions, and specifications."
    },
    {
      "duty": "Research sourcing strategies to ensure sustainable cost or cost avoidance for savings."
    },
    {
      "duty": "Assist the department to address purchasing needs, provide input and participate in systems improvements activities, provide updates and information to community resources, vendors, and county departments."
    },
    {
      "duty": "Manage basic formal and informal competitive procurements and any other solicitation/contracting methods required."
    },
    {
      "duty": "Continuous professional development through participation in educational opportunities."
    },
    {
      "duty": "Protect organization’s value by keeping information confidential."
    },
    {
      "duty": "Successfully perform all duties of a Procurement Specialist I."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Business Administration, Procurement, Public Administration, Construction Management, or a related field (Master’s preferred)"
    }
  ]
}