{
  "meta": [
    {
      "job_title": "Finance Intern",
      "job_category": "Finance",
      "job_class": "Intern",
      "sector": "Finance",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Data Analytics",
      "experience": 2
    },
    {
      "skill": "Business Process Technology",
      "experience": 2
    },
    {
      "skill": "Basic Coding Skills (PowerBI, Alteryx, Tableau, SQL, RPA)",
      "experience": 2
    },
    {
      "skill": "Microsoft Outlook",
      "experience": 2
    },
    {
      "skill": "Critical Thinking",
      "experience": 2
    },
    {
      "skill": "Entrepreneurial Thinking",
      "experience": 2
    },
    {
      "skill": "Communication Skills",
      "experience": 2
    },
    {
      "skill": "Fast-paced Learning",
      "experience": 2
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Analyze different business inputs to advise on price levels across multiple markets."
    },
    {
      "duty": "Develop frameworks to guide pricing decisions for high volume quoting activity."
    },
    {
      "duty": "Manage and maintain credit risk exposures of assigned customer base."
    },
    {
      "duty": "Prepare and manage the monthly review deck and financial summary package for management and leadership."
    },
    {
      "duty": "Prepare monthly financial reporting and analysis and communicate business results in a clear, concise manner."
    },
    {
      "duty": "Collaborate with Global Business Services (GBS) team and division finance teams when reviewing results and deliverables."
    },
    {
      "duty": "Support finance business partners in delivery of monthly financial reporting & analysis to leadership."
    },
    {
      "duty": "Assist with development of business insights and ad hoc analysis."
    },
    {
      "duty": "Assist with development of business insights that will support profitable decision making and improvements across division."
    },
    {
      "duty": "Actively participate in cross-functional projects, providing relevant feedback & sharing best practices."
    },
    {
      "duty": "Prepare valuable financial analyses that provide new insights and drive profitable action across our manufacturing locations."
    },
    {
      "duty": "Identify opportunities for reporting improvement."
    },
    {
      "duty": "Support the Operations Finance team by preparing valuable financial analyses that provide new insights and drive profitable action across our manufacturing locations."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Eligible for full-time employment on or before Summer 2025. Legal authorization to work permanently in the United States for any employer without requiring a visa transfer or visa sponsorship."
    }
  ]
}