{
  "meta": [
    {
      "job_title": "Principal Scientist, Toxicology",
      "job_category": "Toxicology",
      "job_class": "Principal Scientist",
      "sector": "Healthcare",
      "salary": 175000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Toxicology",
      "experience": 9
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 9
    },
    {
      "skill": "Leadership",
      "experience": 9
    },
    {
      "skill": "Research and Development",
      "experience": 9
    },
    {
      "skill": "Pharmacology",
      "experience": 9
    },
    {
      "skill": "Technical Writing",
      "experience": 9
    },
    {
      "skill": "Data Analysis",
      "experience": 9
    },
    {
      "skill": "Team Management",
      "experience": 9
    },
    {
      "skill": "Communications",
      "experience": 9
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide strategic preclinical safety expertise and representation for clinical development programs from IND through post-marketing."
    },
    {
      "duty": "Serve as Preclinical Safety Subteam Leader for multiple programs."
    },
    {
      "duty": "Ensure alignment of preclinical safety plan with the clinical development plan, regulatory guidelines, modality, and program objectives."
    },
    {
      "duty": "Collaborate with other functional groups on program-related tasks and objectives."
    },
    {
      "duty": "Apply understanding of toxicology, pharmacology, DMPK, and regulatory sciences to design toxicology studies."
    },
    {
      "duty": "Prepare high-quality nonclinical regulatory documents to support regulatory submissions, clinical development, and marketing authorizations globally."
    },
    {
      "duty": "Serve as a subject matter expert within their field of sub-specialization and provide input on other programs and studies."
    },
    {
      "duty": "May lead or participate in process improvement/modernization subcommittees and represent the company on external scientific committees and industry working groups."
    },
    {
      "duty": "Provide mentorship to less experienced toxicologists and scientists within and outside of the Preclinical Safety Department."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "Ph.D. or equivalent in Toxicology or closely related field. Board certification preferred."
    }
  ]
}