{
  "meta": [
    {
      "job_title": "System Engineer",
      "job_category": "Engineering",
      "job_class": "Engineer",
      "sector": "Information Technology",
      "salary": 150000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "System Engineering Fundamentals",
      "experience": 8
    },
    {
      "skill": "Network Architecture",
      "experience": 8
    },
    {
      "skill": "Hardware and Software Integration",
      "experience": 8
    },
    {
      "skill": "System Lifecycle Management",
      "experience": 8
    },
    {
      "skill": "Systems Integration Testing",
      "experience": 8
    },
    {
      "skill": "Configuration Management",
      "experience": 8
    },
    {
      "skill": "Reliability Engineering",
      "experience": 8
    },
    {
      "skill": "System Security",
      "experience": 8
    },
    {
      "skill": "Regulatory Compliance",
      "experience": 8
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Mastery of core principles, concepts, and best practices in system engineering to ensure the robustness of complex systems."
    },
    {
      "duty": "Proficiency in designing and configuring network architectures for optimal performance and security."
    },
    {
      "duty": "Knowledge of integrating hardware and software components seamlessly to achieve cohesive system functionality."
    },
    {
      "duty": "Expertise in overseeing the entire system lifecycle, from requirements analysis to system retirement."
    },
    {
      "duty": "Experience in executing rigorous testing procedures to validate system components and interfaces."
    },
    {
      "duty": "Proficiency in maintaining accurate documentation and control of system configurations."
    },
    {
      "duty": "Understanding of reliability principles to ensure systems meet operational demands without compromise."
    },
    {
      "duty": "Knowledge of security measures and practices for safeguarding systems against threats and vulnerabilities."
    },
    {
      "duty": "Familiarity with industry standards and regulations, ensuring systems adhere to compliance requirements."
    },
    {
      "duty": "Collaborate with a diverse range of companies throughout the US actively seeking professionals skilled in these specific capabilities."
    },
    {
      "duty": "Opportunities for career growth, Professional development programs tailored to enhance your technical skills."
    },
    {
      "duty": "Initiatives to promote work-life balance, Health and wellness benefits."
    },
    {
      "duty": "Retirement plans, along with potential stock options or equity-based rewards."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Information Technology, Computer Science, or a related field (Master's preferred)"
    }
  ]
}