{
  "meta": [
    {
      "job_title": "Art Teacher",
      "job_category": "Education",
      "job_class": "Teacher",
      "sector": "Education",
      "salary": 50066,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Art Education",
      "experience": 5
    },
    {
      "skill": "Lesson Planning",
      "experience": 5
    },
    {
      "skill": "Art Portfolio Development",
      "experience": 5
    },
    {
      "skill": "Student Management",
      "experience": 5
    },
    {
      "skill": "Artwork Creation",
      "experience": 5
    },
    {
      "skill": "Diverse 2D and 3D Media",
      "experience": 5
    },
    {
      "skill": "Portfolio Review Process",
      "experience": 5
    },
    {
      "skill": "Student Assessment",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Develop and execute comprehensive art education strategies to engage students and foster creativity."
    },
    {
      "duty": "Create and implement effective lesson plans that cater to diverse student learning needs and abilities."
    },
    {
      "duty": "Guide and support students in developing their art portfolios, providing constructive feedback and mentorship."
    },
    {
      "duty": "Manage student projects, artwork presentations, and art events at a school level, ensuring a supportive and inclusive environment."
    },
    {
      "duty": "Assess student work and provide meaningful feedback to nurture artistic growth and achievement."
    },
    {
      "duty": "Coordinate the art portfolio review process, including the evaluation of student work and the selection of pieces for submission."
    },
    {
      "duty": "Individually display and present each submitted piece of art for proper evaluation, ensuring clarity and adherence to submission guidelines."
    },
    {
      "duty": "Collaborate with colleagues to support a creative and engaging art program, contributing to school-wide initiatives and events."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Art Education, Fine Arts, or related field (Master's preferred)"
    }
  ]
}