{
  "meta": [
    {
      "job_title": "Medical Lab Technician",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "salary": 55000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Receive and process specimens according to department protocols."
    },
    {
      "duty": "Must perform within the productivity expectations as set forth by current departmental guidelines."
    },
    {
      "duty": "Exercise all laboratory safety precautions and adhere to lab procedures as stated in procedure manuals."
    },
    {
      "duty": "Assists the Supervisor, Manager and Director with administrative functions such as ordering supplies and maintaining inventory."
    },
    {
      "duty": "Serves as project leader in the development and implementation of training."
    },
    {
      "duty": "Assists the Chemistry Supervisor with day-to-day operations and development of laboratory services."
    },
    {
      "duty": "Produces, interprets and reports accurate and precise test results."
    },
    {
      "duty": "Communicates pertinent section information/issues to supervisor, manager or other appropriate individual."
    },
    {
      "duty": "Performs instrument maintenance and method troubleshooting."
    },
    {
      "duty": "Identify and correct problems that may adversely affect test performance or result reporting of patient samples."
    },
    {
      "duty": "Assists in documentation and maintaining effective department QA programs and monitors."
    },
    {
      "duty": "Work with other departments within PathGroup and subsidiaries."
    },
    {
      "duty": "Must be familiar with and abide by the Corporate Compliance Program and all corporate policies, including the Privacy and Security policies."
    }
  ],
  "education_certification": [
    {
      "credential": "Associate's degree in a chemical, physical, or biological science or medical technology. Valid ASCP or AMT certification required. Maintain appropriate continuing education for certification and licensure."
    }
  ]
}