{
  "meta": [
    {
      "job_title": "Materials Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Manufacturing",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Production/Materials Management",
      "experience": 5
    },
    {
      "skill": "Supply Chain Management",
      "experience": 5
    },
    {
      "skill": "Inventory Control",
      "experience": 5
    },
    {
      "skill": "Lean Manufacturing",
      "experience": 5
    },
    {
      "skill": "Six Sigma",
      "experience": 5
    },
    {
      "skill": "Microsoft Office",
      "experience": 5
    },
    {
      "skill": "MRP Systems",
      "experience": 5
    },
    {
      "skill": "Leadership",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage and oversee the production and raw material scheduling, inventory control, customer service, indirect purchasing, and logistics functions within the plant."
    },
    {
      "duty": "Provide forecasting information for planning and investigate customer complaints."
    },
    {
      "duty": "Support central purchasing function, participate in quoting process, and provide leadership in customer contact, inventory, EDI, customer service, and delivery issues."
    },
    {
      "duty": "Prepare and make presentations, identify barriers, establish priorities, evaluate practices, and develop plans to ensure successful production control operations."
    },
    {
      "duty": "Monitor daily activities, order scheduling, and expediting priorities to achieve production and shipping targets."
    },
    {
      "duty": "Analyze order volume, backlog status, late order status, and inventory levels, and make recommendations to meet lead time, late order, inventory, and labor budget goals."
    },
    {
      "duty": "Monitor shipping costs, lead, motivate, and develop direct reports, assist in resolving customer issues, and support various initiatives and systems for improvement."
    },
    {
      "duty": "Support the manufacturing strategy, footprint, and integration of acquisitions into the company's culture and processes."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s Degree in Production/Materials Management, Supply Chain, or related field (Master's preferred)"
    }
  ]
}