{
  "meta": [
    {
      "job_title": "Associate Broker",
      "job_category": "Real Estate",
      "job_class": "Broker",
      "sector": "Real Estate",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Sales Experience",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Real Estate Underwriting",
      "experience": 5
    },
    {
      "skill": "Database Management",
      "experience": 5
    },
    {
      "skill": "Prospect Calling",
      "experience": 5
    },
    {
      "skill": "Market Research",
      "experience": 5
    },
    {
      "skill": "Verbal and Written Communication",
      "experience": 5
    },
    {
      "skill": "Problem-Solving",
      "experience": 5
    },
    {
      "skill": "Real Estate License",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Marketing and prospecting to new and/or under-marketed clients, with a goal of generating new business."
    },
    {
      "duty": "Creating and building AB’s individual Business Plan, that will include, as a minimum, a detailed plan on Relationship Building and Learning the Business."
    },
    {
      "duty": "Responsible for understanding and also preparing underwriting packages for investment real estate."
    },
    {
      "duty": "Responsible for learning the real estate market and sub-markets of the city you'll be working at, including getting to know brokers, title company employees, insurance agents, and others who can contribute to general market knowledge and marketing success."
    },
    {
      "duty": "Responsible for learning about deal structure, in all aspects of the prospecting and listing process"
    },
    {
      "duty": "Ability to establish priorities and support the Lead Broker (“Mentor/Coach”)"
    },
    {
      "duty": "The AB will assist the lead underwriter by learning company templates, interpreting owner’s financial statements, performing rent and sales surveys, and developing pricing skills."
    },
    {
      "duty": "Database management, updating the office’s database with recent sales, ownership, and contact information. Develop a knowledge base of local market conditions, ownership, and sales inventory."
    },
    {
      "duty": "Prospect calling to prospective purchasers, leading to calling owners to prospect for listings, initially with the support and coaching from their Lead Broker (mentor/coach)."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 150
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Business, Real Estate, Marketing, or a related field"
    }
  ]
}