{
  "meta": [
    {
      "job_title": "Executive Director, National Sales",
      "job_category": "Sales",
      "job_class": "Director",
      "sector": "Sales",
      "salary": 200000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Lead a team of Regional Business Directors and Pharmaceutical Sales Specialists to drive community sales."
    },
    {
      "duty": "Strategically develop and implement the national community sales plan and cultivate a collaborative culture in the field organization."
    },
    {
      "duty": "Maximize Sales Force Effectiveness by collaborating with relevant stakeholders and aligning execution efforts across customer facing teams."
    },
    {
      "duty": "Select, develop, and manage the Regional Business Directors, community and virtual field sales force, providing coaching and direction for sales strategy development."
    },
    {
      "duty": "Analyze sales and operations data to monitor sales progress and develop corrective plans to improve sales force effectiveness/efficiency."
    },
    {
      "duty": "Create a high-performance culture through empowerment, inclusion, and collaboration, ensuring compliance and ethical promotional standards are met across the sales team."
    },
    {
      "duty": "Stay updated on industry trends, understand market conditions, and develop strategies to address competitive challenges."
    },
    {
      "duty": "Oversee and direct sales force sizing and alignment to support business needs, and prepare monthly, quarterly and annual business updates."
    }
  ],
  "skills": [
    {
      "skill": "Sales Management",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Strategic Planning",
      "experience": 10
    },
    {
      "skill": "Market Analysis",
      "experience": 10
    },
    {
      "skill": "Team Management",
      "experience": 10
    },
    {
      "skill": "Data Analysis",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Problem-Solving",
      "experience": 10
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in related discipline is required, MBA preferred."
    }
  ]
}