{
  "meta": [
    {
      "job_title": "Senior Applications Analyst",
      "job_category": "Information Technology",
      "job_class": "Analyst",
      "sector": "Software Engineering",
      "salary": 95000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Technical Troubleshooting",
      "experience": 5
    },
    {
      "skill": "Customer Support",
      "experience": 5
    },
    {
      "skill": "Documentation Development",
      "experience": 5
    },
    {
      "skill": "Team Collaboration",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "IT Service Management",
      "experience": 5
    },
    {
      "skill": "SQL Server",
      "experience": 5
    },
    {
      "skill": "Powershell Scripting",
      "experience": 5
    },
    {
      "skill": "Software Testing",
      "experience": 5
    },
    {
      "skill": "Legal Software",
      "experience": 5
    },
    {
      "skill": "Financial Software",
      "experience": 5
    },
    {
      "skill": "Network Administration",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide 3rd tier problem resolution and technical support for assigned multi-tiered and major business applications."
    },
    {
      "duty": "Serve as the Subject Matter Expert for company supported applications and highly complex systems."
    },
    {
      "duty": "Collaborate with firm leadership for custom reporting needs and setting standards for software applications."
    },
    {
      "duty": "Participate in projects for new software implementation and upgrades, ensuring inter-dependency with other systems."
    },
    {
      "duty": "Monitor tickets and participate in quality assurance testing for compatibility issues and continuity of knowledge base."
    },
    {
      "duty": "Provide technical guidance to other support teams in the IT Department, including the Service Desk and Desktop Support."
    },
    {
      "duty": "Participate in the development and management of software requests and updates."
    },
    {
      "duty": "Maintain documentation and standards, including all pertinent IT Service Catalog entries."
    },
    {
      "duty": "Proactively monitor latest legal software development and participate in the management of software requests and updates."
    },
    {
      "duty": "Provide dependable and consistent on-call support as needed for backup where special expertise is required."
    },
    {
      "duty": "Assist with problem resolutions, provide backup for coverage, and assist others with skill development."
    },
    {
      "duty": "Participate in projects for new software implementation and upgrades."
    },
    {
      "duty": "Read, analyze, interpret, and write reports, business correspondence, and procedure manuals."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BS in Computer Science, MIS, or equivalent work experience"
    }
  ]
}