{
  "meta": [
    {
      "job_title": "Store Manager",
      "job_category": "Retail",
      "job_class": "Manager",
      "sector": "Retail",
      "salary": 70000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Leadership",
      "experience": 5
    },
    {
      "skill": "Recruitment",
      "experience": 5
    },
    {
      "skill": "Training",
      "experience": 5
    },
    {
      "skill": "Staff Management",
      "experience": 5
    },
    {
      "skill": "Expense Control",
      "experience": 5
    },
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Loss Prevention",
      "experience": 5
    },
    {
      "skill": "Merchandise Processing",
      "experience": 5
    },
    {
      "skill": "Retail Operations",
      "experience": 5
    },
    {
      "skill": "Physical Store Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Overall operation of the Store to ensure that Company standards and best practices are consistently met."
    },
    {
      "duty": "Staff, train, and develop leadership team to deliver desired sales and profit results while maintaining a friendly, easy-to-shop environment."
    },
    {
      "duty": "Manage the operations of the Stockroom, Front End, and Sales Floor to ensure new merchandise gets to the sales floor in a timely manner and goods are received properly."
    },
    {
      "duty": "Recruit, train, and develop Associates."
    },
    {
      "duty": "Lead all Company Best Practices and maximize productivity by minimizing steps and touches while working."
    },
    {
      "duty": "Accept special assignments as directed by Leadership."
    },
    {
      "duty": "Conduct payroll administration and reporting as needed."
    },
    {
      "duty": "Control payroll hours to plan."
    },
    {
      "duty": "Maintain a safe and secure environment, ensuring all Associates understand and can execute emergency operating procedures."
    },
    {
      "duty": "Treat all Customers, Associates, and other leaders with respect and demonstrate courtesy, friendliness, and professionalism at all times."
    },
    {
      "duty": "Maintain a high standard of housekeeping and cleanliness."
    },
    {
      "duty": "Ensure recovery, sizing, and markdowns are completed to Company standards."
    },
    {
      "duty": "Train Associates on Loss Prevention programs and safeguard confidential information, cash, and merchandise."
    },
    {
      "duty": "Lead the annual inventory process."
    },
    {
      "duty": "Use all Store equipment, perform basic mathematical calculations, and supervise Assistant Store Manager, Area Supervisors, and Retail Associates."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Five or more years of Store management experience in a retail environment must maintain a high level of Customer service fluency in English must exercise considerable independent judgement and discretion ability to work evenings and weekends"
    }
  ]
}