{
  "meta": [
    {
      "job_title": "Partnership Manager",
      "job_category": "Management",
      "job_class": "Manager",
      "sector": "Sales",
      "salary": 85000,
      "remote": true
    }
  ],
  "skills": [
    {
      "skill": "Marketing Strategy",
      "experience": 5
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Market Analysis",
      "experience": 4
    },
    {
      "skill": "Digital Marketing",
      "experience": 4
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 4
    },
    {
      "skill": "Influencer Marketing",
      "experience": 3
    },
    {
      "skill": "Negotiation",
      "experience": 4
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Create a systematic, process-driven approach to partner outreach and relationship management."
    },
    {
      "duty": "Identify and source partnership opportunities through inbound lead follow-up and outbound cold calls, emails, and client visits."
    },
    {
      "duty": "Negotiate and finalize deals in accordance with company’s contract guidelines and policies."
    },
    {
      "duty": "Collaborate with senior management and other marketing teammates to align internal goals with new and existing partner relationships."
    },
    {
      "duty": "Deliver a great experience to partners when working with the company, representing the brand and being the partners' liaison internally."
    },
    {
      "duty": "Forecast, measure, and report the results of various projects with partners, including co-created and/or co-branded content promotions, lead sharing, and/or event partnerships."
    },
    {
      "duty": "Keep great ongoing relationships with current partners and offer new ways to grow the partnership."
    },
    {
      "duty": "Exemplary written and verbal communication skills with the ability to communicate with clients directly and professionally."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 120,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Marketing, Business, or a related field (Master's preferred)"
    }
  ]
}