{
  "meta": [
    {
      "job_title": "Senior Maintenance Technician",
      "job_category": "Maintenance",
      "job_class": "Technician",
      "sector": "Engineering",
      "salary": 58000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Blueprint Reading",
      "experience": 3
    },
    {
      "skill": "Safety and Security Practices",
      "experience": 3
    },
    {
      "skill": "General Technical Experience",
      "experience": 3
    },
    {
      "skill": "Appliance Repair",
      "experience": 3
    },
    {
      "skill": "HVAC",
      "experience": 3
    },
    {
      "skill": "Electrical Repair",
      "experience": 3
    },
    {
      "skill": "Plumbing Repair",
      "experience": 3
    },
    {
      "skill": "Maintenance Procedures",
      "experience": 3
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensure the hotel’s maintenance and upkeep standards meet WL, Brand, and Guest standards."
    },
    {
      "duty": "Support Chief Engineer in overseeing and supervising all aspects of the Engineering function of the hotel."
    },
    {
      "duty": "Proactively follow specific departmental procedures in performing repair, maintenance, alteration, and installation work in a safe and neat manner."
    },
    {
      "duty": "Provide advice and support other engineers as needed or requested."
    },
    {
      "duty": "Responsible for identifying and repairing all mechanical failure to include repair of appliances, HVAC, electrical or plumbing."
    },
    {
      "duty": "Maintain communications with supervisors to ensure all needed materials, tools, and supplies are available or on order."
    },
    {
      "duty": "Perform other duties as assigned."
    },
    {
      "duty": "Read and interpret blueprints, specifications, and operating instructions."
    },
    {
      "duty": "Carry out safety and security work practices."
    },
    {
      "duty": "Lift, carry or otherwise move up to 10 lbs. regularly and 25 lbs. occasionally, as well as the ability to stand and move for long periods of time."
    },
    {
      "duty": "Oversee online presence and actively participate in promoting freight and logistics services."
    },
    {
      "duty": "Lead a team of maintenance technicians and provide guidance to achieve set maintenance goals."
    },
    {
      "duty": "Analyze market trends, customer behavior, and competitor activity to identify growth opportunities and refine maintenance strategies."
    },
    {
      "duty": "Manage trade shows and events for promoting hotel engineering services."
    },
    {
      "duty": "Measure and report on the performance of maintenance procedures, using data-driven insights to continuously improve strategies."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 115,
      "student_teacher": 90,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent"
    },
    {
      "credential": "Valid driver’s license"
    },
    {
      "credential": "One year trade school or equivalent"
    }
  ]
}