{
  "meta": [
    {
      "job_title": "Senior Program Manager",
      "job_category": "Program Management",
      "job_class": "Senior Manager",
      "sector": "E-Commerce",
      "salary": 120000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "E-Commerce Program Management",
      "experience": 5
    },
    {
      "skill": "Customer Engagement Strategy",
      "experience": 5
    },
    {
      "skill": "Budget Management",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    },
    {
      "skill": "Partnership Building",
      "experience": 5
    },
    {
      "skill": "Marketing Analytics",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Execute E-Commerce programs and projects, identifying and recommending optimizations based on competitive analysis, customer insights, and business results."
    },
    {
      "duty": "Develop program-specific tactics and goals to achieve business and customer engagement objectives."
    },
    {
      "duty": "Lead the execution of programs, including managing timelines, budgets, and program status communication."
    },
    {
      "duty": "Ensure weekly, monthly, and quarterly reporting for E-Commerce programs, identifying reporting requirements and assessing key performance insights."
    },
    {
      "duty": "Maintain awareness of E-Commerce trends, developments, and best practices."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 120
    }
  ],
  "education_certification": [
    {
      "credential": "BA/BS degree and 4-6 years’ relevant experience OR equivalent combination of education and relevant experience. Good quantitative and financial analysis skills. Good analytical skills. Excellent communication skills. Ability to leverage, influence, navigate, and build partnerships across business teams. Understanding of standard project management methodologies and requirements. Ability to plan, estimate, organize, and monitor projects. Ability to keep projects on track financially, creatively, and in accordance with stakeholder deadlines."
    }
  ]
}