{
  "meta": [
    {
      "job_title": "Construction Superintendent",
      "job_category": "Construction",
      "job_class": "Superintendent",
      "sector": "Construction",
      "salary": 100000,
      "remote": false
    }
  ],
  "skills": [],
  "duties_responsibilities": [
    {
      "duty": "Leads, directs and coordinates the work of subcontractors and/or Turner trade labor."
    },
    {
      "duty": "Oversee and making decisions related to the performance of work related to scheduling, delivery, logistics, quality control and trade employee staffing levels."
    },
    {
      "duty": "Create schedules and determine sequencing of work. Develop and implement recovery strategies to maintain project schedule."
    },
    {
      "duty": "Investigate and resolve field issues."
    },
    {
      "duty": "Manage the billing process as it relates to Work In Place (WIP) and overseeing the monthly estimate of work completed, payrolls, material invoices and subcontractor payment applications."
    },
    {
      "duty": "Manage the work to ensure that it is installed in compliance with and conforms to the approved contract documents."
    },
    {
      "duty": "Supervise and develop Assistant Superintendents, Field Engineers, and/or Interns, as assigned."
    },
    {
      "duty": "Communicate with owners and architects/engineers in connections with field issues."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 100,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree plus a minimum of four years' related experience training and/or experience. Knowledge of building construction, means and methods, scheduling and cost control procedures, general contract, general conditions, subcontract documents, drawings and specifications, including Microsoft Office Suite and proficiency in EH&S applications. Ability to read, understand and interpret contract documents, drawings specifications, scopes of work and project schedule. Demonstrated leadership and interpersonal skills."
    }
  ]
}