{
  "meta": [
    {
      "job_title": "Director, Claims",
      "job_category": "Insurance",
      "job_class": "Director",
      "sector": "Insurance",
      "salary": 182902,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Management",
      "experience": 10
    },
    {
      "skill": "Litigation Management",
      "experience": 10
    },
    {
      "skill": "Insurance Knowledge",
      "experience": 10
    },
    {
      "skill": "Law Knowledge",
      "experience": 10
    },
    {
      "skill": "Medical Professional Liability Claims",
      "experience": 10
    },
    {
      "skill": "Leadership",
      "experience": 10
    },
    {
      "skill": "Communication Skills",
      "experience": 10
    },
    {
      "skill": "Budgeting",
      "experience": 10
    },
    {
      "skill": "Analytical Skills",
      "experience": 10
    },
    {
      "skill": "Decision Making",
      "experience": 10
    },
    {
      "skill": "Mentoring",
      "experience": 10
    },
    {
      "skill": "Hiring",
      "experience": 10
    },
    {
      "skill": "Staff Training",
      "experience": 10
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Oversee and direct claims management staff to ensure compliance with departmental guidelines and regulatory requirements."
    },
    {
      "duty": "Collaborate with Vice President and claim management staff to create and update departmental policies and procedures."
    },
    {
      "duty": "Participate in the development and execution of departmental objectives and strategies."
    },
    {
      "duty": "Communicate department objectives, policies, procedures, and plans to staff for efficient and effective operation."
    },
    {
      "duty": "Participate in claim file audits to ensure claims handling and reserving standards are met."
    },
    {
      "duty": "Assist in the preparation and monitoring of the departmental budget."
    },
    {
      "duty": "Stay current in local, state, and federal changes impacting claims pertaining to Coverys lines of coverage and territories."
    },
    {
      "duty": "Interact regularly with peers in key business units to ensure overall business/strategy goals are met."
    },
    {
      "duty": "Serve as a member of the Reserve and Settlement committee to manage appropriate levels of reserving and settlement authority for cases."
    },
    {
      "duty": "Guide, support, and mentor staff in their strategies and practices impacting individual claim decisions."
    },
    {
      "duty": "Responsible for interviewing, hiring, and training employees; planning, directing work; appraising performance; rewarding and disciplining employees; addressing complaints, and resolving problems."
    },
    {
      "duty": "Provide in-office oversight/guidance to all members of the department during office days."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 160
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree from a four-year college or university; JD preferred"
    }
  ]
}