{
  "meta": [
    {
      "job_title": "Health Center Coordinator",
      "job_category": "Healthcare",
      "job_class": "Coordinator",
      "sector": "Healthcare",
      "salary": 42000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Coordinate schedules of all providers in the Health Center, ensuring all students arrive for appointments, are checked in appropriately, and are seen according to their needs and the needs of the providers. Providers may include Medical, Mental Health, Dental, and other clinic professionals.Coordinate scheduling for providers and students aligning appointments with school-specified classroom times. Manage and adjust scheduling as necessary to maximize efficiency and patient access."
    },
    {
      "duty": "Manage inventory of office supplies, including ordering, invoicing, receiving, and stocking supplies. Work in partnership and joint accountability with other Health Center staff to reduce costs and increase efficiencies, frequently evaluating the budget to reduce costs."
    },
    {
      "duty": "Oversee/perform all day-to-day administrative clinic tasks, including but not limited to answering telephone and email inquiries, greeting Health Center visitors, managing/adjusting clinic flow as needed, and maintaining student health records through electronic health record system(s) and tracking sheet."
    },
    {
      "duty": "Prepare charts and accounts on a daily basis as applicable. Check insurance eligibility and scan Medicaid, Medicare, and private insurance cards. Support and coordinate processes necessary for site supply of vaccinations including monitoring and reporting of equipment temperature and status, participating in vaccine audits, and ensuring up-to-date record keeping."
    },
    {
      "duty": "Coordinate and lead targeted outreach activities focused on promoting, integrating, and informing students, families, school staff, and the general school community about the School-based Health Center services.Cross-school referral coordination (i.e. meeting and maintaining working relationship with neighboring school nurses/counselors/admin/social workers to create a network from which referrals can be obtained and care coordinated)."
    },
    {
      "duty": "Prepares clinic to open and close for business in a timely manner, in accordance with the clinic’s posted schedule. Under Health Center Administrator direction, coordinate and/or perform basic educational outreach activities focused on health promotion and health education to students and families."
    },
    {
      "duty": "Creating lesson plans, fielding health education interest, coordinating with students on areas of interest, and coordinating with teachers to design lessons that are age/class appropriate. General school health promotion (i.e. disseminating health information to families, students, teachers, and administrators) Coordinating public health education and prevention strategies (i.e. organizing flu shot clinics, active outreach to students/families who are behind on vaccinations, disseminating information to families on COVID-19, and coordinating with school administrations to provide care for students in need). Develop and manage materials and announcements associated with School-based Health Center outreach activities."
    },
    {
      "duty": "Serve as the primary point of contact for referrals and service inquiries from school staff and families for School-based Health Center services. Attend school meetings related to identification and coordination of health support services for students. If patient needs are outside the scope of Health Center services, educate patients, school staff, and families on other health care and basic support services available in the community and within the school through student support/intervention systems."
    },
    {
      "duty": "As a knowledgeable resource to patients, navigate community resources to better understand what to offer patients depending on needPerform other duties as assigned by the Health Center Administrator including (but not limited to):Providing remote and in-person coverage at other SBHC sites Additional support to main clinics when requested if time allows Assisting in orienting and training new staff members."
    },
    {
      "duty": "Partner with Site team and Seattle Public Schools (SPF) staff to develop a culture of collaborative team work, problem solving, positive communications, engagement, and flexibility. Lead regular clinic/school staff meetings First in line to help/solve patient complaints. Implement new policies and procedures.Maintain professionalism and confidentiality in administration and patient care areas."
    }
  ],
  "skills": [
    {
      "skill": "Administrative Duties",
      "experience": 3
    },
    {
      "skill": "Scheduling",
      "experience": 3
    },
    {
      "skill": "Inventory Management",
      "experience": 3
    },
    {
      "skill": "Patient Record Management",
      "experience": 3
    },
    {
      "skill": "Community Outreach",
      "experience": 3
    },
    {
      "skill": "Patient Referral Coordination",
      "experience": 3
    },
    {
      "skill": "Health Education",
      "experience": 3
    },
    {
      "skill": "Public Health Promotion",
      "experience": 3
    },
    {
      "skill": "Service Coordination",
      "experience": 3
    },
    {
      "skill": "Team Leadership",
      "experience": 3
    },
    {
      "skill": "Problem Solving",
      "experience": 3
    },
    {
      "skill": "Verbal Communication",
      "experience": 3
    },
    {
      "skill": "Customer Service",
      "experience": 3
    },
    {
      "skill": "Data Analysis",
      "experience": 3
    },
    {
      "skill": "MS Office Suite",
      "experience": 3
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 80,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "High School diploma or equivalent"
    }
  ]
}