{
  "meta": [
    {
      "job_title": "Inside Sales Representative",
      "job_category": "Customer Service",
      "job_class": "Representative",
      "sector": "Sales",
      "salary": 50000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Customer Service",
      "experience": 5
    },
    {
      "skill": "Sales Support",
      "experience": 5
    },
    {
      "skill": "Organizational Skills",
      "experience": 5
    },
    {
      "skill": "Sales Management",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Relationship Management",
      "experience": 5
    },
    {
      "skill": "Sales Outreach",
      "experience": 5
    },
    {
      "skill": "Customer Follow-up",
      "experience": 5
    },
    {
      "skill": "Virtual Client Meetings",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Provide excellent customer service and inside sales support, including verifying purchase order pricing, coordinating logistics, and providing shipping and inventory status."
    },
    {
      "duty": "Participate in customer calls, track and follow up on sales deliverables, develop customer relationships, and make customer outreach."
    },
    {
      "duty": "Coordinate and manage client expectations, work efficiently, and provide information to customers in a concise and customer-friendly manner."
    },
    {
      "duty": "Develop sales plans, goals, and perform daily outbound calling and email prospecting to both existing customers and new prospects."
    },
    {
      "duty": "Establish and grow the inside sales team for outbound prospecting and develop product knowledge to effectively answer customer product questions."
    },
    {
      "duty": "Investigate warranty and defective product claims, identify new or updated products to be added to customer catalogs, and coordinate with Marketing to make those additions/updates."
    },
    {
      "duty": "Lead sales outreach with follow-up products to existing customers via email, phone, and video conferencing, provide alternative solutions if inventory availability does not correspond with a client requirement."
    },
    {
      "duty": "Participate in virtual client meetings, with the majority being virtual but occasional in-person meetings."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 80,
      "student_teacher": 50,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in business or related field."
    }
  ]
}