{
  "meta": [
    {
      "job_title": "Construction Project Manager",
      "job_category": "Construction",
      "job_class": "Manager",
      "sector": "Construction",
      "salary": 90000,
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Ensures the on-time and on-budget completion of assigned construction and new development projects by managing the construction, manpower, financial, and safety, and reporting activities associated with the projects."
    },
    {
      "duty": "Coordinates the execution of the activities associated with development and new construction projects by reviewing blueprints and specifications, inspecting work and overseeing contractors to ensure specifications and safety measures are met, and troubleshooting and resolving issues to ensure an on-time and on-budget completion of work."
    },
    {
      "duty": "Monitors and manages the project budget by reviewing, reconciling, and approving vendor and contractor invoices, reviewing and analyzing financial statements and spending, reporting financial resource needs and issues, and complying with the Company’s policies and procedures related to budgeting."
    },
    {
      "duty": "Develops, executes, and manages the project timetable and completion schedule by prioritizing tasks, accounting for anticipated and unanticipated delays due to weather or changes to specifications and plans, and makes recommendations to resolve delay issues."
    },
    {
      "duty": "Supervises and oversees work performed at the construction site by monitoring contractors and manpower, inspecting completed work for compliance with safety standards and plan specifications, adjusting staffing levels as needed to stay on schedule and within budget, and addressing and resolving issues that impede progress."
    },
    {
      "duty": "Provides regular updates on the progress of construction projects to key business leaders, equity partners, and other contacts affiliated with the projects by preparing routine reports and other communications, and responds to requests for information, concerns, or questions about specific aspects of assigned projects in a timely fashion."
    },
    {
      "duty": "Assists in assembling the onsite construction team by selecting and assigning team members, engaging contractors and sub-contractors, and by managing their performance in accordance with Company policies, values, and business practices."
    },
    {
      "duty": "Completes various human resources, financial, administrative, and other reports and analysis, and performs other duties as assigned or as necessary."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 60,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Minimum 5 years of experience working on similar ground up construction projects with exposure to initial construction through delivery."
    },
    {
      "credential": "Minimum 3 years of experience managing a team and subcontractors."
    },
    {
      "credential": "Strong time management, leadership and decision-making skills."
    },
    {
      "credential": "Ability to be highly organized, in day-to-day and long-term planning and execution, and to track and maintain complex schedules effectively."
    },
    {
      "credential": "Excellent written and oral communication skills, including the ability to effectively delegate and negotiate."
    },
    {
      "credential": "Proven track record of building and maintaining strong relationships with team members, subcontractors and owners in order to foster an exceptional culture at the jobsite."
    },
    {
      "credential": "Bachelor's degree in Construction Management, Engineering, or related field (Master's preferred)"
    }
  ]
}