{
  "meta": [
    {
      "job_title": "Sr. Compensation Analyst",
      "job_category": "Human Resources",
      "job_class": "Analyst",
      "sector": "HR",
      "salary": 116750,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Compensation Analysis",
      "experience": 5
    },
    {
      "skill": "Job Description Review",
      "experience": 5
    },
    {
      "skill": "Market Review",
      "experience": 5
    },
    {
      "skill": "Data Analysis",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Project Management",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Perform administration and analysis of WGU’s Compensation programs and work in conjunction with Business leaders and other members of People & Talent to administer, recommend and review compensation policies, procedures & programs at WGU."
    },
    {
      "duty": "Serve as a primary compensation contact for assigned client groups and partner with Talent & Hiring leaders to develop compensation offers."
    },
    {
      "duty": "Conduct job description reviews, including market reviews, and responsible for the job creation process."
    },
    {
      "duty": "Recommend, conduct, and participate in salary surveys to understand competitive compensation levels in the organization."
    },
    {
      "duty": "Communicate and coach business leaders and employees on compensation processes and policies."
    },
    {
      "duty": "Administer merit, annual & market adjustments and assure through audits, analysis, and reports that all organization compensation programs are consistently administered in compliance with company policies and government regulations."
    },
    {
      "duty": "Work on core compensation projects and conduct ad-hoc analysis on compensation policies, procedures, and programs, making recommendations based on market competitiveness and total rewards philosophy."
    },
    {
      "duty": "Perform other duties as required."
    }
  ],
  "subjective_elements": [],
  "education_certification": [
    {
      "credential": "Bachelor’s degree in Human Resources, Business, or a related field"
    }
  ]
}