{
  "meta": [
    {
      "job_title": "Senior Staff Accountant",
      "job_category": "Accounting",
      "job_class": "Senior",
      "sector": "Finance",
      "salary": 90000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Account Reconciliation",
      "experience": 5
    },
    {
      "skill": "ERP/Subsystem Projects",
      "experience": 5
    },
    {
      "skill": "GAAP",
      "experience": 5
    },
    {
      "skill": "Auditing",
      "experience": 5
    },
    {
      "skill": "Tax Preparation",
      "experience": 5
    },
    {
      "skill": "Financial Statements",
      "experience": 5
    },
    {
      "skill": "MS Excel",
      "experience": 5
    },
    {
      "skill": "CPA",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manage month-end close activities including but not limited to posting and reconciling cash, posting journal entries, and preparing account reconciliations."
    },
    {
      "duty": "Oversee General Ledger/Accounts Payable/Purchasing activities, about 25% of the role."
    },
    {
      "duty": "Coordinate intercompany accounting reconciliations with foreign subsidiaries accounting staff and/or local accounting firm."
    },
    {
      "duty": "Contribute to preparing audit schedules with a supporting role in business assurance audits."
    },
    {
      "duty": "Review and analyze the monthly financial reporting packages submitted by the foreign subsidiaries to ensure revenue, expenses, and other key GL accounts are properly reconciled and amounts are recorded appropriately according to company policy."
    },
    {
      "duty": "Support continuous improvement in the development, approval, and implementation of processes and procedures to improve operations, about 10% of the role."
    },
    {
      "duty": "Special projects as assigned."
    },
    {
      "duty": "Develop recommendations to optimize company's accounting systems and procedures and detect inaccuracies"
    },
    {
      "duty": "Support and consult company's personnel on accounting control procedures"
    },
    {
      "duty": "Organize financial statements and budget preparation, accurately and timely"
    },
    {
      "duty": "Support and oversee tax audits (both internal and external) and tax returns"
    },
    {
      "duty": "Support business processes and accounting policies and prepare corresponding documentation"
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 120,
      "student_teacher": 80,
      "introvert_extrovert": 80
    }
  ],
  "education_certification": [
    {
      "credential": "BS degree in Accounting, Finance or other relevant area; a certification such as CMA or CPA will be a bonus"
    }
  ]
}