{
  "meta": [
    {
      "job_title": "Senior Accountant II",
      "job_category": "Finance",
      "job_class": "Manager",
      "sector": "Accounting",
      "salary": 89000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "General Ledger Reconciliation",
      "experience": 5
    },
    {
      "skill": "Financial Reporting",
      "experience": 5
    },
    {
      "skill": "Sarbanes Oxley Compliance",
      "experience": 5
    },
    {
      "skill": "Audit and Advisory Services",
      "experience": 5
    },
    {
      "skill": "Financial Analysis",
      "experience": 5
    },
    {
      "skill": "Supervisory Experience",
      "experience": 5
    },
    {
      "skill": "GAAP",
      "experience": 5
    },
    {
      "skill": "PC Based Applications",
      "experience": 5
    },
    {
      "skill": "Data Extraction",
      "experience": 5
    },
    {
      "skill": "JD Edwards or Similar Accounting Software",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Manages and coordinates responsibilities of several staff to ensure adherence to Sarbanes Oxley internal controls, procedural / accounting policies and achievement of departmental goals."
    },
    {
      "duty": "Applies Generally Accepted Accounting Principles to determine accurate accounting."
    },
    {
      "duty": "Identifies areas of potential internal control issues and functions as liaison with Audit and Advisory Services and the company’s independent auditors for the timely resolution of any such issues."
    },
    {
      "duty": "Assists management in the analysis and identification of significant Year over Year or Month over Month flux drivers relating to general ledger accounts."
    },
    {
      "duty": "Prepares and/or reviews monthly/quarterly balance sheet reconciliations and schedules ensuring timely resolution of outstanding items."
    },
    {
      "duty": "Assists management in generating financial schedules, Sarbanes Oxley documentation, and other items for external and internal auditors as needed."
    },
    {
      "duty": "Conducts User Acceptance Testing on financial systems or upgrades/modifications of existing systems and determines whether accounting / reporting requirements are adequately met."
    },
    {
      "duty": "Assists management in hiring, evaluating performance and conducting performance reviews for direct reports."
    },
    {
      "duty": "Interfaces with auditors and Information Technology as needed."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 90
    }
  ],
  "education_certification": [
    {
      "credential": "Four-year Finance and/or Accounting Degree from an accredited university required."
    }
  ]
}