{
  "meta": [
    {
      "job_title": "Phlebotomist",
      "job_category": "Healthcare",
      "job_class": "Technician",
      "sector": "Healthcare",
      "remote": false
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Responsible for the collection of blood and other specimens from all patient populations using prescribed procedures with accuracy, skill, professionalism, and superb customer service."
    },
    {
      "duty": "Perform accurate patient registration, including knowledge of insurance codes and billing procedures."
    },
    {
      "duty": "Maintain a clean and orderly work environment and ensure an adequate supply of materials."
    },
    {
      "duty": "Follow proper policy and procedure for specimen transport and specimen processing, including documentation of draws and processing."
    },
    {
      "duty": "Examine all specimens submitted for proper labeling and necessary information prior to final acceptance."
    },
    {
      "duty": "Provide patients and other customers with necessary collection instructions, per department standards."
    },
    {
      "duty": "Assist in training by demonstrating techniques or methods to students/new staff, when requested."
    },
    {
      "duty": "Maintain a professional, mature, positive attitude while on the job and observe proper safety practices."
    },
    {
      "duty": "Verify patient identification according to SOP, ensuring correct identification of patients/specimen with orders."
    },
    {
      "duty": "Demonstrate and integrate age-specific care with consideration to physical communication, safety, nutrition, and psychosocial needs for various age groups."
    },
    {
      "duty": "Be proficient with computer programs and navigate through information systems."
    },
    {
      "duty": "Perform other clerical and technical duties as instructed or requested."
    },
    {
      "duty": "Obtain blood specimens from infants to adults as skillfully as possible using proper technique under specified aseptic conditions."
    },
    {
      "duty": "Handle children, difficult patients, and unconscious patients with proper care post-invasive phlebotomy procedure."
    },
    {
      "duty": "Organize, prioritize, transport, and distribute incoming laboratory workload while also notifying appropriate departments per established protocols."
    }
  ],
  "skills": [
    {
      "skill": "Phlebotomy",
      "experience": 2
    },
    {
      "skill": "Patient Registration",
      "experience": 2
    },
    {
      "skill": "Specimen Processing",
      "experience": 2
    },
    {
      "skill": "Customer Service",
      "experience": 2
    },
    {
      "skill": "Computer Literacy",
      "experience": 2
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 150,
      "student_teacher": 100,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Completion of phlebotomy training program or equivalent experience is preferred."
    },
    {
      "credential": "High school graduate or equivalent required."
    }
  ]
}