{
  "meta": [
    {
      "job_title": "Recruiter",
      "job_category": "Human Resources",
      "job_class": "Recruiter",
      "sector": "Staffing",
      "salary": 75000,
      "remote": false
    }
  ],
  "skills": [
    {
      "skill": "Recruiting",
      "experience": 3
    },
    {
      "skill": "Client Management",
      "experience": 5
    },
    {
      "skill": "Business Acumen",
      "experience": 5
    },
    {
      "skill": "Communication Skills",
      "experience": 5
    },
    {
      "skill": "Negotiation",
      "experience": 5
    },
    {
      "skill": "Research",
      "experience": 5
    },
    {
      "skill": "Cold Calling",
      "experience": 5
    },
    {
      "skill": "Relationship Building",
      "experience": 5
    },
    {
      "skill": "Presentation Skills",
      "experience": 5
    }
  ],
  "duties_responsibilities": [
    {
      "duty": "Identify and attract top talent through various channels and techniques, including cold-calling, referrals, and online research."
    },
    {
      "duty": "Build and maintain professional relationships with both clients and candidates, ensuring exceptional client delivery and candidate interaction."
    },
    {
      "duty": "Utilize internet research tools and databases to source candidates and gather market intelligence."
    },
    {
      "duty": "Effectively communicate with candidates and decision-makers at the executive level, persuading and influencing them in the recruitment process."
    },
    {
      "duty": "Manage a full cycle recruiting process, from sourcing to client delivery, with a focus on excellent relationship building and negotiation skills."
    },
    {
      "duty": "Conduct market analysis, staying informed of industry trends and competitor activity to identify and capitalize on growth opportunities."
    },
    {
      "duty": "Provide ongoing community outreach and develop national partnerships to build a strong network of professional relationships."
    }
  ],
  "subjective_elements": [
    {
      "soldier_general": 100,
      "student_teacher": 90,
      "introvert_extrovert": 100
    }
  ],
  "education_certification": [
    {
      "credential": "Bachelor's degree in Human Resources, Business Administration, or related field (Master's preferred)"
    }
  ]
}